{
    "title": "Apple MacBook Air 2024 ushers in a new era as a resounding response to AI \nPCs",
    "date": "3/28/2024",
    "url": "https://www.hindustantimes.com/business/apple-macbook-air-2024-ushers-in-a-new-era-as-a-resounding-response-to-ai-pcs-101711685756941.html",
    "text": "Subscribe Now! Get features like How do you improve something that’s ticking all the boxes? A couple of years ago, when Apple refreshed the design of its slimmest MacBook — the MacBook Air — it was a significant change from the original design that had carried on since the Late Steve Jobs pulled a MacBook Air out of the manilla envelope all those years ago. Apple, it seems, is going with a bit more of a design parity between the MacBook Air and the MacBook Pro. Gone is the wedge, but do you miss it? With the 2024 updates, a bit of consistency too, with the design already refined for the 13-inch MacBook Air and 15-inch MacBook Air. Yet, this year’s MacBook Air isn’t about that. The M3 chips are key to a significant step forward with performance, and for the first time, Apple openly claims superiority with artificial intelligence (AI) on consumer devices. Even as the M3 chips are now available with the 13-inch MacBook Air, you must keep the contours of the choices in mind. Unlike the MacBook Pro range, there is no option of an M3 Pro or M3 Max chip. That’s a factor of the positioning of the MacBook Air, its pricing, and reducing overlaps within the portfolio. There are two iterations of the M3 to choose from — 8 core CPU and 8 core GPU, or 8 core CPU and 10 core GPU. The pricing of the M3 13-inch MacBook Air begins at the ₹1,14,900, with increments of ₹20,000 each for the next two higher-spec variants. The 13-inch MacBook Air with the M2 chip will remain on sale, prices starting ₹99,900. The previous generation 15-inch MacBook Air doesn’t get that privilege. What hasn’t changed is battery life, but there’s a smaller step forward for performance compared to the already very powerful M2, and indeed a significant upgrade to the M1 from a few years ago. Absolutely different ecosystem now, compared with Intel-powered MacBook Airs from a while ago. While none of that sounds like a big enough upgrade, there are those subtle improvements that do counter the argument. The 13-inch MacBook Air can now output to two external displays (the condition here is the MacBook Air’s own display should be closed at the time). There’s support for the faster Wi-Fi 6E standard, relevant if you have a router matching that standard. The utility of both these updates is definite, yet subjective depending on your workflow. Mind you, the lid will need to be opened to access Touch ID fingerprint, which can cause some complications if you’ve connected two displays. But that fingerprint sensor limitation will likely be sorted if you use Apple’s Magic Keyboard and Magic Mouse combo. It was interesting to note Apple talking about the M3’s artificial intelligence (AI) prowess. That has indeed become a crucial element within the perceived longevity of computing devices, with Intel and AMD’s new neural processing units (NPUs) in their new chips prepping the latest computers for AI smarts, including on-device AI processing as that gains greater adoption. For Apple, the current utility of the M3’s 16-core Neural Engine is significantly more than most Windows laptops (webcam smarts, noise cancellation and so on, mostly). The company talks about camera features, real-time speech to text, translation, text predictions and visual understanding — some of which are relevant today, some in due course. Generative AI tools will enable more of the compute tasks on device instead of sending everything to the cloud, for the sake of data privacy, and the NPU is primed for that scenario. Third-party apps will be able to take advantage of the Neural Engine optimisations. Popular photo editing app Pixelmator’s enhance will be able to utilise this, as would AI math assistance in Goodnotes 6. Canva’s AI suite, Adobe’s generative AI Firefly and even the Copilot integration within Microsoft 365, will draw on the NPU to speed up AI compute. This app list will only grow longer as developers optimise support for the M3 chip, and that’s good news, irrespective of whether you actively use generative AI or not. We are only a couple of years in with the square-ish chassis, which replaced a very familiar wedge design that aged rather well. Therefore, no surprise that visually, the 2024 edition of the 13-inch MacBook Air doesn’t change anything. Port assortment remains the same as before (whether that’s enough or not will depend on your workflow), as does the footprint and weight. The 13.6-inch Liquid Retina display is the same spec IPS panel, with 2560 x 1440 resolution and peak 500 nits brightness. Weirdly enough, MagSafe and two USB-C ports are on the left side spine – and with just the headphone jack on the right spine means all your charge avenues are limited to one side only. Relevant, if you pay attention to detail. For the upgrade conundrum, the answer is subjective. If you’re using an M2 powered 13-inch MacBook Air, an urgency to upgrade to one with an M3 chip may be limited to whether your intention is to use this for any scenarios (those would be gaming and for creators) that’d draw an advantage from the now supported hardware-accelerated ray tracing and mesh shading. It’s a new 3-nanometer process used for the M3, compared with the 5-nanometer used by the M2 before it. The advantages are generational performance improvements, such as the additional graphics capabilities we’ve just spoken about. M3’s performance boost brings the 13-inch MacBook Air to the sort of positioning where a similarly spec-ed 13-inch MacBook Pro was a couple of years ago. At least for quite a few workflows. For a still-fanless design, that’s quite a creditable step forward. The resulting performance experience is as flawless as you’d expect from an ultra-slim, ultra-portable computing device. For anyone who is on an older MacBook Air (perhaps the M1 version, or even more dated Intel chips), the M3 powered 13-inch MacBook Air is a significant step forward. An upgrade doesn’t have to just be a new design. The definition has changed, with a lot of it being about AI, and the new MacBook Air works with it. Vishal Mathur is Technology Editor for Hindustan Times. When not making sense of technology, he often searches for an elusive analog space in a digital world. ...view detail   "
}