{
    "title": "Microsoft almost sold Bing to Apple before the AI and Copilot \nrazzle-dazzle, but one critical issue thwarted the plan",
    "date": "3/17/2024",
    "url": "https://sg.news.yahoo.com/microsoft-almost-sold-bing-apple-121254919.html",
    "text": "Microsoft offered to sell Apple its Bing search engine or start a joint venture in 2018. The plans fell through after the search engine was spotted with critical search quality-related issues. Microsoft Bing's search market share continues to stagnate despite the company's big push in AI. According to a new unsealed filing, Microsoft had offered to sell Bing to Apple or the opportunity to kick start a joint venture back in 2018 (via CNBC). It's apparent that Bing's global search market share stacks miles behind Google. This is despite Microsoft's big push and integration of AI-powered capabilities. While appearing at Google's antitrust trial last year, Microsoft CEO Satya Nadella indicated that Google doesn't play fair with Bing. The CEO added that the exclusive deal between Google and Apple has negatively impacted Bing's growth and reach. Satya added that Microsoft was willing to part with up to $15 billion annually to attract a similar deal with Apple, further citing that it would be a game-changing opportunity. In the past, Google has been accused of allegedly breaking antitrust laws by paying $10-15 billion to Apple to secure and assert its search engine dominance. In 2021, the company paid a jaw-dropping $26 billion to maintain its search engine as the default across Apple devices. Interestingly, Google countered this argument in court by indicating that Microsoft had also tried to extend a similar offer to Apple in 2009, 2013, 2015, 2016, 2018, and 2020. However, the deal didn't pull through because Apple turned down the offer each time because of Bing's search quality issues. As highlighted by Google in the filing: \"In each instance, Apple took a hard look at the relative quality of Bing versus Google and concluded that Google was the superior default choice for its Safari users. That is competition.\" Over the years, Microsoft has invested up to $100 million in Bing to improve its user experience and potentially get more people to use it. Admittedly, it has enjoyed subtle gains that prompted Microsoft to reach out to Apple in 2018 to either sell the search engine or form a joint and profitable venture. The deal didn't pan out as Microsoft expected. According to Apple's senior vice president of services, Eddy Cue: \"Microsoft search quality, their investment in search, everything was not significant at all. And so everything was lower. So the search quality itself wasn't as good. They weren't investing at any level comparable to Google or to what Microsoft could invest in. And their advertising organization and how they monetize was not very good either.\" The long-standing battle between Google and Microsoft over search engine and browser dominance continues to get fierce, with the former coming out on top most of the time. As you may know, the European Commission listed Google as a gatekeeper late last year and given six months to comply with the Digital Markets Act (DMA), including making its services interoperable. Google has already put elaborate measures in place to ensure that it complies with the DMA ahead of the March 2024 deadline, including presenting users in the European region with additional consent for linked devices that will let them choose whether they'd like to continue sharing their data or not, the capability to switch the default browser and search engine on Android phones easily, and more. It remains unclear whether this will help Bing to crack the market. Microsoft was listed as a gatekeeper, too. The EU Commission listed its Windows operating system, Microsoft Edge, and Bing among the services under the DMA regulation. The company argued that neither service meets the threshold that would warrant regulation. The tech giant further argued that regulation of these services would place it at a competitive disadvantage against its rivals. RELATED: Microsoft uses deceptive tricks to gain competitive advantage with Edge over other browsers, says Mozilla Shortly after, the EU watchdog determined that Edge and Bing weren't dominant enough in the digital market, consequently exempting both services from DMA regulation. Elsewhere, Microsoft is seemingly pulling away from the Bing brand. In the past few months, especially after making its multi-billion dollar investment in AI and extending its partnership with OpenAI, the company has virtually rebranded most of its products carrying the Bing name. From Bing Image Creator and Bing Chat to the Bing icon on Microsoft SwiftKey. Microsoft 365 Personal | From $70/year Microsoft 365 Personal comes with the Office suite and 1TB of OneDrive storage. It allows you to work from several devices, including Windows, macOS, iOS, and Android. It also includes a long list of other apps and services, such as Editor, Microsoft Forms, and Microsoft Teams.View Deal Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\"  Abby Hensel officially tied the knot in 2021, it has been revealed This food habit is linked to a specific type of dementia. \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault.  Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Devastating glide bombs have been a major threat to Ukraine's forces, and they can only be beaten by shooting down planes before they're released.  There is a growing understanding across the Western allies that Ukraine is losing the ground war against Russia, and by summer could face defeat.  Russia is pounding front lines with artillery, rocket and drone fire — and at over five times the rate the Ukrainian army can reply.  Volodymyr Zelensky’s troops are exhausted — after sustaining in some sectors a heavier concentration of incoming artillery than at the Somme in 1916, or the Normandy Bocage after D-Day in 1944. The two perpetrators claimed that they were \"dissatisfied\" with Jacky Wu's \"hosting style\" A Russian fighter jet crashed into the sea off the Crimean port of Sevastopol on Thursday, the regional governor has said.  The post Lian Hup Heng: Underrated atas cafe-style tarts & cake loaves for $3.80, hidden within a hawker centre appeared first on SETHLUI.com. Nordegren has moved on and built a life that focuses on her six kids Premier League ball boys and girls have been ordered to stop throwing the ball back to players during matches, amid concerns that the “multi-ball” system is giving home teams an unfair advantage. All You Need To Know About Bathroom Trends Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. Shocking CCTV footage captures the moment a drunk driver plows a red sedan into a beauty clinic in the Lopburi province of Thailand, on March 20. The impact injured two staff members and caused significant damage to the clinic and adjacent beauty salon. The driver was found with a blood alcohol level four times the legal limit. "
}