{
    "title": "Exclusive-EU's Vestager warns about Apple, Meta fees, disparaging rival \nproducts",
    "date": "3/19/2024",
    "url": "https://finance.yahoo.com/news/exclusive-eus-vestager-warns-apple-185419529.html",
    "text": "By Foo Yun Chee BRUSSELS (Reuters) - EU antitrust chief Margrethe Vestager on Tuesday warned Apple and Meta Platforms on their new fees for their services, saying that this may hinder users from enjoying the benefits of the Digital Markets Act which aims to give them more choices. Apple announced a slew of changes in January in a bid to comply with the landmark EU tech legislation which requires it to open up its closed eco-system to rivals. A new fee structure includes a core technology fee of 50 euro cents per user account per year that major app developers will have to pay even if they do not use any of Apple's payment services, which has triggered criticism from rivals such as Fortnite creator Epic Games. Vestager said the new fees have attracted her attention. \"There are things that we take a keen interest in, for instance, if the new Apple fee structure will de facto not make it in any way attractive to use the benefits of the DMA. That kind of thing is what we will be investigating,\" she told Reuters in an interview. Vestager expressed her reservations on Meta's new fees. The company earlier on Tuesday said it has offered to almost halve its monthly subscription fee for Facebook and Instagram to 5.99 euros from 9.99 euros but Austrian privacy activist Max Schrems said the issue is not about the level of the fee. \"I think there are many different ways to monetize the services that you provide. Because one thing are the very targeted advertising that builds on data being consumed. Another way of showing your advertising is to make that contextual,\" she said. \"So I think it's important to continue the conversation with Meta and we will assess also finally, what is the next push in order for them to be compliant with the DMA.\" Vestager also warned companies against discouraging users from switching to rivals by disparaging them, saying this kind of behaviour could trigger an investigation. Apple has said some of its changes could expose users to security risks. \"I would think of it as unwise to say that the services are not safe to use, because that has nothing to do with the DMA. The DMA is there to open the market for other service providers to get to you and how your service provider of your operating system, how they will make sure that it is safe is for them to decide,\" she said. \"And of course, if we see or get the suspicion that this is in order to say that someone else are not doing their job of course, we might take initiatives to look into that.\" Vestager said feedback from developers was key to whether she would launch investigations into any of the six companies subjected to the DMA. Asked whether she had received any comments from third parties, she said: \"Quite a lot, I would say.\" (Reporting by Foo Yun Chee; Editing by Chizu Nomiyama) Related Quotes "
}