{
    "title": "Nvidia on cusp of overtaking Apple as second-most-valuable company",
    "date": "3/9/2024",
    "url": "https://dunyanews.tv/en/Technology/797027-Nvidia-on-cusp-of-overtaking-Apple-as-second-most-valuable-company",
    "text": "Technology Nvidia on cusp of overtaking Apple as second-most-valuable company An AI-induced jaw-dropping rally in Nvidia shares has taken its valuation to more than $2tr (Reuters) - Nvidia (NVDA.O) is nipping at the heels of Apple (AAPL.O) to become the world's second-most-valuable company, as investors cannot get enough of the semiconductor maker whose chips power popular artificial intelligence tools such as ChatGPT. An AI-induced jaw-dropping rally in Nvidia shares has taken the company's valuation from $1 trillion to more than $2 trillion in just nine months, overtaking Amazon.com (AMZN.O) Google-parent Alphabet (GOOGL.O) and Saudi Aramco (2222.SE), on the way. Nvidia's market capitalization currently hovers around $2.38 trillion, lagging Apple by just about $230 billion and Microsoft (MSFT.O) by about $645 billion. The relentless rise in shares of Nvidia, which controls 80% of the high-end AI chip market, has been instrumental in pushing Wall Street to record levels this year, while giving the company a more than 5% weightage on the benchmark S&P 500 index (.SPX). Nvidia, which is up 95%, and Meta Platforms (META.O) which is up 46.6% so far this year, have also outperformed shares of other members of the so-called Magnificient 7, highlighting investors' insatiable appetite for everything AI. \"Nvidia's rally reflects the incredibly strong fundamentals underlying its current business model,\" said Richard Meckler, partner at Cherry Lane Investments, a family investment office in New Vernon, New Jersey. \"It is also finding strong speculative support as a favorite among long option buyers who have seen almost a straight upward climb throughout 2024.\" Meanwhile, Apple, which is grappling with slowing iPhone sales, ceded its position as the most valuable U.S. company to Microsoft for the first time since 2021 in January. In recent weeks, Nvidia also replaced Tesla (TSLA.O) as Wall Street's most traded stock by value. "
}