{
    "title": null,
    "date": "3/29/2024",
    "url": "https://www.thedailystar.net/tech-startup/news/apple-planning-use-baidus-ai-iphones-report-3573861",
    "text": "Mastercard Dhaka Night Market 2024: An adventure awaits! YouTube removes over 152K videos in Bangladesh FTA with China may cost Bangladesh Tk 15,000cr a year: study Dollar crunch dampens multinationals’ mood for eye-popping dividends Apple is reportedly planning to integrate generative AI made by Baidu Inc., the Chinese tech and AI company, into upcoming iPhones and Apple products in China, as per a report by Wall Street Journal. This discussion between the tech giants signals a potentially significant development for the Chinese AI landscape. According to the report, the decision to utilise Baidu's AI technology in Apple products comes amidst regulatory requirements in China mandating thorough vetting of all AI models utilised within the country. Experts believe that the deployment of Baidu's generative AI technology in Apple's gadgets could offer a multitude of benefits, ranging from enhancing user experience to bolstering the performance of Apple devices in the Chinese market. The news of potential collaboration has already sparked investor enthusiasm, with U.S.-listed shares of Baidu experiencing a notable 5% surge in premarket trading. আবরার ফাহাদ হত্যার পর বুয়েটে ছাত্ররাজনীতি নিষিদ্ধ করা হয়। ওই ঘটনার প্রায় সাড়ে চার বছর পর বুধবার মধ্যরাতে ছাত্রলীগের বহিরাগত নেতাকর্মীরা ক্যাম্পাসে প্রবেশ করে। "
}