{
    "title": "Apple defeats consumers’ crypto-payment antitrust case for now",
    "date": "3/27/2024",
    "url": "https://www.thehindu.com/sci-tech/technology/apple-defeats-consumers-crypto-payment-antitrust-case-for-now/article68000925.ece",
    "text": "To enjoy additional benefits CONNECT WITH US March 28, 2024 10:22 am | Updated 10:22 am IST Apple on Tuesday did not immediately respond to a request for comment. The company has denied any wrongdoing [File]\n| Photo Credit: AP A federal judge in San Francisco has dismissed a consumer lawsuit accusing Apple of driving up fees at platforms such as Venmo and Cash App by prohibiting payment apps from implementing cryptocurrency transactions. In a ruling on Tuesday, U.S. District Judge Vince Chhabria called the proposed class action \"speculative\" and said it “suffers from several fatal problems.” He gave the plaintiffs 21 days to amend their complaint. The November 2023 lawsuit alleged Apple was imposing restrictions on cryptocurrency technology in its popular App Store, harming competition for peer-to-peer payments and pushing up fees for cash and credit card transactions at PayPal’s Venmo and Block’s Cash App. It said Apple has excluded at least two Bitcoin wallet apps. Apple on Tuesday did not immediately respond to a request for comment. The company has denied any wrongdoing. (For top technology news of the day, subscribe to our tech newsletter Today’s Cache) An attorney for the plaintiffs declined to comment. Cupertino, California-based Apple in February asked Chhabria to throw out the lawsuit, arguing that the plaintiffs failed to show any unlawful app rules or business agreements. The plaintiffs' lawsuit alleged Venmo, Cash App and others agreed to a specific App Store iPhone guideline that they said prevented developers from using some cryptocurrency transactions. In his ruling, Chhabria said it was not clear that it was an “unlawful agreement” under federal antitrust law for companies to follow such a guideline. Apple faces other antitrust lawsuits, including one from the U.S. Justice Department and a group of states alleging the iPhone maker was unlawfully monopolising the smartphone market. Apple denied the claims and said it would fight the case. In September, a federal judge in another case said payment card issuers can sue Apple over alleged anticompetitive practices involving its Apple Pay mobile wallet. Other lawsuits challenge Apple’s rules for iCloud storage, and consumers are pursuing a class action accusing the company of monopolising the market for iPhone apps. The case is Lamartine Pierre et al v. Apple Inc, U.S. District Court, Northern District of California, No. Case 5:23-cv-05981. For plaintiffs: Yavar Bathaee and Brian Dunne of Bathaee Dunne For Apple: Belinda Lee and Sarah Ray of Latham & Watkins technology (general)\n\n/\n\nPDAs and smartphones\n\n/\n\ncryptocurrency\n\n/\n\nlitigation and regulation BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. "
}