{
    "title": "Pecaut & CO. Cuts Stock Holdings in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/11/2024",
    "url": "https://www.defenseworld.net/2024/03/11/pecaut-co-cuts-stock-holdings-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by Defense World Staff on Mar 11th, 2024 Pecaut & CO. reduced its stake in shares of  Apple Inc. (NASDAQ:AAPL – Free Report) by 2.2% during the 3rd quarter, according to the company in its most recent Form 13F filing with the Securities and Exchange Commission (SEC). The institutional investor  owned 84,633 shares of the iPhone maker’s stock after selling 1,884 shares during the period. Apple accounts for approximately  6.1% of Pecaut & CO.’s portfolio, making the stock its 4th biggest holding. Pecaut & CO.’s holdings in Apple were worth $14,490,000 as of its most recent SEC filing. Several other institutional investors also recently bought and sold shares of AAPL. IFM Investors Pty Ltd raised its holdings in  Apple by 20.0% during the first quarter. IFM Investors Pty Ltd now owns 2,615,701 shares of the iPhone maker’s stock valued at $456,728,000 after buying an additional 435,891 shares in the last quarter.  Ironwood Wealth Management LLC. increased its stake in shares of  Apple by 0.4% in the first quarter. Ironwood Wealth Management LLC. now owns 240,628 shares of the iPhone maker’s stock worth $42,016,000 after purchasing an additional 1,040 shares during the period.  Markel Corp increased its stake in shares of  Apple by 0.7% in the first quarter. Markel Corp now owns 1,206,990 shares of the iPhone maker’s stock worth $210,752,000 after purchasing an additional 8,450 shares during the period.  Camden Capital LLC increased its stake in shares of  Apple by 9.2% in the first quarter. Camden Capital LLC now owns 156,364 shares of the iPhone maker’s stock worth $27,305,000 after purchasing an additional 13,200 shares during the period.  Finally, Harbor Island Capital LLC increased its stake in shares of  Apple by 0.3% in the first quarter. Harbor Island Capital LLC now owns 135,325 shares of the iPhone maker’s stock worth $23,629,000 after purchasing an additional 400 shares during the period. 58.51% of the stock is currently owned by institutional investors. A number of equities analysts have recently commented on the company. Wedbush  reiterated an “outperform” rating and issued a $250.00 price objective on shares of Apple in a research note on Wednesday, February 28th. JPMorgan Chase & Co. dropped their price objective on Apple from $225.00 to $215.00 and set an “overweight” rating on the stock in a research note on Friday, February 2nd. Needham & Company LLC  restated a “buy” rating and set a $220.00 price target on shares of Apple in a research note on Friday, February 2nd. Bank of America raised Apple from a “neutral” rating to a “buy” rating and upped their price target for the company from $208.00 to $225.00 in a report on Thursday, January 18th. Finally, Barclays cut their price target on Apple from $160.00 to $158.00 and set an “underweight” rating for the company in a report on Friday, February 2nd. One equities research analyst  has rated the stock with a sell rating, eleven have issued  a hold rating, twenty-one have given a buy rating and one  has given a strong buy rating to the stock. According to data from MarketBeat, the company presently has a consensus rating of “Moderate Buy” and an average price target of $205.27. View Our Latest Analysis on Apple NASDAQ AAPL opened at $170.73 on Monday. The firm has a market cap of $2.64 trillion, a PE ratio of 26.59, a price-to-earnings-growth ratio of 2.06 and a beta of 1.29. Apple Inc. has a one year low of $147.61 and a one year high of $199.62. The stock’s 50 day simple moving average is $184.64 and its 200 day simple moving average is $183.62. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. Apple (NASDAQ:AAPL – Get Free Report) last announced its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, beating analysts’ consensus estimates of $2.09 by $0.09. The firm had revenue of $119.60 billion for the quarter, compared to analyst estimates of $117.99 billion. Apple had a return on equity of 156.04% and a net margin of 26.16%. The business’s quarterly revenue was up 2.1% compared to the same quarter last year. During the same period last year, the company earned $1.88 EPS.  As a group, sell-side analysts forecast that  Apple Inc. will post 6.55 earnings per share for the current fiscal year. The company also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were given a $0.24 dividend. The ex-dividend date of this dividend  was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a yield of 0.56%. Apple’s payout ratio is 14.95%. In other Apple news, Director Arthur D. Levinson sold 100,000 shares of the stock in a transaction on Thursday, February 29th. The stock was sold at an average price of $180.94, for a total value of $18,094,000.00. Following the transaction, the director now directly owns 4,434,576 shares in the company, valued at approximately $802,392,181.44. The sale was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through this link. Corporate insiders own  0.06% of the company’s stock. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Qube Research & Technologies Ltd Makes New $2.14 Million Investment in Invesco S&P 500 Pure Value ETF (NYSEARCA:RPV) Qube Research & Technologies Ltd Has $2.26 Million Stake in Maximus, Inc. (NYSE:MMS) "
}