{
    "title": "Apples iOS 18 May Debut With Enhanced Customisations For Home Screen, AI \nMagic On Cards Too; All You Need To Know",
    "date": "3/24/2024",
    "url": "https://english.jagran.com/technology/apple-ios-18-may-debut-with-enhanced-customisations-for-home-screen-ai-magic-on-cards-too-all-you-need-to-know-10149950",
    "text": "iOS 18: The latest updates from Bloomberg's Mark Gurman hint Apple could offer enhanced customisations for the Home Screen in an effort for a major revamp. Gurman further added the software may debut with AI tools and could be the 'biggest update' in history. Cupertino-based tech giant Apple has been in the news lately for rumours concerning the upcoming iOS 18's AI features. Amid these speculations, the latest updates from Bloomberg's Mark Gurman hint that the company could offer enhanced customisations for the Home Screen in an effort for a major revamp. While the journalist did not delve deep into the details, the next iOS is expected to arrive with AI features for better user experience. \n    Apple will likely introduce iOS 18 at the Worldwide Developers Conference in June this year. Beyond the Home Screen, the company may bring generative AI features for its voice assistant Siri and other apps. The tech giant could also introduce Rich Communications Services (RCS) support for its messaging app for better integration with the Android experience, according to MacRumors. \nAlso Read: Apple May Introduce 'Hearing Aid Mode' In Upcoming New-Gen AirPods Pro With iOS 18 Update; Details\nSimilar to previous years, the company may bring design tweaks in different parts of the UI. Meanwhile, the company reportedly held talks with AI service providers such as Google, OpenAI and Anthropic. Gurman noted that Apple may deploy Google's Gemini model to power an AI chatbot within the brand's OS. The company's AI engine may handle \"behind-the-scenes\" tasks.  \n\nHere’s what I wrote about iOS 18, visionOS 2.0 and watchOS 11 in Power On today https://t.co/yHepnBRSE7 pic.twitter.com/K7qY2iVw7I  — Mark Gurman (@markgurman) March 24, 2024\n\n\nAccording to the report, the company could also allow developers to build generative AI models for iPhones. Plus, integrating Google AI chat into upcoming iOS may open revenue streams for the tech giant. With the move, the company could also evade local approvals and regulations in China, for instance. \n    Also Read: WWDC 2024 Expectations: Apple May Rename 'Apple ID' To 'Apple Account' With iOS 18 Announcement; All You Need To Know  \nMacRumors, citing the reporter, stated the iPhone maker may focus on AI tools that will help people manage daily life better. The upcoming update is touted by some employees as the biggest OS update in the software's history. Speaking of the Home Screen, the company extend better control over app icon placements. The report noted this could imply more free space compared to the locked grid system. Apple will likely introduce iOS 18 at the Worldwide Developers Conference in June this year. Beyond the Home Screen, the company may bring generative AI features for its voice assistant Siri and other apps. The tech giant could also introduce Rich Communications Services (RCS) support for its messaging app for better integration with the Android experience, according to MacRumors. \nAlso Read: Apple May Introduce 'Hearing Aid Mode' In Upcoming New-Gen AirPods Pro With iOS 18 Update; Details\nSimilar to previous years, the company may bring design tweaks in different parts of the UI. Meanwhile, the company reportedly held talks with AI service providers such as Google, OpenAI and Anthropic. Gurman noted that Apple may deploy Google's Gemini model to power an AI chatbot within the brand's OS. The company's AI engine may handle \"behind-the-scenes\" tasks.  \n\nHere’s what I wrote about iOS 18, visionOS 2.0 and watchOS 11 in Power On today https://t.co/yHepnBRSE7 pic.twitter.com/K7qY2iVw7I  — Mark Gurman (@markgurman) March 24, 2024\n\n\nAccording to the report, the company could also allow developers to build generative AI models for iPhones. Plus, integrating Google AI chat into upcoming iOS may open revenue streams for the tech giant. With the move, the company could also evade local approvals and regulations in China, for instance. \n    Also Read: WWDC 2024 Expectations: Apple May Rename 'Apple ID' To 'Apple Account' With iOS 18 Announcement; All You Need To Know  \nMacRumors, citing the reporter, stated the iPhone maker may focus on AI tools that will help people manage daily life better. The upcoming update is touted by some employees as the biggest OS update in the software's history. Speaking of the Home Screen, the company extend better control over app icon placements. The report noted this could imply more free space compared to the locked grid system. Also Read: Apple May Introduce 'Hearing Aid Mode' In Upcoming New-Gen AirPods Pro With iOS 18 Update; Details\nSimilar to previous years, the company may bring design tweaks in different parts of the UI. Meanwhile, the company reportedly held talks with AI service providers such as Google, OpenAI and Anthropic. Gurman noted that Apple may deploy Google's Gemini model to power an AI chatbot within the brand's OS. The company's AI engine may handle \"behind-the-scenes\" tasks.  \n\nHere’s what I wrote about iOS 18, visionOS 2.0 and watchOS 11 in Power On today https://t.co/yHepnBRSE7 pic.twitter.com/K7qY2iVw7I  — Mark Gurman (@markgurman) March 24, 2024\n\n\nAccording to the report, the company could also allow developers to build generative AI models for iPhones. Plus, integrating Google AI chat into upcoming iOS may open revenue streams for the tech giant. With the move, the company could also evade local approvals and regulations in China, for instance. \n    Also Read: WWDC 2024 Expectations: Apple May Rename 'Apple ID' To 'Apple Account' With iOS 18 Announcement; All You Need To Know  \nMacRumors, citing the reporter, stated the iPhone maker may focus on AI tools that will help people manage daily life better. The upcoming update is touted by some employees as the biggest OS update in the software's history. Speaking of the Home Screen, the company extend better control over app icon placements. The report noted this could imply more free space compared to the locked grid system. Similar to previous years, the company may bring design tweaks in different parts of the UI. Meanwhile, the company reportedly held talks with AI service providers such as Google, OpenAI and Anthropic. Gurman noted that Apple may deploy Google's Gemini model to power an AI chatbot within the brand's OS. The company's AI engine may handle \"behind-the-scenes\" tasks.  \n\nHere’s what I wrote about iOS 18, visionOS 2.0 and watchOS 11 in Power On today https://t.co/yHepnBRSE7 pic.twitter.com/K7qY2iVw7I  — Mark Gurman (@markgurman) March 24, 2024\n\n\nAccording to the report, the company could also allow developers to build generative AI models for iPhones. Plus, integrating Google AI chat into upcoming iOS may open revenue streams for the tech giant. With the move, the company could also evade local approvals and regulations in China, for instance. \n    Also Read: WWDC 2024 Expectations: Apple May Rename 'Apple ID' To 'Apple Account' With iOS 18 Announcement; All You Need To Know  \nMacRumors, citing the reporter, stated the iPhone maker may focus on AI tools that will help people manage daily life better. The upcoming update is touted by some employees as the biggest OS update in the software's history. Speaking of the Home Screen, the company extend better control over app icon placements. The report noted this could imply more free space compared to the locked grid system. Here’s what I wrote about iOS 18, visionOS 2.0 and watchOS 11 in Power On today https://t.co/yHepnBRSE7 pic.twitter.com/K7qY2iVw7I  — Mark Gurman (@markgurman) March 24, 2024 According to the report, the company could also allow developers to build generative AI models for iPhones. Plus, integrating Google AI chat into upcoming iOS may open revenue streams for the tech giant. With the move, the company could also evade local approvals and regulations in China, for instance. \n    Also Read: WWDC 2024 Expectations: Apple May Rename 'Apple ID' To 'Apple Account' With iOS 18 Announcement; All You Need To Know  \nMacRumors, citing the reporter, stated the iPhone maker may focus on AI tools that will help people manage daily life better. The upcoming update is touted by some employees as the biggest OS update in the software's history. Speaking of the Home Screen, the company extend better control over app icon placements. The report noted this could imply more free space compared to the locked grid system. Also Read: WWDC 2024 Expectations: Apple May Rename 'Apple ID' To 'Apple Account' With iOS 18 Announcement; All You Need To Know  \nMacRumors, citing the reporter, stated the iPhone maker may focus on AI tools that will help people manage daily life better. The upcoming update is touted by some employees as the biggest OS update in the software's history. Speaking of the Home Screen, the company extend better control over app icon placements. The report noted this could imply more free space compared to the locked grid system. MacRumors, citing the reporter, stated the iPhone maker may focus on AI tools that will help people manage daily life better. The upcoming update is touted by some employees as the biggest OS update in the software's history. Speaking of the Home Screen, the company extend better control over app icon placements. The report noted this could imply more free space compared to the locked grid system.  Jagran English brings you all the latest and breaking news from India and around the world. Get live English news from India, World, Politics, Entertainment, Lifestyle, Business, Education, Sports, Technology, and much more. Follow english.jagran.com to stay updated with the latest English news. Copyright © 2023 Jagran Prakashan Limited. "
}