{
    "title": "AI, Biotech, Energy Sectors Expect M&A Revival For 2024 - Apple \n(NASDAQ:AAPL), Amazon.com (NASDAQ:AMZN)",
    "date": "1/29/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36824293/ai-biotech-energy-sectors-expect-m-a-revival-for-2024",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Markets are primed for a revival in mergers and acquisitions (M&A) in 2024 following the worst performance in almost a decade for deal-making in 2023. Equity and M&A experts believe that, after a year beset by volatile markets and rising interest rates, 2024 offers improving conditions for takeover deals and corporate mergers. “Capital markets were not as open or freewheeling, and 2023 did not happen the way we thought it would,\" said Tom Miles, Head of Americas M&A at Morgan Stanley. “The market forces are in place that make an eventual return inevitable. It's not a question of if but when.” One piece of the M&A jigsaw that was largely missing last year was private equity (PE) firms. These players use leveraged buyout methods to take poorly performing publicly traded companies private. The goal is to exit via an IPO or sell off the assets at a profit. Pitchbook analyst Tim Clarke noted how higher interest rates made it more costly for PE firms to engage in deals. “PE's share of M&A has no doubt been constrained by reduced access to leverage,” he said. During 2023, PE involvement was the lowest total recorded going back to 2005. Overall volumes of M&A dropped to $2.4 trillion in 2023, down from $3.1 trillion in 2022 and $5.2 trillion at its 2021 peak. But analysts at Morgan Stanley expect both corporate and PE deal-making to be stronger in 2024 after the fourth-quarter rally on equity markets in 2023. “Corporate balance sheets are strong, financing markets are improving and CEO confidence, which is closely correlated with M&A activity, is climbing,” said Miles. Which sectors, then, can investors expect to lead this increase in M&A activity. There’s agreement here on three sectors that appear ripe for takeovers to flourish in 2024. Throughout the latter half of 2023, it has become clear that AI will be a major market theme in 2024 and beyond. The burgeoning technology is being identified through growing numbers of potential use cases as the most important technological advance in a generation. Additionally, there is no shortage of start-up companies being pursued for partnerships with the Mega Techs. Could this be the year that sees Microsoft MSFT make an offer for OpenAI, with which it already has a major investment and development partnership. It’s unlikely, given the regulatory scrutiny the partnership has come under in Europe and the UK, and Microsoft has stated that it isn’t seeking ownership of OpenAI. But investors can gain exposure to potential game-changing deals through the many exchange traded funds that track the technology sector. The iShares U.S. Technology ETF‘s IYW main three holdings are Microsoft, Apple AAPL and Nvidia NVDA, while the Global X Robotics & Artificial Intelligence ETF BOTZ follows key listed AI and robotics firms. Also Read: AI Regulation – Did The EU Just Deliver The Future Of AI Directly Into The Hands Of The US? Pharmaceuticals stocks had a mixed 2023, and it was those companies cashing in on the success of diabetes/weight-loss drugs that enjoyed the significant gains. That left many large drugmakers at a disadvantage, and they could be looking to set this straight in 2024 with deals to acquire biotech firms already in development and testing stages of the next potential blockbuster treatments. “It's a very big industry, and because biotech is so research-intensive, consolidation may need to happen,” said John Collins, head of global M&A at Morgan Stanley. There are several companies in the sector that analysts and market commentators see as potential takeover targets. Krystal Biotech KRYS is a potential target, with a pipeline of approved and developmental gene therapies as the prize. Ventyx Biosciences VTYX could also be taken out. Its near penny stock status and small $120 million market cap are attractive, and its founder has sold a previous enterprise. As yet, however, the company has nothing in its pipeline beyond phase two trials. The iShares Biotechnology ETF IBB holds Vertex Pharma VRTX and Regeneron Pharma REGN as its top two holdings, but their $100 billion-plus market caps make them more likely to be acquirers than targets. In the last half of 2024, the markets watched COP28’s dedication to energy transition. And yet, ExxonMobil XOM bought Pioneer Natural Resources PXD for $60 billion, and Chevron CVX bought Hess Corp HES for $53 billion. “While COP 28 resulted in the ‘UAE Consensus’ to transition away from fossil fuels, there should, nevertheless, continue to be, consolidation in the oil and gas sector in 2024,” said Sarah Jones, global head of corporate at Clifford Chance. Again, many of the companies held by energy sector ETFs are likely to be those on the acquisition trail. The top three holdings in the Energy Select Sector SPDR Fund XLE are Exxon, Chevron and ConocoPhillips COP. Any increase in M&A activity could be felt most keenly within the smaller listed companies. They can perform relatively cheap mergers without loading up on finance — or agree to all-share deals that circumvent the need for financing. Also, larger companies often pursue non-organic growth strategies by making smaller, bolt-on acquisitions, rather than going for large deals. Thus, this year could see a bounce for the Russell 2000 index of small-cap companies, tracked by the iShares Russell 2000 ETF IWM. Now Read: EXCLUSIVE: Tesla’s Humanoid Robot ‘Was A Fake,’ Elon Musk ‘Doesn’t Deliver At All,’ Says Analyst Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}