{
    "title": "Short Apple's Stock",
    "date": "1/21/2024",
    "url": "https://247wallst.com/?p=1350525",
    "text": "Very few investors are short Apple’s (NASDAQ: AAPL) shares. Short interest is less than 1% of the float. However, if there was ever a time recently to short Apple’s shares, it is now. Apple’s revenue may no longer grow, and its flagship iPhone 15 sales appear to be in trouble. Apple has had a remarkable run. Five years ago,+ shares traded at $38. Today, that figure is $191. However, in the last two months, the shares are flat. Barclay’s recently issued a rating downgrade of Apple from “neutral” to “sell.” Worry about iPhone sales was at the heart of their argument. Piper Sandler cut the stock from “overweight” to “neutral.” Its analyst was that iPhone sales in China, the world’s largest smartphone market, were falling. A look at Apple’s last quarter shows that problems had already started. In the next two weeks, Apple will report numbers again. At the core of any critique is whether iPhone revenue is falling and revenue at its “Services” business is still rising. In the most recent quarter, revenue fell 1% to $89.5 billion. iPhone revenue numbers were mediocre. At $43.9 billion, they rose from $42.7 billion in the year-ago period. The bright spot was “Services,” which included Apple Pay and Apple TV+ items. This revenue was $22.3 billion, up from $19.2 billion. “Services” would need to rise at a breakneck pace to offset any sharp drop in iPhone revenue. The iPhone faces two challenges. The first is that people may be less likely to upgrade to a smartphone, the improvements of which are only modest from model to model. How many people can tell that a camera has been improved slightly or that a chip’s speed is better? The other challenge is the Android operating system, which several smartphone companies use and is led by behemoth Samsung. Globally, Android’s share is 70%. Android competes directly with Apple’s iOS. However, Apple is the world’s largest smartphone company. When Apple’s numbers stumbled in late 2022, the stock traded down to $130. That could happen again if the next two or three quarters do not recover nicely from the most recently reported one. Ever wanted an extra set of eyes on an investment you’re considering? Now you can speak with up to 3 financial experts in your area for FREE. By simply \nclicking here you can begin to match with financial professionals who can help guide you through the financial decisions you’re making. And the best part? The first conversation with them is free. Click here to match with up to 3 financial pros who would be excited to help you make financial decisions.  Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}