{
    "title": "Apple Stock Gains A New Bull On AI, Vision Pro Prospects",
    "date": "1/18/2024",
    "url": "https://www.investors.com/news/technology/apple-stock-gains-a-new-bull-on-ai-vision-pro-prospects/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Apple (AAPL) stock rose Thursday after BofA Securities turned positive on the consumer electronics maker, citing artificial intelligence and the company's upcoming Vision Pro headset as sales drivers. BofA analyst Wamsi Mohan upgraded Apple stock to buy from neutral and raised his price target to 225 from 208. Apple stock advanced 3.3% to close at 188.63 on the stock market today. In a positive sign, Apple stock broke through a downward trend line on Thursday. It now is trying to reclaim its 50-day moving average line. In a client note, Mohan predicted a \"stronger multiyear iPhone upgrade cycle\" as consumers replace older handsets to take advantage of generative AI features coming this year and next. Apple's Vision Pro spatial computing headset also should provide a sales lift, he said. Preorders for the device begin Friday, with product availability starting Feb. 2. Mohan also forecast higher growth in services as Apple better monetizes its installed base. Plus, risks around legal issues facing the company are \"manageable,\" he said. Those legal issues include antitrust actions and patent infringement lawsuits. Meanwhile, sentiment in Apple stock should turn more positive as investor attention shifts to the Apple Vision Pro launch and AI-enabled iPhones, he said. Earlier this month, investment banks Barclays and Piper Sandler downgraded Apple stock on concerns over weak iPhone sales. Follow Patrick Seitz on X, formerly Twitter, at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks. YOU MAY ALSO LIKE: Taiwan Semiconductor Forecasts Return To Sales Growth In First Quarter Samsung Unveils AI-Enabled Smartphones As Apple Gears Up For Vision Pro Launch Apple Isn't The Only Player In Spatial Computing. Rivals Populated CES 2024. Apple In 2024: AI, Selling Vision Pro Are Key Challenges See Stocks On The List Of Leaders Near A Buy Point 3/29/2024\nCheck the Stock Market Today column to spot changes in market trend and track the best stocks to buy and... 3/29/2024\nCheck the Stock Market Today column to spot changes in... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}