{
    "title": "Apple services & China will be key to Q4 earnings next week",
    "date": "1/27/2024",
    "url": "https://finance.yahoo.com/video/apple-services-china-key-q4-130051580.html",
    "text": "Consumer tech manufacturer Apple (AAPL) is due to report earnings next Thursday, February 1. Notably, waning iPhone demand out of China has worried investors as Apple had a rocky 2024 start, dealing with several stock downgrades. CFRA Research Senior Equity Analyst Angelo Zino breaks down his expectations for Apple and the biggest tailwinds and risks for its various devices. \"As far as those businesses are concerned, the only one that will probably show growth is Mac because some of the new products that they rolled out and easy comps from a year ago, you will probably see some sharp declines specifically on the iPad side of things...,\" Zino notes. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. JOSH LIPTON: And Angelo, I want to get your take on another big name reporting next week, and that's Apple. We had tech investor, Dan Niles, on the show this week, Angelo. Not a fan of the iPhone maker. And I think Dan's point was basically-- the argument he made to us, Angelo, is, Why am I going to pay about 30 times for this company where the top line performance is just underwhelming? That seemed to be his core argument. What do you think, Angelo? ANGELO ZINO: Yeah, I mean, listen, the reason you're paying, you know, high 20s on a 20, 25 basis for Apple is because of that free cash flow potential, right? I mean, this is a company that we think, this year, is going to generate about $110 billion in free cash flow. The best free cash flow generator out there on the planet clearly supporting the buybacks and real stability in that overall business. So, you know, when we kind of think about here the December quarter results, the two key factors you have to look out for is, one, the services business. That continues to be the main growth driver for this company. You don't necessarily need to see top line growth or significant top line growth to see the earnings growth for Apple. If you actually kind of look in calendar 2023, you're probably looking at about 8% earnings growth on no revenue growth, right? And that's because of that ongoing mix shift towards the services side of things, which essentially is 2x the margins that hardware does. So we need to continue to see good growth on the services side. And then China is, of course, going to be the other big story out there. If they're showing that China is holding up very well, I think, you know, that's something that kind of alleviates some concerns out there for investors and potentially kind of allows the stock to continue to work here over the next couple of months. JOSH LIPTON: What about, Angelo, how much focus are you going to have about what they have to say about the kind of non-iPhone hardware in the corner-- in the quarter, Watch, iPad, Mac? ANGELO ZINO: Yeah, I mean, listen, I think as far as those businesses are concerned, the only one that probably will show growth is Macs because some of the new products that they rolled out and the easy comps from a year ago. You're probably going to see some sharp declines, specifically on the iPad side of things. They didn't have any new products on that side. And then on wearables side of things, it really is kind of what they have to say about the Vision Pro. And that has the potential to kind of move a couple of basis points on the wearables side of things here over the next couple of quarters, but we're not expecting much on that side of things. So, you know, I'm not looking too much into those type of end markets right now, but, you know, something to definitely keep an eye on. Related Quotes "
}