{
    "title": null,
    "date": "1/15/2024",
    "url": "https://seekingalpha.com/news/4054921-apple-offering-iphone-15-at-rare-discounts-in-china-amid-rising-competition",
    "text": "Nodokthr Apple (NASDAQ:AAPL) is offering rare discounts on its iPhones in China, reducing retail prices by up to 500 yuan (about $70) amid rising competition in the smartphone arena. The company has reduced prices of some iPhones by up to 5%, according to its Chinese website. The tech giant is running the promotion event from Jan. 18 to Jan. 21 to welcome the Lunar New Year, which will be in February. The maximum instant savings for iPhones, including the new iPhone 15 series, would be up to 500 yuan. The limited time offer to welcome the Chinese New Year also extends to other Apple products and buyers can save up to 800 yuan, as per the company website. Apple has not reduced the prices of its latest iPhones in years. However, the company did not raise the prices for the iPhone 15 series when they were launched in September. Last week it was reported that Apple's Chinese iPhone sales had dropped 30% in first week of 2024, compared to the same period a year ago. Earlier this month, the company's shares also saw a downgrade at Barclays amid concerns over its hardware business, including the iPhone 15. Online shopping platforms such as Pinduoduo, owned by PDD (PDD), have been cutting prices of the iPhone 15 and iPhone 15 Pro by up to 16% since the start of the year, as per a Reuters' report. Apple is facing competition from Chinese rivals such as Huawei Technologies and Xiaomi (OTCPK:XIACF) (OTCPK:XIACY). At the end of August 2023, Huawei surprised many by quietly launching its new phone, Mate 60 Pro. The company did not provide information on the power of the chip inside but people speculated that it could be using a 5G capable chip. In the third quarter, Huawei's smartphone sales had grown 37% year-over-year on the back of Mate 60 series, which is powered by its SoC Kirin 9000S, Counterpoint Research had reported in October 2023. Huawei Technologies expects to generate over 700B yuan (about $98.7B) in revenue in 2023. "
}