{
    "title": "Microsoft overtakes Apple as world's most valuable company",
    "date": "1/11/2024",
    "url": "https://www.moneycontrol.com/news/business/stocks/microsoft-overtakes-apple-as-worlds-most-valuable-company-12037191.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Microsoft overtook Apple as the world’s most valuable company on Thursday after the iPhone maker’s shares made a weak start to 2024 due to growing concerns over demand. Shares of Redmond, Washington-based Microsoft were last up 1.6%, giving it a market valuation of $2.875 trillion as its early lead in the race to make money from generative artificial intelligence helped draw investors. Apple was 0.9% lower with a market capitalization of $2.871 trillion – the first time since 2021 that its valuation has fallen below that of Microsoft. The Cupertino, California-based company’s stock has slid 3.3% in January as of last close, compared with a 1.8% rise in Microsoft. ”It was inevitable that Microsoft would overtake Apple since Microsoft is growing faster and has more to benefit from the generative AI revolution,” said D.A. Davidson analyst Gil Luria. The weakness in Apple stock follows a series of rating downgrades that fanned worries that sales of the iPhone, its biggest cash cow, would stay weak, especially in major market China. ”China could be a drag on performance over the coming years,” brokerage Redburn Atlantic said in a client note on Wednesday, pointing to competition from a resurgent Huawei and Sino-U.S. tensions that have increased pressure on Apple. The brokerage added Apple’s services business – a bright spot in recent quarters – faces threats as regulators deepen scrutiny of a lucrative deal that makes Google the default search engine on iOS. Shares of Apple, whose market capitalization peaked at $3.081 trillion on Dec. 14, ended last year with a gain of 48%. That was lower than the 57% rise posted by Microsoft, which aggressively rolled out genAI-powered tools in 2023 thanks to its tie-up with ChatGPT-maker OpenAI. Microsoft has briefly taken the lead over Apple as the most valuable company a handful of times since 2018, most recently in 2021 when concerns about COVID-driven supply chain shortages hit the iPhone maker’s stock price. Currently, Wall Street is more positive on Microsoft. The company has no ”sell” rating and nearly 90% of the brokerages covering the company recommend buying the stock. Apple has two ”sell” ratings and only two-thirds of the analysts covering the company rate it a ”buy”. Both the stocks look relatively expensive in terms of price to their expected earnings, a common method of valuing publicly listed companies. Apple is trading at a forward PE of 28, well above its average of 19 over the past 10 years, according to LSEG data. Microsoft is trading around 31 times forward earnings, above its 10-year average of 24. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}