{
    "title": "Apple shares more details about the new default web browser prompt in iOS \n17.4",
    "date": "1/26/2024",
    "url": "https://9to5mac.com/2024/01/26/apple-shares-more-details-about-the-new-default-web-browser-prompt-in-ios-17-4/",
    "text": "Yesterday, Apple announced that iPhone users in the EU will be prompted to choose a default web browser when they open Safari for the first time after updating to iOS 17.4. The company has now shared more details on this process. Apple tells me that the popup message in iOS 17.4 will show a list of the 12 most popular browsers from the App Store in that country. That list will be presented in random order for each user. In addition to making it easier for users to set their default browser, iOS 17.4 will also allow third-party browsers that use different web engines than Safari for the first time. Again, these changes only apply in the European Union. Here’s a full breakdown of the browser options that will be included on this message in iOS 17.4 in the European Union, based on the App Store popularity in each storefront. These will be presented in random order in iOS 17.4 for each user in the EU. Austria Belgium Bulgaria Croatia Cyprus You.com AI Search Assistant Czechia Denmark Estonia Finland France Germany Greece Hungary Ireland Italy Latvia Lithuania Luxembourg Malta Netherlands Poland Portugal Romania I wonder about their continuing stance on browser engines. I could (possibly) get it back when we were on iPhone 4. But today, even on macOS, Safari does not feel the fastest browser, and is definitely the worst in handling extensions. Slovakia Slovenia Spain Sweden FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… iOS is Apple's mobile operating system that runs… Chance is an editor for the entire 9to5 network and covers the latest Apple news for 9to5Mac. Tips, questions, typos to chance@9to5mac.com "
}