{
    "title": null,
    "date": "1/3/2024",
    "url": "https://www.forbes.com/sites/petercohan/2024/01/03/barclays-sends-apple-stock-down-4-dont-catch-this-falling-knife/",
    "text": "CUPERTINO, CALIFORNIA - JUNE 05: Apple CEO Tim Cook stands next to the new Apple Vision Pro headset ... [+] is displayed during the Apple Worldwide Developers Conference on June 05, 2023 in Cupertino, California. Apple CEO Tim Cook kicked off the annual WWDC23 developer conference with the announcement of the new Apple Vision Pro mixed reality headset. (Photo by Justin Sullivan/Getty Images) Apple stock fell 4% on January 2 after Barclays downgraded the tech giant’s stock, according to a Forbes staff report. This raises a question: In light of Apple’s negative earnings and profit growth, is $2.9 trillion too high a market capitalization for the company? My answer: Unless Apple’s board replaces CEO Tim Cook with an executive who can revive the company’s growth, I think the stock is heading down. To be fair, for years Apple stock — which gained 49% in 2023 — rose as its revenues slowed and shifted into reverse. Between 2010 and 2020, Apple revenue grew at a 15.5% average annual rate. During the pandemic, Apple enjoyed a surge in revenue — growing at a nearly 20% annual rate in 2021 and 2022. Sadly, since the end of 2022, Apple’s revenue has declined every quarter. While the bulk of Apple’s revenue came from iPhone sales in China — where its revenue fell 2.5% in the latest quarter to $15.1 billion, noted the Wall Street Journal — the company’s services business grew and generated profits. To wit, Apple’s services gross margin is “double the margin Apple makes on all its hardware products,” according to CNBC. That could come to an end. Barclays analyst Tim Long cited two concerns for downgrading Apple’s stock:   Nothing clear on Apple’s new product horizon is likely to accelerate its revenue growth enough to justify its high valuation. China is delivering Apple a one-two punch — limits on government employee use of iPhones and the success of local rivals. According to Bloomberg, the International Data Corp. cut its 2024 forecast for Apple’s China sales. “Huawei’s success most significantly impacts Apple’s growth in China,” said IDC Research Director Nabila Popal. Huawei is rapidly gaining share against the iPhone. The Chinese company’s high-end phone segment market share soared from 11% in 2022 to 24% during the third quarter of 2023, according to IDC. In 2020, then-President Donald Trump imposed export controls on TSMC — provider of the most advanced chips for smartphones — blocking Huawei from keeping up with Apple. Huawei ran out of TSMC chips and its market share plummeted in 2021 and 2022, noted Bloomberg. That has changed because SMIC, a Chinese chip maker, has begun to catch up with TSMC. Huawei can now buy chips from SMIC through a near-state-of-the-art 7 nm process technology that “puts it a bit closer to parity with processes used by Apple,” according to Bloomberg. Thanks to the SMIC chip, Huawei announced the Mate 60 Pro, a smartphone that’s “roughly comparable to a top-of-the-line iPhone 15 Pro Max,” noted Bloomberg. This could put more downward pressure on iPhone revenue. Moreover, since October, China has continued to restrict its government officials from purchasing iPhones. By December 2023, “multiple state-backed companies and government departments in at least eight provinces had instructed employees to use devices made by local brands,” Bloomberg News reported. With 80 million potential customers working for government-owned companies, Apple’s pain could become Huawei’s gain. Regulation could cut billions of dollars out of Apple’s $85 billion services business. “Apple’s services business is a friggin’ money tree,” Vijay Marolia, managing partner and chief investment officer of Regal Point Capital, told TechNewsWorld. He added. “Lawyers, regulators, and lobbyists are trying to shake that tree while it keeps getting bigger and the rest of Apple’s revenues are stagnating.” Google pays Apple pulls an estimated $15 billion to $20 billion in revenue to make its search engine the default choice on the iPhone, iPad, and Mac. However, those payments could end if the U.S. government prevails in its antitrust lawsuit against Google, noted TechNewsWorld. Another lawsuit threatens Apple’s App Store revenues. That’s because the U.S. Department of Justice has filed an antitrust suit against Apple — which charges a 15% to 30% commission on most App Store in-app purchases and paid downloads, TechNewsWorld reported. In Europe, Apple has already lost a similar battle — requiring Apple to permit customers to download apps from outside the App Store. “The company fought hard against, and lost to, the EU’s new Digital Marketing Act, which requires vendors to allow customers to download apps from other companies,” Charles King, the principal analyst at Pund-IT, told TechNewsWorld. He added, “If similar regulations were adopted in the U.S., it could substantially reduce Apple’s App Store commissions over time.” If Apple suffers a further decline in iPhone sales and loses huge chunks of its services revenue, does the company have anything to pick up the slack? Apple clearly lags its largest peers when it comes to growth. According to the Wall Street Journal, Apple’s revenue fell nearly 3% in the fiscal year ending September 2023 and FactSet notes Wall Street expects Apple to generate single-digit growth averaging 5% annually over the next three years. That is much slower than the 11% to 14% average annual growth expected from Microsoft, Amazon, and Alphabet over the next three years, the Journal notes. The hope for new growth at Apple requires an electron microscope to see. Apple intends to launch its Vision Pro mixed reality headset in early 2024 — at a starting price of $3,499. UBS analyst David Vogt expects Apple to sell 400,000 Vision Pros in the first year, reported the Journal, adding about “$1.4 billion in revenue.” That would amount to about half a percentage point of Apple’s total revenue. Why is Apple trading at a higher trailing price-earnings ratio than Google? After Apple’s revenue shrank 3% in 2023 while Google’s revenue rose 12%, I think Apple’s PE of 30.3 should not exceed Alphabet’s 26.7. Beyond the Warren Buffett halo effect — Berkshire Hathaway\nBRK.B\n owned 915.5 million Apple shares as of September 2023, according to CNBC, almost 47% of its portfolio — there is little to keep the tech giant’s stock from falling further. Either Cook keeps Buffett from selling his shares by raising Apple’s dividend and buying back more shares, or you should get ahead of the crowd and unload your Apple stock.  "
}