{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.fool.com/investing/2024/01/12/will-nvidia-be-worth-more-than-apple-by-year/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Apple (AAPL -1.06%) has been the world's largest company since 2011 (although a few companies passed it briefly). Right now, Apple is worth about $3 trillion -- nearly triple the size of Nvidia (NVDA 0.12%) at $1.2 trillion. However, the two have several key differences, as Nvidia is growing at a lightning pace, while Apple's revenue is shrinking. Nvidia could surpass Apple in valuation if this trend continues. But it's not that simple, either. Could Nvidia pass Apple in valuation by 2030? Let's see what it would take. Everyone is familiar with Apple, as its iPhones, Macs, and AirPods are the products of choice for consumers in the U.S. But Nvidia may be a bit of a mystery to some. Nvidia makes graphics processing units (GPUs), which excel at processing large calculations. While the initial use for this hardware was gaming graphics (thus the name), their use quickly evolved to include engineering simulations, cryptocurrency mining, and artificial intelligence (AI) model creation. The latter provided Nvidia a substantial business boost in 2023 (Nvidia grew revenue by 206% in the third quarter of fiscal 2024, ending Oct. 29), which caused the stock to gain nearly 240% in value. Despite this growth, Nvidia is still much smaller than Apple.  AAPL Revenue Estimates for Current Fiscal Year data by YCharts Even two years ahead, Nvidia's fiscal year 2026 revenue is projected to be about $109 billion. With Apple's current trailing 12-month revenue sitting at $383 billion, it's still far ahead of where Nvidia will be. However, that's not the end of this analysis. If companies were valued by sales alone, commerce businesses like Amazon and Walmart would be valued higher than Apple, as their sales are much higher ($554 billion and $639 billion, respectively). That's why it's important that investors also consider profit margin to make a better assessment. From a profitability perspective, Nvidia has the upper hand on Apple. In their most recent quarters, Nvidia's and Apple's profit margins were 51% and 26%, respectively. This means Nvidia turns more than half of every dollar into pure profit. Furthermore, Nvidia's profit margin dramatically improved throughout the year and will likely continue to rise. This has two effects: Returning to the revenue projections from above, if Nvidia can hit its fiscal year 2026 analyst projection of $109 billion in sales with a 50% profit margin, it will produce $54.5 billion in profits. Likewise, if Apple can hit the analyst target with a 25% margin, it will produce $112 billion in profits. That still doesn't close the gap, but if Nvidia continues growing at a 20% pace until 2030 (the growth rate analysts expect in fiscal 2026) until fiscal 2029 (calendar year 2030), it will have revenue and profits of $188 billion and $94 billion, respectively. Using this same logic for Apple, with a 7% growth rate, it would produce $138 billion in profits. With Nvidia's superior growth rate and profitability, it would be expected to have a premium valuation to Apple. If Apple traded at 21 times earnings (its decade-long historical average) and Nvidia at 35 times earnings (still cheaper than its current 69 times earnings price tag), Apple and Nvidia would be worth $2.9 trillion and $3.3 trillion, respectively. One interesting note here is that despite Apple's growth, if it returns to its decade-long average valuation of 21 times earnings, maintains a 25% profit margin, grows at analyst expected pace for the next two years and 7% beyond that; investors could still lose money from now until 2030 due to the massive premium it trades at currently. Share buybacks could flip this investment from a losing to a winning one, but that effect wouldn't save it from market underperformance if the above assumptions occur. While the math indicates Apple stock could see trouble ahead with slower growth, Apple is owned in a large amount by so many investors that a valuation decline seems unlikely. That's Nvidia's path to being worth more than Apple, but there is one huge caveat that many investors are forgetting: Nvidia is cyclical. While there is a massive demand for its GPUs to build out AI infrastructure, no one knows how large this market is. While it's possible it could be worth the $188 billion in revenue by 2030 I calculated above, I highly doubt it because companies aren't building additional supercomputers. Nvidia's product isn't subscription-based; once a customer buys a product, they don't need another GPU (or thousands of GPUs) until they're ready to upgrade. As a result, Nvidia may be unable to sustain current revenue levels.On the other hand, while Apple's consumer electronic products are also cyclical to some extent, it has a growing subscription-based model that allows it to maintain its revenue throughout economic cycles. So, while Nvidia could be worth more than Apple by 2030 if it follows the growth trajectory outlined above, it's highly unlikely that will happen. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Amazon. The Motley Fool has positions in and recommends Amazon, Apple, Nvidia, and Walmart. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}