{
    "title": "2 Magnificent Artificial Intelligence (AI) Growth Stocks Set to Join Apple \nand Microsoft in the $3 Trillion Club by 2030",
    "date": "1/28/2024",
    "url": "https://finance.yahoo.com/news/2-magnificent-artificial-intelligence-ai-170000094.html",
    "text": "There's been a technological shift in the major market indexes over the past two decades. For example, in 2004, General Electric and ExxonMobil reined supreme in terms of market capitalization, clocking in at $319 billion and $283 billion, respectively. Now, just 20 years later, a review of the chart toppers helps illustrate the changing of the guard. Tech titans Apple and Microsoft are currently in a class by themselves, with market caps of $3 trillion each (as of Thursday morning). A review of the top 10 provides further evidence of tech's dominance, as seven of the top 10 are industry-leading technology companies. Over the past year or so, one of the biggest drivers of stock market gains has been advances in the field of generative artificial intelligence (AI). The potential for widespread productivity gains is causing a stir, and accelerating adoption could boost the next cohort of \"three trillionaires.\" There are two stocks that I believe will be fueled by the growing demand for AI and join this exclusive group over the next seven years, if not sooner. Nvidia's (NASDAQ: NVDA) current market cap is $1.54 trillion, so it could eventually join the $3 trillion club, though the timing is a matter of some debate. The stock would need to increase by roughly 95% from Wednesday's closing price to reach that benchmark, amounting to approximately 10% gains annually between now and 2030, which is still easily within the realm of possibility. That's not to say there won't be challenges along the way. One of the biggest headwinds may be the stock's recent rally, as Nvidia gained 239% last year alone. However, its importance in the field of AI can't be overstated. In each of the past two quarters, the company has generated triple-digit year-over-year revenue and profit growth, and management is forecasting for more of the same. Nvidia serves multiple markets, each of which represents a growth opportunity. Nvidia has long held a commanding lead in the discrete desktop graphics processing unit (GPU) space, recently controlling more than 80% of the market. However, record sales during the pandemic and the subsequent downturn caused an industrywide slump. Now, after nearly three years of successive declines, GPU shipments are finally beginning to rebound, which should help drive Nvidia higher. But it's the combination of AI and cloud computing that could really drive the company to new heights. Nvidia has established itself as the gold standard for AI and is the go-to for helping data move through the ether -- but don't take my word for it. The company has an estimated 95% share of the GPU data center market -- which forms the foundation for cloud computing -- according to CFRA Research analyst Angelo Zino. Furthermore, Nvidia is unmatched when it comes to processors used for machine learning -- an established method used by many AI tools -- with an estimated market share of 95%, according to New Street Research. It was these credentials that made Nvidia the natural choice for accelerating generative AI. While estimates vary, it's clear there are trillions of dollars at stake. Analysts at Morgan Stanley suggest generative AI represents a $6 trillion opportunity, while Goldman Sachs estimates the market is worth $7 trillion. As the leading provider of AI processors, Nvidia is in the catbird seat. Data centers and cloud infrastructure providers are scrambling to increase the capacity of their systems to meet the computational demands of generative AI. This trend is expected to continue for years, giving Nvidia the fuel it needs to join the $3 trillion club. Amazon (NASDAQ: AMZN) currently has a market cap is $1.63 trillion, and many believe it's merely a matter of time before the company is admitted to the $3 trillion club. To reach that benchmark, the stock would only need to increase by roughly 85% from Wednesday's closing price. That works out to about 10% gains annually between now and 2030, a hurdle that's well within Amazon's reach. There are numerous catalysts that could fuel the company's future growth. Decades-high inflation caused people to make difficult choices in order to make ends meet, which put a pinch on consumer spending. This, in turn, hurt Amazon's industry-leading online retail business. There are signs the economy is finally on the mend, with Amazon experiencing an 11% lift in its e-commerce sales in the first three quarters of 2023. Further improvement in the economic outlook could provide an additional boost. Global e-commerce sales are expected to climb more than 9% in 2024, topping $6.3 trillion. As the world's largest digital retailer, Amazon is well positioned to ride the wave of e-commerce growth. Another growth area for the company is the digital transformation, led by cloud computing. Amazon Web Services (AWS) is the global leader in cloud infrastructure services, with 31% of the market, according to data supplied by market analytics firm Canalys. In the face of the economic downturn, many businesses scaled back on cloud spending, but growth is returning. Spending on cloud services increased 16% in the third quarter of 2023 and is expected to accelerate further as economic conditions improve. As the industry leader, Amazon is poised to benefit from the trend. Perhaps the biggest potential growth driver for Amazon is generative AI. The technology has proven effective at summarizing emails and drafting responses, searching the internet and company storehouses for data, and even writing and debugging computer code, with new use cases being discovered every day. The result has been a mad dash to adopt these AI models. However, the cost to create these systems from scratch is prohibitive, as are the mountains of data necessary to train foundational generative AI models. As a result, cloud providers, including AWS, are best suited to provide generative AI services to users. Amazon already offers dozens of these models and has rolled out a growing suite of tools to help its cloud customers benefit from AI. The recovery of the e-commerce market, a rebound in cloud spending, and the growing adoption of AI should give Amazon the necessary momentum to join the $3 trillion club. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Nvidia wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 22, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Danny Vena has positions in Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Amazon, Apple, Goldman Sachs Group, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. 2 Magnificent Artificial Intelligence (AI) Growth Stocks Set to Join Apple and Microsoft in the $3 Trillion Club by 2030 was originally published by The Motley Fool Related Quotes "
}