{
    "title": "The Zacks Analyst Blog Highlights Apple, UnitedHealth Group, Exxon Mobil, \nThe Boeing and AT&T",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-apple-155300606.html",
    "text": "Chicago, IL – January 9, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Apple Inc. AAPL, UnitedHealth Group Inc. UNH, Exxon Mobil Corp. XOM, The Boeing Company BA and AT&T Inc. T. Here are highlights from Monday’s Analyst Blog: The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Apple Inc., UnitedHealth Group Inc. and Exxon Mobil Corp. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today's research reports here >>>Apple's shares have essentially moved sideways to down since July 2023, but they have performed roughly in-line with the Zacks Tech sector over the past year (+41.6% vs. +45.1%) and handily outperformed the broader market's +22% gain. The company is benefiting from strong demand for the iPhone. Apple expects the iPhone's year-over-year revenues to grow on an absolute basis in first-quarter fiscal 2024.Revenues for Mac are expected to significantly accelerate compared with the fourth-quarter fiscal 2023's reported figure. It expects the year-over-year revenue growth for both iPad and Wearables, Home and Accessories to decelerate significantly from the September quarter due to a different timing of product launches.For the Services segment, Apple expects average revenues per week to grow at a similar strong double-digit rate as it did during the September quarter. It is benefiting from increasing customer engagement in the services segment. The expanding content portfolio of Apple TV+ aids subscriber growth.(You can read the full research report on Apple here >>>)Shares of UnitedHealth have outperformed the Zacks Medical - HMOs industry over the past year (+12.3% vs. +9.8%). The company's top line remains well-poised for growth on the back of a strong market position, new deals, renewed agreements and expansion of service offerings. The company's solid health services segment provides diversification benefits.The Government business remains well-poised for growth. Adjusted net earnings per share are anticipated in the $24.85-$25.00 band in 2023, the midpoint of which indicates a 12.3% rise from the 2022 figure. A sturdy balance sheet enables business investments and prudent deployment of capital via share repurchases and dividend payments.However, membership in its global business continues to decline. High operating costs due to rising medical expenses are hurting margins. As such, the stock warrants a cautious stance.(You can read the full research report on UnitedHealth here >>>)Exxon Mobil shares have underperformed the Zacks Energy sector over the past year (-7.9% vs. -0.7%), but they have held up better than Chevron's -15.5% decline over the same time period. The energy giant's financials were weakened by years-long significant spending on low-return developments and the coronavirus pandemic. Also, high input cost is hurting refining operations.Nevertheless, this bellwether status and an optimal integrated capital structure that has historically produced industry-leading returns make it a relatively lower-risk energy sector play. In the Stabroek Block, located offshore Guyana, ExxonMobil has made many major discoveries that significantly improve its production outlook.The advantaged growth projects of Guyana have lower greenhouse gas intensity than most of the oil and gas-producing resources across the globe. ExxonMobil's deal to acquire Pioneer Natural will bolster its presence in the prolific Permian Basin.(You can read the full research report on Exxon Mobil here >>>)Other noteworthy reports we are featuring today include The Boeing Company and AT&T Inc.. Why Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report The Boeing Company (BA) : Free Stock Analysis Report AT&T Inc. (T) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report UnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report Exxon Mobil Corporation (XOM) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}