{
    "title": "(02/07/24) AAPL: Services, Vision Pro Growth Should Offset China Sales Conc",
    "date": "2/7/2024",
    "url": "https://www.moneyshow.com/articles/dailyguru-62440/",
    "text": "Apple (AAPL) reported December quarter results above expectations, although analysts focused on Chinese sales below expectations. Meanwhile, Apple announced 600 new spatial computing apps built for the Vision Pro headset. I expect Apple services growth and the Vision Pro to provide plenty of growth, notes Michael Murphy, editor of New World Investor. Revenues grew 2% from last year to $119.58 billion despite one less week in the quarter, above the $117.97 billion estimate. Earnings per share hit $2.18, also topping expectations for $2.11. China sales of $20.82 billion were below the $23.5 billion estimate. Market research firm IDC said that although iPhone shipments in the quarter declined 2.1% year-over-year, for the full year, Apple overtook Vivo to take first place as the top smartphone seller with a 17.3% market share. This was the first time Apple became the top seller in China. On the conference call, CEO Tim Cook said the installed base (to buy services) is more than 2.2 billion active devices. The iPhone active installed base grew to a new all-time high, and the company had an all-time record number of iPhone upgraders during the quarter. Services grew 11.3% year-over-year to another new record:  Widely-read TF International Securities analyst Ming-Chi Kuo, best known for gathering intelligence from his contacts in Apple’s Asian supply chain, reported that Apple has lowered its 2024 iPhone shipments of key upstream semiconductor components to about 200 million units. That correspondents to a decline of 15% year-on-year. As a result, he expects iPhone 15 shipments to decline by 10% year-over-year in the first half of 2024 compared to iPhone 14 shipments in 2023. He expects the coming iPhone 16 series shipments to drop 15% year-over-year in the second half, compared to iPhone 15 series shipments in 2023. He pointed to the new high-end mobile phone design paradigm that includes Generative AI and foldable phones. He doesn’t expect Apple to launch new iPhone models with those design changes until 2025 at the earliest. Recommended Action: Buy AAPL. Subscribe to New World Investor here… April 10 - 12, 2024 The Big Money Pivot - East Subscribe to MoneyShow’s daily investment newsletter Top Pros' Top Picks and get actionable advice from our top experts, including the hottest stocks to buy and sell, ETFs and funds for short- and long-term capital appreciation, and a wide variety of dividend-paying stocks set to deliver a steady stream of safe, reliable income. Get an edge on the markets with our weekly trading newsletter, Trading Insights, and receive timely trade ideas covering stocks, options, futures, and more to keep you on the right side of the action. From trading basics to advanced strategies and high-probability set-ups, the insights you need from our all-star lineup of trading pros is delivered straight to your inbox. The stock market offers virtually any combination of long-term opportunities for growth and income, as well as short-term investments for trading gains. MoneyShow’s weekly Virtual Learning Letter showcases a variety of on-demand webcasts and video market commentary by top financial experts covering the hottest financial topics each week. Support@MoneyShow.com "
}