{
    "title": "Mark Zuckerberg reactions after testing Apple Vision Pro",
    "date": "2/14/2024",
    "url": "https://supercarblondie.com/mark-zuckerberg-tests-apple-vision-pro-and-shares-unfiltered-reaction/",
    "text": "Published on Feb 14, 2024 at 9:29PM (UTC+4) Last updated on Feb 15, 2024 at 7:18PM (UTC+4) Meta’s Mark Zuckerberg has tested the Apple Vision Pro and shared his thoughts and comments. And it’s fair to say he didn’t hold back. READ MORE: Meta reveal the impressive costs of Mark Zuckerberg jet Mark Zuckerberg decided to test Apple’s newly-released VR headset because that’s his competition. Through Meta, Zuckerberg sells one of Apple Vision Pro’s main market rivals, Quest. And by the way, the video you see here was filmed using Quest. In the clip, Zuckerberg starts with the punchline. “I expected that Quest would be the better value for most people since it’s really good and it’s like seven times less expensive,” Zuck said. “After using [Apple Vision Pro], I don’t just think Quest is better value, it’s a better product, period.” For reference, Apple Vision Pro is priced at $3,499, while Quest starts at $499. Even though they’re both VR headsets, their design isn’t exactly the same. For starters, Quest is 120 grams lighter. This is probably a good selling point for Quest, because if there’s one thing most Apple Vision Pro users agree on is, it’s a bit too heavy. According to Zuckerberg, Quest’s field of view is wider, and even though he concedes that Vision Pro has higher resolution, he believes that Quest’s screen is brighter. And there’s something else, too. Zuckerberg says that every generation of computing has an open and closed model. For smartphones, according to Zuckerberg, it’s fair to say Apple’s closed model won. But it’s not always that way, and so he believes Apple’s model won’t win in the VR headset domain. Everybody wants to know why Mark Zuckerberg is building top-secret $270m Hawaii compound with bunker Mark Zuckerberg could buy a Bugatti Chiron everyday for many years before running out of money Instagram\nFacebook\nTwitter\nLikedin Copyrights ©2024 SB Media Holding Limited "
}