{
    "title": "Apple Loop: Leaked iPhone 16 Pro Specs, MacBook Pro Future, Microsoft \nChallenges Apple",
    "date": "2/23/2024",
    "url": "https://www.forbes.com/sites/ewanspence/2024/02/23/apple-news-headlines-iphone-16-pro-ios-meta-microsoft-app-store-oled-macbook/",
    "text": "Taking a look back at this week’s news and headlines from Apple, including leaked iPhone 16 Pro details, new iOS 17.4 features, Meta and Microsoft challenge Apple App Store changes, Apple’s improved battery, OLED MacBook plans, new AirPods features, and iPhone dominates top ten phone list. Apple Loop is here to remind you of a few of the many discussions around Apple in the last seven days. You can also read my weekly digest of Android news here on Forbes. iPhone 16’s AI Focused Chipset Following Qualcomm, Samsung, and Mediatek, Apple plans to add AI-focused hardware into the next generation of Apple Silicon. These are expected to be dedicated AI cores, likely optimised to balance the needs of battery life and productivity: \"These extra cores will increase performance, which fits with the rumors that generative AI features are coming to the next series of iPhones. When I say rumors, I also mean that CEO Tim Cook has told me that Apple is working on generative AI, and told an earnings call that Apple would share details later this year—almost certainly in June at WWDC or the fall when the iPhones are released.\" (Forbes). The Apple store  (Photo credit should read GREG BAKER/AFP via Getty Images) The Exciting iOS 17.4 Updates The release of iOS 17.4 is expected before March 6th—remember, it needs to be in place to satisfy the European Union’s DMA ruling—and there’s a lot to get excited over. Forbes’ David Phelan looks through the beta versions to pick out some highlights: \"There’s a refinement coming for the brilliant Stolen Device Protection, for a start. Then there are new emoji (hurrah), including a phoenix and a couple of Smileys that shake their heads yes or no. Oh, and a mouth-watering-in-its-freshness slice of lime.\" (Forbes). Microsoft And Meta Lobby Europe Over App Store Changes Apple believes its changes to the App Store and third-party access to iPhone owners satisfy the European regulators. Developers and competitors took little time to go through the financial impact of Apple’s demands and called out Apple as not doing enough: “The initial steps [to comply with the DMA] that Apple has put forward are very prohibitive to us actually creating a meaningful alternative to the one store that’s available on the world’s largest gaming platforms, which are mobile phones,” Phil Spencer, Microsoft’s gaming chief, told the Financial Times. “So we will continue to work with regulators to open that up.\" \"Meta chief executive Mark Zuckerberg has also dismissed Apple’s proposal as “onerous” and “at odds” with the intent of the EU regulation, saying he would be surprised “if any developer chose to go into the alternative app stores”. (FT). Apple Offers New iPhone Battery Numbers Alongside the impact of iOS 17.4 on software, Apple has been retesting the current iPhone 15 and iPhone 15 Pro handsets and the older hardware to see the effect of the new code on battery life. The published reports are exciting: \"As for the other iPhones? Apple says those handsets continue to meet the previous bar of retaining 80% battery capacity after 500 cycles, but this is being investigated—which I take to mean there’s a lot of battery testing going on in Cupertino just now.\" (Forbes). When Will Your MacBook Go OLED It might be a common fixture on Windows laptops, but Apple has been reluctant to add OLED options to the macOS laptops. The supply chain is showing more signs this week that Apple is gearing up to switch, but it’s not going to happen quickly: \"The current M3 generation of MacBook Pro models are using mini-LED technology, and that’s unlikely to change this year. We’ve yet to see the M3 MacBook Air—a launch is expected in mid-March—but it's unlikely that the cheaper consumer-focused laptop will debut the OLED. Realistically, we’re not going to see an OLED-equipped MacBook until 2025, and Samsung’s impact on the supply chain will not be felt until 2027.\" (Forbes). New AirPods, New Features Apple is preparing to significantly refresh the AirPods range, bringing key features down from the Pro range to the vanilla vanilla true wireless earbuds. It will make the new AirPods an attractive choice, but will it cannibalise the more expensive audio accessories? \"The two models will be differentiated by price, of course, but also by features. For the first time, Apple’s AirPods (as opposed to Pro or Max models) will include noise-cancelling, in the higher-priced model. This is a very big change, and makes you wonder if people will choose these over AirPods Pro. There will also be a charging case which, along with USB-C, will have a speaker so it can make a sound when using Find My, again like the AirPods Pro case now.\" (Forbes). And Finally... The list of Top Ten smartphones for 2023 will make for pleasant reading in Cupertino, with the iPhone claiming spots one through seven, comfortably ahead of Samsung and its other Android competitors: \"Apple, for the first time, captured the top seven positions in the global list of best-selling smartphones in 2023, according to Counterpoint Research’s Global Monthly Handset Model Sales Tracker. Samsung secured the remaining three places in the list, marking an increase of one spot from the 2022 list. There have been no other brands on the list since 2021.\" (Counterpoint Research). Apple Loop brings you seven days worth of highlights every weekend here on Forbes. Don’t forget to follow me so you don’t miss any coverage in the future. Last week’s Apple Loop can be read here, or this week’s edition of Loop’s sister column, Android Circuit, is also available on Forbes.  "
}