{
    "title": "Apple Vision Pro's Biggest Complaints — Are Returns Affecting Stock Price?",
    "date": "2/26/2024",
    "url": "https://finance.yahoo.com/news/apple-vision-pro-biggest-complaints-190157071.html",
    "text": "Apple’s biggest fans have already returned the long-awaited Apple Vision Pro, saying the headset isn’t worth the hefty $3,500 price tag. Apple stock went up following the Vision Pro release, but will the surge last? I’m a Financial Advisor: I’d Invest My First $5,000 in These 6 StocksExplore: 6 Genius Things All Wealthy People Do With Their Money Since the Apple Vision Pro debuted on Feb. 2, there’s been a larger-than-expected number of returns. While returns are normal, the higher return rate suggests there are some quirks to work out. Here are the biggest complaints Bloomberg reported after speaking to more than a dozen people who returned the Vision Pro: The device is too heavy, too cumbersome to manage, headache-inducing and uncomfortable. The lack of applications and video content doesn’t justify the $3,500 price. The work features are difficult to use for long periods and don’t make people more productive than using a normal external monitor with a Mac. The displays have too much glare, the field of view is too narrow and it causes eyestrain and vision problems. It can make users feel isolated from family and friends, the meaningful shared experiences don’t yet exist and the Vision Pro can’t easily be passed around to others because of the need for a precise fit. Vision Pro fans say the current model is only the first generation, which should only get better with time. The first iPhone, iPad and Apple Watch had their problems, but Bloomberg noted nobody complained those devices were too cumbersome, a pain to use or too heavy to justify keeping. Data from sources at retail stores told Bloomberg the return rate is between average and above average compared with other products, depending on the location. Some smaller stores are seeing two returns per day, but larger stores have seen as many as over eight in a single day. However, the Vision Pro is a low-volume product, which Apple expected from the beginning, and this isn’t a sign of a big problem. Apple is at least 18 months away from releasing a second-generation Vision Pro, but the company is taking the return rate seriously. When customers return the device, staff ask them what went wrong, Bloomberg reported, and employees have also been instructed to report to a manager after each return. According to Tastylive, Apple stock prices dropped 4.22% in January, but prices were back on the up in early February following the Vision Pro release. Apple stock is now down 5.3% so far in 2024, but Wedbush analyst Dan Ives told The Motley Fool he sees this drop as a buying opportunity. The analyst sees the Vision Pro as a growth catalyst, and his sales forecast is 600,000 units in 2024 with one million unit sales in 2025. The Apple Vision Pro could have a measurable impact, but it’s still too early to tell. More From GOBankingRates 7 Best New Dollar Tree Items That Are Worth Every Penny Average Cost of Groceries Per Month: How Much Should You Be Spending? 8 Signs You'll Retire Wealthy 4 Reasons You Should Be Getting Your Paycheck Early, According to An Expert This article originally appeared on GOBankingRates.com: Apple Vision Pro’s Biggest Complaints — Are Returns Affecting Stock Price? "
}