{
    "title": "Canalys: Apple tops European smartphone market in Q4 as rebound approaches \n- GSMArena.com news",
    "date": "2/20/2024",
    "url": "https://www.gsmarena.com/canalys_apple_reaches_top_spot_in_europe_as_the_market_slowly_heals-news-61672.php",
    "text": "Login Yordan \n20 February 2024 Apple Samsung Xiaomi Android iOS Canalys revealed that Apple became the best-selling smartphone maker in Europe during Q4 2023. The US company's success was fueled by strong demand for the iPhone 15 Pro and Pro Max during the holiday period, but Samsung kept the top spot for the whole of 2023. The overall market saw 129.8 million shipments for the calendar year, which was 8% lower than the 140.8 million units in 2022. However, Canalys predicted that Europe will see a single-digit growth next year, driven by an impending refresh cycle of devices bought during the pandemic. High-end smartphones took a record share of the whole European market in Q4 2023. According to Runar Bjorhovde, Analyst at Canalys, almost 40% of all shipments were for phones that cost over $800. Three out of four devices were an iPhone, followed by Samsung with a mere 16% share. Apple kept a nearly flat amount of shipments during Q4 2023; it is Samsung and Xiaomi that flopped massively, allowing the US company to rise on top. The Top 5 saw the resurgence of Honor, and Canalys said we should expect smaller brands to increase their share in the near future. This includes Oppo, which settled with Nokia on 5G patents, allowing the Chinese maker to reintroduce its devices in major European markets. Companies would see an increase in shipments only if they apply a holistic approach emphasizing innovation, reliability, backend logistics, regulatory compliance, and a clear brand message, added Bjorhovde. In the long run, vendors will increase focus on the on-device user experience with AI at the core, emphasizing personalization, ecosystem interaction, productivity, and entertainment. However, investing in AI should be followed by educating consumers on maximizing the power of on-device AI features; otherwise companies might not see a strong return on their investment. Source How about in the last 13 years? We're all iphones flop? \"For the complete year of 2023, the total sales of foldable smartphones are expected to reach 15.8 million units\" \r\n \r\nC'mon that's hardly nothing for a whole year and is nothing significant, that's a very low performance kno... Since when 15 and 15 plus are their flagship models? Who is talking about sarcasm? Phone finder All brands\n\n\n\nRumor mill Home\nNews\nReviews\nCompare\nCoverage\nGlossary\nFAQ\nRSS feed\nYoutube\nFacebook\nTwitter\nInstagram © 2000-2024 GSMArena.com\nMobile version\nAndroid app\nTools\nContact us\nMerch store\nPrivacy\nTerms of use\nChange Ad Consent\nDo not sell my data "
}