{
    "title": "Apple's 'Super Bowl Moment?' Analyst Sees $5B Annual Run-rate From This \nOpportunity That Will Likely Lead",
    "date": "2/11/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37061464/apples-super-bowl-moment-analyst-sees-5b-annual-run-rate-from-this-opportunity-that",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Apple, Inc. AAPL has been one of the laggards among the Magnificent Seven stocks since 2023, but a bullish analyst said Sunday the company can soon turn things around. The Apple Analyst: Wedbush analyst Daniel Ives has an “Outperform” rating and a $250 price target for Apple shares. The Apple Thesis: New Asia supply chain checks show a “clear stabilization” demand in China, with iPhone units expected to show “incremental growth,” said Ives in a note. This validates the analyst’s prediction of the iPhone 15 triggering an upgrade cycle that surpasses Street expectations. Investors reacted negatively to Apple’s quarterly results released in early February, as the China region reported a year-over-year revenue decline. The analyst now expects iPhone unit sales of 225 million to 230 million units for this year and the average selling price of its flagship device to exceed $900, given the product mix shift moving toward the two high-end models. The stock recovery seen since the earnings is due to investors taking stock of the fact that “AI is coming to Cupertino.” Additionally, they have come to realize that the iPhone guidance is very conservative and Services business will continue its “rock solid double digit growth.” Ives expects iPhones to show year-over-year growth during the Lunar New Year holiday period in China as “some promotions and a stepped up marketing campaign by Apple [have] been very successful in mainlandChina.” “Clearly Apple has a fight on its hands with Huawei and some geopolitical headwinds, but the reality is with over 200 million active iPhones in China very few consumers are switching out of the Apple ecosystem and that is the linchpin to our bullish thesis for Apple in China despite Street concerns,” Ives said. See Also: Everything You Need To Know About Apple Stock The analyst also weighed in on Apple’s potential AI foray. “We believe the ‘Super Bowl moment for Apple’ will be when Cook & Co. finally take the covers off the generative AI technology being worked on in the labs of Apple Park and introduce it to developers and consumers at WWDC in June followed by the exclusive AI features we expect to be included on iPhone 16,” he said. Apple’s game-changing monetization opportunity is to introduce a standalone AI App Store to developers that lays the groundwork for its AI growth, the analyst said. Incremental revenue from the Services business around AI will be over $5 billion annually, he said, adding that “[it’s] just the start of this renaissance of growth at Apple.” The analyst also expects Vision Pro sales to be at 1 million units in 2025. AAPL Price Action: Apple ended Friday’s session up 0.41% at $188.95, according to Benzinga Pro data. Read Next: Apple Unveils AI Tool That Makes Detailed Edits To Videos With Text Commands: Here’s How It Works Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}