{
    "title": "Ruchir Dave, a graduate from Gujarat college, is new boss at Apple Audio \ndivision after big shakeup",
    "date": "2/21/2024",
    "url": "https://www.indiatoday.in/technology/news/story/ruchir-dave-a-graduate-from-gujarat-college-is-new-boss-at-apple-audio-division-after-big-shakeup-2504972-2024-02-21",
    "text": "Listen to Story Apple has revealed a big change in its hardware team, responsible for overseeing audio features across its range of products such as AirPods and Macs. Gary Geaves, who was at the helm of Apple's Acoustics, will be stepping down from his role, reports Bloomberg. Geaves had been serving as Apple's Vice President, Acoustics, for nearly 13 years. Replacing Geaves, Ruchir Dave, who has been at the company for over 14 years and is a graduate from a college in Gujarat, will be taking up the role of the new VP of  Acoustics at Apple. advertisementWho is Ruchir Dave?According to his LinkedIn account, Dave has been at the company for more than 14 years and joined Apple back in 2009, as a lead in the Acoustics Engineer team. He was then promoted to Manager level in May 2012 and climbed up the corporate ladder. In March 2021, Dave was appointed as a Senior Director at the company. Before Apple, Dave worked at Cisco for nearly 10 years. According to his LinkedIn account, Dave has been at the company for more than 14 years and joined Apple back in 2009, as a lead in the Acoustics Engineer team. He was then promoted to Manager level in May 2012 and climbed up the corporate ladder. In March 2021, Dave was appointed as a Senior Director at the company. Before Apple, Dave worked at Cisco for nearly 10 years. Another thing that we couldn't help but notice after looking at Dave's LinkedIn profile is that he was once a student in Gujarat. Dave's LinkedIn bio mentions that he was a student at Sharadmandir, Ahmedabad from 1982 till 1994. After this, he went on to study at Lalbhai Dalpatbhai College of Engineering, Ahmedabad and graduated from the college in the year 1998. Following this, he went on to study at Penn State University.Apple's hardware team gets a reshuffle The Bloomberg report says that the news of Dave taking up the new role was reported by people familiar with the matter who didn't want to be identified because the development was still \"private.\" Apple hasn't officially announced the change and the news was circulated internally amongst employees. Apple's hardware team consists of about 300 employees and plays a vital role in the company's HomePod, AirPods and speakers business. The team also oversees the advancements in sound and microphone technologies, and played a crucial role in the creation of software features like spatial audio. These innovations have emerged as key selling points for Apple's array of audio products. A couple of months back, Apple had introduced a major change in one of its most popular audio products, the AirPods. For the first time, the company bid adieu to the lightning port and brought the universally accepted USB Type C charging port to the device. This was a welcome move as people who owned the new AirPods could now charge their devices without carrying an additional cable.Published By: Divya BhatiPublished On: Feb 21, 2024Also Read |  Microsoft developing AI chip for servers, puts IIT Kanpur graduate Pradeep Sindhu in charge of key projectAlso Read |  Elon Musk says the first human with Neuralink implant is now able to control a mouse with his mindAlso Read |  Apple iPhone 16 series launch is still months away but we already have the design, camera, and other details "
}