{
    "title": "1 Unstoppable Stock Set to Join Nvidia, Apple, Microsoft, Amazon, Alphabet, \nand Meta in the $1 Trillion Club",
    "date": "2/28/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOG/pressreleases/24400426/1-unstoppable-stock-set-to-join-nvidia-apple-microsoft-amazon-alphabet-and-meta-in-the-1-trillion-club/",
    "text": "Warren Buffett is widely considered to be one of the most successful investors in history. He was born in 1930 and bought his first stock at age 11. By 1965, he was running his own investment company, Berkshire Hathaway(NYSE: BRK.A)(NYSE: BRK.B). Buffett remains at the helm of Berkshire today. It has amassed an expansive portfolio that includes several wholly owned private companies, and 47 publicly traded stocks and securities. Berkshire's largest holding is Apple (NASDAQ: AAPL), which became the world's first $1 trillion company in 2018. That rare milestone has since been achieved by five other technology giants: Microsoft, Amazon, Alphabet (Google), Nvidia, and Meta Platforms. Berkshire could be the first U.S. company outside the tech sector to join the $1 trillion club. Its stock has delivered a mammoth 4,384,748% gain since 1965, carrying the company to a valuation of almost $900 billion. Here's why it could cross the trillion-dollar milestone as soon as this year. Image source: The Motley Fool. Buffett is all about value investing. He likes to buy great businesses at a fair price -- though the cheaper the better -- with the intention of holding on to them for the long term. He looks for companies generating a steady profit, combined with consistent revenue growth and strong management teams. He especially likes companies that return money to shareholders through dividends and stock buybacks. Buffett's most powerful weapon is time. He's a big advocate for compound interest, which is responsible for building most of his wealth. For example, Berkshire spent $1.3 billion accumulating shares of Coca-Cola between 1988 and 1994. Today, that position is worth $24.4 billion -- but it also paid Berkshire $736 million in dividends in 2023. In other words, Berkshire recoups its initial Coca-Cola investment in dividends alone every two years. But that's just one of the conglomerate's many success stories. Berkshire was a textiles company on the brink of failure before Buffett stepped in and bought it in 1965. He quickly realized its core business was no longer viable, so he transformed it into a holding company to house various investments. Berkshire now has a full ownership stake in a number of famous businesses including Dairy Queen, Duracell, and GEICO. Plus, its portfolio of publicly traded stocks and securities is worth $371.9 billion, a sizable portion of which is attributable to one stock: Apple. Berkshire first bought Apple stock in 2016 and it has steadily increased the size of its position over time, spending around $38 billion in total. That single holding is worth $165.3 billion as of this writing, accounting for 44% of the total value of Berkshire's portfolio of publicly traded securities. Bank of America and American Express are Berkshire's second- and third-largest holdings, respectively. Last year, Berkshire received more than $2.1 billion in dividends from its top three positions alone. Berkshire owns smaller positions in energy companies like Chevron and Occidental Petroleum. Plus, if owning American Express wasn't enough, its portfolio also includes the two other major credit card companies, Visa and Mastercard. While Buffett is known to avoid most technology stocks, Berkshire has accumulated small positions in Amazon and cloud computing company Snowflake. As I touched on at the top, Berkshire stock has delivered a whopping 4,384,748% gain since 1965, or 19.8% compounded annually. That trounces the 31,223% gain in the benchmark S&P 500 index over the same period, which translates to just 10.2% compounded annually. The difference is staggering in dollar terms. A mere $1,000 invested in Berkshire stock in 1965 would be worth $48.4 million today. The same investment in the S&P 500 would be worth just $313,230. The conglomerate has the financial results to back up those substantial gains. It generated $49.3 million in revenue in 1965, and in 2023, that number was a record-high $364.4 billion. Over $155.6 billion came from sales and services across the various businesses under Berkshire's umbrella, with a further $83.4 billion coming from its insurance businesses. Its railroad, utility, and energy interests contributed $101.4 billion. Berkshire also delivered a record profit last year, with a net income of $96.2 billion. That compares to just $2.3 million in net income in 1965. With a market capitalization of almost $900 billion as of this writing, Berkshire stock only needs a gain of about 11% from here to cross the $1 trillion milestone. Considering its 58-year track record of delivering 19.8% annual returns, on average, it appears sure to get there in 2024. A number of factors will probably work in the conglomerate's favor as the year progresses. The stock market is at an all-time high right now, and most Wall Street analysts predict it will continue to move higher. Plus, Berkshire could earn record dividends in 2024 because companies like Apple, Coca-Cola, and American Express continue to increase their payouts. In the broader economy, the U.S. Federal Reserve estimates it will cut interest rates three times in 2024, which will serve as a tailwind for Berkshire's consumer-focused businesses. Its transport and logistics businesses would also benefit if rate cuts drive more economic activity. Finally, Buffett continues to believe in the conglomerate's prospects because he authorized the repurchase of almost $9.2 billion worth of Berkshire's shares in 2023. Buffett has overseen $73.6 billion worth of share repurchases during the last five years alone, which is more than he has deployed into any other stock. Buffett recently told investors that Berkshire's enormous size will prevent it from generating \"eye-popping performance\" in the future, but based on its share repurchases, it's clear he still feels Berkshire stock is the best bet he can make in the world. Should you invest $1,000 in Berkshire Hathaway right now? Before you buy stock in Berkshire Hathaway, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  American Express is an advertising partner of The Ascent, a Motley Fool company. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Bank of America is an advertising partner of The Ascent, a Motley Fool company. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Bank of America, Berkshire Hathaway, Chevron, Mastercard, Meta Platforms, Microsoft, Nvidia, Snowflake, and Visa. The Motley Fool recommends Occidental Petroleum and recommends the following options: long January 2025 $370 calls on Mastercard, long January 2026 $395 calls on Microsoft, short January 2025 $380 calls on Mastercard, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Alphabet Cl C stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}