{
    "title": "Epic plans to launch its own iOS storefront in the EU this year",
    "date": "2/16/2024",
    "url": "https://ca.finance.yahoo.com/news/epic-plans-to-launch-its-own-ios-storefront-in-the-eu-this-year-192358893.html",
    "text": "Epic Games just announced that Apple has finally reinstated its iOS developer account in the European Union. This means that the developer plans to launch a digital storefront for iOS devices sometime this year. More importantly, this will allow users to easily download Fortnite on iPhones. The company revealed that it would be bringing its games store and Fortnite to iOS back in January, but it wasn’t clear if Apple would grant it a developer account. This account makes it much easier for developers to distribute apps and content across Apple’s various platforms. Fortnite will return to iOS in Europe in 2024, distributed by the upcoming @EpicGames Store for iOS. Stay tuned for details as we figure out the regulatory timeline. We'll continue to argue to the courts and regulators that Apple is breaking the law. https://t.co/MHh6EGVinC — Epic Games Newsroom (@EpicNewsroom) January 25, 2024 This is all thanks to the EU’s new Digital Markets Act, which officially goes into effect on March 7. The law designates large services as \"gatekeepers,\" like Apple's App Store, and commands them to become interoperable with competing products to remain in compliance. As far as enforcement in this case, the DMA will all developers to take payments and distribute apps on iOS from outside of official App Store. Apps sold by a third-party sales platform still need to be approved by Apple, via the company’s Notarization process, to spot and remove potentially harmful content. There’s been a lot of bad blood between Apple and Epic ever since the latter company began using its own in-app payment option in the iOS version of Fortnite. Using it's own payment processing, the 30 percent cut of cosmetic upgrades and power-ups it sold to Fortnite players was no longer landing in Apple's pockets. This launched a lengthy legal battle in the US over whether or not Apple’s walled-garden approach was anticompetitive. Epic sued Apple and Apple banned Epic from its platform. A judge recently issued a permanent injunction that gives developers a way to avoid the 30 percent cut of sales that Apple takes via its in-house payment system. This seemed to satisfy neither company. Apple wasn’t happy about being forced to allow third-party payment options on its platform. Epic was unhappy regarding the language of the injunction, in which it was decided that Apple did not have a monopoly on mobile gaming and did not violate antitrust law by banning competing app marketplaces. Under what possible theory of antitrust regulation is it acceptable for a monopoly to decide what companies are allowed to compete with it, and on what terms they can compete? Apple makes a mockery of free market competition. https://t.co/BPEdXQ2htt — Tim Sweeney (@TimSweeneyEpic) January 26, 2024 Apple is also allowed to arrange fee structures to dissuade developers from using a third-party payment option. It's widely expected that the ruling, as it stands, will not reduce Apple's current 30 percent cut of App Store sales in any meaningful way. Both companies appealed. California’s Ninth Circuit Court of Appeals upheld the district court’s rulings. The companies took their appeals to the US Supreme Court, but the court refused to hear them. That’s where we stand right now. As all of this was happening on this side of the pond, the EU passed the aforementioned Digital Markets Act, which also forced Apple’s hand into allowing third-party storefronts on iOS devices. There’s no ongoing legal battle in Europe between the two companies, so EU residents will get to play Fortnite again. Americans will have to rely on Xbox Cloud Gaming or GeForce Now to get the popular shooter running on their Apple device. In any event, maybe things are cooling off a bit between the two companies. It’s worth noting that Disney recently bought an equity stake in Epic Games, to the tune of $1.5 billion. Apple and Disney are known to be particularly cozy. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th Trade 24 hours a day on the world's most popular platform. This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids  Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt  Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone  They soft-launched their relationship at the supermodel's cookbook event in Miami. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. IBKR EventTrader - A new, straightforward way to trade CME futures markets The \"Late Night\" comedian brutally summed up the former president's media company. Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair.  \"We love to cook and we have the family together,\" Richards tells PEOPLE Public disagreements about how to handle immigration resulted in U.S. Rep. Alexandria Ocasio-Cortez reminding Elon Musk he is an immigrant himself. Leaks from a notoriously sketchy data broker have revealed the locations of hundreds of people who visited convicted pedophile Jeffrey Epstein's Bahaman island before his 2019 arrest and subsequent death behind bars. In an investigation, Wired reports that the firm in question, Near Intelligence, "
}