{
    "title": "Mark Zuckerberg’s Quest flex seen as his own iPhone moment",
    "date": "2/15/2024",
    "url": "https://fortune.com/2024/02/15/mark-zuckerberg-meta-quest-apple-iphone-microsoft-steve-ballmer-microsoft-vision-pro/",
    "text": "Hubris is said to come before the fall, and the swagger with which Mark Zuckerberg dunked on Apple’s $3,500 Vision Pro this week is giving critics an acute case of déjà vu. In an Instagram post, the Meta founder on Tuesday dismissed the premium mixed reality headset as inferior to his own Quest 3 mixed reality headset both in price and performance, calling the latter the “better product, period.” But Zuck’s bravado is unflatteringly being compared to the overly hasty obituary for the iPhone written by rival Steve Ballmer when the revolutionary device first launched nearly 17 years ago. “There’s no chance that the iPhone is going to get any significant market share,” the ex–Microsoft CEO famously predicted in 2007 in a quote that has since aged very poorly. Like Zuckerberg, Ballmer primarily took issue with the price tag of the phone, ignoring the potential value it could offer consumers through a thriving digital app economy. “Five hundred dollars? Fully subsidized with a plan? I said that is the most expensive phone in the world!” Ballmer said in a separate interview. “And it doesn’t appeal to business customers, because it doesn’t have a keyboard—which makes it not a very good email machine.” The \"Steve Ballmer iPhone video\" is 16 years old. Worth watching the full 2-minute clip. I actually think it got worse as the video went on. Ballmer implied a Motorola Q could do everything an iPhone can do for just $99. Sounds familiar? pic.twitter.com/Rf2c7SmjA2 In Zuckerberg’s recent criticism of Apple’s headset, the Meta founder similarly trashed everything from the Vision Pro’s design to its comfort and practicality in addition to its cost, at seven times the price of his Quest 3. “Is Zuckerberg channeling Steve Ballmer by trying to dis Apple?” asked Glen Kacher, founder and chief investment officer at Palo Alto–based wealth manager Light Street Capital. Ballmer eventually went on to regret his lack of foresight, which he blamed on a deeply ingrained cultural hostility toward the company’s expansion into the hardware space. Like watching a 2007 Nokia fan telling you iPhone is not that advanced because you can do the same with Symbian.He could’ve just said nothing, taken the best things of visionOS, add eye tracking back and be a king. Now he’s got his own Ballmer iPhone video. Surprising misstep https://t.co/Z4Ac4sR0Pl According to the former Microsoft boss, senior management’s thinking at the time was very much anchored in the easily delineated business model that separated chips, system, and software makers from personal computers. The company didn’t anticipate the shift toward end-to-end vertical integration that Apple popularized in the mobile space. The comparison with Ballmer isn’t entirely accurate, though. While the Microsoft boss said his biggest mistake was limiting the company’s focus to Windows Mobile rather than entering the handset business earlier with a true iPhone competitor, Zuckerberg’s problem is just the opposite: He already has the hardware—it’s just not catching on. A closer analogy is the possibility that Meta’s Quest is the Nokia or BlackBerry of mixed reality headsets, a mass-market device that lacks enough compelling content and useful applications because it failed to keep pace with innovation in the tech industry. It was only with this month’s arrival of the Apple Vision Pro that the technology suddenly gained broader pop culture prominence, in a blow to the Quest 3 that launched only four months earlier. Zuckerberg did receive some moral support in response to his Ballmer-esque video, though. “He’s one of the most impressive CEOs there is,” wrote Kaushik Subramanian, a partner at early stage investor EQT Ventures, who once worked for the Meta founder. “Don’t bet against Zuck!” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}