{
    "title": "What to do when your iPhone gets wet? Apple warns against this common advice",
    "date": "2/19/2024",
    "url": "https://www.delcotimes.com/2024/02/19/what-to-do-when-your-iphone-gets-wet-apple-warns-against-this-common-advice/amp/",
    "text": "Thanks for Reading! \t\t\t\t\t\t\t\nDon't miss this deal Get Standard Digital access to enjoy this article and more Ever accidentally dropped your iPhone in water? As you may have heard for more than a decade, the popular advice would be to turn the phone off and place the device in a bag or bowl of rice so it could suck out the moisture and dry out. But how effective is that method? Well, Apple appears to not be a fan of it, saying it’s actually dangerous and could damage the iPhone. On its support site, the company says you shouldn’t place your wet iPhone into a bag of rice, because “doing so could allow small particles of rice to damage your iPhone.” The warning comes in regards to the company’s new “liquid-detection alert” feature, in which the phone will warn the user it has gotten wet and advise you to hold off on charging the device. That’s because charging a wet device might damage the connector or cable, which could potentially cause problems for both the iPhone and any accessory it’s connected to. Instead of placing the phone in rice when wet, Apple is telling users to unplug their iPhones, and then unplug the other end of any cable. Don’t plug the cable in again until everything is dry. To help remove access liquid and dry your phone, tap it gently against your hand with the connector facing down. Afterward, leave the device in a dry area with some airflow. Then, after waiting at least 30 minutes, try charging your phone again. If the alert pops up again, try leaving the phone to dry out for a full day in the same dry setting with airflow. After, you can try charging it again. ©2024 Advance Local Media LLC. Visit pennlive.com. Distributed by Tribune Content Agency, LLC. View more on\t\t\t\t\n\t\t\t\t\tDelco Times  "
}