{
    "title": "Norfolk County Council secures settlement as Apple agrees £384m lawsuit \npayment",
    "date": "3/15/2024",
    "url": "https://ca.finance.yahoo.com/news/norfolk-county-council-secures-settlement-195924538.html",
    "text": "Norfolk County Council has secured a settlement in a lawsuit against Apple, with the tech giant agreeing to pay 490 million dollars (£384 million) in a “tremendous result”. The lawsuit alleged Apple’s chief executive Tim Cook misled investors about iPhone sales in China between November 2018 and January the following year. The preliminary settlement filed in the US District Court in Oakland, northern California, will need final approval from a judge at a further hearing. The class action – made on behalf of a group of claimants including investors in Apple – was led by Norfolk Council, which said its pension fund was affected by the company’s alleged actions. A spokesperson for the Norfolk Pension Fund said: “We are proud of this recovery for investors. “We are mindful that we are stewards of pensions relied upon by thousands of families and individuals. “When and where it’s warranted, we will take decisive action to recover losses when our participants’ investments are harmed by fraud.” The Oakland court’s judgment said: “The settlement is a tremendous result for the class.” According to the document, Norfolk Council became the “lead plaintiff” in June 2020 and alleged that Apple “made materially false and misleading statements and omissions about demand for the newly-released iPhones and Apple’s business in China” contrary to the Securities Exchange Act 1934. The complaint further alleged “false and misleading statements and omissions” caused Apple’s stock to trade at “artificially inflated prices” before the stock price declined when the “true facts” were disclosed. Mr Cook indicated during an investor conference call in November 2018 that iPhone sales in China were performing well, according to the complaint. In January the following year, the chief executive warned Apple’s revenue for the quarter would drop nine billion dollars (£7.09 billion) below what was predicted – with almost all of the fall found to be down to poor demand in China. It led to the company’s stock price diving 10% in the next day of frenetic trading and cut shareholder wealth by more than 70 billion dollars (£55 billion). Apple denied Mr Cook deceived investors about the phone’s sales in China in that period. “Defendants (Apple) have expressly denied and continue to deny that they have violated the federal securities laws or any other laws, or have otherwise misled investors as alleged in this action,” the Oakland judgment made clear. “But in recognition that further litigation will be protracted, overly burdensome, expensive and distracting have determined that it is desirable and beneficial for them to resolve the action.” The parties accepted a mediator’s proposal to settle on March 1. Norfolk Council will receive a portion of the settlement. Apple recorded 97 billion dollars (£76 billion) in profit in its last fiscal year. The 490 million-dollar payment is less than 1% of that figure. Apple has been approached for comment. This dividend stock has been absolutely crushing the TSX 60 and looks like it will continue to do so while providing a juicy dividend. The post Beat the TSX With This Cash-Gushing Dividend Stock appeared first on The Motley Fool Canada. Truth Social's owner, which counts Donald Trump as its biggest shareholder, is now worth more than American Airlines and Ralph Lauren by one measure. Trade 24 hours a day on the world's most popular platform. The stock value of Reddit and Donald Tump's Truth Social took a hit by the end of trading on Thursday ahead of Easter weekend and the NYSE's Friday closure. Berkshire Hathaway’s chairman Warren Buffett, one of the world's most famed investors, is still faithful to the fact that holding steady, being patient and believing in the power of value investing is key to successful investments. Just as important to Buffett's investment strategy, though, are the investments he doesn't believe in. Here are but a few of the investment types that the Oracle of Omaha would rather not waste money on. BCE (TSX:BCE) stock is a dividend juggernaut that's getting beyond cheap at multi-year depths. The post 1 Nosediving Blue-Chip Stock That’s Getting Ridiculously Cheap appeared first on The Motley Fool Canada.  Three million dollars sounds like the kind of money that lets you spend retirement sitting on the dock of your own boat, sipping mai tais (or coffee, if that's more of your thing). But a $3 million... Fairfax Financial Holdings (TSX:FFH) and another TSX stock I'd buy and hold for the next five decades in a TFSA! The post Millennials: 2 TFSA-Worthy Stocks to Buy and Hold for 50 Years appeared first on The Motley Fool Canada. Sienna stock (TSX:SIA) looks like a strong dividend stock that's only getting stronger, but there is more growth available. The post 1 Dividend Stock Down 20% to Buy Right Now appeared first on The Motley Fool Canada.  With stocks off to their best start in five years, many strategists on Wall Street still make a case for the S&P 500 to keep chugging higher. If you've already created a diversified portfolio and are looking for more options from a windfall, here is where I would invest next. The post Where to Invest $10,000 in April 2024 appeared first on The Motley Fool Canada. Investors can be safe while still making large amounts of passive income, even from an investment you can afford! The post 2 Dividend Stocks That Could Create $553.72 in Passive Income in 2024 appeared first on The Motley Fool Canada.  In 2019, Aurora and its peers in Canada’s cannabis sector were under immense pressure to reassure investors as stocks crashed from dizzying highs. Alex Wong/GettyTony Bobulinski, a former associate of Hunter Biden who recently testified against President Joe Biden in the GOP-led House impeachment inquiry, filed a defamation lawsuit against Fox News co-host Jessica Tarlov on Thursday.The complaint, filed in the Southern District of New York, seeks $30 million in damages from the liberal pundit over comments she made on Fox News about Bobulinski and his legal representation. Stefan Passantino, a lawyer for Bobulinski, is also a plaintiff in Do you own Enbridge (TSX:ENB) in your portfolio? Here's why every investor needs to own some Enbridge stock. The post Why Enbridge Stock Belongs in Every Portfolio appeared first on The Motley Fool Canada.  There are plenty of growth stocks in the market worth considering, but Shopify (TSX:SHOP) looks like one of the best right now. The post 1 Growth Stock Down 50 Percent to Buy Right Now appeared first on The Motley Fool Canada. Boom and Bust It was only a matter of time. Reddit shares are cratering right now, plunging almost 25 percent in just two days, as CNBC reports. The social media company went public last week at an IPO price of $34 and initially rallied to around $65. This week, however, shares started slipping, following Hedgeye […] Canopy Growth (TSX:WEED) stock saw its share more than double in the last two weeks. So, can it do it again with all this good news? The post Why Canopy Growth Stock Could Double in 2024 appeared first on The Motley Fool Canada. 2024 Subaru Crosstrek Review, Pricing, and Specs The price of gold hit a record high this week. While support for the rally may be fading, the yellow metal could still gain. Alex Murdaugh failed a polygraph test administered as part of the plea agreement for the disgraced former attorney’s raft of financial crimes, violating the deal, which required his truthfulness, federal prosecutors said in a court filing Tuesday. With Bitcoin's halving event just around the corner, it certainly seems like we're on the cusp of something big.  Daniel Polotsky is the founder of CoinFlip.  Bitcoin's value has surged of late, buoyed by anticipation surrounding the upcoming halving event in April, alongside milestones like the approval of spot bitcoin exchange-traded funds in the U.S. and major financial institutions such as BlackRock publicly entering the space. "
}