{
    "title": "Apple just can't catch a break",
    "date": "3/7/2024",
    "url": "https://www.businessinsider.in/tech/news/apple-just-cant-catch-a-break/articleshow/108307081.cms",
    "text": "Liked the article? Share it with your friends... or copy link Bad news keeps piling up for Apple. On Monday, the European Commission slammed the iPhone maker with a nearly $2 billion fine after ruling that it restricted competition for music-streaming services such as Spotify. The very next day, a report from Counterpoint Research found that Apple's iPhone sales in China — a major market — had dropped by 24% in the first six weeks of 2024. That also means the iPhone has been dethroned from its No. 1 smartphone spot in the country, falling behind competitors including Vivo, Huawei, and Honor. And all this comes just days after Apple killed its long-worked-on self-driving-car project, dubbed \"Project Titan.\" It's said to have shuttered that project to focus on artificial intelligence. This string of negative headlines has left some concerned that Apple has lost its mojo. So far, shares have dropped by about 12% this year, while the Nasdaq has gained. Plus, Apple has been taking heat for falling behind peers in its AI efforts, with the move away from Project Titan seen as a sign that it's scrambling to catch up. And the European Union forced Apple to crack open its App Store — a move it wasn't at all happy about that will almost certainly net it less money from developers. \"I think the last three months is as rough as it gets for Apple,\" Gene Munster, a managing partner at Deepwater Asset Management, told Business Insider. \"There's a sense that their franchise is in jeopardy.\" But some analysts say Apple hasn't lost all its luster. \"There are a lot of factors swirling around Apple today, but I do think the core of the business is fundamentally intact,\" Toni Sacconaghi, a senior research analyst at Bernstein, said Tuesday on CNBC's \"Squawk Box.\" \"This is a company that has 2 billion devices in its install base and about 1.2 billion unique users, and they have a capability to develop new products that consumers want to go and try.\" Dan Ives, a technology analyst at Wedbush Securities, concurs. He told BI that while Apple had \"definitely had a few roadblocks over the course of the past couple of weeks,\" he remained bullish on the company and believed it could eventually bounce back. \"Over the last decade we have been through many challenging periods in the Apple story, and we handheld investors through these stormy periods just like today,\" Ives wrote in a recent analyst note. \"This is no different, and in our view, brighter days will be ahead.\" After all, Apple may still have what it takes to win over consumers. Just look at the Vision Pro, Apple's mixed-reality headset that got more than 200,000 units in preorders before its February launch and had customers lining up to buy it. While the $3,500 spatial-computing device didn't win over everyone — some returned it after finding its design a bit too clunky — it did demonstrate Apple still had the wow factor when introducing products and services, which may help it in the future. \"That platform of 1.2 billion users isn't going anywhere, and Apple has the opportunity to leverage that going forward,\" Sacconaghi said on CNBC. That doesn't mean the road ahead is easy. With growing pressures in the hot, new AI space, there have been mounting questions about whether Apple is lagging. But Sacconaghi said it didn't have to be a leader in generative AI to win. \"Apple has this powerful install base, and the question is: Can it use AI to add more value to that install base? And I think it can,\" the analyst said on CNBC. While Apple has held its AI cards close to its chest so far, \"we think Apple will have AI-enabled capabilities in its next phone coming out in September,\" he added. But if it doesn't buckle down on its AI strategy, the tech titan may find it's outdone by other major companies, Ming-Chi Kuo, an analyst, wrote in a post on X, formerly Twitter. \"If Apple fails to launch generative AI services this year that are better than market expectations, Nvidia's market value will most likely surpass Apple,\" Kuo said. Apple didn't respond to a request for comment from BI before publication. Advertisement "
}