{
    "title": "Microsoft is already bigger than Apple, but its 'iPhone moment' could be \ncoming",
    "date": "3/30/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240330251/microsoft-is-already-bigger-than-apple-but-its-iphone-moment-could-be-coming",
    "text": "By Emily Bary Wedbush is excited about the potential for AI to give a big boost to Microsoft's cloud business Microsoft Corp. is already the largest public U.S. company, with a nearly $500 billion lead on second-ranked Apple Inc. But that's not to say Microsoft (MSFT) couldn't stand to benefit from some iPhone-like magic of its own, at least according to Wedbush analyst Daniel Ives, who said late Monday that artificial intelligence could do for Microsoft what the smartphone did for Apple (AAPL) - transform the company's growth trajectory. Specifically, Ives was referring to Microsoft's revenue growth rate for its Azure cloud business, as well as the company's potential to give its software business a boost thanks to new Copilot AI features. He thinks \"'transformative' Copilot monetization\" is on the horizon for Microsoft, \"and now starting to manifest across many customers and verticals.\" Read: Apple's stock has faltered, but a Steve Jobs moment in AI may be on the horizon He boosted his price target on Microsoft's stock to $500 from $475 in his latest report, with the new target implying 18% upside from Monday's closing level. Ives' growing optimism came after he talked to customers, chief information officers and partners about how Copilot is playing out in the market so far. He came out with the impression that AI could prove Microsoft's \"iPhone moment.\" \"In a nutshell, we see an acceleration of adoption for generative AI and Copilot activity which in turn is catalyzing more Azure cloud deal flow for [Chief Executive Satya Nadella and his team] with major momentum heading into the next six to 12 months as AI use cases explode across the enterprise landscape,\" Ives said. In three years, over 70% of Microsoft's installed base will be using Copilot, he said, whereas his prior estimate was for 60% adoption. The company could see AI momentum build this year, though next fiscal year \"remains the true inflection year of AI growth\" as the company will continue to make pricing moves and roll out use cases in the coming months, according to Ives. Don't miss: How software investors should view the AI 'tsunami' as chip stocks outperform \"We believe the stock still has yet to fully price in what we view as the next wave of cloud and AI growth coming to the Redmond story as AI enterprise use cases catalyze more budget dollars to AI in 2024/2025,\" Ives continued. Microsoft's stock is up 12% so far this year, and it's ahead 0.5% in Tuesday's premarket action. -Emily Bary This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 03-30-24 0832ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}