{
    "title": null,
    "date": "3/5/2024",
    "url": "https://finimize.com/content/the-bitter-fruit",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest 25 days ago  •  2 mins What’s going on here? Apple’s iPhone sales were 24% lower in China during the first six weeks of this year versus last, after Huawei took more than one bite at the Apple. What does this mean? China’s shoppers are usually a reliable crowd for luxury clothing stores, high-end potion and lotion makers, and tech companies. But now they need to watch their wallets, they’ve ditched their souped-up nice-to-haves. The result: the Chinese smartphone market shrunk by 7% in the first six weeks of this year compared to the same time last year. That explains why Apple has struggled to shift its new iPhone 15, with the model selling a lot slower since its September debut than previous releases. It hasn’t helped that Chinese brand Huawei is winning customers back onside, while other local firms like OPPO, Vivo, and Xiaomi have rolled out competitive deals for cost-conscious shoppers. Why should I care? For markets: Good job Apple loves a challenge. Apple’s stock price has fallen 9% this year, handing the title of the world’s most valuable company back to Microsoft. Goldman Sachs removed Apple from the list of its highest-conviction investments, too, not long after Warren Buffett’s Berkshire Hathaway trimmed its holding of the stock in the final quarter of last year. To make matters worse, the European Union slapped Apple with a €1.8 billion ($2 billion) penalty on Monday, alleging that was making it harder for customers to explore different music streaming services. The bigger picture: Hooray for Huawei. Even though Apple has resorted to rare discounts, the iPhone is still stuck as the fourth-most popular smartphone in China. Meanwhile, Huawei has nabbed second place. And when Huawei isn’t tucking into Apple’s dwindling market share, it’s carrying China’s chipmaking ambitions on its shoulders: last year, the Shenzhen-based firm designed and produced a semiconductor more advanced than the US thought was possible, only five years after the firm nearly crumbled at the hands of stateside sanctions. apple information technology semiconductors smartphones tech stocks china us apple consumer discretionary government bonds macroeconomics Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}