{
    "title": "Invesco Ltd. Sells 1875356 Shares of Apple Inc. (NASDAQ:AAPL)",
    "date": "3/10/2024",
    "url": "https://www.americanbankingnews.com/2024/03/10/invesco-ltd-sells-1875356-shares-of-apple-inc-nasdaqaapl.html",
    "text": "Posted by ABMN Staff on Mar 10th, 2024 Invesco Ltd. reduced its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 3.6% during the 3rd quarter, according to the company in its most recent filing with the Securities and Exchange Commission (SEC). The fund owned 50,480,712 shares of the iPhone maker’s stock after selling 1,875,356 shares during the period. Apple accounts for about 2.3% of Invesco Ltd.’s portfolio, making the stock its 2nd largest holding. Invesco Ltd. owned approximately 0.32% of Apple worth $8,642,803,000 as of its most recent filing with the Securities and Exchange Commission (SEC). Other institutional investors and hedge funds have also made changes to their positions in the company. Vanguard Group Inc. lifted its holdings in Apple by 0.7% in the first quarter. Vanguard Group Inc. now owns 1,269,995,750 shares of the iPhone maker’s stock valued at $221,753,959,000 after acquiring an additional 8,734,393 shares during the last quarter. State Street Corp raised its position in Apple by 0.5% in the second quarter. State Street Corp now owns 578,897,858 shares of the iPhone maker’s stock valued at $112,288,818,000 after purchasing an additional 2,616,084 shares during the period. Moneta Group Investment Advisors LLC raised its position in Apple by 116,483.5% in the fourth quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock valued at $74,002,245,000 after purchasing an additional 569,066,184 shares during the period. Geode Capital Management LLC raised its position in Apple by 2.2% in the second quarter. Geode Capital Management LLC now owns 291,538,165 shares of the iPhone maker’s stock valued at $56,396,763,000 after purchasing an additional 6,367,053 shares during the period. Finally, Price T Rowe Associates Inc. MD raised its position in Apple by 3.4% in the first quarter. Price T Rowe Associates Inc. MD now owns 234,017,381 shares of the iPhone maker’s stock valued at $38,589,468,000 after purchasing an additional 7,736,013 shares during the period. 58.51% of the stock is currently owned by institutional investors and hedge funds. Shares of AAPL opened at $170.73 on Friday. Apple Inc. has a fifty-two week low of $147.61 and a fifty-two week high of $199.62. The company has a market capitalization of $2.64 trillion, a price-to-earnings ratio of 26.59, a price-to-earnings-growth ratio of 2.04 and a beta of 1.29. The firm has a 50-day simple moving average of $184.64 and a 200-day simple moving average of $183.60. The company has a debt-to-equity ratio of 1.28, a quick ratio of 1.02 and a current ratio of 1.07. Apple (NASDAQ:AAPL – Get Free Report) last announced its earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, topping the consensus estimate of $2.09 by $0.09. Apple had a net margin of 26.16% and a return on equity of 156.04%. The business had revenue of $119.60 billion during the quarter, compared to the consensus estimate of $117.99 billion. During the same quarter in the prior year, the firm earned $1.88 earnings per share. The business’s quarterly revenue was up 2.1% compared to the same quarter last year. On average, equities research analysts anticipate that Apple Inc. will post 6.55 earnings per share for the current year. The company also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Investors of record on Monday, February 12th were given a $0.24 dividend. The ex-dividend date was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a yield of 0.56%. Apple’s payout ratio is currently 14.95%. A number of analysts have issued reports on AAPL shares. Rosenblatt Securities reissued a “neutral” rating and issued a $189.00 target price on shares of Apple in a research report on Tuesday, March 5th. The Goldman Sachs Group boosted their target price on Apple from $223.00 to $232.00 and gave the company a “buy” rating in a research report on Friday, February 2nd. Piper Sandler Companies lowered Apple to a “neutral” rating and cut their target price for the company from $220.00 to $205.00 in a research report on Thursday, January 4th. Barclays cut their target price on Apple from $160.00 to $158.00 and set an “underweight” rating on the stock in a research report on Friday, February 2nd. Finally, Monness Crespi & Hardt upped their price objective on Apple from $189.00 to $200.00 and gave the stock a “buy” rating in a research report on Friday, February 2nd. One investment analyst has rated the stock with a sell rating, eleven have issued a hold rating, twenty-one have issued a buy rating and one has assigned a strong buy rating to the stock. According to MarketBeat, the stock currently has an average rating of “Moderate Buy” and a consensus price target of $205.27. View Our Latest Stock Analysis on AAPL In related news, Director Arthur D. Levinson sold 100,000 shares of the firm’s stock in a transaction dated Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the completion of the sale, the director now owns 4,434,576 shares in the company, valued at $802,392,181.44. The sale was disclosed in a legal filing with the SEC, which is available through the SEC website. 0.06% of the stock is owned by insiders. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.    Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Apple Inc. (NASDAQ:AAPL) Shares Bought by Alcosta Capital Management Inc. Apple Inc. (NASDAQ:AAPL) Shares Purchased by WINTON GROUP Ltd "
}