{
    "title": "Fashion's use cases for the Apple Vision Pro are evolving",
    "date": "3/27/2024",
    "url": "https://www.glossy.co/fashion/fashions-use-cases-for-the-apple-vision-pro-are-evolving/",
    "text": "On February 2, brands and retailers including MyTheresa, E.l.f Cosmetics and Alo Yoga launched the first fashion experiences for the Apple Vision Pro, a mixed reality headset from Apple. Nearly two months in, those experiences are getting more sophisticated. “We found that doing things just for the sake of being unconventional is not the answer,” said Greg Schwartz, president and COO at StockX. The luxury resale platform launched a shopping experience on the device on March 6. “Doing things that can improve the user experience is critical, and that’s what drives a lot of our innovation.” The StockX app for Vision Pro, which has seen thousands of downloads, according to the company, features an “Immersive Sneaker Showcase”, where users can explore 3D models of the latest sneakers in their own space. The experience leverages eye tracking and hand gestures to create a smooth catalog browsing experience. It also provides users with market data on real-time insights to inform buying decisions, as well as shopping inspirations and a visual check-out. “We realized early on that [the use of] this was going to be limited,” said Schwartz. “It’s a high-priced device. So [our participation] was less about trying to drive mass adoption and more about being among the first to demonstrate what a shopping experience looks like here.” The company is now considering how to bring some of the best aspects of the experience to its core experiences on more traditional interfaces. “We are thinking about how we can [further use] some of the interactive data visualizations and 3D models, even if it’s not as immersive,” said Schwartz. “We are using the AVP experience as a test space for future innovation.” Shopping and styling In February, J.Crew introduced an Apple Vision Pro app centered on a virtual closet for immersive 3D shopping. The brand declined to share the app’s number of downloads. “Combined with the SharePlay feature on FaceTime, the J.Crew Virtual Closet allows a J.Crew stylist to share the [shopping] experience with a customer,” said Halsey Anderson, vp of marketing at J.Crew. “The customer can explore the environment and get help building looks. Combining our passion for superior service and styling with this immersive technology offers the most advanced form of virtual clienteling we’ve seen.” “The shopping experience in J.Crew is a lot of fun,” said Cathy Hackl, co-CEO of computing and AI solutions company Spatial Dynamics, who bought a pair of shoes through the retailer’s app. “It’s still a little flat, but that is to be expected this early on,” she said. According to the company and its shopping experience studio Obsess, J.Crew will continue to develop and evolve the app as Apple brings in new features over the next year or so. For its app, Mytheresa developed shopping scenarios for curated product collections, in places like Capri and Paris. E.l.f. Cosmetics, meanwhile, blended gaming with product exploration. And Alo Yoga combined self-care with shopping in an “Alo Sanctuary,” featuring meditations and product discoveries in nature-inspired settings. Both Neha Singh, CEO of Obsess, and Cathy Hackl said brands testing the waters of Apple Vision Pro can gain an early mover advantage. “Experimenting with these content formats allows brands to be prepared for when iPhones start to get more spatial capabilities and Vision Pro starts to get cheaper, faster, better and more convenient,” said Hackl. According to Hackl, the tool offers big potential for fashion brands, when it comes to styling. “With the AVP, a stylist or designer could send you a 3D video [of a look] or dress up a model with the same body type and height to see how it looks on you in virtual reality.” Even some luxury brands have begun venturing into the space, albeit with a smaller focus on shoppable experiences. On April 3, Gucci will introduce an app for the Apple Vision Pro enabling users to design virtual environments and engage with unique augmented reality content, including 3D renditions of products from the fall 2024 Gucci Ancora collection. The app also grants access to an augmented reality version of the documentary “Who Is Sabato De Sarno? A Gucci Story” and exclusive insights from the fall presentation. The data opportunity The Apple Vision Pro also opens up new brand opportunities for tracking marketing and customer behavior. Schwartz said it is too early to say what data StockX will get from the app, but he anticipates it will be more granular and help shape other e-commerce experiences. “When you put on the device, you are completely immersed in video, because the AVP has 10 external cameras, versus the iPhone 15’s three cameras,” said Ranjan Roy, vp of strategy at intimates company Adore Me. And the 10 cameras process external and eye cues in real-time. Adore Me recorded its New York Fashion Week show using the device to use it for future marketing and other AVP testing. Roy also says the device offers a similar, but much more elevated, experience to livestream shopping: “In terms of getting people to shop, it’s a huge jump from how live shopping works right now,” he said. Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. "
}