{
    "title": "Apple buys startup DarwinAI, adds staff to its AI division, Bloomberg \nreports",
    "date": "3/14/2024",
    "url": "https://ca.news.yahoo.com/apple-buys-startup-darwinai-adds-173425904.html",
    "text": "(Reuters) - Apple has bought artificial intelligence (AI) startup DarwinAI and added dozens of the Canadian company's staffers to its AI division, Bloomberg News reported on Thursday. The iPhone maker purchased the business earlier this year, the report stated, citing people familiar with the matter. The report did not mention the deal value. The companies did not immediately respond to Reuters requests for comment. Apple has been slower in rolling out generative AI, which can generate human-like responses to written prompts, than rivals such as Microsoft and Alphabet's Google, which are weaving them into products. Alexander Wong, an AI researcher at the University of Waterloo who helped build DarwinAI's business, has joined Apple as a director in its AI group as part of the deal, the report added. DarwinAI has developed AI technology for visually inspecting components during the manufacturing process and serves customers in a range of industries, Bloomberg said. (Reporting by Arsheeya Bajwa in Bengaluru; Editing by Pooja Desai and Shailesh Kuber) This dividend stock has been absolutely crushing the TSX 60 and looks like it will continue to do so while providing a juicy dividend. The post Beat the TSX With This Cash-Gushing Dividend Stock appeared first on The Motley Fool Canada. Truth Social's owner, which counts Donald Trump as its biggest shareholder, is now worth more than American Airlines and Ralph Lauren by one measure.  The stock value of Reddit and Donald Tump's Truth Social took a hit by the end of trading on Thursday ahead of Easter weekend and the NYSE's Friday closure. Berkshire Hathaway’s chairman Warren Buffett, one of the world's most famed investors, is still faithful to the fact that holding steady, being patient and believing in the power of value investing is key to successful investments. Just as important to Buffett's investment strategy, though, are the investments he doesn't believe in. Here are but a few of the investment types that the Oracle of Omaha would rather not waste money on. BCE (TSX:BCE) stock is a dividend juggernaut that's getting beyond cheap at multi-year depths. The post 1 Nosediving Blue-Chip Stock That’s Getting Ridiculously Cheap appeared first on The Motley Fool Canada. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Good Friday is here—and Easter Sunday is around the corner.  The New York Stock Exchange and the Nasdaq Stock Market will both be closed on Friday.  Since Good Friday is not a federal holiday, the U.S. Postal Service and banks will both be open. Fairfax Financial Holdings (TSX:FFH) and another TSX stock I'd buy and hold for the next five decades in a TFSA! The post Millennials: 2 TFSA-Worthy Stocks to Buy and Hold for 50 Years appeared first on The Motley Fool Canada. Sienna stock (TSX:SIA) looks like a strong dividend stock that's only getting stronger, but there is more growth available. The post 1 Dividend Stock Down 20% to Buy Right Now appeared first on The Motley Fool Canada.  With stocks off to their best start in five years, many strategists on Wall Street still make a case for the S&P 500 to keep chugging higher. If you've already created a diversified portfolio and are looking for more options from a windfall, here is where I would invest next. The post Where to Invest $10,000 in April 2024 appeared first on The Motley Fool Canada. Investors can be safe while still making large amounts of passive income, even from an investment you can afford! The post 2 Dividend Stocks That Could Create $553.72 in Passive Income in 2024 appeared first on The Motley Fool Canada.  Do you own Enbridge (TSX:ENB) in your portfolio? Here's why every investor needs to own some Enbridge stock. The post Why Enbridge Stock Belongs in Every Portfolio appeared first on The Motley Fool Canada. The Fed doesn't want to say it outright, but its rate forecast is nodding to a recession on the way, according to David Rosenberg. In this article, we will be taking a look at 11 undervalued semiconductor stocks to buy according to hedge funds. To skip our detailed analysis of the semiconductor sector, you can go directly to see the 5 Undervalued Semiconductor Stocks To Buy According to Hedge Funds. Semiconductor Industry Outlook The semiconductor space is now more […]  In this piece, we will take a look at the 25 biggest food companies in the world by revenue. If you want to skip our coverage of the global food industry and recent events, then you can check out 5 Biggest Food Companies in the World by Revenue. Just like the oil industry, the food […] Boom and Bust It was only a matter of time. Reddit shares are cratering right now, plunging almost 25 percent in just two days, as CNBC reports. The social media company went public last week at an IPO price of $34 and initially rallied to around $65. This week, however, shares started slipping, following Hedgeye […] Canopy Growth (TSX:WEED) stock saw its share more than double in the last two weeks. So, can it do it again with all this good news? The post Why Canopy Growth Stock Could Double in 2024 appeared first on The Motley Fool Canada. IBKR EventTrader - A new, straightforward way to trade CME futures markets In 2019, Aurora and its peers in Canada’s cannabis sector were under immense pressure to reassure investors as stocks crashed from dizzying highs. The price of gold hit a record high this week. While support for the rally may be fading, the yellow metal could still gain. My children have inherited $5 million of stock from their father (whose estate has not yet been dispersed after 11 months) leaving them with a 30% or so loss of value over which they have had no control. Is there … Continue reading → The post Ask an Advisor: My Kids Inherited $5 Million. How Should They Handle It? appeared first on SmartAsset Blog. "
}