{
    "title": "Apple may not do a spring event this year",
    "date": "3/3/2024",
    "url": "https://www.theverge.com/2024/3/3/24089196/apple-no-spring-event-planned-macbook-air-ipad",
    "text": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Apple has plenty of releases planned for the spring, by the rumor mill’s reckoning, but one thing it may not do is make a big production out of it, according to Mark Gurman in today’s Power On newsletter for Bloomberg. It’s not all that unusual for Apple to skip a spring event — it didn’t have one last year, and it’s skipped it in years past, too. Even so, it’s a little surprising, given the plethora of devices the company is expected to launch. The biggest thing is a revamped iPad Pro with an OLED screen and an M3 chip. For the most part, Apple’s highest-end tablet’s design has been unchanged since its 2018 refresh, when it took on the flat-sided design language that also defines the company’s phones, laptops, and even the iMac. The company is also expected to update the iPad Air, introducing a new 12.9-inch version alongside the usual 10.9-inch model. Both would be the first new iPads since 2022. Rumors have been predicting a new Apple Pencil, too, though there hasn’t been a lot of information about what will be different. There could be new interchangeable magnetic tips that alter its characteristics for different kinds of art, and it may also have Find My built-in. Other accessories that have been tipped by Gurman and others include a redesigned Magic Keyboard for the iPad Pro that would be encased in aluminum and lend the deluxe iPad more of the illusion of a laptop. Rumors have pegged spring as the release window for M3 chip-equipped 13- and- 15-inch MacBook Airs, as well. Those probably won’t change hugely — just more powerful chips. But apart from perhaps a nicer display, I’m not convinced anyone is clamoring for big changes on the Air lineup. As with iPads, this would be the first update to the excellent 13-inch MacBook Air since 2022. That’s so much new hardware to announce without a big production! But maybe it makes sense. After all, it’s not without precedent, and it’s not like there are any fancy new chips for Johnny Srouji to talk up in his lab. Plus, if Apple changes little else about the iPad Pro apart from the screen, there’s functionally not a lot to really get excited about there, either. It also remains to be seen how big a deal a larger iPad Air will be to customers. That would make Apple’s next big event its World Wide Developer Conference, typically in June. There, we expect a lot of changes. As Gurman writes, the company is getting ready to unveil the fruits of its massive effort to catch up with everyone else on generative AI. That’s also where Apple shows off what it’s doing to update its operating systems, so expect plenty of updates there — particularly for iOS 18, which Gurman has said (and does again today) will be the most significant software rejiggering the iPhone has ever seen. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}