{
    "title": "Chinese tech firms step up car business expansion, despite Apple's \nwithdrawal",
    "date": "3/1/2024",
    "url": "https://www.shine.cn/biz/tech/2403019738/",
    "text": "Chinese tech giants such as Xiaomi and Huawei are accelerating steps to expand into the car segment, at a time Apple abandoned electric car manufacturing, Shanghai Daily learned. Apple's target of \"Project Titan,\" beginning around 2014, was to develop a fully autonomous car. The company reportedly invested billions of dollars in the project. The iPhone maker's decision to shut down the project was announced internally on Tuesday. Xiaomi's new SU7 \"becomes the best choice for Apple users\" after Apple's withdrawal from car-making, Lei Jun, Xiaomi's chairman, said in a post on Wednesday on Weibo, a Twitter-like social platform in China. Xiaomi's SU7 makes its overseas debut on February 26 at the Mobile World Congress in Barcelona, Spain. Xiaomi unveiled its first electric vehicle, the SU7, in December. The company invested over 10 billion yuan (US$1.38 billion) in the auto business and has a team of 3,400 engineers, helping the company become \"China's Porsche and Tesla,\" Lei said at the time. Xiaomi's new car price, which will be announced in March, is expected to be about 200,000 yuan, according to industry sources. Xiaomi's cars support (iPhone's) Carplay and iPads hanging in front of the rear seats, Lei added in the Weibo post. In February, Huawei-backed AITO brand car sales reached 21,142 units, making its combined sales over 100,000 units. AITO was co-designed by Huawei and automaker Seres Automobile, and powered by Huawei's Harmony system. The new AITO M9, a high-end car with an average price of over 500,000 yuan, has received orders for more than 50,000 units. Shanghai-listed Seres Automobile stocks closed 92.30 yuan on Friday, jumping more than 60 percent in February. Chinese new-energy carmakers also expressed their understanding of Apple's decision. Li Xiang, chief executive of Li Auto, said Apple was making a \"absolutely right decision\" as it was time for Apple to focus on artificial intelligent research and development. In Focus Metro Nation World Sport Economy Tech Auto Company Property Finance Event Art & Culture Travel Lifestyle Taste Entertainment Wellness MENTAL Book Education iDEALShanghai 沪公网安备 31010602001940号 Copyright 2019 ©  Shanghai Daily  All Rights Reserved. 沪公网安备 31010602001940号 About Us Contact Us Feedback Privacy Policy Terms of Use "
}