{
    "title": "US Stocks Rise At Week's Start, Tesla Rebounds, SoFi, Lucid Shine: What's \nDriving Markets Monday? - Apple",
    "date": "1/29/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36831122/us-stocks-rise-at-weeks-start-tesla-rebounds-sofi-lucid-shine-whats-driving-markets",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Wall Street witnessed slight gains at midday on Monday, with investors eagerly awaiting a series of critical earnings reports, the Federal Reserve’s meeting on Wednesday and the much-anticipated job market report this Friday. This week’s significant tech earnings include reports from Microsoft Corp. MSFT, Alphabet Inc. GOOGL GOOG and Advanced Micro Devices Inc. AMD on Tuesday, followed by Qualcomm Inc. QCOM on Wednesday, and Apple Inc. AAPL and Amazon.com Inc. AMZN on Thursday. Both the S&P 500 and Nasdaq 100 saw modest increases, rising by 0.1% and 0.3%, respectively, while the Dow Jones Industrial Average remained broadly steady. Small-cap stocks outperformed their large-cap counterparts, with the Russell 2000 Index climbing 0.5%. Tesla Inc. TSLA emerged as a notable performer among mega-cap stocks, rebounding 2.4% after a 12% decline last week. In the bond market, Treasury yields slightly decreased, leading to gains in fixed-income securities. The iShares 20+ Year Treasury Bond ETF TLT experienced a 0.8% increase. In commodities, gold prices, as tracked by the SPDR Gold Trust GLD, rose by 0.5%. Crude oil prices fell by 1.6% despite escalating tensions in the Middle East, following a statement from the White House regarding Iran-backed militants’ attack on U.S. troops in Jordan, with President Joe Biden vowing a response. Bitcoin BTC/USD experienced a notable surge, rising 2.3% to reach $43,000. The SPDR S&P 500 ETF Trust SPY was 0.1% higher to $487.95, the SPDR Dow Jones Industrial Average DIA edged 0.1% lower to $380.73 and the tech-heavy Invesco QQQ Trust QQQ rose 0.3% to $424.06, according to Benzinga Pro data. Sector-wise, the Consumer Discretionary Select Sector Fund XLY outperformed, up 0.7%, aided by Tesla. The Energy Select Sector Fund XLE underperformed, down 1.1%. Read now: iRobot Hit By Regulatory Hangover: Amazon Merger Collapse Triggers Stock Plunge, Restructuring Efforts Photo via Shutterstock. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}