{
    "title": "Spotify CEO says Apple's App Store changes are a 'new low'",
    "date": "1/27/2024",
    "url": "https://www.businessinsider.com/spotify-ceo-daniel-ek-apple-app-store-changes-new-low-2024-1",
    "text": "       The list of executives who aren't thrilled with Apple's new app distribution policies just keeps growing. Spotify chief executive Daniel Ek said in an X post on Friday that Apple's changes represent a \"new low, even for them.\" This came after Spotify released a statement calling out the iPhone maker for acting like \"they don't think the rules apply to them.\" After sitting with our legal team to parse through the fine print of Apple's DMA announcement (that took a while), which is, at best vague and misleading, I wanted to share my thoughts.  While Apple has behaved badly for years, what they did yesterday represents a new low, even… Apple announced it will for the first time allow developers to create and distribute apps on third-party marketplaces once it releases iOS 17.4. The changes will only take effect in the EU, which has forced Apple to comply with the Digital Markets Act — a European law aimed at curtailing tech giants' hold over the digital economy. Related stories While this may sound like a victory for app developers since it will open up more channels for distribution, many are complaining that Apple will not only retain control over which third-party marketplaces end up on its system but will also charge fees for downloads on those other marketplaces. Ek said Apple's reaction to the Digital Markets Act is \"a masterclass in distortion.\" Under Apple's new changes, apps with over one million downloads will need to pay a \"core technology fee\" for \"each first annual install per year.\" That puts an app like Spotify — which Ek said has more than 100 million downloads in the EU — in an \"untenable situation\" because it drastically increases the cost of acquiring new customers. In a statement, Spotify described the fee as \"extortion, plain and simple.\" The company says the fee will likely hurt developers, potential start-ups, and those offering free apps who might not have the funds to pay Apple — especially if their app suddenly goes viral. That means that even a multibillion-dollar company like Spotify will need to \"stick with the status quo\" to remain profitable, Ek said. For its part, Apple said in a statement that it seeks to support developers, including Spotify, which it acknowledged as the world's \"most successful\" music streaming app. \"The changes we're sharing for apps in the European Union give developers choice — with new options to distribute iOS apps and process payments,\" a spokesperson for Apple told Business Insider by email. \"Every developer can choose to stay on the same terms in place today. And under the new terms, more than 99% of developers would pay the same or less to Apple.\" While Apple's tight hold over the iOS ecosystem has helped it reap billions in revenue, it has also caused it to run afoul of regulators who believe its tactics stifle innovation and suppress new entrants. Ek, too, is a longtime critic of Apple's tactics and has previously said the company has a ways to go before it becomes an \"open and fair platform.\" Apple's App Store change not only falls short of that ideal, but \"mocks the spirit of the law and the lawmakers who wrote it,\" Ek said. The good news for him is that Apple's new changes aren't set in stone until they pass muster with the EU. And Ek said he's hoping the EU \"recognizes this for exactly what it is and stands firm and doesn't let their work over the years all be for nothing.\" Read next Jump to "
}