{
    "title": "Apple continues drop even as it surpassed Samsung as 2023's top phone maker",
    "date": "1/16/2024",
    "url": "https://seekingalpha.com/news/4055039-apple-continues-drop-even-as-it-surpassed-samsung-as-2023s-top-phone-maker",
    "text": "yalcinsonat1 Apple (NASDAQ:AAPL) may have lost its crown as the world's most valuable company last week, but it has a new title it can claim: world's top smartphone maker. Apple shipped more smartphones in 2023 than Samsung (OTCPK:SSNLF), according to research firm IDC. The firm estimated that Apple shipped 80.5M units in the fourth-quarter and 234.6M throughout the year, ending the year with 20.1% of the market, ahead of Samsung's 19.4%. Research firm Canalys also said Apple was 2023's top smartphone maker, ending the year with 24% of the market, according to its findings. Samsung had held the title of the world's top smartphone maker since 2010. Xiaomi, OPPO and Transsion rounded out the top smartphone makers, according to IDC. That comes even as global smartphone shipments fell 3.2% year-over-year to 1.17B units in 2023, the lowest full-year volume in a decade, IDC said. However, the fourth-quarter said 8.5% year-over-year growth, higher than the 7.3% that was expected. \"While we saw some strong growth from low-end Android players like Transsion and Xiaomi in the second half of 2023, stemming from rapid growth in emerging markets, the biggest winner is clearly Apple,\" said Nabila Popal, IDC research director in a statement. \"Not only is Apple the only player in the Top 3 to show positive growth annually, but also bags the number 1 spot annually for the first time ever.\" Popal continued: \"All this despite facing increased regulatory challenges and renewed competition from Huawei in China, its largest market. Apple's ongoing success and resilience is in large part due to the increasing trend of premium devices, which now represent over 20% of the market, fueled by aggressive trade-in offers and interest-free financing plans.\" Apple is offering discounts for its iPhone 15 line in China amid rising competition from companies like Huawei and others. The company has reduced prices of some iPhones by up to 5%, according to its Chinese website. It is running the promotion from Jan. 18 to Jan. 21 to welcome the Lunar New Year, which will be in February. The Tim Cook-led company is slated to report fiscal first-quarter results on Feb. 2. A consensus of analysts expect the company to earn $2.10 per share on $118.24B in revenue. Apple shares fell 1% in early trading on Tuesday. "
}