{
    "title": "Microsoft and Apple neck and neck in race to be world's most valuable \ncompany",
    "date": "1/11/2024",
    "url": "https://www.telegraph.co.uk/business/2024/01/11/ftse-100-markets-latest-news-tesco-marks-spencer-inflation/",
    "text": "Chosen by us to get you up to speed at a glance Microsoft briefly overtook Apple as the world’s most valuable company on Thursday as its bets on artificial intelligence (AI) begin to pay off. Apple’s shares dropped more than 1pc in early trading on Thursday, giving it a valuation of $2.87 trillion. Meanwhile, Microsoft’s shares climbed as much as 2pc in early trading in New York, surpassing Apple’s market capitalisation and climbing as high as $2.9 trillion. However, the lead was short lived and Microsoft’s stock lost early gains to trade roughly flat. The tech giant behind Office and Windows has enjoyed a share price surge over the past 12 months as investors back the company’s AI advances. Microsoft has invested $13bn into OpenAI, the fast-growing business behind ChatGPT, and launched a slew of products featuring chatbots. It has added AI assistants, which can talk to users in plain English, to its Office tools and Windows operating system. Its cloud digital infrastructure arm has also been boosted by renewed interest from businesses in AI. Apple, meanwhile, is facing investor jitters amid concerns its latest iPhone has not sold as well as hoped. Its share price has tumbled so far this year over concerns about lacklustre demand for its smartphones in China, one of its biggest markets. Earlier this month, analysts at Barclays warned that sales of the iPhone 15 had been “incrementally worse” in China. The company is facing growing competition from rival smartphone maker Huawei in China, which has made a comeback with a powerful new handset. Apple has also been slow off the mark in Silicon Valley’s new AI race. While it has its own voice-based chat system, Siri, it has yet to announce new products using AI since ChatGPT debuted. The iPhone-maker’s shares have fallen around 4pc so far this year after a series of downgrades by analysts who watch its stock, wiping more than $100bn off the company’s market capitalisation. Microsoft and Apple have previously traded places as the most valuable company in the world, with Microsoft holding the top spot at times in 2018 and 2021. Google was also more valuable than Apple in 2016, while oil giant Saudi Aramco has also held the top spot in the past. Apple’s share price climbed as much as 50pc last year, giving the iPhone-maker a market capitalisation of over $3 trillion in June 2023. Read the latest updates below. Thanks for joining us today here on the Markets live blog. Chris Price will be back in the morning with the latest from the stock market and beyond. But I’ll leave you this evening with some of our latest business stories from The Telegraph: Aircraft manufacturer Airbus said on Thursday that it secured 2,094 orders last year, a record for the group. The rise was fuelled by airlines expecting growing passenger numbers and seeking out more fuel-efficient planes. Despite supply chain problems, it delivered 735 jets to clients last year, beating its own target of 720 and well above the 661 aircraft delivered in 2022. New orders beat Airbus’s previous record from 2013 of 1,503 planes, continuing to reap the success of its popular A320 family for shorter flights and the A350 for long-haul routes. Airbus’s Christian Scherer said that its post-Covid recovery has occurred faster than it expected. “We have never sold as many A320s or A350s in any given year,” he said. “Travel is back and there is serious momentum.” Hopes of rapid interest rate cuts in the US are fading after inflation jumped more than expected last month, writes Tim Wallace: Traders had increasingly predicted that the Federal Reserve would accelerate interest rate cuts, particularly as inflation edged closer to the central bank’s 2pc target. However, economists have since cautioned that stubborn inflation figures could mean the Fed, led by chairman Jerome Powell, keeps rates at 5.5pc for longer. Edoardo Campanella, economist at Unicredit, said the surprising rise in inflation “suggests that the last mile in the disinflationary process towards the Fed’s 2pc inflation target will be bumpy.” He predicts the Fed will hold off until June before bringing rates down. “The central bank wants to be confident that the 2pc target is not only within reach but that it will be achieved on a sustained basis,” Mr Campanella said. At the same time, the number of new jobless benefit claims edged down from 203,000 to 202,000 last week, defying expectations of a modest rise. James Knightley, economist at ING, said this further adds to pressure on the Fed to keep rates on hold. He said: “The combination of the two – slightly firmer inflation and good jobs numbers really brings into doubt the market expectation of a March rate cut from the Federal Reserve.” The pound will reach £1.30 by the end of the year from its current lever of $1.27, say economics at Pantheon Macroeconomics: Sterling gained ground against most currencies in 2023, rising to $1.27 against the dollar, from $1.20 at the start of the year, and €1.16 against the euro, from €1.13. We think the pound will continue to appreciate gradually against the dollar, as it becomes apparent the MPC [Monetary Policy Committee] won’t reduce Bank Rate quite as quickly as markets currently anticipate. The general election, which will probably be held in the autumn, likely won’t weigh materially on sterling. The number of households whose energy bill payments failed surged last month, after the ban on forcibly fitting prepayment meters last year, writes Tim Wallace: A total of 1.17pc of all direct debits for energy bills failed in December, jumping by almost 40pc on the same month a year earlier, according to the Office for National Statistics (ONS). It indicates that more households had insufficient funds in their accounts to afford the transaction. Direct debts can also fail for other reasons, such as a cancellation of the payment without telling the supplier.It suggests families are struggling with their finances - and worse could be yet to come.The failure rate has fallen a touch since October’s high of 1.3pc, but this month’s cold weather is expected to raise pressure on households as thermostats are cranked up to keep homes warm. At the same time Ofgem’s energy price cap ticked up this month, taking the bill for a household of average usage to £1,928 per year, from £1,834 before the new year.The failures indicate families are struggling with the cost of living despite the recent easing in the headline rate of inflation. The average direct debit payment was lower in December 2023 than it was a year earlier, falling from £183.18 to £178.79. But failed payments went up, indicating households are still feeling the pinch.Direct debit failures on mortgage payments rose to 0.46pc, up from 0.38pc in December 2022. The French catering and facilities management company with schools, hospitals and prisons contracts in Britain is pushing ahead with spinning off a division focused on employee benefits programmes. Pluxee, which helps employers offer meal cards, wellness programmes and training courses, is to be floated on the Euronext Paris on Feb 1. Is boss, Aurelien Sonet, told Bloomberg that the unit sees an “ocean” of potential growth ahead of it. The float could place a value on the unit as high as €5bn (£4.3bn). Bitcoin prices climbed to a two-year high during trading after Wall Street’s watchdog approved the first funds to invest directly in the digital currency. Michael Bow reports: The move is a watershed moment for the much-maligned asset and has sparked hopes that Bitcoin will become more mainstream. Around $52bn worth of Bitcoin traded hands across various cryptocurrency exchanges, the highest volume since March, as the industry gears up for increased demand. Bitcoin is the world’s biggest cryptocurrency despite reservations about its safety from regulators. The SEC gave the green light to 11 Bitcoin ETFs which applied for an application to trade on the US stock markets. Several fund managers have also filed applications in the US to launch ETFs that buy and sell Ether, the world’s second largest cryptocurrency. A decision is expected from the SEC on the approvals in May.The SEC had resisted approving funds owning actual Bitcoin.The agency was sued over its refusal to approve Grayscale’s application for a Bitcoin ETF. Grayscale won its case in August, paving the way for SEC approval. The former boss of a bank linked to steel magnate Sanjeev Gupta has been fined close to £120,000 for not managing the troubled bank’s exposure properly. The Bank of England said that former Wyelands Bank chief executive Iain Hunter would pay £118,808 and promised not to do certain jobs in the future. It comes close to a year after the Bank’s Prudential Regulation Authority (PRA) said that it would have fined the lender £8.5 million if it was not already winding down. Wyelands, which supported small and medium sized business, had lent far too much money to Mr Gupta’s conglomerate GFG Alliance, which it was also linked to, the PRA said at the time. It did not have proper strategies in place to manage this risk or to mitigate potential conflicts of interest, the Bank said. The PRA said that Mr Hunter had “failed both to act with due skill, care and diligence and to take reasonable steps” to ensure that Wyelands had proper systems in place to manage its exposure to certain customers. The Bank said: Mr Hunter also failed to comply with Wyelands’ internal policy, which had been created to mitigate potential conflicts of interest arising from its membership of the Gupta Family Group (GFG) Alliance and failed to take appropriate steps to verify the accuracy of statements he made about Wyelands in two letters he wrote to the PRA. Mr Hunter has been approached for comment. The FTSE 100 was down 0.94pc today. Hotel group Whitbred was the biggest riser, up 2.28pc, followed by pest control and cleaning company Rentokill Initial, up 1.33pc. The biggest declines were experienced by Marks and Spencer, down 5.51pc, followed by Barclays, down 4.77pc. Meanwhile, the mid-cap FTSE 250 fell 0.79pc. The biggest riser was Trustpilot, up 12.98pc, followed by Darktrace, up 8.85pc. The biggest fallers were merchant banker Close Brothers, down 10.69pc, followed by commodity trading and mining company Ferrexpo, down 9.63pc. Delays in the planning system will hold back housebuilding in Britain, the boss of Taylor Wimpey has warned. Melissa Lawford has the details: Jennie Daly said stretched council resources and reduced housing targets have led to increased planning constraints. As a result, wait times for even the most basic decisions have doubles, said Ms Daly.She said that three years ago its took six months for the simplest applications to be resolved, whereas this has now jumped to a minimum of 12 months. A decision by Housing Secretary Michael Gove to water down local authority housing targets at the end of 2022 is largely to blame, she said, as he made them advisory rather than mandatory.Ms Daly said: “What that means is that local authorities don’t have to deliver on housing targets. So we’re likely to see reduced numbers coming through the plans. And ultimately that means reduced numbers of new homes being built.This has added further delays to an already creaking system, the Taylor Wimpey chief said, as local authorities were already grappling with an extreme lack of resources.Ms Daly said: “There are not enough planners to process applications so we have got a real backlog.” Netflix has removed an Indian language film from its platform after the movie faced a backlash on social media for depicting the daughter of a Hindu priest eating meat. Hindus are India’s largest religious grouping and Hindu priests, as well as their families, are typically vegetarian. Annapoorani: The Goddess of Food, a Tamil-language film, is no longer available on the international streaming platform. On Wednesday, protesters from the Vishwa Hindu Parishad (VHP), a Hindu organisation with ties to Prime Minister Narendra Modi’s Bharatiya Janata Party, shouted slogans against Netflix and the movie at the company’s Mumbai office, according to a post on social media platform X by VHP spokesperson Shriraj Nair. The film depicts the daughter of a Hindu temple priest in the southern Indian state of Tamil Nadu eating meat and later entering a high-stakes cooking contest, where she cooks meat. Netflix was approached for comment. The US President stuck an interventionist note today after new inflation figures for the world’s largest economy rose by more than expected. They increased to 3.4pc from 3.1pc in November, according official figures, above analyst expectations of a rise to 3.2pc. He said: Despite what many forecasters were predicting a year ago, inflation is down while growth and the job market have remained strong. The economy has created more than 14 million jobs since I took office, and wealth, wages, and employment are higher now than under my predecessor. But there is much more work to do to lower costs for American families and American workers. That’s why I’m taking action to bring down the price of insulin, prescription drugs, and energy, eliminating hidden junk fees companies use to rip you off, and calling on large corporations to pass on savings to consumers as their costs moderate. Mr Biden accused “extreme Republicans” of having “no plan to lower costs for families”. But in a post on social media, Donald Trump claimed: “Our middle class is being crushed by Biden’s crippling inflation.” Egypt’s petroleum minister, Tarek El Molla, and Saudi Arabia’s energy minister, Prince Abdulaziz Bin Salman, reportedly reaffirmed in a meeting on Thursday the importance of continuing to support stability and the balance of global oil markets in the face of challenges, according to a statement by Egypt’s petroleum ministry seen by Reuters. It follows mounting challenges for the Saudi-led Opec cartel, which saw Angola quit as a member in December at a time of record levels of US oil production. Egypt is not a member of Opec but was granded observer status in 2001. Fortnum & Mason is to double the amount of warehouse space it uses after a spike in orders over Christmas left the retailer “stretched to the limit”, its chief executive has said. Daniel Woolfson reports: Tom Athron, the Royal grocer’s chief executive, said a surge in orders over the festive period put “real pressure on our infrastructure”. It comes after reports that customers were being charged multiple times for transactions and left waiting to get through to its customer service for long periods in December. Fortnum denied it was having issues with its website at the time and Mr Athron said on Thursday: “It wasn’t so much about ordering hampers or technical problems. At that incredibly busy time, the spike that we see at Christmas is really quite substantially bigger than probably any other retailer in the country.” Read on to find out more on how Fortnum & Mason performed in the Christmas period... The FTSE 100 is in negative territory today (down 0.65pc) with banks seeing declines in their share prices. Barclays is the biggest faller in the index, down 4.68pc. Lloyds is down 3.44pc and HSBC is down 2.25pc. Michael Hewson, chief market analyst at CMC Markets UK, explains: The banking sector has proved to be the main laggard with today’s weakness accelerating in the wake of warnings from Barclays that the final three months [of 2023] were challenging for its investment banking division due to a lack of volatility. US bank Citigroup, aside from the various write-downs announced today, also warned of a similar slowdown in trading revenue in Q4 ahead of its numbers tomorrow. These warnings have served to weigh on the banks with HSBC, Barclays and Lloyds acting as the main drags on the UK benchmark. Swedish flat-pack retailer Ikea cut the prices of 1,500 items, including shelving units and chests of drawers, on Thursday citing “improved purchasing goods costs”. The move, which the company said would be matched by another 1,000 cuts by the spring, came after the official inflation rate fell to 3.9pc and the Bank of England said it was on track to hit its target of 2pc by the end of next year. Last month, Ikea warned that attacks on ships in the Red Sea “will result in delays and may cause availability constraints for certain Ikea products”. It sources its furniture from 12,000 suppliers including those in China, but also uses European manufacturers. That’s quite enough excitement for me for one day and I will breathlessly hand over the blog to my colleague Alex Singleton. There is just time to take a quick look at the pound, which has edged down after US inflation rose to 3.4pc in December. Sterling was down 0.2pc against the dollar to $1.27 in a sign that markets are being cautious that the US Federal Reserve may not cut interest rates as fast as had been hoped. The pound is flat against the euro at 86p. Microsoft briefly topped Apple as the world’s largest company as the two tech giants go head to head in the race to develop artificial intelligence (AI). Microsoft’s market capitalisation touched $2.875trillion in early trading, overtaking Apple as its share price rose 2.1pc. It comes as Wall Street has recently sounded the alarm on Apple’s business in China, sending the company’s shares sliding by 4.8pc over the last month. Meanwhile, Microsoft has been riding the wave of optimism about the development of AI, becoming the largest backer of ChatGPT maker OpenAI. Its share price has risen 63pc over the last year to $383.56. The S&P 500 briefly rose above its record closing high as investors were unfazed by data showing inflation ticking higher in December. The benchmark index went up to 4,798.50 points earlier in the session, breaching its record closing high of 4,796.56, hit in January 2022. It was last up 6.84 points, or 0.1pc, at 4,790.29. The partners of the Odey Asset Management hedge fund, which is winding up after its founder was accused of misconduct, are to share nearly £64m for its final year of operations. Odey AM said the amount of profit that will be distributed between its 11 members had grown from £18.8m in the year to the end of April 2022 to £63.9m the following year. This will be split between the members, although not evenly. One member will be entitled to £28.6m on their own. The company spent £17.6m paying its 29 members of staff during the period, results posted to Companies House reveal. The accounts also show that Odey AM’s funds under management had grown to $4.4bn (£3.5bn) in April 2023 from $3.8bn (£3bn) a year later. It will be the last full year for Odey Asset Management, which is set to close down after a series of allegations against its founder, Crispin Odey. Mr Odey has for years faced allegations of sexual misconduct, and in 2021 was found not guilty in a court case which accused him of indecent assault that allegedly happened in 1998. But in June the Financial Times and Tortoise Media said they had spoken to 13 women who alleged they were abused or harassed by the fund manager. US markets gained at the opening bell as investor nerves were calmed by underlying prices rising more slowly despite an overall increase in inflation. The tech-heavy Nasdaq Composite gained 0.5pc to 15,046.25 while the benchmark S&P 500 rose 0.2pc to 4,794.98. The Dow Jones Industrial Average of 30 leading US companies edged up 0.1pc to 37,726.21. Car rental giant Hertz plans to sell a third of its US electric vehicle fleet and reinvest in petrol powered cars amid weak demand for battery-powered automotives. The company began selling 20,000 EVs last month and will continue throughout this year as customers demanded combustion engine vehicles and amid the high costs of repairs. Hertz expects to take a $245m (£192m) hit in its fourth quarter results from the sales  - in a dramatic reversal after announcing plans in 2021 to buy 100,000 Teslas. The update to shareholders said: “The company expects to reinvest a portion of the proceeds from the sale of EVs into the purchase of internal combustion engine vehicles to meet customer demand.” Hertz said it “expects this action to better balance supply against expected demand of EVs.” The number of Americans applying for unemployment benefits inched down to its lowest level in nearly three months last week as the US jobs market continues to flex its muscle in spite of elevated interest rates. Jobless claim applications fell to 202,000 for the week ending January 6, down by 1,000 from the previous week, the Labor Department reported. The four-week average of claims, which evens out some of the week-to-week volatility, ticked down by 250 to 207,750. Weekly unemployment claims are a proxy for layoffs. They have remained at extraordinarily low levels in the face of high interest rates and elevated inflation. In an effort to stomp out the four-decade high inflation that took hold after an unusually strong economic rebound from the Covid recession of 2020, the Federal Reserve raised its benchmark rate 11 times since March of 2022. Although inflation has eased considerably in the past year, the Labor Department reported said that overall prices rose 3.4pc from 12 months earlier, a sign that the Fed’s drive to slow inflation to its 2pc target will likely remain a bumpy one. Tough to view this morning's jobless claims data as anything but strong, but still worth highlighting the elevated noise around the turn of the year...I had expected some of the prior week's massive move lower in initial claims to unwind but instead it actually moved further… pic.twitter.com/8o7EJvDnrZ Financial markets “will remain chopping” until interest rate cuts come into view, analysts have said, after US inflation  ticked higher to 3.4pc last month. Lindsay James, investment strategist at Quilter Investors, said: While inflation was always expected to tick up and bounce around at this level for a period, this data print will be a warning to financial markets that have been punchy in the scale of rate cuts expected this year. Three rate cuts signalled by the Fed is looking increasingly more likely. In particular housing appears to have been a large contributor to this print and suggests the rise is not just the impact of base effects. This is partly driven by a lack of housing supply driving up prices and rents, with most US homeowners in reality having seen little change to housing costs which are typically on long term fixed rate mortgages. While you cannot read too much into a data point in isolation, the possibility of rate cuts in the first half of the year is looking increasingly stretched. The US economy continues to prove resilient and while the Fed won’t want to act too late on rate cuts given the lag effect, they will also be worried about causing a fresh bout of inflation given the US consumer and corporate America is holding up well. It is not going to be easy to get back to the magic 2pc inflation target and thus market volatility is likely to remain elevated for the time being. Compared to December, this month has seen a lacklustre start from stock markets and uncertainty is only going to fuel that. Until rate cuts come further into view markets will remain choppy. Analysts seem to think that the slight uptick in US inflation will not change the overall downward trend in the long run - and thus not impact the Federal Reserve’s thinking on the timing of cutting interest rates: 🇺🇸 Dis-#inflation momentum still strong despite headline bumpiness📉Headline #CPI inflation +0.3ppt to 3.4% ✅Energy driven bumpiness ✅5.7pt below Jun '22 high📉Core #CPI -0.1ppt at 3.9% ✅Low since May '21 ✅2.7pt below Sep '22 high pic.twitter.com/tvZm1eiF3o ⚠️ Hot but not so hot US CPI report (Goldilocks). Only 42% of the basket saw >0.2% MoM inflation... these happen to be weighted more (services/housing). But not the type of hot CPI that drove aggressive Fed hikes. Bar for Mar Fed cut got a bit higher... $USD shorts most offsides pic.twitter.com/CUCneLdaj1 The US #inflation numbers, while (very slightly) hotter than the consensus forecasts, will neither change the dominant market narrative nor the policy one.This is, however, a bit of a warning shot, especially given that the dis-inflationary process gets harder from here.… After US inflation increased more than expected to 3.4pc in December, Charles Schwab UK managing director Richard Flynn, said: Today’s figures show an increase in the rate of inflation – a change that will likely be interpreted by the market as unwelcome, but unsurprising. Recent higher than expected earnings growth set alarm bells ringing for many investors who are hoping for interest rate cuts. While strong activity in the jobs market is a sign of a healthy economy and is good for workers, it can also be a contributing factor to inflation, so this likely played into the price rises we have seen today. Inflation figures in recent months have been promising and a single number is not a trend, but if today’s report is the start of an upward pattern, there is a good chance that the Fed will delay rate cuts until later than previously expected. It looks like the market may have jumped the gun in pencilling in as many as six Federal Reserve rate cuts in 2024. Futures tracking Wall Street’s main indexes turned negative as stronger-than-expected consumer inflation dampened expectations of an early start to interest-rate cuts. The consumer prices index (CPI) rose 3.4pc in December on a yearly basis versus a 3.2pc increase expected by economists. Core CPI, excluding volatile items like food and energy, rose 3.9pc year-on-year versus expectations of a 3.8pc increase. A separate report showed jobless claims rose to 202,000 in the week ended January 6 compared with an expected 210,000 increase. In premarket trading, the Dow Jones Industrial Average was down 76 points, or 0.2pc, the S&P 500 was down 10 points, or 0.2pc, and Nasdaq 100 e-minis were down 19.5 points, or 0.1pc. US inflation slightly rose more than expected last month but underlying price rises continued to slow down in a boost to hopes for interest rate cuts by the Federal Reserve. The consumer prices index increased to 3.4pc from 3.1pc in November, according to the US Bureau of Labor Statistics, which was ahead of analyst expectations of a rise to 3.2pc. However, core inflation, which excludes volatile food and energy prices, edged down further from 4pc to 3.9pc.  Former Jigsaw boss Peter Ruis has been appointed to lead the John Lewis department store business. The John Lewis Partnership said Mr Ruis is set to become executive director of the John Lewis business from the start of next week. Mr Ruis, who was previously the fashion retail buyer for the group, was most recently chief executive officer of book and lifestyle retailer Indigo in Canada. It also confirmed that Naomi Simcock, who had been leading the fashion and homeware specialist on an interim basis, will take up a new role as operations director for John Lewis. Elections in both the UK and US this year will cast a shadow over the stock market and risk delaying a rebound in listings until 2025, EY has warned. Our professional services reporter Adam Mawardi has the latest: Investor uncertainty around the election results may force businesses to delay initial public offering (IPO) plans until the outcomes are clearer, according to a report by EY. That would push many listings into 2025, with Rishi Sunak signalling he plans to hold an autumn election in Britain and US voters going to the polls in November. Scott McCubbin, who leads EY’s UK and Ireland IPO team, said: “The stability of equity markets hinges on consistent conditions, so whilst falling inflation and interest rate reductions may ease in the first half of 2024, the upcoming UK and US elections in the latter half might delay significant IPO activities until 2025.” Read how the forecast suggests another lean year for London. Bitcoin will leap above $100,000 this year, economists have said, after US regulators approved wider trading for the cryptocurrency. The Securities and Exchange Commission late on Wednesday gave the green light to the first exchange-traded funds (ETFs) to track bitcoin on Wall Street, allowing investors to gain exposure to the digital token’s price movements without owning the volatile commodity. Though long-expected, the green light marks a watershed moment for the world’s best known cryptocurrency, with most of the new funds expected to begin trading today. The price of bitcoin has risen more than 160pc over the last year and was up 1.2pc today to $47,229.50 (£36,999.12) following the approval. Standard Chartered’s head of digital assets research Geoff Kendrick has estimated the approval, along with bitcoin’s ‘halving’ in April, which cuts the currency’s supply and historically kick-starts price rises, could send it to $100,000 (£78,300) by the end of the year. He added: “If ETF-related inflows materialise as we expect, we think an end-2025 level closer to $200,000 is possible.” Workers employed by Fujitsu Services are to take strike action later this month in a dispute over pay. Around 300 members of the Public and Commercial Services union (PCS) working mainly for HM Revenue & Customs (HMRC) in Stratford-on-Avon and Telford will walk out on Wednesday, January 17. The union said they have been offered a pay rise of between 3pc and 4pc, almost 10 times less than their Japanese counterparts. Some members working in IT roles will be taking additional action from Thursday January 18 to Thursday February 15. The PCS said the industrial action is likely to disrupt those seeking to complete their self-assessment tax returns by the end of the month. Workers involved in the dispute have nothing to do with the Post Office Horizon scandal, which has seen calls for Fujitsu to lose UK Government contracts. PCS general secretary Mark Serwotka said: “Why is the UK Government giving Fujitsu lucrative contracts when the company treats its UK workers so badly? “Why is it workers in Japan are deemed worthy of a pay rise almost 10 times more than those in the UK?” Carol Vorderman has said she will be “using my voice to cause a commotion” as it was announced she is joining LBC to front a new Sunday programme. The news comes two months after the former Countdown star left her BBC radio show saying she was “not prepared to lose my voice” after the corporation introduced new social media guidelines. Vorderman has been vocal in her criticism of the Government on social media and has had several arguments on X, formerly Twitter, with Tory MPs. She said management had decided she should give up her Saturday morning show on BBC Radio Wales over a breach of the guidelines. She will now host her own Sunday afternoon programme on LBC from 4pm to 7pm. Wall Street markets edged higher in premarket trading ahead of a consumer inflation figures that could test hopes of an early start to interest-rate cuts. The benchmark S&P 500 has recovered nearly 17pc from its October lows, gaining steam in December after the Federal Reserve hinted it was reining in inflation and rate cuts were “coming into view”. The index is now a hair’s breadth away from its record closing high of 4796.56, hit in early January 2022. Market attention is focused on the December consumer price index (CPI) report, due at 1.30pm UK time, which could help traders assess the timing of the Fed’s monetary policy easing. Money markets see a 68.8pc chance the central bank will deliver its first rate cut of at least 25 basis points in March and a 95.6pc probability of another reduction in May, despite recent pushback from policymakers. Meanwhile, crypto stocks have risen after regulatory approval for exchange-traded funds tracking bitcoin. In premarket trading, the Dow Jones Industrial Average was flat, the S&P 500 was up 0.1pc and the Nasdaq 100 had risen 0.3pc. Large music venues should have to pay towards the cost of supporting smaller ones to help “produce the superstars of tomorrow”, a Conservative former minister has said. Ashford MP Damian Green told the Commons: Across the country... in 2023 live music boomed, 22 million people attended gigs, and yet 76 small venues closed. More than one a week. So I draw her (the culture minister’s) attention to the analogy with another hugely successful leisure industry - football, where a small amount of the enormous riches gained by the Premier League actually is allowed to trickle down to the grassroots so that the future of the sport is preserved. Just as in that we have hugely profitable large arenas, where the superstars of today perform, and create huge revenues. A levy on the tickets from those sorts of shows... would actually help the small venues produce the superstars of tomorrow. Culture minister Julia Lopez replied: “We agree with the importance of grassroots music and that is why we have given another £5m to the Supporting Grassroots Music fund, but we are also in touch with the Music Venue Trust. “They have a great initiative - Own Our Venues - where the Arts Council is supporting buying some of the freehold of grassroots music venues. Again, we support that. “But we think there is a larger amount of scope for the industry to lead a solution in this area, and we are supporting talks between different parts of that industry.” Fewer big money prizes will be available in NS&I’s Premium Bonds prize draw from March as the Treasury adjusts to falling interest rates. Savings giant NS&I said the prize fund rate will be reduced, from 4.65pc to 4.4pc from the March 2024 draw. The changes will mean that an estimated 85 prizes of £100,000 will be up for grabs in March, down from 91 in January, although the odds of any £1 Premium Bond number winning a prize will remain the same, at 21,000 to one. Laura Suter, director of personal finance at AJ Bell, said: This is the biggest sign yet that the rates bonanza enjoyed by savers is coming to an end. This rate cut marks the end of 18 months of Premium Bond prize fund increases from NS&I. The Government-backed provider has been increasing the prize fund on Premium Bonds consistently since 2022 as base rate rose and the saving war heated up. But that has reached its peak. Read on for details. The owner of Premier Inn has said it has continued to do better than its low-cost rivals as demand for hotel rooms in London and across the UK stayed strong. Whitbread told investors it was outperforming other brands in the midscale and economy sector, referring to more affordable hotels. Total accommodation sales in the UK rose by 11pc in the three months to the end of November, compared with the same period a year before. And revenue per available room for Premier Inn UK, an important measure for hotels of sales performance and how many rooms are being filled, was up 9pc year on year. Chief executive Dominic Paul said this was achieved because of “high levels of occupancy and strong pricing” across its more than 800 Premier Inn hotel rooms in the UK. The average room rate was £82.30 in the latest quarter, down from £90.01 over the previous three months. In London, average prices were considerably higher at £115.78. Whitbread, which also owns food brands including Beefeater and Bar + Block, also revealed that food and beverage sales grew by 6pc year on year. Whitbread shares have gained 3.2pc today. An oil tanker involved in a dispute between the US and Iran was boarded by armed guards east of Oman and appeared to be changing course towards Iranian waters, authorities have reported. British maritime security company Ambrey said the Marshall Islands-flagged tanker’s AIS tracking system was turned off as it headed in the direction of the Iranian port of Bandar e-Jask at the time it made the report. The ship, which loaded in the Iraqi port of Basra, and was heading to Aliaga in western Turkey, tracking data from LSEG showed. While Ambrey did not name the vessel, shipping tracking service TankerTrackers said the vessel was the St Nikolas, which in 2023 had been seized by the United States in a sanctions enforcement operation under a different name, Suez Rajan. The United States said at the time that Iran’s Islamic Revolutionary Guard Corps (IRGC) had been trying to send Iranian oil to China, in violation of US sanctions. The United Kingdom Maritime Trade Operations (UKMTO) authority said today it had received a report that a vessel located around 50 nautical miles east of Oman’s coast was boarded by four to five armed persons. The armed intruders were reported to be wearing military style black uniforms and black masks. UKMTO said the chief security officer reported the vessel had altered course towards Iranian territorial waters and that communication with the tanker had been lost. The former chief executive of Sanjeev Gupta-linked Wyelands Bank has been fined nearly £119,000 by the Bank of England. The Bank said that Iain Mark Hunter did not act with “due skill, care and diligence” to take reasonable steps to ensure that Wyelands had proper systems and controls in place. The Bank had previously said that Wyelands was far too exposed to Mr Gupta’s business empire, which includes Liberty Steel. Sam Woods, chief executive of the Bank’s Prudential Regulation Authority, said: If senior individuals fail to meet the conduct rules, as Mr Hunter did, it undermines the trust in financial institutions and the wider financial system. Mr Hunter failed to take reasonable steps to ensure that large exposures risks relating to Wyelands’ business were appropriately identified and mitigated, and failed to take appropriate steps to verify the accuracy of statements he made to the PRA. The number of shipping vessels travelling through the Red Sea fell by more than half last month as attacks by Houthi rebels intensified. Only around 200,000  containers per day travelled through the vital trade route, compared to around 500,000 containers in November, according to the Kiel Institute for the World Economy. The current volume is 66pc below the levels expected, as vessels instead sail around South Africa and the Cape of Good Hope, a detour that takes seven to 20 days longer. Update #KielTradeIndicator: The number of containers shipped in the Red Sea fell drastically by more than half in December. The volume was only around 200,000 containers per day, compared to around 500,000 containers in November. This means that the current volume is 66… pic.twitter.com/blwR9iDrfn Wholesale gas prices have dropped despite the cold weather front sweeping the UK and Europe amid high levels of supply in storage sites. The benchmark European contract declined as much as 2.7pc toward €30 per megawatt hour, while the UK equivalent slumped 2.6pc to around 75p per therm. Europe amassed record amounts of gas in storage last year in response to rocketing prices caused by Vladimir Putin’s cutting off of Russian supplies after his decision to invade Ukraine in 2022. Icy temperatures are expected to remain in the UK, France and Germany well into next week, increasing demand for heating. The boss of shipping giant Maersk has warned that the disruption to shipping travelling through the Red Sea could last for months, raising fears that prices could rise on shop shelves. The Danish shipping giant’s chief executive Vincent Clerc said the closure of the vital shipping route to most vessels after a series of attacks was “brutal and dramatic”. Ships have been travelling around the southern tip of Africa rather than using the vital trade route linking the Arabian Sea with the Mediterranean after attacks on vessels by Houthi rebels from Yemen. Mr Clerc said there were “no winners” as vessels are forced to take a lengthy and costly detour. He told the Financial Times: It’s unclear to us if we are talking about re-establishing safe passage into [the] Red Sea in a matter of days, weeks or months. It could potentially have quite significant consequences on global growth. Taylor Wimpey sold nearly a quarter fewer homes last year as buyers grappled with unaffordable mortgage rates. The house builder sold 10,848 homes in 2023, ahead of its previous guidance of as many as 10,500 for the year but still below the 14,154 completions in 2022. The developer said it expects full-year operating profit to be at the top end of its guidance range of as high as £470m. It said it had received “good levels” of inquiries so far this year but shares were down 0.7pc in early trading. Chief Executive Officer Jennie Daly said: Looking ahead, it is encouraging to see a reduction in mortgage rates. We remain confident in the attractive medium and long term fundamentals of the sector. Retailer Boohoo has been found to have mislabelled items of clothing made in South Asia as “Made in the UK”, according to the BBC. The company removed the original labels on T-shirts and hoodies at the retailer’s controversial factory at Thurmaston Lane in Leicester between January and October last year, a Panorama investigation found. A spokesman for Boohoo said: This was an isolated incident, which impacted less than 1pc of the group’s global garments intake. These errors were found to be the result of human error and we have taken steps to ensure this does not happen again. Boohoo is considering closing its Leicester factory and relocating operations. The company said fewer than 100 employees at the Thurmaston Lane factory may be affected by the closure and it expects “some roles will be relocated”. The boss of Tesco has warned that the disruption to shipping in the Red Sea could send prices higher. Ships have been travelling around the southern tip of Africa rather than using the vital trade route linking the Arabian Sea with the Mediterranean after attacks on vessels by Houthi rebels from Yemen. Ken Murphy said: If they do have to go the whole way around Africa to get to Europe, it extends shipping times, it constrains shipping space and it drives up shipping costs. So that could drive inflation on some items, but we just don’t know. It comes after Sainsbury’s boss Simon Roberts said that his supermarket is working closely with the Government to mitigate the effects of the unrest in the Red Sea. Britain is to build a new nuclear power station with the capacity to power as many as six million homes under plans to boost energy security and hit net zero targets. Our energy editor Jonathan Leake has the details: Claire Coutinho, the Energy Secretary, heralded the plans as “the biggest expansion in nuclear power for 70 years” as she set out a raft of other measures in the Government’s long-awaited Nuclear Roadmap. Plans for a new full-scale nuclear power plant supplement the two already under development: Hinkley Point C, which is under construction in Somerset; and Sizewell C, planned for Suffolk. The new station would be similar in size to these existing projects, with plans for several more plants to follow before 2050. Read on for details about the scale of the plan and why Labour has criticised it. Google will lay off hundreds of staff in its digital assistant, hardware and engineering teams as the tech giant tries to cut costs in the face of competition from artificial intelligence. Staff working on its voice-based Google Assistant are among those affected as the business takes on rival artificial-intelligence offerings from Microsoft and ChatGPT-creator OpenAI. It comes after Google’s parent company Alphabet said in January last year that it would cut about 12,000 jobs, more than 6pc of its global workforce. Google executives told investors that they will scrutinise operations to identify areas where cuts can be made to free up resources to invest in its biggest priorities. A Google spokesman said: Throughout the second half of 2023, a number of our teams made changes to become more efficient and work better, and to align their resources to their biggest product priorities. Some teams are continuing to make these kinds of organisational changes, which include some role eliminations globally. Britain’s main stock indexes climbed as industrial metal miners tracked commodity prices higher. The blue-chip FTSE 100 was up 0.5pc and the midcap FTSE 250 index climbed 0.4pc. Industrial metal miners gained the most among sectors, with a jump of a much as 1.8pc, as prices of base metals like copper and nickel rose on a softer dollar and Chinese government support for the yuan. Chilean copper miner Antofagasta rose 3,6pc to the top of the FTSE 100, while Anglo American gained 2.1pc. Shares of Tesco rose 1pc after Britain’s biggest retailer upgraded its profit outlook for the second time in four months. Tesco reported a better-than-expected rise in underlying UK sales for the key Christmas trading period. Marks & Spencer slipped 5pc to the bottom of the FTSE 100 even as the British retailer reported a better-than-expected jump in like-for-like sales over the Christmas trading period. WPP fell as much as 2.1pc as it is considering the sale of its 40pc stake in Kantar, which could be valued at up to $8bn (£6.3bn) including debt. Investors will later focus on the latest US inflation data for December, due at 1.30pm UK time, to gauge how soon the Fed will start its monetary policy easing, which could influence interest rates globally. Marks & Spencer has slumped to the bottom of the FTSE 100 as traders considered the potential impact of the disruption in the Red Sea on the high street bellwether. Shares have slumped by 5pc after M&S reported international sales were down 6.4pc, largely driven by the planned timing of franchise shipments in the Middle East and Asia and more challenging market conditions in India. The company added: “As we enter the new year and FY25, expectations for economic growth remain uncertain, with consumer and geopolitical risks.” Shipping in the Red Sea has been affected by attacks from Houthi rebels which has forced most major shipping companies to redirect vessels to the longer route around the southern tip of Africa. International sales only made up around 7.5pc of total M&S sales over in the last three months of 2023 at £288m, compared to £2.3bn of food sales, which was up 10.5pc, and £1.2bn of home and clothing sales, which were up 4.8pc. UK markets gained at the open as investors gear up for the release of US inflation data that could have a huge bearing on the Federal Reserve’s timetable for cutting interest rates. The FTSE 100 gained 0.4pc to 7,679.03 while the midcap FTSE 250 rose 19,304.47. However, Marks & Spencer shares dropped 4.8pc as markets opened following its sales report on the last three months of 2023. Real estate investment trust LondonMetric Property has agreed to take over rival UK landlord LXI REIT in a deal valuing the business at £1.9bn. The all-share merger, which has been recommended by both companies’ boards, is the latest in a series of tie-ups by publicly traded UK landlords as they look to increase scale. Commercial property landlord LondonMetric’s management will take over the management of LXI’s portfolio, which includes a series of buildings used by Travelodge, Beefeater, Aldi and Lidl. LondonMetric chief executive Andrew Jones said: In the world of income compounding, bigger is better and the deal will deliver economies of scale, substantial cost savings, better liquidity and improved terms in both debt and equity markets which will drive accelerated earnings and dividend progression. Increased scale will allow us to look at the widest possible range of opportunities and we will have more tools at our disposal to carry on our trade, which will allow further operating synergies. Marks & Spencer has said it starts 2024 with a “spring in our step” after sales jumped over Christmas and its food halls saw a record number of shoppers. The high street stalwart said like-for-like sales lifted 9.9pc across its food arm, while comparable store sales were 4.8pc higher in its clothing and home division in the quarter to December 30. The group said more than 9,200 staff, most customer service workers, are set to benefit from bumper payouts in February under its share save scheme thanks to its performance on the stock market driven by impressive trading. An employee saving a typical £150 a month into the scheme will gain more than £10,000, according to the group. Stuart Machin, chief executive of M&S, said: “We enter 2024 with a spring in our step, but clear eyed on the near-term challenges.” The group’s updated to shareholders added a note of caution over the outlook: As we enter the new year and 2024-25, expectations for economic growth remain uncertain, with consumer and geopolitical risks. We also face additional cost increases from higher than anticipated wage and business rates related cost inflation. Nevertheless, the strong Christmas trading performance provides confidence that the results for the year will be consistent with market expectations. Tesco has said it is on track for bigger-than-expected profits this year after record sales over Christmas. Bosses at the supermarket giant said its growth was boosted by investment to keep prices low, as it has sought to stop shoppers switching to fast-growing German discount rivals Aldi and Lidl. The retailer said it has cut “nearly 2,700 prices” as part of this strategy to attract customers who have faced a surge in the cost of living. On Tuesday, Tesco said like-for-like retail sales across the group rose by 6pc over the six weeks to January 2024, compared with the same period a year earlier. In the UK, sales across it stores grew by 6.8pc over the Christmas period, with the company hailing a sharp rise in demand for its Finest premium range of food and drink products. It came as the company also reported that like-for-like retail sales grew by 6.6pc over the previous 13 weeks, the quarter to November 25, as it was boosted by strong growth in its UK and Ireland shops. Tesco said it now expects a retail-adjusted operating profit of £2.75bn for the year, up from a previous range of between £2.6bn and £2.7bn. Chief executive Ken Murphy said: The Tesco team has worked harder than ever to help customers celebrate this Christmas, with our strongest ever range of great value, fantastic quality food. Our powerful combination of great value, quality, availability and service means that we head into the new year in great shape to keep delivering for customers. Robert Walters has axed hundreds of staff as it battles a slowdown in hiring around the world. The recruitment consultancy said it had axed about 220 roles in the last three months of last year, taking its total headcount down to 3,980. The company reported a 13pc slowdown in fee income to £91.4m as companies around the world have had their hiring plans derailed by higher interest rates. Chief executive Toby Fowlston said: “Despite the challenging macro-economic conditions, the group has delivered a resilient fourth quarter and FY23 profit before tax will be in-line with market expectations.” Robert Walters’ struggles comes as Britain finds itself in the grip of the longest slump in jobs vacancies on record as higher interest rates knock the labour market. A total of 949,000 positions were advertised in the three months to November, according to the Office for National Statistics (ONS), which was down almost a quarter of a million from the number of posts advertised a year ago. Rival recruiter Hays announced on Tuesday it had axed 650 jobs across its workforce as it tried to offset what it called a “clear slowdown” in the labour market. 1) American regulator approves Bitcoin funds but warns of risks | Investors should remain cautious about Bitcoin’s dangers, the regulator’s chairman has said 2) The bond vigilantes who could punish Britain’s debt binge | ‘The kindness of strangers’ is set to play a decisive role as a general election looms 3) M&S to edge Waitrose in battle of the middle-class supermarkets | Strong festive sales puts grocer on track to overtake rival 4) Channel 5-owner is takeover target for Silicon Valley billionaire’s heir | A deal would scupper a mega-merger being discussed between Warner Bros and Paramount 5) Claire Coutinho vows to build nuclear energy plant to power six million homes | Energy Secretary heralds ‘biggest expansion’ for 70 years after setting out roadmap Asian stocks rose ahead of US inflation data that could influence the Federal Reserve’s thinking on rate cuts, while the crypto world got a boost after exchange-traded funds (ETFs) to track bitcoin were approved in the United States. Japan’s Nikkei breached 35,000 for the first time since February 1990 in a blistering start to the year, after rising 28pc in 2023, its strongest yearly performance in a decade. The Nikkei closed up 1.8pc, or 608.14 points, to 35,049.86 while the broader Topix index added 1.6pc, or 38.39 points to 2,482.87. Hong Kong, Shanghai, Sydney, Seoul, Singapore, Taipei, Manila and Jakarta were also well up. In the US, the Dow Jones Industrial Average of 30 top American companies rose 0.45pc, to 37,695.73, while the S&P 500 gained 0.57pc, closing at 4,783.45. The tech-laden Nasdaq Composite index added 0.75pc, reaching 14,969.65. The yield on benchmark 10-year US Treasury bonds advanced one basis point to 4.03pc. "
}