{
    "title": "Apple stock faces three downgrades, but not everyone is down on the company",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/news/apple-stock-faces-three-downgrades-but-not-everyone-is-down-on-the-company-192846428.html",
    "text": "Apple (AAPL) is having anything but a happy new year, as the company’s stock was hit with its third downgrade in less than two weeks on Wednesday. The latest sting comes from Redburn Atlantic’s James Cordwell, who lowered the stock’s rating to Neutral while keeping its price target at $200, on fears of slowing iPhone sales and the potential for regulatory headwinds. Barclays and Piper Sandler also issued downgrades on Apple’s stock, last week, with Barclays' Tim Long rerating the stock from Equal Weight to Underweight and lowering its price target from $161 to $160. Piper Sandler’s Harsh Kumar, meanwhile, downgraded Apple’s stock to Neutral. Shares of the tech giant have fallen roughly 4% in the first few days of 2024, as of Wednesday afternoon. Shares of Apple’s Big Tech peers, including Microsoft (MSFT), Google (GOOG, GOOGL), and Meta (META), on the other hand, are up 1.9%, 2.2%, and 4.9%, respectively. In general, Redburn Atlantic, Barclays, and Piper Sandler point to potential weakness across Apple’s iPhone and services segment. Barclays' Long and Piper Sandler’s Kumar both point to China as a major concern, with Long saying that Barclays' latest checks show incrementally worse iPhone 15 data points out of the region, and Kumar citing China’s deteriorating macro environment. Greater China is Apple’s third-largest revenue driver behind North America and Europe. In 2023, the area accounted for $72.6 billion of the company’s $383.3 billion in total revenue. According to Long, while Apple should report December quarter revenue in line with market expectations, the company will report March revenue below the market consensus. Kumar, for his part, says negative news surrounding the ongoing Apple Watch patent controversy and antitrust fights could prove to be problematic for Apple moving forward. But Wall Street isn’t entirely down on the iPhone maker. Of the 53 analysts tracking Apple, 32 maintain Buy ratings, while 16 have Hold ratings. Just five analysts have Sell ratings on the stock. Evercore ISI’s Amit Daryanani reiterated his Outperform rating on Apple with a price target of $220, saying that now might be the time to buy the dip in the company’s stock price. And while he admits Apple Watch bans are problematic and Apple’s multibillion-dollar agreement to make Google the default search engine in Safari might be at risk, there are more positives than negatives to Apple’s story. “As some of the fears abate and we shift to a more positive news flow (Vision Pro), [Apple] could start to re-rate in a more positive manner,” Daryanani wrote. Morgan Stanley’s Erik Woodring says that Apple’s 2024 could offer a big lift for the company. “We believe that not only are fundamentals on the path to recovery (albeit with some near-term unevenness), but more importantly, 2024 will be the year when Apple's 'Edge AI' opportunity likely comes to fruition, highlighted by an LLM-powered Siri 2.0 and a broader Gen AI-enabled operating system (introduced at WWDC in June) that has the potential to catalyze an iPhone upgrade cycle,” he wrote in a note to investors. Apple hasn’t specifically announced a generative AI offering, instead focusing on machine learning to improve the accuracy of its autocomplete feature. But the company is reportedly hard at work integrating the technology into its future products. Apple could also stand to benefit from an expected resurgence in laptop and desktop sales, as consumers who purchased computers at the start of the pandemic begin to seek out newer, faster systems. All of this comes as Apple prepares to launch its $3,499 Vision Pro spatial computing headset in February. Preorders for the device start Jan. 19. Apple’s first new product category in nearly a decade, the Vision Pro is expected to get off to a slow sales start as a result of its relatively high price. And depending on how the Vision Pro roll out goes, Apple could drive a significant amount of interest in the headset among both consumers and enterprise users. No, most people won’t be able to afford the Vision Pro out of the gate, but even creating buzz around the product could benefit Apple’s stock price. With the Vision Pro launch just a few short weeks away, we won’t have to wait long to see if Apple’s slow start to 2024 is a fluke or long-term trend. Daniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}