{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.wionews.com/business-economy/microsoft-takes-apples-crown-becomes-worlds-most-valuable-company-679150",
    "text": "On Thursday, a boost of 0.7 per cent made Microsoft get a market value of USD 2.865 trillion. Increase in stock price touched the 2 per cent mark giving the tech giant market value of USD 2.903 trillion. Apple's shares were 0.9 per cent lower. And this gave it market capitalisation of USD 2.871 trillion Microsoft on Thursday (January 11) dethroned Apple as the world's most valuable company, albeit briefly. Microsoft pulled it off for the first time since 2021. Apple stocks haven't had a good start in the new year. Microsoft shares have gotten a boost since last year after the company's early lead in generative artificial intelligence when it invested in ChatGPT-maker OpenAI. On Thursday, a boost of 0.7 per cent made Microsoft get a market value of USD 2.865 trillion. The increase in stock price touched the two per cent mark giving the tech giant a market value of USD 2.903 trillion. Apple's shares were 0.9 per cent lower. This gave it a market capitalisation of USD 2.871 trillion. Watch | 2024 will be the Year of Microsoft Copilot \"It was inevitable that Microsoft would overtake Apple since Microsoft is growing faster and has more to benefit from the generative AI revolution,\" said Gil Luria, an analyst at DA Davidson as quoted by Reuters. Microsoft has been quick to incorporate OpenAI's tech in its software. This has resulted in a rebound in its cloud-computing business. At the same time, Apple is facing a slump in demand for its devices, including the iPhone. The iPhone is a major revenue earner for Apple. As China makes a slow recovery from pandemic years, demand in this key market has gone down. A resurgent Huawei is likely to compete with Apple for market share in the country. \"China could be a drag on performance over the coming years,\" brokerage Redburn Atlantic said in a client note on Wednesday. It has downgraded Apple's shares to \"neutral\". Also Read | AI's double-edged sword: Technology making hacking easy for non-tech-savvy people, warn US officials In this month alone, Apple shares have fallen 3.3 per cent while Microsoft's have risen 1.8 per cent. Apple's market capitalisation peaked at USD 3.081 trillion on December 14 last year. Microsoft has overtaken Apple with respect to market value several times since 2018. In 2021, Apple stocks were hit because of Covid-driven concerns about supply chains. Also Read | An AI marketplace? OpenAI launches GPT Store for buying and selling customised chatbots The mood on Wall Street is positive about Microsoft. Reuters has reported that almost 90 per cent of the brokerages which cover Microsoft are recommending buying the stock. (With inputs from agencies) "
}