{
    "title": "Is Apple Stock a Buy?",
    "date": "1/5/2024",
    "url": "https://www.fool.com/investing/2024/01/05/is-apple-stock-a-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Apple (AAPL -1.06%) has been rewarding investors' faith for years. The stock is up 435% over the past five years, including a 46% rise in 2023 as one of the \"Magnificent Seven\" stocks that contributed such a large share of the major market indexes' gains last year. But Apple stock has cooled off in early 2024. Just a few trading sessions into the new year, its shares have already slipped by more than 3%. Is this a buy-the-dip opportunity for a proven winner, or could this be the beginning of a long year for shareholders? A big clue to the answer can be found in the company's fundamentals. Often, what the market is willing to pay for a stock depends heavily on how much growth the underlying business can deliver. Apple's price-to-earnings (P/E) ratio and analysts' expectations about long-term earnings growth tend to follow each other. In other words, investors pay up for the stock when they expect good things in the future.  AAPL PE Ratio data by YCharts. These lines began diverging from each other in early 2023. Remember, the stock rose tremendously last year, but analysts have become increasingly pessimistic about Apple's future earnings growth. These gulfs between valuation and market expectations generally don't last, because they indicate that someone is wrong. Either analysts are too pessimistic about Apple's future, or the market's expectations are too high. Eventually, it will become clear which side has it right. The potential risk in buying Apple stock today is that you'll turn out to be on the wrong side of this gap. Though it's a $3 trillion company, Apple's business is fairly simple. The company sells a line of hardware products, headlined by the iPhone. It also sells various subscription services for cloud storage, video, news, games, music, and more. The company's total revenue in its fiscal 2023 (which ended Sept. 30) was $383 billion. Roughly 78% of that came from products, the rest from services. Today, there are over 2 billion active Apple devices worldwide. Considering that it sells premium devices that aren't affordable for everyone, hitting 2 billion customers is pretty impressive. Nonetheless, it's seemingly getting more challenging for the company to grow. Noteworthy product updates are fewer and farther between because the smartphone is maturing nearly two decades after the first iPhone launched. Apple got a temporary boost as customers and telecoms upgraded from 4G networks; it launched its first 5G model in late 2020. But its revenues have roughly flattened over the past two years. Much of Apple's user base has newer models now (most phone installment plans run from 12 to 24 months).  AAPL Revenue (TTM) data by YCharts. There might not be another company that generates as much free cash flow as Apple -- just under $100 billion over the past year. Apple has primarily aimed that cash-flow cannon at its own stock, feverishly repurchasing shares to boost its earnings per share. The number of shares outstanding has fallen by more than 17% over the past five years. Management leaned on Apple's balance sheet to do this, occasionally using debt to help fund repurchases. While Apple is rock-solid financially, it carries $111 billion in long-term debt on its balance sheet -- a net debt of roughly $50 billion once you subtract its $61 billion in cash. Repurchases likely won't stop, but they could slow. Adding more debt wouldn't be good for Apple's long-term health and isn't a sustainable way to operate. Nobody knows for sure where a stock will trade tomorrow, next month, or even next year. However, a company's fundamentals can indicate to investors what direction it may eventually go. Investing sometimes boils down to making the best educated guess you can with the best information you have. Even the greats aren't always correct. Apple is showing investors some clues right now. The combination of stagnant revenue growth and the potential for a slowdown in share repurchases helps explain why analysts are a bit down on Apple. The stock is trading at a P/E ratio of almost 30, which is expensive if Apple only grows earnings by 9% annually. That would give it a PEG ratio of more than 3. I consider any ratio around 1.5 or less to be a good value for a long-term investor. Consider standing on the sidelines with this stock until either one of two things happens: Apple's earnings growth exceeds expectations, or its valuation reverts to something more appropriate for a company with a slower growth rate. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}