{
    "title": "What's behind Apple's $100 billion market-cap loss today? A major downgrade \nthat has investors worried about ...",
    "date": "1/2/2024",
    "url": "https://fortune.com/2024/01/02/apple-110-billion-market-cap-loss-barclays-downgrade-iphone/",
    "text": "After surging roughly 50% to a record high in 2023, a rare rating downgrade from Wall Street helped push Apple stock down 3.65% on Tuesday, shaving over $100 billion from the tech giant’s market cap. Barclays analyst Tim Long tagged Apple with an “underweight” rating due to weak iPhone demand Tuesday morning, arguing its shares could sink roughly 13% to $160 over the next 12 months. It’s rare to see any analyst hit America’s highest-valued company with a negative rating. Apple is rated at hold or better by 40 out of 44 Wall Street forecasters, according to data provided to the Wall Street Journal by FactSet. But Long said that iPhone 15 sales have been “lackluster”—particularly in China, which has reportedly banned government officials from using Apple’s flagship product due to security concerns. He also expects sales of the iPhone 16, which is set to be released in September, to be weaker than expected. “We see no features or upgrades that are likely to make the iPhone 16 more compelling,” he wrote. While Barclays’ downgrade may have sparked Apple’s stock price drop Tuesday, there are several other factors putting the company under pressure. For one, after Apple shares jumped nearly 50% last year, investors might be reallocating some capital away from the company in the new year. “The new year brings tax-motivated postponed gain-taking and repositioning by portfolio managers,” Louis Navellier, founder and chairman of Navellier & Associates, told Bloomberg Tuesday. Apple’s decline also coincides with wider weakness in the tech-heavy Nasdaq Composite. The index sank 1.6% on Tuesday, with investors digesting the potential impact of rising geopolitical tensions amid the Israel-Hamas war and Houthi rebel attacks on ships carrying freight in the Red Sea, a critical trade route. Surging oil prices and broken supply chains because of conflict in the Middle East could lead inflation to be stickier than previously anticipated, which might force the Federal Reserve to keep interest rates high, weighing on growth-focused tech stocks. There have also been warning signs about waning iPhone demand for some time—and that’s critical given that iPhone sales made up nearly 50% of Apple’s total revenue in the third quarter of 2023. UBS analyst David Vogt, who holds a neutral rating and $190 price target for Apple, warned in a Monday note that iPhone 15 sales have been “soft” in many key regions lately, including China and India. Vogt explained that U.S. iPhone sales to end customers (called sell-through) fell almost 13% from a year ago in November, while China sales were down 6% over the same period. This led Apple to lose 50 basis points of global smartphone market share year over year in November, and 320 basis points of smartphone market share in China over the same period. “New competition is a challenge,” Vogt said of the data. Regulatory challenges to Apple’s app store in the U.S. and EU are also weighing on investor sentiment. Apple’s $85 billion services business could face pressure due to a U.S. antitrust trial that revealed, among other things, Google pays tens of billions a year to maintain its standing as the default search engine on Apple’s devices. “In 2024…some app store investigations could intensify,” Long wrote Monday, noting that the U.S. court’s decision over Google’s payments to Apple will come later this year. As Gene Munster, managing partner at Deepwater Asset Management, told the Financial Times last week, investors may have been ignoring antitrust risks in recent years, but as a number of high-profile cases wind their way through the courts, antitrust is no longer just “noise in the background.” “I think investors should take it seriously,” he warned. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}