{
    "title": "The Mac No Longer Plays a Leading Role at Apple",
    "date": "1/23/2024",
    "url": "https://www.statista.com/chart/8817/mac-sales-as-a-percentage-of-apples-revenue/",
    "text": "Industry Overview Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 100m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: 40 years ago, on January 24, 1984, Apple released its first iconic product, the Apple Macintosh (later renamed Macintosh 128K). The Macintosh was groundbreaking as it was the first mass-market all-in-one computer with a graphical user interface and a mouse. And while the Mac is still the foundation of everything that Apple later built, it no longer plays a leading role at the company it helped establish.In the fiscal year ended September 30, 2023, the company formerly known as Apple Computer generated $29.4 billion in revenue selling what it was originally named after: computers. And while that makes Apple’s Mac business of 2023 more than four times as large as it was at the turn of the century, selling laptops and desktop computers is no longer as crucial to the company's overall success as it used to be. Mac sales may have increased more than four-fold over the past two decades, but Apple’s total sales increased almost 50-fold over the same period.While the release of the first iMac in 1998 marked the beginning of Steve Jobs’ second stint at Apple and the company's return to form, the Mac line has done little more than lay the groundwork for what makes Apple the most valuable company in the world over two decades later. As the following chart illustrates, Mac computers gradually lost importance to Apple as the company introduced one blockbuster product after another (think iPod, iPhone and iPad) in the first decade of the 21st century. In 2023, Mac sales accounted for just 7.7 percent of Apple’s total revenue, down from 86 percent in 2000 and the lowest it's ever been. 40 years ago, on January 24, 1984, Apple released its first iconic product, the Apple Macintosh (later renamed Macintosh 128K). The Macintosh was groundbreaking as it was the first mass-market all-in-one computer with a graphical user interface and a mouse. And while the Mac is still the foundation of everything that Apple later built, it no longer plays a leading role at the company it helped establish. In the fiscal year ended September 30, 2023, the company formerly known as Apple Computer generated $29.4 billion in revenue selling what it was originally named after: computers. And while that makes Apple’s Mac business of 2023 more than four times as large as it was at the turn of the century, selling laptops and desktop computers is no longer as crucial to the company's overall success as it used to be. Mac sales may have increased more than four-fold over the past two decades, but Apple’s total sales increased almost 50-fold over the same period. While the release of the first iMac in 1998 marked the beginning of Steve Jobs’ second stint at Apple and the company's return to form, the Mac line has done little more than lay the groundwork for what makes Apple the most valuable company in the world over two decades later. As the following chart illustrates, Mac computers gradually lost importance to Apple as the company introduced one blockbuster product after another (think iPod, iPhone and iPad) in the first decade of the 21st century. In 2023, Mac sales accounted for just 7.7 percent of Apple’s total revenue, down from 86 percent in 2000 and the lowest it's ever been.  Description This chart shows the percentage of Apple's revenue that is accounted for by Mac computer sales. Report Can I integrate infographics into my blog or website? Yes, Statista allows the easy integration of many infographics on other websites. Simply copy the HTML code that is shown for the relevant statistic in order to integrate it. Our standard is 660 pixels, but you can customize how the statistic is displayed to suit your site by setting the width and the display size. Please note that the code must be integrated into the HTML code (not only the text) for WordPress pages and other CMS sites. Statista offers daily infographics about trending topics, covering:Economy & Finance, Politics & Society, Tech & Media, Health & Environment, Consumer, Sports and many more. Feel free to contact us anytime using our contact form or visit our FAQ page.  Need infographics, animated videos, presentations, data research or social media charts? More Information "
}