{
    "title": "Mark Zuckerberg's Meta wants to burst Apple's blue bubbles: WhatsApp is \ncoming for iMessage in the US",
    "date": "2/3/2024",
    "url": "https://africa.businessinsider.com/news/mark-zuckerbergs-meta-wants-to-burst-apples-blue-bubbles-whatsapp-is-coming-for/1bwg7tj",
    "text": "Business Insider Edition Apple's blue-bubble texts have made messaging a pretty tribal affair for many Americans. iPhone users have come to feel a degree of comfort — or superiority, depending on your perspective — when using iMessage because of the blue bubbles that contain their texts when interacting with fellow iPhone users. Green bubbles that appear when iPhone users text anyone else, on the other hand, tell them they're dealing with someone who isn't Team Apple. That's an oddity in the US, where almost 80% of Gen Z consumers prefer iPhones over Android devices, Bloomberg Intelligence found last year. As superficial as this color-coded system may seem, it's meant a lot to Apple. The company has aggressively defended the blue-green split, going as far as shooting down an app in December that allowed Android users to disguise their messages in blue bubbles. Mark Zuckerberg may have a plan to burst those bubbles, though. The Meta CEO reigns over an empire of social media apps that will be familiar to many Americans. Facebook and Instagram are, after all, common screen time gobblers. There is, however, one Meta app that isn't as popular yet in the US: WhatsApp. Facebook bought the instant messaging app for $19 billion back in 2014, and has been able to turn it into a mega-hit across the world ever since. About 2 billion people are thought to use the app globally, though most are outside the US. Zuckerberg hopes to change that. In an interview last year, he described WhatsApp as Meta's \"next chapter\" — a bold statement to make in a year dominated by AI and efficiency strategies, not to mention the metaverse. What can Americans expect from this \"next chapter?\" Zuckerberg has offered a few clues. For one, WhatsApp is aiming to be business-friendly. According to the company, a person running a business account can link multiple devices together, enabling more employees to \"respond to customer messages from anywhere.\" Meta also offers tools for brands such as Chevrolet and Samsung to reach customers, including those that allow them to address queries without the need to engage \"live support,\" as well as ways of placing orders on the app. Such features seem to be of interest to businesses: WhatsApp's daily business users jumped 80% in the US last year, per data from Apptopia first reported by the Big Technology newsletter. WhatsApp is also trying to be an app that everyone can use. As internet users increasingly sour on social media, the search for private spaces to interact with friends and family — like WhatsApp group chats — has only grown. WhatsApp is trying to offer the perks of social media without the publicity of it all. For users who may miss certain social media features – say, the ability to follow people – WhatsApp introduced a \"Channels\" feature last year that allows anyone to follow their favorite influencers and get updates from a \"broadcast.\" Think of it as an Instagram story update. WhatsApp is trying to build a better groupchat experience too. Though Apple offers a group chat feature on iMessage, users are limited to adding up to 32 extra people. On WhatsApp, a group can have more than 1,000 users. Is this enough to pry people away from their blue bubbles? Zuckerberg sure hopes so. In late 2022, the Meta chief acknowledged that while there is still some time before bets on the metaverse can prove successful, \"business messaging is probably going to be the next major pillar.\" Expect him to push that hard in the US. Thanks for signing up for our daily insight on the African economy. We bring you daily editor picks from the best Business Insider news content so you can stay updated on the latest topics and conversations on the African market, leaders, careers and lifestyle.  Also join us across all of our other channels - we love to be connected! © 2024 africa.businessinsider.com "
}