{
    "title": "RCS — Rich, Interoperable Messaging: Apple On Board - Hello Future Orange",
    "date": "2/12/2024",
    "url": "https://hellofuture.orange.com/en/rcs-rich-interoperable-messaging-apple-on-board/",
    "text": "Only two letters change from SMS to RCS, yet it represents a significant technological leap in the field of mobile messaging. SMS (Short Message Service) emerged in the 1990s in GSM signaling channels, and since then has become an integral part of everyday life. Its success is enduring: 12.8 billion A2P (Application-to-Person) SMS messages were sent in 2022.  With evolutions such as MMS (Multimedia Messaging Service), this protocol now coexists with alternative proprietary solutions, led by WhatsApp and iMessage, and their enhanced functionalities. RCS makes the green bubble—emblematic of text messaging on Android smartphones—more competitive, more attractive and with guaranteed interoperability It was therefore only natural that an SMS 2.0 should be developed, and the answer came with     \n        RCS    , which adopts similar formatting and functionalities to those offered by “ \n        Over The Top    ” (OTT) services — group messaging, notifications of typing or availability, file transfers, etc. Standardization of this new protocol began in the late 2000s within the GSMA, culminating in 2016 with the publication of the Universal Profile standard. Driven by carriers, the RCS initiative has subsequently rallied the giant Google to its cause and aims to streamline the implementation of the technology into the Android environment. Philippe Lucas, EVP Devices and Partnerships at Orange, explains the objective: “To make the green bubble—emblematic of text messaging on Android smartphones—more competitive, more attractive and with guaranteed interoperability, via a trusted carrier solution.  And all this, while bringing more richness and value to customers, not only in terms of interpersonal relations and group communication, but also in terms of person-to service exchange, to broaden the scope of possibilities in the field of customer relations.” A communication campaign based on RCS is indeed an opportunity for companies to enhance their interaction (through carousels, photos, videos, etc.) with consumers. Where an SMS advertising campaign has return rates of around 2% to 5%, these can rise to 15% to 20% if the same campaign is deployed using RCS configuration. Thanks to the commitment of telecoms operators and Google, the RCS implementation project has already reached several major milestones, including making all Android devices compatible based on a single native solution: Android Messages. The vast majority of users in the Android world, regardless of their carrier or smartphone manufacturer, can enjoy the benefits of RCS via their standard messaging service, without having to download an application. In France, this represents 45% of active smartphones, or around 25 million devices. Until recently, Apple preferred to capitalize exclusively on its proprietary technology. On an iPhone, the distinction between blue bubbles for iMessage interactions and green bubbles for SMS exchanges with Android devices has long been the norm. However in November 2023, the Cupertino-based company shared its intention to deploy the RCS protocol on iOS. An announcement that Google and many carriers, including Orange, had been hoping for and which has been warmly welcomed. For Philippe Lucas, this decision signifies “a growing awareness of the importance of alternatives to SMS/MMS and iMessage. This is particularly evident in Europe, where solutions like WhatsApp are widely adopted and achieve very high penetration rates — 100% in Spain, for example. Yet this is also notable in the United States, where iPhone users tend to turn away from iMessage for group messaging or for communicating with people outside of their domestic territory.” Changes to European regulations have also influenced Apple’s decision. The forthcoming implementation of the Digital Markets Act, which requires certain “gatekeeper” services to be open and interoperable, was like a sword of Damocles hanging over the Californian giant and its iMessage solution that would potentially be affected. What does Apple joining change? It will significantly increase the reach of RCS automatically. With the addition of the iPhone, the proportion of compatible devices could constitute 80% of all devices globally by 2025. RCS itself represents a disruption, but until now it has not been perceived as a genuine source of innovation, due to lacking sufficient reach. Its adoption by Apple could make all the difference. But above all, the porting of RCS to the iOS environment marks an evolution in usage: “The most important thing,” Philippe Lucas concludes, “is the possibility of finally having an augmented and interoperable green bubble. In future, iPhone owners will no longer have to use a separate application to engage in enriched communication, including group messaging, with the Android world, and vice versa.” RCS Rich Communication Services. A messaging protocol developed within the GSMA, offering enhanced services (private chats, group chats, file transfers, video calls, etc.), accessible via Wi-Fi or mobile connection. Over The Top A service deployed by a publisher or a content provider via existing carrier networks, without financial compensation. "
}