{
    "title": "Apple Thanks Man Charged With Defrauding Them Of $2.5M, Reason Remains \nUnclear: Report - Apple (NASDAQ:AA",
    "date": "2/8/2024",
    "url": "https://www.benzinga.com/24/02/37000182/apple-thanks-man-charged-with-defrauding-them-of-2-5m-reason-remains-unclear-report",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW In a surprising turn of events, Apple Inc. AAPL reportedly thanked a man charged with defrauding the company of approximately $2.5 million worth of gift cards and products. What Happened: Noah Roskin-Frazee, a San Francisco resident, was publicly acknowledged by Apple in a security update on Jan. 22, two weeks after his arrest, reported Business Insider. The reason behind Apple’s acknowledgment remains unclear. According to CourtWatch and 404 Media report, Roskin-Frazee, a security researcher, had previously reported issues to Apple. The indictment, filed in December, charged Roskin-Frazee and a co-defendant with counts including fraud and intentionally damaging a protected computer. Apple is yet to respond to Benzinga's request for comment. See Also: Tesla Driver Pulled Over For Wearing Apple Vision Pro While Driving The indictment details an intricate scheme in which Roskin-Frazee and his co-defendant used a password reset function to break into an employee’s account. They altered orders for items such as gift cards and devices, sometimes reducing the orders to $0 or having gift cards sent to fake addresses, which they subsequently resold. Despite Apple not being explicitly named in the indictment, CourtWatch and 404 Media note that the company is headquartered in Cupertino, California, and is involved in the development, manufacture, licensing, support, and sale of computer software, consumer electronics, personal computers, and services. Why It Matters: This is not the first time an Apple employee has been involved in fraudulent activities. In April, a former Apple employee was sentenced to prison for stealing approximately $17 million from the company through wire fraud. Another former Apple employee of Indian origin was also sentenced to three years in prison and ordered to pay over $19 million for conspiring to defraud the tech giant and related tax crimes. Read Next: Arm Holdings Expected To Report Strong Earnings On Back Of Android Demand, While Apple Supplier Faces Risks Amid China Slowdown Photo by Jimmy Jin on Unsplash Engineered by Benzinga Neuro, Edited by \nPooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}