{
    "title": "Apple says don't put wet iPhones in rice. Here's what to do instead.",
    "date": "2/21/2024",
    "url": "https://finance.yahoo.com/news/apple-says-dont-put-wet-154600424.html",
    "text": "Apple is dispelling a piece of conventional wisdom followed by iPhone users who accidentally get their devices wet. The company is warning against putting wet phones in uncooked rice to dry them out. In new guidance for salvaging phones that come into contact with liquid, Apple is advising users to let them dry out on their own, rather than by submerging them in uncooked rice. Many people rely on uncooked rice to dry out wet electronics because the grains absorb liquids quickly — but Apple said that the technique can actually damage your iPhone. \"Don't put your iPhone in a bag of rice\" Apple is telling iPhone users explicitly what not to do when a \"Liquid Detected\" warning appears on screen. \"Don't put your iPhone in a bag of rice. Doing so could allow small particles of rice to damage your iPhone,\" the company says. Also, when a \"Liquid Detected\" alert appears on a phone's screen, don't try to charge the device until both the phone and the cable are completely dry, Apple said. \"If you charge your iPhone while the Lightning or USB-C connector is wet, the pins on the connector or cable can corrode and cause permanent damage or stop functioning, causing connectivity issues for your iPhone or accessory,\" Apple explains. Tap the phone and leave it in a dry area Instead, unplug the phone from its power adaptor, and gently tap the phone against your hand, with the charging port facing down, in order to let excess liquid drain from the device. Then leave the iPhone in a dry area with airflow, Apple says. A wireless iPhone charger also won't cause damage. After 30 minutes, you can try to reconnect the device to a power adaptor. An alert will indicate if liquid remains in the phone, with Apple noting that It could take up to 24 hours for a device to completely dry out. Also avoid trying to dry it with an external heat source or compressed air. For example, don't use a hair dryer, and avoid inserting cotton swabs and other objects into the connector to try to absorb any liquid, the company said. "
}