{
    "title": "Meta Offers Advertisers Escape From Apple's 30% Service Charge",
    "date": "2/15/2024",
    "url": "https://www.pymnts.com/meta/2024/meta-offers-advertisers-escape-from-apple-30percent-service-charge/",
    "text": "Meta said it is giving advertisers a way to avoid Apple’s 30% service charge. Businesses that use boosted posts on Meta’s Facebook and Instagram platforms can go to Facebook.com and Instagram.com on mobile or desktop devices to boost their content and not pay the service charge, the company said in a Thursday (Feb. 15) announcement. “The Apple service charge is a result of updates Apple made to the App Store Review Guidelines,” per the announcement. “Starting later this month, when an advertiser uses the Facebook or Instagram iOS app to boost a post, they will be billed through Apple, which retains a 30% service charge on the total ad payment, before any applicable taxes. This service charge is retained by Apple, not Meta.” Meta said in the announcement that it is required to either comply with Apple’s rules or remove boosted posts from its apps. Boosted posts let a company quickly promote content without needing to launch a full ad campaign in Meta’s Ads Manager. The feature is especially popular with small businesses, for whom boosted posts are their only form of advertising on Meta. A Thursday report by Bloomberg included a statement from Apple that said treating boosts as an in-app purchase is consistent with its App Store strategy. “We have always required that purchases of digital goods and services within apps must use in-app purchase,” Apple said in a statement, per the report. “Boosting, which allows an individual or organization to pay to increase the reach of a post or profile, is a digital service — so of course in-app purchase is required. This has always been the case, and there are many examples of apps that do it successfully.” As PYMNTS wrote last month, small- to medium-sized businesses (SMBs) are already facing challenges when trying to sell their products online, including those related to marketing. The PYMNTS Intelligence study “Main Street Health Q4 2023: eCommerce Protects Main Street SMBs’ Bottom Line in a Cooling Market” found that 40% of SMBs said marketing costs are a key obstacle when selling their products and services online. “This factor is more challenging than others, such as shipping and delivery or providing effective customer support,” PYMNTS wrote. “The study also found that 55% of SMBs think digital marketing guidance is crucial to drive their business.” We’re always on the lookout for opportunities to partner with innovators and disruptors. "
}