{
    "title": "APPLE ALERT: Bragar Eagel & Squire, P.C. is Investigating Apple Inc. on \nBehalf of Apple Stockholders and Encourages Investors to Contact the Firm",
    "date": "3/22/2024",
    "url": "https://forextv.com/top-news/apple-alert-bragar-eagel-squire-p-c-is-investigating-apple-inc-on-behalf-of-apple-stockholders-and-encourages-investors-to-contact-the-firm/",
    "text": "NEW YORK, March 22, 2024 (GLOBE NEWSWIRE) — Bragar Eagel & Squire, P.C., a nationally recognized stockholder rights law firm, is investigating potential claims against Apple Inc. (“Apple” or the “Company”) (NASDAQ: AAPL) on behalf of Apple stockholders. Our investigation concerns whether Apple has violated the federal securities laws and/or engaged in other unlawful business practices. Click here to participate in the action. The focus of this investigation is whether Apple issued false and/or misleading statements and/or failed to disclose information relevant to investors. The US Justice Department and 16 attorneys general are suing the iPhone maker for violating antitrust laws. And in Europe, the company is said to be facing probes about whether it’s complying with the region’s Digital Markets Act. Apple, fresh from its €1.8 billion ($2 billion) European Union fine for blocking music streaming apps from informing users of cheaper deals, has been the focus of more attention since the DMA came into full effect on March 7. Then on March 21, 2024, Investor’s Business Daily published a report titled “Apple Stock Drops As Justice Department Sues iPhone Maker.” According to the report, “The lawsuit alleges that Apple’s conduct makes it harder for Americans to switch smartphones, undermines innovation for apps, and imposes extraordinary costs on developers, businesses and consumers.” On this news, Apple shares dropped by 4.29% in intraday trading on the same day, erasing about $113 billion in market value and taking their year-to-date loss back to 11%. If you purchased or otherwise acquired Apple shares and suffered a loss, are a long-term stockholder, have information, would like to learn more about these claims, or have any questions concerning this announcement or your rights or interests with respect to these matters, please contact Brandon Walker or Marion Passmore by email at [email protected], by telephone at (212) 355-4648, or by filling out this contact form.  There is no cost or obligation to you. About Bragar Eagel & Squire, P.C.: Bragar Eagel & Squire, P.C. is a nationally recognized law firm with offices in New York, California, and South Carolina. The firm represents individual and institutional investors in commercial, securities, derivative, and other complex litigation in state and federal courts across the country. For more information about the firm, please visit www.bespc.com. Attorney advertising. Prior results do not guarantee similar outcomes. Contact Information: Bragar Eagel & Squire, P.C.Brandon Walker, Esq.Marion Passmore, Esq.(212) 355-4648[email protected]www.bespc.com  © 2024 ForexTV.com © 2024 ForexTV.com Login to your account below   Remember Me  Please enter your username or email address to reset your password.   "
}