{
    "title": "Apple plans new iPad Pro, iPad Air for May as production ramps up overseas",
    "date": "3/28/2024",
    "url": "https://gulfnews.com/business/retail/apple-plans-new-ipad-pro-ipad-air-for-may-as-production-ramps-up-overseas-1.1711685246940",
    "text": "Latest iPad Pro will get OLED; Air will have new screen size Washington: Apple Inc.'s overseas suppliers have ramped up production of the company's long-anticipated new iPads and a launch is planned for early May, according to people with knowledge of the matter. The release will center on revamped versions of the iPad Pro and iPad Air, said the people, who asked not to be identified because the plans aren't public. As Bloomberg News has previously reported, the Pro models will get crisper new OLED displays \"- short for organic light-emitting diode \"- while the iPad Air will get a 12.9-inch screen option for the first time. Get exclusive content with Gulf News WhatsApp channel The move marks an end to the longest stretch without new models in the history of the iPad, which was first introduced by Apple co-founder Steve Jobs in 2010. It's been about 18 months since the last updates \"- a drought that's contributed to already-sluggish demand for tablets. Apple is betting that the new models, with faster chips and revamped accessories, can help spur a renaissance for the category. After a run-up during the pandemic, iPad sales have fallen in each of Apple's last two fiscal years, which run through September. They suffered an additional 25 per cent year-over-year decline during the latest holiday period, when the devices have typically been popular gifts. A spokeswoman for Cupertino, California-based Apple declined to comment. The iPad Pro models \"- codenamed J717, J718, J720 and J721 \"- will run the new M3 chip and work with redesigned versions of the Magic Keyboard and Apple Pencil. The update represents the first overhaul to that lineup since 2018. The iPad Air, meanwhile, was last updated in 2022 with the M1 chip. It will get a new processor, and the 12.9-screen size means consumers can get a large iPad for less money than the more upscale Pro. The current iPad Air starts at $599, while the Pro line costs $200 more. Apple had planned to release the new iPads by the end of March or early April, but the company has been working to finish software for the devices. The screens in the latest models also require complex new manufacturing techniques, which have contributed to the delay. An early May product release would come about a month before Apple's next major event. On June 10, the company plans to kick off its weeklong Worldwide Developers Conference. There, Apple is expected to unveil a renewed artificial intelligence strategy \"- alongside software updates for the iPhone, iPad, Apple Watch, Mac and Vision Pro headset. Get Breaking News Alerts From Gulf News We’ll send you latest news updates through the day. You can manage them any time by clicking on the notification icon. "
}