{
    "title": "Is Apple Card Shutting Down in 2024?",
    "date": "3/1/2024",
    "url": "https://www.macobserver.com/tips/deep-dive/is-apple-card-shutting-down-in-2024/",
    "text": "Apple launched the Apple Card in 2019 as a way to expand its business into consumer credit. Not even five years later, there is already talk of the Apple Card shutting down. However, the credit card is surprisingly successful, with over six million cardholders. That’s a lot of people left asking, “Is Apple Card going away?” We will also look at whether you can still get an Apple Card in 2024. Despite the rumors, nothing major is going to happen in 2024. There are still a lot of questions, but we do know that Apple Card will not shut down in 2024. The company confirmed in late January that they do plan on severing ties with issuer Goldman Sachs in the next 12-15 months. However, Apple also said that they plan on finding a new issuing bank. Any changes to Apple Card are unlikely in 2024 and would likely happen at the beginning of 2025. With that in mind, expect Apple to make more announcements on the card’s future later in the year. The Apple Card is a unique credit card that is very unprofitable. Apple initially approached several major banks with their plans for a credit card but was quickly turned away. They ended up making a deal with Goldman Sachs, which isn’t heavily invested in the consumer credit business. Many analysts feared this relationship wouldn’t work out, and now that seems to be coming to fruition. Losses reportedly surpassed $1 billion for Goldman Sachs, which is a leading factor in severing ties with Apple. This largely stems from Apple’s desire to not have fees associated with the card, and to encourage users to avoid accruing interest. Apple has also expressed displeasure with the customer service that Goldman Sachs provides. Despite the future uncertainty for Apple Card, you can still get one. Apple has not announced any official plans to get rid of the credit card and has actually sought out a new partner. As long as they get a new partner, existing accounts should not be affected. Additionally, you can still sign up for Apple’s high-yield savings account. Signing up for an Apple Card is very easy, and you can do it on the Apple website. You will need to sign into your Apple ID and enter some personal information such as date of birth and social security number. After applying, you should receive a decision within a few minutes. Here is how you can sign up for an Apple Card: Apple Card is not being replaced, but a different company will likely manage it. Apple is very interested in remaining in the consumer credit market despite its hiccups with Goldman Sachs. As of now, Apple plans on ending its deal with Goldman Sachs, but not the Apple Card. The plan would have a different company, such as Synchrony, take over all Apple Card accounts. If Apple Card isn’t a good fit for you, then you can close it at any time. Remember, you must pay off your remaining balance and closing the account could impact your credit score. The fastest and easiest way to close your Apple Card account is on your iPhone with these steps. You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. "
}