{
    "title": "Judge denies Apple's attempt to dismiss a class-action lawsuit over AirTag \nstalking",
    "date": "3/19/2024",
    "url": "https://finance.yahoo.com/news/judge-denies-apples-attempt-dismiss-183435295.html",
    "text": "NEW YORK (AP) — A judge has denied Apple's motion to dismiss a class-action lawsuit claiming that stalkers are using its AirTag devices to track victims — and that the tech giant hasn't done enough to prevent them. Apple’s $29 AirTags have become popular items since their 2021 release, helping users keep tabs on the location of anything from their lost keys to wallets and luggage. But stalkers have also taken advantage of AirTags and similar products to follow individuals without their consent. In December 2022, Apple was sued by dozens of plaintiffs who said they were stalked by AirTag users. They alleged that Apple failed to mitigate such dangers and should have done more to protect victims — claiming AirTags “revolutionized the scope, breadth, and ease of location-based stalking” and that current safety features are inadequate. Apple attempted to dismiss the litigation in a filing last year, arguing the company “took proactive steps to try to deter misuse” and that it should not bear liability for injuries caused by third parties. But San Francisco-based U.S. District Judge Vince Chhabria dismissed that motion on Friday. Chhabria ruled that, while most of the class-action plaintiffs' claims were “inadequately pled,\" three can proceed for negligence and strict product liability under California law. The remaining claims were dismissed in a separate order. “Apple may ultimately be right that California law did not require it to do more to diminish the ability of stalkers to use AirTags effectively, but that determination cannot be made at this early stage,\" Chhabria wrote. Chhabria detailed arguments from both Apple and the plaintiffs in the ruling. Included were accounts from the three remaining claims of victims being stalked by former partners or others through AirTags that were allegedly attached to their cars, resulting in emotional and sometimes financial harm. All three of these cases involve “purported defects” of AirTags that made it harder for the victims to both understand the tracking and quickly stop it, Friday's ruling outlines, including unclear or delayed notifications, as well as an inability to disable the devices remotely, which allegedly prolonged stalking. “We’re grateful for the opportunity to continue this critical litigation,” Gillian L. Wade, an attorney representing the plaintiffs, told The Associated Press via email. “Abusive and dangerous location tracking is only becoming more common, so it’s imperative to do everything we can to give voice to the victims, and to push for accountability and change.” Apple and attorneys representing the California-based company did not immediately respond to requests for comment Tuesday. Back in February 2022, months ahead of the class action filing, Apple released a statement that said it “condemn(s) in the strongest possible terms any malicious use of our products.\" It also noted then-planned updates aimed at increasing safety. Last year, Apple also partnered with Google to submit a proposal aimed at setting standards for combatting secret surveillance on AirTags and similar gadgets. Related Quotes "
}