{
    "title": "Columbia Asset Management Reduces Stake in Apple Inc. (NASDAQ:AAPL)",
    "date": "3/11/2024",
    "url": "https://www.americanbankingnews.com/2024/03/11/columbia-asset-management-reduces-stake-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by ABMN Staff on Mar 11th, 2024 Columbia Asset Management cut its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 1.8% during the 3rd quarter, according to its most recent disclosure with the Securities & Exchange Commission. The institutional investor owned 244,688 shares of the iPhone maker’s stock after selling 4,490 shares during the quarter. Apple comprises 8.6% of Columbia Asset Management’s investment portfolio, making the stock its biggest holding. Columbia Asset Management’s holdings in Apple were worth $41,893,000 at the end of the most recent reporting period. Other hedge funds and other institutional investors have also recently modified their holdings of the company. Cambridge Financial Group Inc. bought a new stake in Apple in the third quarter worth $6,534,000. Glenview Trust co grew its position in Apple by 1.3% during the 3rd quarter. Glenview Trust co now owns 1,042,483 shares of the iPhone maker’s stock valued at $178,484,000 after purchasing an additional 13,080 shares during the last quarter. WestHill Financial Advisors Inc. increased its stake in Apple by 7.2% during the 3rd quarter. WestHill Financial Advisors Inc. now owns 43,351 shares of the iPhone maker’s stock valued at $7,422,000 after purchasing an additional 2,896 shares in the last quarter. Pearl River Capital LLC raised its holdings in Apple by 146.7% in the third quarter. Pearl River Capital LLC now owns 37,455 shares of the iPhone maker’s stock worth $6,413,000 after buying an additional 22,270 shares during the last quarter. Finally, Alterna Wealth Management Inc. lifted its stake in shares of Apple by 3.8% in the third quarter. Alterna Wealth Management Inc. now owns 18,089 shares of the iPhone maker’s stock worth $3,097,000 after buying an additional 665 shares in the last quarter. 58.51% of the stock is owned by hedge funds and other institutional investors. In related news, Director Arthur D. Levinson sold 100,000 shares of the business’s stock in a transaction on Thursday, February 29th. The shares were sold at an average price of $180.94, for a total value of $18,094,000.00. Following the sale, the director now owns 4,434,576 shares in the company, valued at $802,392,181.44. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is available at the SEC website. Corporate insiders own 0.06% of the company’s stock. Apple stock opened at $170.73 on Monday. Apple Inc. has a 1 year low of $147.61 and a 1 year high of $199.62. The firm’s 50 day moving average price is $184.64 and its 200-day moving average price is $183.62. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. The stock has a market cap of $2.64 trillion, a P/E ratio of 26.59, a PEG ratio of 2.06 and a beta of 1.29. Apple (NASDAQ:AAPL – Get Free Report) last announced its quarterly earnings results on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, topping the consensus estimate of $2.09 by $0.09. Apple had a net margin of 26.16% and a return on equity of 156.04%. The business had revenue of $119.60 billion for the quarter, compared to analysts’ expectations of $117.99 billion. During the same quarter in the previous year, the company earned $1.88 EPS. The business’s quarterly revenue was up 2.1% compared to the same quarter last year. On average, equities analysts predict that Apple Inc. will post 6.55 earnings per share for the current fiscal year. The company also recently disclosed a quarterly dividend, which was paid on Thursday, February 15th. Stockholders of record on Monday, February 12th were issued a dividend of $0.24 per share. The ex-dividend date was Friday, February 9th. This represents a $0.96 annualized dividend and a dividend yield of 0.56%. Apple’s dividend payout ratio (DPR) is 14.95%. AAPL has been the topic of several recent analyst reports. Barclays cut their target price on Apple from $160.00 to $158.00 and set an “underweight” rating on the stock in a research note on Friday, February 2nd. Oppenheimer reiterated an “outperform” rating and issued a $200.00 price objective on shares of Apple in a report on Friday, February 2nd. DA Davidson assumed coverage on shares of Apple in a research note on Wednesday, January 3rd. They set a “neutral” rating and a $166.00 target price on the stock. Piper Sandler Companies lowered shares of Apple to a “neutral” rating and reduced their price target for the stock from $220.00 to $205.00 in a research note on Thursday, January 4th. Finally, JPMorgan Chase & Co. cut their target price on shares of Apple from $225.00 to $215.00 and set an “overweight” rating for the company in a research report on Friday, February 2nd. One research analyst has rated the stock with a sell rating, eleven have given a hold rating, twenty-one have issued a buy rating and one has given a strong buy rating to the stock. According to MarketBeat.com, the stock has an average rating of “Moderate Buy” and a consensus target price of $205.27. View Our Latest Report on AAPL (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. AQR Capital Management LLC Buys 37,782 Shares of Bread Financial Holdings, Inc. (NYSE:BFH) 38,164 Shares in Apple Inc. (NASDAQ:AAPL) Purchased by Cambridge Financial Group Inc. "
}