{
    "title": "Apple Inc. (NASDAQ:AAPL) is Meridian Wealth Advisors LLC's 3rd Largest \nPosition",
    "date": "3/10/2024",
    "url": "https://www.defenseworld.net/2024/03/10/apple-inc-nasdaqaapl-is-meridian-wealth-advisors-llcs-3rd-largest-position.html",
    "text": "Posted by Defense World Staff on Mar 10th, 2024 Meridian Wealth Advisors LLC lifted its position in  Apple Inc. (NASDAQ:AAPL – Free Report) by 1.2% in the third quarter, Holdings Channel.com reports. The firm owned 103,763 shares of the iPhone maker’s stock after purchasing an additional 1,201 shares during the quarter. Apple makes up   4.4% of Meridian Wealth Advisors LLC’s holdings, making the stock its 3rd biggest holding. Meridian Wealth Advisors LLC’s holdings in Apple were worth $17,765,000 at the end of the most recent reporting period. Other institutional investors also recently bought and sold shares of the company. Kingdom Financial Group LLC. boosted its holdings in  Apple by 5.5% during the 3rd quarter. Kingdom Financial Group LLC. now owns 11,464 shares of the iPhone maker’s stock valued at $1,963,000 after acquiring an additional 598 shares during the period.  RFG Advisory LLC lifted its holdings in  Apple by 13.6% in the 3rd quarter. RFG Advisory LLC now owns 172,823 shares of the iPhone maker’s stock worth $29,589,000 after buying an additional 20,737 shares during the period.  Tsfg LLC lifted its holdings in  Apple by 2.2% in the 3rd quarter. Tsfg LLC now owns 50,943 shares of the iPhone maker’s stock worth $8,722,000 after buying an additional 1,091 shares during the period.  State Street Corp lifted its holdings in  Apple by 0.5% in the 2nd quarter. State Street Corp now owns 578,897,858 shares of the iPhone maker’s stock worth $112,288,818,000 after buying an additional 2,616,084 shares during the period.  Finally, Private Wealth Partners LLC lifted its holdings in  Apple by 3.8% in the 3rd quarter. Private Wealth Partners LLC now owns 673,349 shares of the iPhone maker’s stock worth $115,284,000 after buying an additional 24,634 shares during the period. 58.51% of the stock is currently owned by hedge funds and other institutional investors. In other Apple news, Director Arthur D. Levinson sold 100,000 shares of the firm’s stock in a transaction dated Thursday, February 29th. The stock was sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the sale, the director now directly owns 4,434,576 shares of the company’s stock, valued at $802,392,181.44. The transaction was disclosed in a legal filing with the SEC, which is available through this hyperlink. Insiders own  0.06% of the company’s stock. Several research firms have weighed in on AAPL. Needham & Company LLC  reiterated a “buy” rating and issued a $220.00 price objective on shares of Apple in a report on Friday, February 2nd. Piper Sandler dropped their price objective on Apple from $205.00 to $190.00 and set a “neutral” rating for the company in a report on Friday, February 2nd. Wedbush  reiterated an “outperform” rating and issued a $250.00 price objective on shares of Apple in a report on Wednesday, February 28th. Redburn Partners cut Apple to a “neutral” rating and set a $200.00 price objective for the company. in a report on Wednesday, January 10th. Finally, JPMorgan Chase & Co. decreased their target price on Apple from $225.00 to $215.00 and set an “overweight” rating for the company in a research report on Friday, February 2nd. One analyst  has rated the stock with a sell rating, eleven have assigned  a hold rating, twenty-one have issued  a buy rating and one  has given a strong buy rating to the company. According to data from MarketBeat, Apple currently has a consensus rating of “Moderate Buy” and a consensus price target of $205.27. Check Out Our Latest Report on Apple NASDAQ AAPL opened at $170.73 on Friday. The company has a market capitalization of $2.64 trillion, a PE ratio of 26.59, a price-to-earnings-growth ratio of 2.04 and a beta of 1.29. The company has a debt-to-equity ratio of 1.28, a quick ratio of 1.02 and a current ratio of 1.07. The business’s fifty day moving average is $184.64 and its 200 day moving average is $183.60. Apple Inc. has a fifty-two week low of $147.61 and a fifty-two week high of $199.62. Apple (NASDAQ:AAPL – Get Free Report) last released its earnings results on Thursday, February 1st. The iPhone maker reported $2.18 earnings per share for the quarter, beating the consensus estimate of $2.09 by $0.09. The company had revenue of $119.60 billion for the quarter, compared to the consensus estimate of $117.99 billion. Apple had a return on equity of 156.04% and a net margin of 26.16%. Apple’s quarterly revenue was up 2.1% compared to the same quarter last year. During the same period in the previous year, the business earned $1.88 earnings per share.  Sell-side analysts predict that  Apple Inc. will post 6.55 earnings per share for the current year. The firm also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Shareholders of record on Monday, February 12th were issued a dividend of $0.24 per share. The ex-dividend date  was Friday, February 9th. This represents a $0.96 dividend on an annualized basis and a yield of 0.56%. Apple’s dividend payout ratio  is presently 14.95%. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.  Want to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Free Report).   Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Invesco Ltd. Buys 273,479 Shares of Polestar Automotive Holding UK PLC (NASDAQ:PSNY) Plan Group Financial LLC Has $1.73 Million Holdings in Apple Inc. (NASDAQ:AAPL) "
}