{
    "title": "Apple's stock once drove the S&P 500. Here's how much its influence has \nwaned.",
    "date": "3/30/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240330250/apples-stock-once-drove-the-sp-500-heres-how-much-its-influence-has-waned",
    "text": "By Joseph Adinolfi Apple's influence on daily moves in the S&P 500 has waned to its weakest level in a decade. There was a time when the S&P 500 reaching record highs without any help from Apple Inc. was almost unthinkable. But those days are over, at least for now. Since the start of the first quarter, Apple (AAPL) has exerted less influence over the S&P 500's daily performance than at any time over the past 10 years. So far, there have been 13 days where the S&P 500 SPX rose while Apple shares fell, including Thursday, where the large-cap index marched to a second-straight record high while shares of the iPhone maker tumbled by more than 4%, according to Dow Jones Market Data. That is the highest number in any quarter since the first three months of 2014, and there is still one week remaining. Compare that with one year ago, when the iPhone maker was at the height of its powers in terms of the influence it wielded over the large-cap index. During the first quarter of 2023, there were only two days where the S&P 500 rose without any help from Apple, tied with the second quarter of 2022 for the lowest number in any quarter going back to 1990. Apple's influence over the Nasdaq Composite has also weakened considerably. Since the start of the year, there have been 15 days where the Nasdaq rose while Apple fell, the most since the fourth quarter of 2014. Apple shares have struggled since the start of 2024, causing many analysts to rethink the company's status as a member of the Magnificent Seven group of megacap stocks, which drove the bulk of the S&P 500's advance in 2023. Since Jan. 1, shares of the iPhone maker have slid by more than 10%, according to FactSet data. The S&P 500, meanwhile, is up 9.9% through Thursday's close. Analysts cited several reasons for Apple's weakness. The company's revenues shrank in 2023 for four straight quarters, the longest slide in 22 years. The slide is expected to continue, albeit at a slower pace, in 2024, according to an estimate from analysts at Morningstar. Wall Street's consensus sees modest revenue growth for the company during the current fiscal year. Weakness in Apple shares spurred a handful of analysts to strip the company of its overweight or buy ratings. But as shares have declined, some analysts, including Morningstar's William Kerwin, have decided to upgrade the stock as it has moved closer to their price targets. Kerwin told MarketWatch he recently upgraded Apple from a sell to a hold as its shares have moved closer to his price target of $160. They traded at $171.37 as of Thursday's close. According to Kerwin, the bear case for Apple rests on three pillars. The first is a deteriorating sales-growth outlook in China, where domestic competition has improved and a government crackdown has restricted the use of Apple devices for government employees and workers at state-owned companies. The second issue is that refresh cycles for consumers are slowing. Apple's customers worldwide are opting to hang on to their devices for longer. Finally, antitrust actions from the Department of Justice, which filed a lawsuit on Thursday taking the company to task over its walled-garden ecosystem, which the DoJ claims inhibits competition. Read more: Apple has withstood regulatory blowback before. The DOJ's latest suit may be different. Kerwin said the antitrust actions could dent the company's business, but likely won't dismantle its considerable moat. \"We generally bake in all the above to our forecast, but don't expect severe antitrust issues, even in light of today's announcement,\" Kerwin wrote Thursday in emailed comments. To be sure, Apple still commands a heavy weighting in the S&P 500 and Nasdaq. Despite its decline, Apple remains the second-most valuable publicly traded U.S. company, with a market capitalization of $2.76 trillion as of Thursday's close, according to FactSet data. Although it ceded its position as the most-valuable U.S. company earlier this year to rival Microsoft Corp. (MSFT) Now, another megacap technology stock is rapidly catching up. Artificial-intelligence darling Nvidia Corp. (NVDA), whose advanced chip designs have led to soaring profits, boasted a market cap of $2.26 trillion as of Thursday after its shares have risen 84.6% since the start of the year. Nvidia has seen explosive growth in earnings and sales. Its adjusted net income increased roughly nine times to $5.16 a share during the most recent fiscal quarter, compared with the same period a year earlier. Its shares rose 1.2% on Thursday, helping to blunt the impact of Apple's decline. Its performance has prompted some strategists to label it the market's new indispensable stock. -Joseph Adinolfi This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 03-30-24 0819ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}