{
    "title": "Will Warren Buffett Keep Selling Apple?",
    "date": "3/12/2024",
    "url": "https://www.cmcmarkets.com/en/opto/will-warren-buffett-keep-selling-apple",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. By OPTO  12 Mar 2024, 17:40 Warren Buffett’s Berkshire Hathaway [BRK-B] pared down its stake in Apple [AAPL] by 1.1% during the last three months of 2023. As of 31 December, he owned 905.6 million shares worth $174.3bn. While the asset manager remains one of the largest shareholders in the tech giant with a stake of nearly 6%, following a lacklustre start to 2024, there are concerns that Buffet might sell more. Here, OPTO unpacks Buffett’s history with Apple, the challenges currently facing the iPhone maker, and what another selloff by Berkshire could mean for the stock. Roundhill Ball Metaverse ETF iShares Expanded Tech Sector ETF +1.84% iShares MSCI ACWI Low Carbon Target ETF BlackRock U.S. Carbon Transition Readiness ETF +1.31% JPMorgan Carbon Transition U.S. Equity ETF +0.70% Data correct as of Tuesday, 12 March. Prior to investing in Apple, the only tech company Buffett had a position in was IBM [IBM]. “The chances of being way wrong in IBM are probably less, at least for us, than the chances of being way wrong in Google [GOOGL] or Apple,” he said at Berkshire Hathaway’s 2012 annual shareholder meeting, stressing that his particular expertise didn’t give him confidence in his ability to properly value the stocks. Less than four years later, in Q1 2016, Berkshire acquired its first tranche of 9.8 million shares for $1.1bn. By the end of that year, Buffett had built a stake of 57.4 million shares worth $6.6bn. Buffett’s conviction of the iPhone’s usefulness in life and business saw his investment firm continue to add to its position. In the second half of 2020, Buffett sold approximately $11bn of shares, a move he described at Berkshire’s following annual shareholder meeting as “probably a mistake”. Asked about having Buffett as a major shareholder in 2019, Apple CEO Tim Cook told CNBC: “We run the company for the long term. And so the fact that we’ve got the ultimate long-term investor in the stock is incredible.”  The first few months of the year have been rotten for Apple. In January, the Cupertino company lost its title as the world’s most valuable, ousted by Microsoft [MSFT]. The stock was the second-most profitable short position in February, according to research by data analytics firm S3 Partners seen by Bloomberg. Then, at the start of March, the stock was cut from Goldman Sachs’ list of top buys. Headwinds from China also appear to be gathering strength. Sales of iPhone models in the country plunged 24% in the first six weeks of the year, according to a report by Counterpoint. “Primarily, it faced stiff competition at the high end from a resurgent Huawei while getting squeezed in the middle on aggressive pricing from the likes of OPPO, Vivo and Xiaomi [1810:HK],” commented Mengmeng Zhang, Senior Analyst at Counterpoint. The report also revealed that Apple’s share of the Chinese smartphone market has slipped from 19% last year to 16%. Despite these headwinds, someone who is remaining bullish on Apple is Dan Ives. The Wedbush analyst told CNBC last week that the recent share price movement has created a buying opportunity. “Artificial intelligence is coming to Cupertino. I think to sell this stock ahead of that would be not just the wrong move, but a historically wrong move,” said Ives. The Apple share price is down 10.2% year-to-date through 12 March and down 7.7% in the past month alone. The stock is the second-worst performer among the ‘magnificent seven’ in 2024 but remains up 15.4% over the past 12 months. The big question is whether Buffett will have reduced his Apple stake further between January and March amid the recent turmoil. We won’t find out until 15 May, when Berkshire’s next 13F filing is due with the US Securities and Exchange Commission. If the filing shows he has further reduced his stake, it could trigger something of a panic, particularly among smaller investors. “He knows when that 13F comes out showing he started to sell, that Apple shares will get killed as retail investors rush for the exit,” wrote Mizuho analyst Jordan Klein in a note seen by Quartz. An investor who wishes to get exposure to Apple but doesn’t want to carry the risk of holding the stock outright could consider a number of ETFs. According to ETF.com, the fund that has allocated the largest amount (21.5%) to Apple, as of 7 March, is the Vanguard Information Technology ETF [VGT], while other funds worth keeping an eye on are the Vanguard Mega Cap Growth ETF [MGK] (14.8%) and the ProShares Ultra Technology ETF [ROM] (14.7%). Disclaimer Past performance is not a reliable indicator of future results. CMC Markets is an execution-only service provider. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. CMC Markets does not endorse or offer opinion on the trading strategies used by the author. Their trading strategies do not guarantee any return and CMC Markets shall not be held responsible for any loss that you may incur, either directly or indirectly, arising from any investment based on any information contained herein. *Tax treatment depends on individual circumstances and can change or may differ in a jurisdiction other than the UK. Continue reading for FREE Error! Please try submitting again. Success! You have successfully signed up. Latest articles Why Did Ray Dalio Buy These Two Fintech Stocks in Q4? OPTO unpacks why super investor Ray Dalio bought shares in Visa and Mastercard during Q4 2023. 11 Mar 2024 Research Series - Gene Therapy: A Cure for Cancer? Projected to hit $120 billion by 2027, the genomic sequencing market stands out for its potential in cancer diagnosis. 07 Mar 2024 Cathie Wood: Bitcoin ETFs Are “a Feeder for Coinbase” Cathie Wood, CEO of ARK Invest, maintains a bullish outlook on Coinbase shares despite recent sales of the stock. 06 Mar 2024 Why is Warren Buffett Still So Bullish on US Stocks? Warren Buffett’s latest shareholder letter revealed why the legendary investor remains bullish on US stocks, particularly Occidental Petroleum. 05 Mar 2024 © 2024 CMC Markets Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when spread betting and/or trading CFDs with this provider. You should consider whether you understand how spread bets and CFDs work and whether you can afford to take the high risk of losing your money. CMC Markets UK plc (173730) and CMC Spreadbet plc (170627) are authorised and regulated by the Financial Conduct Authority in the United Kingdom. "
}