{
    "title": "Apple: Dead Money Thesis Playing Out (NASDAQ:AAPL)",
    "date": "3/17/2024",
    "url": "https://seekingalpha.com/article/4678740-apple-dead-money-thesis-playing-out",
    "text": "akiyoko/iStock via Getty Images  akiyoko/iStock via Getty Images Just over 2 years ago, Stone Fox Capital warned investors that Apple (NASDAQ:AAPL) was dead money for up to 4 years. The stock of the tech giant was set to struggle with the strong new product development needed to warrant the current price at the time, much less higher prices over the years. My investment thesis remains ultra Bearish on the stock with the valuation still disconnected from the lack of growth. Source: Finviz Source: Finviz Back in March 2022, analysts were forecasting Apple to generate minimal growth over the next 4 years while the stock had already priced in massive growth. The major question was whether the tech giant could even hit those growth rates. Apple really needed new products like AR/VR devices and autonomous EVs in order to hit the growth rates needed to warrant a stock trading up at $166. On this front, the Vision Pro was recently released with minimal revenue forecasts due to production limits and the long vaunted Apple Car plans were terminated. The company enters the mid-point of FY24 with neither products expected to provide material revenues to Apple over the next few years when these products were the future growth drivers of the FY22 investment thesis. The Vision Pro definitely has some positive feedback when launched, but the $3,500 price point and complexity in making the AR/VR device has limited both supply and demand. Not to mention, Apple hasn't announced any road map for the AR/VR device segment, similar to how the iPhone has new product releases on an annual basis. Top analysts like Dan Ives of Wedbush Securities and Wamsi Mohan of BofA Securities forecast Vision Pro sales in the 400K to 600K range. At $3,500 a unit, revenues will only hit $1.4 to $2.1 billion for 2024, which would presumably include the December quarter that counts towards FY25 sales. Influential Apple analyst Ming-Chi Kuo has even suggested sales have slowed down significantly following the early adopter rush leading to concerns regarding the intensity of demand. The analyst suggests the MR device product roadmap has limited visibility with an expected cheaper version in Q1'26 followed by a new model with advanced technology not until 2027. Mohan provides a 4 million unit estimate for the lower-end model in FY26. At a cost of $2,000, the Vision Pro line would generate only $8 billion in sales and this number appears aggressive considering the demand equation as slowed dramatically for the initial device and $2K for an AR/VR device is still extremely expensive for consumer adoption. At the same time, Apple faces an existential threat in China with iPhone sales plunging. Counterpoint Research documented a 24% dip in iPhone sales in China for the first 6 weeks of 2024 after Huawei surprised the market with a competitive smartphone despite U.S. chip restrictions. Source: Counterpoint Research Source: Counterpoint Research Huawei saw sales surge 64% YoY to start 2024 while other smartphone manufacturers saw sales slump. Overall units sold in China were down 7% YoY contributing to substantial weakness for Apple with market share down 3 percentage points to 16% on top of the weaker sales levels. China is a big problem for Apple with FY23 sales representing 19% of total revenues. The country produced $73 billion in annual sales and was the second largest region for the tech giant, barely behind all of the Europe at $94 billion. Source: Business of Apps Source: Business of Apps In reality, Apple doesn't have a bright spot in the product development road map unless the iPhone 16 sees extra demand from an AI focus. The iPhone 15 faced problems from the start with no significant upgrades leading to apathy in upgrading a phone costing upwards of $1,000. The iPhone now generates $200 billion in annual sales and the weakness in China is a major concern. Even with the 5G iPhone and Covid pull forwards, iPhone sales are still only slightly above the FY18 level of $166 billion, speaking to demand issues. Apple is still only selling roughly the same iPhones as FY15 when units sold first topped 230 million leaving all of the revenue gains due to higher ASPs. The original dead money thesis was written back in March 2022 and Apple has only risen 4% during the period with the S&P 500 index up over 17%. The stock rose to a high of nearly $200 during this period and investors were warned that an irrational rally might occur, even to as high as $250. Source: Seeking Alpha Source: Seeking Alpha The key here is that Apple has now reported 5 consecutive quarters of minimal or negative growth rates and the forecasts ahead aren't particularly impressive. The company guided to FQ1'24 sales dipping $5 billion from the sales levels of FQ2'23 leading to a 4% decline. The analyst forecasts for growth the following 3 quarters appear particularly aggressive considering the iPhone sales issues in China and the lack of new product innovation providing a boost to revenues. Source: Seeking Alpha Source: Seeking Alpha A prime example of how analyst estimates have been overly aggressive for a while now are the FQ1'25 revenues targets. The consensus targets back in October 2022 were $142 billion and the number has now fallen below $126 billion for only 5% growth YoY. Source: Seeking Alpha Source: Seeking Alpha As highlighted in our research over the last 2 years, Apple has a history of generally matching analyst targets for the quarters ahead. The tech giant will beat estimates by a minor amount with limited growth. Only during the Covid period did sales growth ramp up and the company start smashing analyst estimates, but that period of excessive growth is likely contributing to some of the weakness now. The original dead money article even predicted what the FY25 EPS estimates would look like, if Apple actually beat analyst estimates by 5% annually. The EPS target was still only $8.82 under a bullish cash scenario and now the consensus analyst EPS estimate is only $7.16. Even under the best case scenario where Apple was generating the annual 6% growth rates and beating analyst EPS targets, the stock still didn't justify a price of $166. Now, Apple still trades at 26x these lowered EPS targets and the price is clearly not justified. Data by YCharts The stock still trades at higher multiples than Meta Platforms (META) and Google (GOOG) despite these companies being heavily involved in AI and already reporting strong growth. Microsoft (MSFT) trades in a different atmosphere at nearly 36x forward EPS targets. Despite the market loving these Magnificent 7 stocks over the last 2 years, several stocks have considerably lagged the market during a tough period. One has to really question why Apple has a favorable valuation when even a 20x PE multiple only produces a $143 stock price. Again, the market is probably aggressive assigning 7% to 10% EPS growth rates for Apple over the next 3 years. Even if the company makes these targets, Apple should be lucky to garner a 15x multiple without any clear new product offering a path for material growth off a revenue base approaching $400 billion. The Vision Pro is the only product garnering consumer intrigue, but the general consensus is for sales of only a few billion in the next few years and the product will quickly age heading into FY26. Apple hasn't shown any sign of an updated product so far. The key investor takeaway is that warning investors that Apple should be dead money for 4 years was actually over positive on the outcome. The stock should see considerable downside based on the weak results and ongoing product development failures. CEO Tim Cook turns 64 this year and pressure could start mounting for his retirement after another year lacking growth and weak product development leading to a weak stock price. Investors should consider the stock still trading above $170 as a gift. In a normal market, Apple would be lucky to trade at 15x EPS targets leading to a stock price of only $107. The stock could easily face more than 2 years of ongoing dead money with the real risk that investors face negative returns over this period while watching years of gains disappear. If you'd like to learn more about how to best position yourself in under valued stocks mispriced by the market to start 2024, consider joining Out Fox The Street. The service offers a model portfolio, daily updates, trade alerts and real-time chat. Sign up now for a risk-free 2-week trial. This article was written by Stone Fox Capital (aka Mark Holder) is a CPA with degrees in Accounting and Finance. He is also Series 65 licensed and has 30 years of investing experience, including 10 years as a portfolio manager. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The information contained herein is for informational purposes only. Nothing in this article should be taken as a solicitation to purchase or sell securities. Before buying or selling any stock, you should do your own research and reach your own conclusion or consult a financial advisor. Investing includes risks, including loss of principal. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}