{
    "title": "DIAGEO ANNOUNCES ITS FIRST EXPERIENCE WITH APPLE VISION PRO TO BRING \nTEQUILA CULTURE TO FANS ...",
    "date": "3/4/2024",
    "url": "https://markets.ft.com/data/announce/detail?dockey=600-202403040930PR_NEWS_USPRX____NY50477-1",
    "text": "In collaboration with Trigger XR, Tequila Don Julio is creating the next level of access and engagement with spatial computing, beginning this spring. DIAGEO\n is the first beverage company to launch on Apple Vision Pro, as it continues its mission to shape the future of the beverage industry. NEW YORK\n, March 4, 2024 /PRNewswire/ -- As the global leader in premium drinks, DIAGEO marks its ongoing ambition to shape the future of how people around the world interact with its extensive portfolio of iconic brands through an inaugural experience with Apple Vision Pro. Tequila Don Julio, Mexico's original luxury tequila, will be the first DIAGEO brand to leverage this immersive new storytelling platform, as the company adapts this emerging technology to create new experiences for tequila enthusiasts.  With a commitment to bringing the culture of modern Mexico across the globe through the recently launched Por Amor campaign, this platform will allow tequila fans to be immersed in the world of Don Julio and experience the people, places, and processes behind the brand like never before. Agave-based spirits is one of the fastest growing categories in the industry, and tequila enthusiasts are seeking new ways to learn more about this incredible spirit. This new way to engage Don Julio with Apple Vision Pro leverages the latest in spatial computing and enables users to travel virtually to Mexico to experience the rich legacy, craft and culture that makes Don Julio the world's most authentic Mexican tequila from the comfort of their own home. Launching this spring, users will have a first-hand opportunity to experience the dedication to craft that brand founder Don Julio González had when he began his tequila making journey in 1942. The Don Julio app experience on Apple Vision Pro will focus on the four key chapters in the Don Julio making process: harvesting the agave, baking the piñas, distilling the liquid, and aging the tequila. Future iterations will feature guided tastings, mixology demonstrations and experiences that will further celebrate the people and cocktail culture of modern Mexico. \"Apple Vision Pro offers us a new opportunity to bring consumers closer to the vibrant world of modern Mexico and all that goes into making Tequila Don Julio an iconic brand,\" said Sophie Kelly, Senior Vice President of Global Tequila and Mezcal Categories at DIAGEO. \"Spatial computing gives us a rich canvas to deliver the closest version of the physical world of Tequila Don Julio through digital content, while allowing users to stay wherever they are in the world. What was once limited to visitor centers, distillery tours and physical activations, we're now able to inspire and educate seamlessly with behind-the-scenes access to our award-winning portfolio.\" Don Julio's app experience developed for Apple Vision Pro is spearheaded through a collaboration between DIAGEO's Global Breakthrough Innovation team led by Director Guy Middleton and Senior Vice President of DIAGEO's Global Tequila and Mezcal Categories, Sophie Kelly. The Breakthrough Innovation team was recently formed to build upon the company's commitment to push the boundaries of how people socialize and shape innovation at DIAGEO beyond the development of new products. The Tequila Don Julio experience on Apple Vision Pro will continue to evolve and is just the beginning as DIAGEO taps into this disruptive technology to bring similar experiences across its portfolio of exceptional spirits. \"The technology behind Apple Vision Pro is an exciting new frontier that empowers us at DIAGEO to further our commitments to be cultural disruptors and provide industry leading experiences for our fans around the world,\" said Guy Middleton, Global Director of DIAGEO Breakthrough Innovation at DIAGEO. \"We're excited to be amongst the first companies to adapt this new technology, enhance the way people discover our brands and help shape the future of immersive storytelling.\" The Tequila Don Julio experience on Apple Vision Pro will be a visionOS application available for users 21+ this spring. Follow @DonJulioTequila on Instagram to stay up to date on the details. ABOUT TEQUILA DON JULIO:Founded on the pioneering agricultural principles of Don Julio González and his personal pursuit of perfection, Don Julio revolutionized the tequila industry and set the standard for ultra-premium tequila. A tequila brand loved by Mexicans, Don Julio uses only the highest calibre, fully matured and ripened Blue Agave that has been hand-selected from the rich, clay soils of the Los Altos region of the state of Jalisco. The Don Julio portfolio includes Don Julio Blanco, Don Julio Reposado, Don Julio Añejo, Don Julio 70 and Don Julio 1942. For more information on Don Julio, please visit www.DonJulio.com. ABOUT DIAGEO NA\n\nDiageo is a global leader in beverage alcohol with an outstanding collection of brands including Johnnie Walker, Crown Royal, Bulleit and Buchanan's whiskies, Smirnoff, Cîroc and Ketel One vodkas, Casamigos, DeLeon and Don Julio tequilas, Captain Morgan, Baileys, Tanqueray and Guinness. Diageo is listed on both the New York Stock Exchange (NYSE: DEO) and the London Stock Exchange (LSE: DGE) and their products are sold in more than 180 countries around the world. For more information about Diageo, their people, brands, and performance, visit www.diageo.com. Visit Diageo's global responsible drinking resource, www.DRINKiQ.com, for information, initiatives, and ways to share best practice. Follow at Twitter and Instagram for news and information about Diageo North America: @Diageo_NA ABOUT TRIGGER XR:Trigger XR is the world's most experienced XR developer and agency. For over 15 years, we've been trusted by some of the biggest companies and IPs to strategize, build and run cutting-edge AR, VR and immersive solutions across mobile and HMD. We push the limits of emerging technologies in service of stories Brands want to tell and people want to hear. Trigger XR has over 8 years of HMD experience, completed over 300+ XR projects and led more than 350,000+ hours of XR development with clients such as Disney, LEGO, Coca-Cola, the NBA, Nike, Mercedes AMG Petronas F1, Starbucks, Verizon and Molson Coors, along with premium entertainment IP including Spider-Man, Star Wars, Avengers, Avatar, Jurassic World and more. We are also exclusive early development partners with Unity, Apple, Niantic, Qualcomm, Roblox, Snap, Meta, Adobe and Google. We offer advisory, creative and development in-house with expertise at every stage of XR production, from R&D and prototyping to scalable mobile and HMD development, including live ops and maintenance. Trigger XR has numerous awards from Clios, Shortys, Auggies and Webbys and was recognized as one of the fastest growing companies by Inc. Magazine. As a minority owned business and a member of the National Minority Supplier Development Council (NMSDC), we collaborate with a diverse slate of clients and partners who represent inclusive values. For more information about Trigger XR, visit us at www.triggerxr.com. View original content to download multimedia:https://www.prnewswire.com/news-releases/diageo-announces-its-first-experience-with-apple-vision-pro-to-bring-tequila-culture-to-fans-around-the-world-302077722.html SOURCE  DIAGEO North America "
}