{
    "title": "Some Apple Vision Pro users are returning the headset because they don't \nknow how to set it up, analyst says",
    "date": "3/13/2024",
    "url": "https://ca.news.yahoo.com/apple-vision-pro-users-returning-181201465.html",
    "text": "Apple says its Vision Pro headset will change how you live and work. But up to 30% of returns are from users unsure how to set it up, says analyst Ming-Chi Kuo. Even so, Kuo estimates a 1% return rate currently for the headset. Apple says its Vision Pro headset will change how you live and work — but some people are apparently having trouble figuring out how to set up the headset in the first place. A significant percentage of Vision Pro returns are from customers who can't figure out how to operate the headset when they first get it, according to a high-profile analyst who recently said he surveyed the product's repair and refurbishment production line. Ming-Chi Kuo, an analyst who often reports on Apple's supply chain, estimates that 20% to 30% of Apple Vision Pro returns stem from users not knowing how to set up the mixed-reality headset, he wrote Wednesday. But overall, Kuo says some of Apple's smaller Vision Pro suppliers are expanding production and he estimates the current return rate for the device is less than 1%. It's not clear exactly what could be tripping up some of the new owners during set-up, but the headset is incredibly high-tech and introduces a new control interface that relies on eye and hand tracking for navigation. There are a few steps to setting up the Apple Vision Pro, according to the company's user guide for the device. After you charge and connect the battery and adjust the headset to comfortably fit your face, you can either set it up manually or by using an iPhone with iOS 17 or iPad with iPadOS 17 or later in close proximity. Once there, you'll need to do your eye and hand input setup, sign in with your Apple ID, and learn the gestures you'll use to navigate while using the device. Some users are returning their Vision Pros for other reasons, including gripes with its bulky design, feeling underwhelmed by its pass-through video quality, and questions over whether it's worth the $3,500 price tag. Some diehard fans, meanwhile, likely wouldn't dream of parting with the headset. One tech worker wore the Vision Pro to his wedding, much to his wife's dismay, while some people are going against safety advice from authorities and crossing the street with the headset on or even driving a Tesla Cybertruck while in the device. Read the original article on Business Insider AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. The post 5 Artificial Intelligence (AI) Stocks That Could Be Millionaire Makers appeared first on The Motley Fool Canada. Some iPhone owners have received a series of notifications about resetting their Apple ID password, followed by a spoofed phone call. IBKR EventTrader - A new, straightforward way to trade CME futures markets Ping Ping Ping A Boston Dynamics SPOT robot that was sent inside a home by Massachusetts state police was shot three times by a person barricaded inside. As the Associated Press reports, the robotics company believes it's the first time one of its robotic dogs has been shot. The remotely-controlled quadruped was deployed earlier this […] While it's easy to draw comparisons to the Microsoft - OpenAI alliance, Wednesday's move by AWS actually signals just how vulnerable Amazon's cloud empire has become. Apple's overseas suppliers have increased production of the company's new iPad models and plans to launch them in early May, Bloomberg News reported on Thursday citing people with knowledge of the matter.  Apple's initial plan was to launch the new iPads by late March or early April, but it is still working to finish the software for the devices, the report added.  The new iPad Pro models will have Apple's latest M3 chip and will come with redesigned versions of the Magic Keyboard and Apple Pencil, the report said.  (Bloomberg) -- Huawei Technologies Co. sustained its run of strong quarterly profit growth, building on the resurgence of its consumer business against Apple Inc.’s iPhone and the rise of its cloud division against incumbent Alibaba Group Holding Ltd.Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the (Bloomberg) -- Microsoft Corp. is trying to make it harder for people to trick artificial intelligence chatbots into doing weird things. Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineSBF’s Best Friends Who Turned on Him Brace for Their PunishmentNew safety features are b Apple will finally launch new iPads in early May, according to Bloomberg’s Mark Gurman. Expected are a new iPad Pro with an OLED display and a faster iPad Air, including a 12.9-inch model for the first time in that lineup. Select Hong Kong and Greater Bay Area (GBA) artists are being showcased at Art Central, an annual international art fair which this year takes... Taiwan's Foxconn hit a record closing high on Thursday as it is set to benefit from growth in AI servers. Elsewhere, CEOs of U.S. chip makers met Chinese leader Xi Jinping. ANCHORAGE, Alaska (AP) — A headless robot about the size of a labrador retriever will be camouflaged as a coyote or fox to ward off migratory birds and other wildlife at Alaska's second largest airport, a state agency said. The Alaska Department of Transportation and Public Facilities has named the new robot Aurora and said it will be based at the Fairbanks airport to “enhance and augment safety and operations,\" the Anchorage Daily News reported. The transportation department released a video of The company is among the fastest-growing cybersecurity players based on my peer analysis If given HK$8 million to spend, Yat says he would invest in digital assets such as non-fungible tokens Caution is needed even with this famous tech behemoth and its fast-growing services business \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. Play this game for 1 minute and see why everyone is addicted. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Trump's former national security adviser shut down a comparison between the ex-president and Julius Caesar. Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… 連續13日閃購，PS5 Slim、Marshall、Switch OLED、AirPods Pro 2、DJI等人氣產品平到笑！ TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. "
}