{
    "title": "Apple Agrees To $490 Million Settlement In Shareholder Lawsuit Over iPhone \nDemand Disclosure | IBTimes",
    "date": "3/15/2024",
    "url": "https://www.ibtimes.com/apple-agrees-490-million-settlement-shareholder-lawsuit-over-iphone-demand-disclosure-3727315",
    "text": "Apple Inc. has reached a $490 million settlement to resolve a class-action lawsuit alleging that Chief Executive Tim Cook misled shareholders by concealing declining iPhone demand in China. The preliminary settlement, filed on Friday in the U.S. District Court in Oakland, California, is subject to approval by U.S. District Judge Yvonne Gonzalez Rogers. The lawsuit stemmed from Apple's surprise announcement on January 2, 2019, when the tech giant revealed plans to slash its quarterly revenue forecast by up to $9 billion, citing trade tensions between the United States and China. Cook's earlier remarks on a November 1, 2018, analyst call, where he did not include China in a list of countries facing sales pressure, were central to the case. Shortly after Cook's comments, Apple instructed suppliers to reduce production. The news of the revenue forecast cut marked a significant event for Apple, representing its first downward adjustment since the iPhone's launch in 2007. Following the announcement, Apple's stock price plummeted by 10%, erasing $74 billion in market value. Apple, based in Cupertino, California, has denied any wrongdoing but agreed to settle the lawsuit to avoid the cost and distraction of prolonged litigation, according to court documents. Shawn Williams, a lawyer representing the shareholders, hailed the settlement as an \"outstanding result\" for the class, which includes shareholders who purchased Apple shares between Cook's comments and the revenue forecast adjustment. The lead plaintiff in the case is the Norfolk County Council as Administering Authority of the Norfolk Pension Fund, located in Norwich, England. The settlement agreement includes provisions for lawyers representing the shareholders to seek fees of up to 25% of the settlement amount. U.S. District Judge Yvonne Gonzalez Rogers refused to dismiss the lawsuit last June, finding it plausible that Cook's statements could have misled investors about Apple's sales outlook. Despite Apple's contention that Cook was addressing currency changes rather than sales projections, the judge ruled that Apple was aware of the slowing Chinese economy and potential decline in demand. The settlement, if approved, would mark the resolution of a legal saga that began nearly five years ago, with shareholders accusing Apple of misleading statements regarding its business in China amid economic challenges and trade tensions between the two countries. The hearing to validate the settlement agreement is scheduled for April 30, 2024. Apple's share price has surged more than fourfold since the events in question, propelling the company's market value to over $2.6 trillion. Despite the settlement's sizeable sum, it represents less than two days of Apple's net income for its latest fiscal year, which totaled $97 billion. © Copyright IBTimes 2024. All rights reserved. "
}