{
    "title": "'It Was Way Over Due': Basecamp CTO Calls Windows Return A Response To \nApple's Epic Games Move",
    "date": "3/7/2024",
    "url": "https://www.tradingview.com/news/benzinga:fe5df2b21094b:0-it-was-way-over-due-basecamp-cto-calls-windows-return-a-response-to-apple-s-epic-games-move/",
    "text": "Basecamp CTO and Ruby on Rails creator David Heinemeier Hansson announced that his company is making a \"return\" to Microsoft Corp.'s MSFT Windows after Apple Inc.'s AAPL \"shenanigans\" in Europe. What Happened: Hansson blamed the announcement on Apple's recent decision to kill progressive web apps (PWA) for iPhone users in the European Union. \"It took Apple's shenanigans with PWAs in Europe to illuminate why having all our computing eggs in one basket was a bad idea in general.\" We're resetting our company culture when it comes to Windows at 37signals. It was way over due. pic.twitter.com/9I3LDc3r4a For context, Apple decided to block web apps for iPhone users in the EU as it updated iOS to comply with the Digital Markets Act requirements. This drew sharp criticism, with famous iPhone hacker \"geohot\" stating that he is not switching back to the iPhone. See Also: Apple Under EU Scrutiny Over Its Decision To Ban Epic Games’ Developer Account Although Apple reversed course and restored web apps' functionality, it has soured sentiments amongst developers. Hansson has gone ahead and called Apple the new \"enemy #1\" of developers, replacing Microsoft. \"Apple is speed-running the fastest destruction of goodwill with developers I’ve ever seen in 40 years of computers. It took Microsoft much longer to poison the pond in the 90s. It’s really a sad sight.\" Apple is speed-running the fastest destruction of goodwill with developers I've ever seen in 40 years of computers. It took Microsoft much longer to poison the pond in the 90s. It's really a sad sight. https://t.co/z0EDSvVDVx Why It Matters: Apple has had an eventful past few months with developers – the latest one being its decision to terminate Epic Games' developer account. This has brought the company under fire from EU regulators, who are already looking into Apple's ban. While Epic Games CEO Tim Sweeney has accused Apple of violating DMA, the EU's immediate inquiry into the iPhone maker's decision has increased the possibility of another legal tussle between the company and regulators. In fact, Apple was just slapped with a $1.95 billion fine by the EU in a 2019 lawsuit brought by Spotify Technology SA. SPOT. Price Action: Apple closed at $168.45, down 0.98% on Wednesday, according to Benzinga Pro. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Marc Andreessen And Former Windows Chief Steven Sinofsky Back Elon Musk Amidst OpenAI Lawsuit: ‘Open Source Can’t Be Secure... 100% Wrong’ Photo by Windows on Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @bradfairbridge @rajbuzzz @Kevin Trinh @Cenobar @arcanebear @udcovers @fx.today @_dalton16 @TradingView @mytradingsetup @ftmocom @chartfeed @olka_gadzieva @mytradingsetup @satoshi_empire @MidasPls @Zeiierman Trading @Onlnternet Whatever the trade "
}