{
    "title": "US government and 15 states sue Apple for alleged smartphone market monopoly",
    "date": "3/21/2024",
    "url": "https://www.wionews.com/business-economy/us-government-and-15-states-sue-apple-for-alleged-smartphone-market-monopoly-702936",
    "text": "This legal action is part of a broader crackdown on Big Tech companies, with Apple joining the ranks of competitors like Google, Meta Platforms, and Amazon that have faced regulatory scrutiny under both the Trump and Biden administrations. The US Department of Justice, along with 15 states, has filed a lawsuit against Apple, accusing the tech giant of monopolising the smartphone market and driving up prices. This legal action is part of a broader crackdown on Big Tech companies, with Apple joining the ranks of competitors like Google, Meta Platforms, and Amazon that have faced regulatory scrutiny under both the Trump and Biden administrations. Reuters cited Attorney General Merrick Garland who said, “Consumers should not have to pay higher prices because companies violate the antitrust laws. If left unchallenged, Apple will only continue to strengthen its smartphone monopoly.” The lawsuit alleges that Apple charges exorbitant prices for its iPhones, with some models priced as high as $1,599, and reaps larger profits compared to its industry peers. The Justice Department claims that Apple imposes various fees on its business partners, including software developers, credit card companies, and even rivals like Google. These hidden charges allegedly contribute to higher prices for consumers and boost Apple's profits. The lawsuit seeks to challenge Apple's longstanding business model, which focuses on controlling nearly every aspect of its technology products, from hardware to software. In response to the allegations, Apple denied any wrongdoing, with the company stating, “This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets. If successful, it would hinder our ability to create the kind of technology people expect from Apple — where hardware, software, and services intersect.” Despite Apple's denial, the Justice Department is pushing for significant changes, including potential structural reforms or breakup of the company to restore competition in the smartphone market. The 88-page lawsuit, filed in US federal court in Newark, New Jersey, aims to “free smartphone markets from Apple's anticompetitive and exclusionary conduct and restore competition to lower smartphone prices for consumers, reduce fees for developers, and preserve innovation for the future.” The lawsuit cites five specific instances where Apple allegedly suppressed technologies that could have increased competition among smartphones, such as super apps, cloud stream game apps, messaging apps, smartwatches, and digital wallets. One of the key issues raised in the lawsuit is Apple's restrictive app store policies, which the Justice Department claims have hindered competition and consumer choice. The government seeks to define the market as that of smartphones in the United States, where Apple holds slightly over half of the market share. However, Apple representatives argue for a global market definition, where the iPhone accounts for only one-fifth of consumers. The Justice Department also referenced an email chain from Apple co-founder Steve Jobs, who passed away in 2011, where he expressed frustration over consumers switching from iPhones to Android phones. Jobs vowed to “force” developers to use Apple's payment systems in an attempt to lock in both developers and consumers. The specific changes sought by the Justice Department remain unclear, but the complaint calls for measures to prevent Apple from using its control over app distribution and contracts to undermine rivals. This is not the first time Apple has faced antitrust probes and legal challenges. The company has been subject to investigations and orders in Europe, Japan, and Korea, as well as lawsuits from corporate rivals like Epic Games. In Europe, Apple's App Store business model has already been impacted by the Digital Markets Act, which requires the company to allow developers to offer their own app stores without paying commissions. (With inputs from Reuters) "
}