{
    "title": "Nvidia's inches closer to surpassing Apple to become world's \nsecond-most-valuable company | Mint",
    "date": "3/9/2024",
    "url": "https://www.livemint.com/companies/news/nvidias-moves-inches-closer-to-surpassing-apple-to-become-worlds-second-most-valuable-company-11709968704420.html",
    "text": "Nvidia, the semiconductor titan behind AI tools like ChatGPT, is rapidly approaching Apple's spot as the world's second-most valuable company.. In a remarkable rally driven by AI advancements, Nvidia's market valuation has surged from $1 trillion to over $2 trillion in just nine months, surpassing Amazon.com, Google-parent Alphabet, and Saudi Aramco along the way, according to a report by CNBC-TV18. Currently valued at around USD 2.38 trillion, Nvidia trails Apple by approximately USD 230 billion and Microsoft by roughly USD 645 billion. The company's relentless ascent, controlling 80 per cent of the high-end AI chip market, has propelled Wall Street to record highs this year, with Nvidia commanding over a 5 per cent weightage on the benchmark S&P 500 index. Nvidia's staggering 95 per cent surge this year, along with Meta Platforms' 46.6 per cent increase, outpaces other members of the \"Magnificent 7,\" underscoring investors' voracious appetite for AI-related assets. Richard Meckler, a partner at Cherry Lane Investments, notes, \"Nvidia's rally reflects the incredibly strong fundamentals underlying its current business model,\" citing widespread speculative interest from long option buyers amid the stock's upward trajectory throughout 2024, as quoted by CNBC Amidst challenges in iPhone sales, Apple yielded its position as the most valuable U.S. company to Microsoft in January, while Nvidia supplanted Tesla as Wall Street's most traded stock by value in recent weeks. Despite its robust performance, Nvidia's stock may be approaching a peak. Analysts' median target price over the next 12 months suggests a valuation of $850 per share, below the last closing price of $926. David Wagner, portfolio manager at Aptus Capital Advisors, emphasizes Nvidia's comparatively lower forward price-to-earnings ratio, suggesting it's “the cheapest of the 'AI narrative' stocks,\" the CNBC report added. During a recent economic forum at Stanford University, Nvidia's CEO Jensen Huang stirred conversation by proposing that artificial general intelligence (AGI) might arise within five years, contingent on how the goal is defined. Huang's comments coincide with Silicon Valley's ongoing quest to develop computers with human-like cognitive abilities, as reported by Mint earlier. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}