{
    "title": "Apple Faces Legal Battle Over iCloud Storage Limits, Alleging Exploitation \nof Users",
    "date": "3/3/2024",
    "url": "https://www.techtimes.com/articles/302249/20240303/apple-faces-legal-battle-over-icloud-storage-limits-alleging-exploitation-users.htm",
    "text": " Apple is facing a lawsuit that alleges the company's 5GB iCloud storage limit is intentionally restrictive. Introduced in 2011, this storage cap has seen minimal adjustment over the years.  A recent class-action lawsuit contends that Apple's iCloud storage practices are deceptive, with plaintiffs accusing the tech company of exploiting users through restricted free space and high upgrade fees. Since its inception in 2011, the 5GB storage limit for iCloud has remained unchanged, leaving many iPhone users feeling constrained. Bloomberg Law reported that the lawsuit highlights Apple's strategy of artificially limiting free storage and then charging steep prices for additional space, a tactic that allegedly stifles competition in the cloud storage market. Upon inspection, many users have reported receiving prompts to upgrade their iCloud storage for more seamless backups, fueling further scrutiny of Apple's practices. According to the lawsuit, Apple exercises significant control over iPhone and iPad users, compelling them to rely on iCloud for comprehensive device backups. The limited 5GB of complimentary storage is viewed as a strategic tactic to drive users towards costly subscription plans. This storage constraint has remained largely unaltered since its inception in 2011. The lawsuit contends that Apple has manipulated the system, anticipating that most users will swiftly deplete their free storage and be compelled to purchase additional storage from Apple. The plaintiffs are specifically concerned about a significant disparity Apple creates: iCloud is granted sole authority to back up specific file formats such as apps and device configurations, while other cloud platforms can handle photos and videos. The lawsuit contends that this grants Apple an unjust advantage, hindering competitors like Google Drive and Dropbox from providing a comprehensive backup solution. Industry experts are puzzled by Apple's approach, noting that there seems to be no valid technical or security rationale behind the company's enforcement of this division. Instead, it appears to be more about market manipulation than consumer protection. The legal proceedings spotlight lead plaintiff Julianna Felix Gamboa, represented by the formidable Hagens Berman law firm. This firm has a track record of successfully confronting tech giants, notably securing a substantial $560 million settlement from Apple in a previous price-fixing case. The law firm is also involved in another class-action lawsuit against Apple regarding its alleged throttling of older iPhones. Also Read: Apple iCloud, 'Find My' Service Outages Have Been Resolved The stakes are undeniably high. If the plaintiffs prevail, it could compel Apple to open up iCloud to increased competition, potentially resulting in reduced prices and broader consumer choices. Apple has yet to respond to the latest lawsuit. Additionally, the company is grappling with other legal hurdles. It is currently under an antitrust probe by the European Commission regarding its practices concerning the App Store and Apple Pay. Furthermore, it faces a lawsuit filed by Epic Games concerning its 30% commission on in-app purchases. Related Article: FBI Expresses Concerns About Apple's New iCloud End-to-End Encryption  Sign up for our free newsletter for the Latest coverage!   "
}