{
    "title": "Why are Apple, Amazon, Google and Meta facing antitrust lawsuits and huge \nfines? And will it protect consumers?",
    "date": "1/23/2024",
    "url": "https://theconversation.com/why-are-apple-amazon-google-and-meta-facing-antitrust-lawsuits-and-huge-fines-and-will-it-protect-consumers-221501",
    "text": "Senior Lecturer, School of Engineering, Australian National University Zena Assaad does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.  Australian National University provides funding as a member of The Conversation AU. View all partners Following a lengthy investigation, the United States Justice Department is set to file a lawsuit against Apple for potentially breaching antitrust laws. The department alleges Apple is using hardware and software limitations that make it harder for rival companies to compete with iPhones and iPads. If the filing goes ahead, it will mean each of the “big four” tech companies – Amazon, Meta, Google and Apple – will have been sued by the US federal government within the past five years for monopolistic business practices. As the digital market continues to grow, many countries including the European Union, Japan, the United Kingdom, the US, China, South Korea, India and Australia have all either introduced, or plan to introduce, competition legislation specific to tech firms. But what are antitrust laws? And how are the tech giants breaching them? Antitrust laws originated with the US Sherman Antitrust Act of 1890. This law banned business arrangements which restrained trade, and prohibited attempts to monopolise. Over time, the Sherman Antitrust Act evolved into what are today’s antitrust laws, adopted in countries all over the world. Antitrust laws are enforced at domestic levels and allegations of breaches of these laws pertain to domestic markets. These laws – also known as competition laws – prohibit business practices that promote unfair monopolies, stifle competition and reinforce dominance or power. In recent years, technology products – whether apps or physical products like phones and computers – have been under an enormous amount of scrutiny. Calls for regulating the development and use of technology have a dominant focus on artificial intelligence. Meanwhile, the business practices of tech giants are garnering less public attention. So it’s noteworthy that the antitrust lawsuits filed against the big four focus on the companies, not just their products. The allegation is these companies are concentrating the market and therefore charging higher markups for their goods and services, while having less incentive to innovate in ways that benefit consumers. Of the big four, Apple is not the first to be accused of breaching antitrust laws. In the past decade, the European Union has fined Google a total of €8.25 billion (A$13.6 billion) for three separate breaches of EU’s antitrust laws. These related to misuse of Google Shopping to disadvantage competitors in 2017, unfair dominance of the Android operating system market in 2018, and abusive practices in online advertising in 2019. The advertising business accounts for 80% of Google’s income. While Google and its parent company Alphabet did enact some changes to their practices following these EU rulings, to date Google has not paid these fines and continues to appeal them in various instances. In 2020, the US Justice Department also filed an antitrust lawsuit against Google for monopolising multiple digital advertising technology products. The ongoing lawsuit claims Google monopolised the “ad tech stack” – the key technologies publishers and advertisers use to sell and buy ads. It is alleged Google neutralised or eliminated ad tech competitors through acquisitions, which forced publishers and advertisers to use its products. Read more:\n      The US is taking on Google in a huge antitrust case. It could change the face of online search In 2021, the US Federal Trade Commission and more than 40 US states sued Meta, claiming the tech company eliminated competition by buying up its rivals. The two biggest purchases under scrutiny are Instagram, which was purchased for US$1 billion in 2013, and WhatsApp, which was purchased for US$19 billion in 2015. The lawsuit alleges these purchases eliminated competition which had the potential to challenge Meta’s dominance. In 2023, the US Federal Trade Commission and 17 state attorneys general sued Amazon, claiming the tech company used anticompetitive and unfair strategies to maintain a position of dominance in the market. The US lawsuits against Google, Meta and Amazon are ongoing, with no decisions handed down as yet. The Australian federal government has also been investigating global tech giants. Since 2021, the government has investigated legislative methods for protecting Australian consumers. One example is the Australian Competition and Consumer Commission (ACCC) news media bargaining code. The code requires digital platforms operating in Australia to compensate domestic news publishers for the use of their content. Read more:\n      How 2021 was the year governments really started to wise up against big tech Despite these advancements, Chandni Gupta, Deputy CEO and Digital Policy Director at the Consumer Policy Research Centre, points out: There are gaps in both Australia’s privacy laws and the consumer law, which can leave Australians with far fewer protections online than consumers in the US and other countries. The ACCC released its second Digital Platform Services Inquiry interim report in 2021. The report’s findings indicate Google’s Play Store and Apple’s App Store have significant market power in the distribution of mobile apps in Australia, and measures are needed to address this. Examples of measures the ACCC proposed include increasing transparency and providing greater choice of default apps for consumers. In 2023, ACCC chair Gina Cass-Gottlieb publicly addressed the dangers of the big four. The commissioner referred to the tech giants as “serial acquirers” and raised concerns about their measures for extending and protecting their market power. Antitrust laws exist to maintain fair competition among businesses. Breaches of these laws mean companies are influencing the market to the detriment of other, usually smaller companies. If governments are successful in holding tech giants to account, this could drastically redefine the tech market, making way for more equitable competition and more ethical business practices. Copyright © 2010–2024, The Conversation "
}