{
    "title": "Meta is hoping Apple's Vision Pro can help save the metaverse",
    "date": "1/30/2024",
    "url": "https://www.businessinsider.in/tech/news/meta-is-hoping-apples-vision-pro-can-help-save-the-metaverse/articleshow/107266291.cms",
    "text": "Liked the article? Share it with your friends... or copy link Meta is feeling good about Apple's entry into the VR arena. The iPhone maker is preparing to launch its mixed-reality headset, the Vision Pro, later this week. But, according to a report from The Wall Street Journal, Meta is optimistic about the competition. Meta execs view Apple's entry into the market not just as a validation for Mark Zuckerberg's pivot to the metaverse, but also as a way to draw in more customers, the Journal reported, citing unnamed sources. They said the company hopes its Quest headset could become the Google Android of the metaverse. Meta's headset is being sold for around $500, a fraction of the Vision Pro's $3,500 price tag. The latter device's hefty price tag, which has already proved to be a sore spot with potential buyers, may push customers towards Meta's cheaper alternatives. The price for Apple's latest offering has raised eyebrows with those already using the metaverse. One Oculus user told the Financial Times he found the idea of paying $3,499 laughable. It's not the first time Apple's new product has been linked to the rival tech company. Some commentators have theorized that Apple's headset is a form of insurance against Meta. Bloomberg reported that Apple would face issues if augmented reality headsets took off and it did not have a product in the space. The Vision Pro is more of a defense against the potential popularity of this tech, he argued. Zuckerberg's decision to go all-in on the metaverse failed to resonate with consumers and has cost the company billions. A recent BI analysis of regulatory filings found that Meta has lost a cumulative $47 billion in its metaverse-focused Reality Labs division since 2019. Still, Zuckerberg says he has no plans to give up on the dream. He told The Verge: \"I don't know how to more unequivocally state that we're continuing to focus on Reality Labs and the metaverse.\" Meta company was still pouring more than $15 billion a year into the project, Zuckerberg added. Representatives for Meta did not respond to a request for comment from Business Insider. Advertisement "
}