{
    "title": null,
    "date": "1/15/2024",
    "url": "https://investorplace.com/2024/01/7-ar-stocks-to-bet-on-ahead-of-apples-vision-pro-release/",
    "text": " These 7 AR stocks are set to get a boost as virtual reality headsets advance with the release of the Vision Pro Advertisement          Source: Gorodenkoff / Shutterstock Over the last few years, investors have become increasingly interested in the idea of virtual reality (VR), or augmented reality (AR), as a broad opportunity. The emergence of the metaverse during the pandemic served to heat up conversation around the topic. And the apparent opportunity has only become clearer as the technology has developed. With this, AR stocks are on the rise. With an expected CAGR above 24% between 2024 and 2029, the virtual reality market and stocks therein are very attractive. There’s also more immediate news that will inspire investors in the coming weeks – Apple is set to release its Vision Pro in early February. Its release will prompt greater interest in the sector overall and is a great reason for investors to consider directing money into these firms at the moment. The News that Apple’s (NASDAQ:AAPL) Vision Pro will be on store shelves on Feb. 2 makes it the most important stock in this conversation. The Vision Pro won’t contribute much to Apple’s fundamentals in the near term but that doesn’t mean it won’t serve to propel its shares higher. The simple truth is that despite the Vision Pro’s high price of $3,499, sales aren’t expected to be particularly significant. Recent estimates suggest that Apple could sell about 1 million of the headsets in 2024. That means the company will only see a few billion dollars extra in revenues from The Vision Pro at best. Frankly, that doesn’t move the needle much for Apple due to its massive size. So, why then should investors assume that the release of the Vision Pro will positively affect Apple’s share price? The most obvious answer is that sales could dramatically increase in the next few years, for one. In time, the Vision Pro could contribute significantly to Apple’s fundamental growth. And two, Apple has an incredibly strong track record of impactful product releases that tend to do very well. Meta Platforms (NASDAQ:META) has long been one of the leading names in the development of the virtual reality space. The company then known as Facebook acquired AR firm Oculus in 2014. CEO Mark Zuckerberg has long been a strong proponent of virtual reality dating back beyond the metaverse branding pivot in 2021. Back in 2017 Zuckerberg announced at the Oculus Connect conference that he wanted to get 1 billion people in virtual reality. That was a bold assertion at the time given that the company had only sold roughly 1 million VR headsets at that point. However, Zuckerberg has not slowed down which was made all the more clear by the company’s brand pivot and renaming to Meta Platforms in late 2021. Fast forward a few years, and the company had sold more than 20 million VR headsets through early 2023. Obviously 20 million is well short of 1 billion, but Meta Platforms is well positioned to chase that goal moving forward. Apple’s early February release of the Vision Pro 2 will rekindle interest in Meta Platforms as it chases that goal. Universal Display Corporation (NASDAQ:OLED) supplies organic light emitting diodes (OLEDs) that are critical to the manufacturer of VR/AR headsets. All kinds of companies including Sony (NYSE:SONY) and Apple use OLED in their headsets, making Universal Display Corporation an interesting stock to consider. Investors should also note that Universal Display Corporation is positively regarded on Wall Street. Its shares currently benefit from an overall ‘buy’ rating and moved up from a lower ‘overweight’ rating just a month ago. The high target price among the 12 analysts with coverage suggests that OLED shares could rise by 50% in the next 12 to 18 months. Information regarding some of the company’s more than 5,500 current patents can be found here. The overall thrust, though, is clear – Universal Display Corporation is well positioned to benefit from licensing opportunities as the virtual reality space continues to develop. Companies like Sony and Apple will continue to purchase the rights to that technology. That truth is all the more pertinent as Apple gears up to release the Vision Pro in the coming weeks. Unity Software (NYSE:U) will continue to be an interesting stock to consider in the VR space for one simple fact: graphics are incredibly important to the success or failure of the entire sector. The company has developed software that allows developers to create the 3D images used throughout them. If those images are subpar, disaster is not far away. For example, remember when Mark Zuckerberg and Meta Platforms first released their demos of the Metaverse? The graphics were downright childish and led to wide derision of the company’s Metaverse pivot. It wasn’t the end and that demo also did not fully represent the firm’s graphical capability. However, it does reinforce the idea that quality graphics are vitally important throughout the industry. More to the point, Apple and Unity Software are already partners. The release of the Vision Pro in early February should serve to redirect investors again toward Unity software and its shares. Nvidia (NASDAQ:NVDA), like Unity Software, is a very important stock to consider in virtual reality in relation to the importance of graphics. Nvidia’s GPUs are known to be the very best and benefit from wide application in gaming consoles and PCs. What’s interesting here is that the world of virtual reality/mixed reality/augmented reality requires even better graphical capabilities. Users demand strong graphics first and foremost whereas graphics are less important in platform gaming. Nvidia has created a developer tool kit which is geared toward virtual reality. In short, Nvidia’s graphical prowess is very well known at this point. The company clearly has a strong opportunity in the continued development of the virtual reality space and a highly established name overall. Its chips continue to be in high demand for multiple applications including virtual reality. Further, Nvidia obviously has and will continue to have a massive opportunity in relation to artificial intelligence. Thus, its shares expose investors to multiple paths toward continued strong growth overall. Microsoft (NASDAQ:MSFT) is one of the largest tech companies in existence. Silicon Valley firms have a presence across almost any given area of technology. Thus, it shouldn’t surprise readers to understand that the company has a significant role in the development of virtual reality. MSFT stock is strong for many reasons with the VR opportunity serving to further bolster investor confidence. That statement might seem a bit contradictory given recent news around Microsoft’s Windows VR headsets. The company announced in December that it was discontinuing those headsets, which have thus far been slower sellers relative to those of competitors throughout Silicon Valley. It’s difficult to believe that Microsoft will scrap the project on a wholesale scale. The company’s HoloLens 2 has a wide enterprise level application. firms are using it to enhance productivity and capability in workplace situations. Despite some clear setbacks to date, anticipate that Microsoft will figure out a way to make money from future continued development of virtual reality. The company has shown a continued investment in the artificial intelligence space which only makes that possibility greater. Qualcomm (NASDAQ:QCOM) Is another firm that has a wide footprint across the technology sector. Like Microsoft, Qualcomm is a very well established player in Silicon Valley. Both stocks are very stable overall and are strong choices for investors looking to gain exposure to VR without substantial risk. Let’s begin with looking at the reasons to consider Qualcomm for the short to medium term. Most importantly, Qualcomm recently extended its contract with Apple through 2026. That contract provides Qualcomm with a lot of stability that eases prior concerns. As much as Apple would like to bring more of its chip production in house, it simply isn’t as easy as wishing it to be. Qualcomm continues to provide technology that Apple is incapable of replicating. The long and short of that truth is that Qualcomm will continue to be a steady stock in the coming years. In short, Qualcomm is a very stable stock. That notion is reinforced by the fact that the company pays a dividend yielding roughly 2.3% last reduced more than two decades ago. All of that said, Qualcomm is leveraging its well regarded Snapdragon chips for the development of virtual reality. Further, the company has developed its own virtual reality/augmented reality glasses. Qualcomm continues to be a strong stable stock overall and one that should benefit from increased interest following the release of the Vision Pro headset. On the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Alex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/7-ar-stocks-to-bet-on-ahead-of-apples-vision-pro-release/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}