{
    "title": "Apple's 2024 Stock Sees Worst Start in Over 40 Years",
    "date": "1/8/2024",
    "url": "https://retailwire.com/apples-2024-stock-sees-worst-start-in-over-40-years/",
    "text": "Logout Photo by Laurenz Heymann on Unsplash January 8, 2024 Dennis Limmer Apple’s commencement into 2024 has seen a historic development that has taken an unexpected turn for the worse. The tech company’s shares have dropped for the first four trading sessions of the year, marking the first such occurrence in over 40 years. This streak has extended to five consecutive trading days if we consider the last session of 2023. This sequence of losses has led to a 6.4% decrease in Apple’s stock value, which is the company’s worst performance since September 2023 when its shares dipped by 7.1%. This sequence of events has led to Apple losing a staggering $193 billion in market capitalization. Simultaneously, Microsoft is now edging closer to seizing the title of the most valuable U.S. company, a spot it hasn’t occupied since late 2021. The difference in market value now stands at less than $100 billion between the two tech giants. There are several attributed causes for Apple’s stock downfall. One critical issue is a patent dispute involving the Apple Watch Series 9 and Apple Watch Ultra 2. While an appeals court last year temporarily halted an import ban on these devices, Apple may soon have to face larger legal challenges. The Department of Justice is reported to be drawing close to launching a broad antitrust lawsuit against the company. Adding more woes to Apple’s start of 2024, the company’s stock was also downgraded by two independent analysts during the first trading week. Analysts raised concerns over its valuation and growth prospects, further churning the waters for the company’s financial well-being. However, despite the precarious start, it’s important not to prematurely write off Apple. As history has demonstrated, a shaky start does not dictate the final outcome. In 1982, Apple saw a similar rocky start but ended the year with an increase of 35% in its stock value. Recent News In a bid to beat rival platforms like Instagram and TikTok, YouTube has revealed that numerous creators are now monetizing their short videos on the platform and earning a sizable paycheck. Read More A Creator on YouTube Earns $20,000 a Month to Make 1-Minute VideosContinue As the battle to bring the most cost-effective electric vehicles to the market heats up, the Chinese smartphone company Xiaomi announced that its first electric car will go on sale for significantly less than Tesla’s Model 3. Read More Xiaomi Unveils EV $4K Cheaper Than Tesla’s Model 3Continue SpaceX CEO Elon Musk has proposed an ambitious plan to make travel to Mars affordable for the masses. Musk envisions a ticket price of $100,000, believing it could be achievable for most individuals through hard work and saving. Read More SpaceX’s ‘Affordable’ Journey to MarsContinue Kroger, the grocery chain, has announced the closure of three spoke facilities in its e-commerce operations in Texas and Florida. This decision marks a strategic shift for the company in its efforts to streamline operations and enhance efficiency. Read More Kroger Shuts Down E-Commerce Spoke Facilities in Texas and FloridaContinue Retail industry’s premier source for news, analysis, and discussion. © 2023 RetailWire · Privacy Policy · Community Guidelines · Sitemap Username or Email Address Password Remember Me  Lost your password? Don't have an account yet? Sign up "
}