{
    "title": "Apple to see little impact from EU regulations, says investing firm",
    "date": "1/25/2024",
    "url": "https://appleinsider.com/articles/24/01/25/apple-to-see-little-impact-from-eu-regulations-says-investing-firm",
    "text": "Copyright © 2024, Quiller Media, Inc. Contact Us | Privacy Policy Apple's EU changes won't have impact on revenue J.P. Morgan says Apple won't see much immediate impact on App Store revenue due to how its new fee structure is arranged, but regulators around are likely eyeing the solution.\r  Apple has changed how it does business in the EU due to the Digital Markets Act. Amongst other changes, it reduced its overall commission from 30% to 17% and added a fifty-cent fee on all apps downloaded after a developer passes 1 million downloads.\rAccording to a finance note seen by AppleInsider from J.P. Morgan, these changes will have little impact on Apple. The fifty-cent fee will balance out the reduced commissions, and Europe only accounts for about 6% of App Store revenue.\rChanges to the App Store market in the EU are restricted to that region. However, regulators around the world may seek to achieve similar results. The United States, for example, is already \"firing on all cylinders\" in an antitrust investigation on Apple's App Store.\rThe implementations for Apple's App Store changes in the EU won't go into effect until iOS 17.4 is released in March. The beta for the update released earlier Thursday. Apple has changed how it does business in the EU due to the Digital Markets Act. Amongst other changes, it reduced its overall commission from 30% to 17% and added a fifty-cent fee on all apps downloaded after a developer passes 1 million downloads. According to a finance note seen by AppleInsider from J.P. Morgan, these changes will have little impact on Apple. The fifty-cent fee will balance out the reduced commissions, and Europe only accounts for about 6% of App Store revenue. Changes to the App Store market in the EU are restricted to that region. However, regulators around the world may seek to achieve similar results. The United States, for example, is already \"firing on all cylinders\" in an antitrust investigation on Apple's App Store. The implementations for Apple's App Store changes in the EU won't go into effect until iOS 17.4 is released in March. The beta for the update released earlier Thursday. Wesley Hilliard served ten years as a Nuclear Power Electrician in the US Navy, then jumped careers in 2019. Today, he is Assistant Editor, Podcast Cohost, SEO Specialist, and Social Media Manager for AppleInsider. I believe Apple will be selling more iPhones in Europe, currently many people are thinking the platform is not open enough. I believe Apple will be selling more iPhones in Europe, currently many people are thinking the platform is not open enough. A lot of developers, both legit and non-legit, must be disappointed.  They probably thought the EU forcing Apple to open up to side loading and 3rd party app stores means that iOS will turn into a free-for-all platform where any app can be installed and that Apple won't charge a commission anymore.  Unfortunately for them, the EU is not stupid enough to force Apple to abandon its focus on security and privacy or to impose price controls in the form of requiring commission-free app installation.Devs dreaming of squatting on iOS for free have been living on Cloud Cuckoo Land.  Forbidding Apple to charge iOS app developers is like forcing malls to lease retail space for free.  Maintaining an app platform, just like maintaining a physical mall, is not a cost-free proposition. A lot of developers, both legit and non-legit, must be disappointed.  They probably thought the EU forcing Apple to open up to side loading and 3rd party app stores means that iOS will turn into a free-for-all platform where any app can be installed and that Apple won't charge a commission anymore.  Unfortunately for them, the EU is not stupid enough to force Apple to abandon its focus on security and privacy or to impose price controls in the form of requiring commission-free app installation.Devs dreaming of squatting on iOS for free have been living on Cloud Cuckoo Land.  Forbidding Apple to charge iOS app developers is like forcing malls to lease retail space for free.  Maintaining an app platform, just like maintaining a physical mall, is not a cost-free proposition. xyzzy-xxx said:\nI believe Apple will be selling more iPhones in Europe, currently many people are thinking the platform is not open enough.\n\r\nThing is, hardly anyone thinks like this, except bureaucrats. It's the same with the US political obsession with 'big tech'. Consumers haven't been complaining about this, the lawmakers are in their own bubble. Apple has some of the highest customer satisfaction ratings for all their products, the only ones who have been asking for more freedom is billionaire companies who don't want to pay any commission, all while their own businesses collect commission on their own products and services.Consumers don't complain about not being able to install a particular app on their device or the commission fee that they never see on their $0.99 purchases. Nor will the prices change, the billionaire companies will just keep more.Companies like Match.com have been complaining about it, they made $3.1b in 2022, $848m from Europe:https://d18rn0p25nwr6d.cloudfront.net/CIK-0000891103/de338546-2c7e-4e51-adf0-c83bb15ab356.pdfThey had 30% costs ($959m) attributed mainly to the commission fee. This is more than their net income ($360m). It looks like Apple and Google make more profit from their product/service than they do, which can't sit well with their shareholders.There isn't a large mass of Apple consumers waiting for more freedom. Google has had it for years and it's only used by Amazon and Chinese app stores, consumers stick with the store that's on their device because it's safe and easy.What will probably happen is there will be a store for Epic, one for Match, one for Microsoft (including Candy Crush now) and they will each host their own products to avoid paying a fee.I suspect European App Store revenue is higher than 6%, for Match.com it's 27%. Generally, there are 3 big markets - US, Asia, Europe, split roughly 50:25:25. This will impact a portion of 25% of Apple's App Store revenue. It could be a significant portion if all the billionaire companies skip out on the bill but small vs Apple's overall revenue. Thing is, hardly anyone thinks like this, except bureaucrats. It's the same with the US political obsession with 'big tech'. Consumers haven't been complaining about this, the lawmakers are in their own bubble. Apple has some of the highest customer satisfaction ratings for all their products, the only ones who have been asking for more freedom is billionaire companies who don't want to pay any commission, all while their own businesses collect commission on their own products and services.Consumers don't complain about not being able to install a particular app on their device or the commission fee that they never see on their $0.99 purchases. Nor will the prices change, the billionaire companies will just keep more.Companies like Match.com have been complaining about it, they made $3.1b in 2022, $848m from Europe:https://d18rn0p25nwr6d.cloudfront.net/CIK-0000891103/de338546-2c7e-4e51-adf0-c83bb15ab356.pdfThey had 30% costs ($959m) attributed mainly to the commission fee. This is more than their net income ($360m). It looks like Apple and Google make more profit from their product/service than they do, which can't sit well with their shareholders.There isn't a large mass of Apple consumers waiting for more freedom. Google has had it for years and it's only used by Amazon and Chinese app stores, consumers stick with the store that's on their device because it's safe and easy.What will probably happen is there will be a store for Epic, one for Match, one for Microsoft (including Candy Crush now) and they will each host their own products to avoid paying a fee.I suspect European App Store revenue is higher than 6%, for Match.com it's 27%. Generally, there are 3 big markets - US, Asia, Europe, split roughly 50:25:25. This will impact a portion of 25% of Apple's App Store revenue. It could be a significant portion if all the billionaire companies skip out on the bill but small vs Apple's overall revenue. Apple will be holding WWDC 2024 from June 10, showing off its future operating system updates and maybe even new hardware. This is what has been rumored so far. Time Machine is Apple's backup system that automatically saves your Mac's files. Here's how to use the macOS file protection feature. Sponsored Content As streaming becomes more unreliable, having a backup copy is becoming a greater priority, leaving more internet users turning to a YouTube video downloader for various reasons. We checked out the 4K Video Downloader app on Mac to learn how to download YouTube videos for free. Canada's complex car theft ring, which often involves stealing and shipping expensive cars and SUVs around the world, just got even creepier thanks to AirTag. We now have a date for WWDC 2024, we have perhaps more idea than ever of just what it will cover, and we have ever increasing rumors of a smart Apple Ring. All we need now is the release of new iPads. B&H has dropped MacBook Pro prices further as March comes to a close. Pick up an M3 MacBook Pro with 16GB RAM for just $1,549 — or opt for the M3 Pro MacBook Pro 14-inch for $1,699. Both are record-breaking deals. Fake iPhones, AirPods and iPhone cases were among counterfeit goods seized in police raids in Northern Ireland. A photograph of cases intended for the iPhone 16 indicates at least one accessory producer is leaning in on rumors of a new vertical camera arrangement in the new models. With the earliest possible trial date start likely in late 2026, analysts are generally nonplussed by the Department of Justice omnibus antitrust suit and are telling investors to stick with Apple. Aiming to show that its carbon reduction efforts are not mere \"climate-washing,\" Apple has spotlighted how its Restore Fund is contributing to the restoration of a Brazilian rainforest, and attempts to save over 3,000 types of tree from extinction. Investment firm Evercore says Apple is facing weakening demand and strong competition from AI rivals, but investors should stick with it for the long term.  "
}