{
    "title": "Apple smart ring development accelerating, claims sketchy report",
    "date": "2/20/2024",
    "url": "https://9to5mac.com/2024/02/20/apple-smart-ring/",
    "text": "A sketchy report claims that development of an Apple smart ring is accelerating, following a teaser by Samsung of its own upcoming Galaxy Ring (shown above). The Korean report is light on details, citing an unnamed source claiming that “pre-development for commercialization is imminent” … What seems to have prompted this latest report is Samsung last month teasing its own smart ring, the Galaxy Ring. At the end of its event this morning, Samsung dropped a very brief teaser for the “Galaxy Ring,” an upcoming smart health tracker that you wear on your finger. Samsung’s teaser mentions the device will offer health tracking and use AI in some capacity, but there’s no word on pricing or when the device will launch. This appears to be similar to the Oura Ring: ET News has more detail on the Galaxy Ring. Samsung Electronics is scheduled to unveil the Galaxy Ring at the unpacked event in the second half of July. It is expected to track and measure health and sleep-related information by being equipped with blood flow measurement and electrocardiogram functions, or support remote control of other devices, wireless payment, etc. But it builds on this to suggest Apple its accelerating its own work on a competing product. Apple is also speeding up the development of Apple Ring by registering patents related to smart rings one after another. In November of last year, it filed a patent for an electronic system applied to the U.S. Patent and Trademark Office (USPTO). It is a technology that can install a near-field wireless communication circuit and work with other devices. It is estimated that it will be used to control smartphones, tablets, etc. “As Apple has been steadily releasing smart ring-related patents for years, it seems that pre-development for commercialization is imminent,” an industry official said. This report seems to be based on nothing more than the opinion of one unnamed source, and we’re definitely putting it on the ‘sketchy’ pile. We’ve literally been hearing talk of an ‘iRing’ in one form or another for more than a decade now, with a couple of analysts in particular pushing the idea. Yes, it’s true that Apple has patents in this area – but as we frequently note, Apple patents all kinds of things, only a tiny fraction of which ever make it to market. The idea that Samsung’s launch would influence the timing of any Apple launch is especially silly: The Cupertino company always operates on its own timescale, launching as and when it thinks the technology is ready and the time is right. None of this is to say that an Apple Ring won’t happen. Apple’s patent history clearly indicates that the company has been at least exploring the idea, and there are definitely benefits to the form factor for those who want the health monitoring features of an Apple Watch in a more compact form factor with a longer battery-life. But this particular report really doesn’t shed any light. Image: Samsung (Galaxy Ring teaser) FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}