{
    "title": "As Part of Its Big Design Change, the iPhone 16 Could Feature ‘Ultra-Thin \nBezels’ Based on Latest Screen Potector Leak",
    "date": "2/21/2024",
    "url": "https://wccftech.com/iphone-16-slim-bezels/",
    "text": "Apple will potentially launch the new iPhone 16 models in September of this year, and the company has planned a slew of upgrades for the handsets. We have previously reported that the company is looking to redesign the camera layout on the back for the standard models and a redesigned camera housing for the 'Pro' models. It appears that the company has additional surprises in store for users, which are shaping the device to be a major upgrade over the current models. iPhone 16's leaked screen protector features slim or ultra-thin bezels as part of a major design change from Apple. The iPhone 15 Pro models launched with one of the slimmest bezels on a smartphone. However, the company wants to take a step further as it seeks to trim down bezels on the standard models next, based on the latest leaked screen protector details from Majin Bu on X. The tipster claims that in comparison to the current iPhone 15 Pro, the iPhone 16 could feature a bezel size of 3mm. It can be seen in the image embedded below that the bezels of the iPhone 16 screen protector are significantly trimmed down. Note that Apple has trimmed-down the bezels on the iPhone 15 Pro as well compared to the iPhone 14 Pro. The company is bringing the same change to the standard iPhone 16 lineup. However, there are several factors that need to be considered before drawing a conclusion on the bezel size of the iPhone 16. The tipster mentions that the bezels of the iPhone 16 screen protector are trimmed down, which does not necessarily mean that the bezels of the device will be slimmer. Additionally, these are early leaks, and the company has yet to finalize the design of its forthcoming iPhones. Henceforth, we would advise readers to take the news with a grain of salt. Apple will potentially begin mass production by the end of the first half of this year, so the company has a lot of time to make adjustments. Apart from the bezel size, Apple is reportedly working on redesigning the camera layout on the iPhone 16 and iPhone 16 Plus. However, we have previously covered that the iPhone 16 Pro models could also feature a redesigned camera housing on the back. While these are mere speculation at this stage, what we do know is that the iPhone 16 models will be the first to get Apple's AI features with the launch of iOS 18 later this year. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}