{
    "title": "S&P 500 Flirts With 5000 As Magnificent 7 Tops $13 Trillion, NYCB Sinks: \nWhat's Driving Markets Wednesday? - Apple ...",
    "date": "2/7/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36988926/s-p-500-flirts-with-5-000-as-magnificent-7-tops-13-trillion-nycb-sinks-whats-driving-markets-wed",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Wednesday is a bullish day on Wall Street, with major large-cap indices extending record highs, aided by robust corporate earnings. Despite the overall market optimism, concerns linger within segments such as regional banks, highlighting investor caution. The S&P 500 surged to an intraday high of 4,995 points, inching up 0.6%, while the tech-centric Nasdaq 100 slightly outpaced it with a gain of 0.8%. Small-cap stocks experienced a modest dip, declining by 0.3%. The so-called Magnificent Seven — Apple Inc. AAPL, Microsoft Corp. MSFT, Alphabet Inc. GOOG GOOGL, Amazon Inc. AMZN, Meta Platforms Inc. META, NVIDIA Corp. NVDA and Tesla, Inc. TSLA — collectively exceeded a market capitalization of $13 trillion, underscoring their dominant market presence. Market movements were relatively muted in both Treasury yields and the dollar, even as Federal Reserve officials Neel Kashkari,  Ariana Kugler and Susan Collins made statements Wednesday, reinforcing the message that the central bank is not poised to cut rates in the immediate future. New York Community Bancorp NYCB saw a further 8% decline following downgrades by Moody’s and Fitch to its credit rating, accompanied by Bank of America and JPMorgan adjusting their stock recommendations from Overweight to Neutral. In the cryptocurrency space, Bitcoin BTC/USD advanced 1.3% to $43,600, positioning itself for the highest close since Jan. 12. The SPDR S&P 500 ETF Trust SPY was 0.7% higher to $497.13, the SPDR Dow Jones Industrial Average DIA rose 0.4% to $386.51 and the tech-heavy Invesco QQQ Trust QQQ rose 0.8% to $430.97, according to Benzinga Pro data. Sector-wise, the Consumer Discretionary SPDR Select Sector Fund XLY outperformed, up 0.9%, followed by the Technology SPDR Select Sector Fund XLK, up 0.8%. The Energy SPDR Select Sector Fund XLE, down 0.2%, was the laggard. Read now: Disney’s Sports Streaming JV Will Help ‘Collect Lost Revenue From Cord Cutters,’ Analyst Says Photo via Shutterstock. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}