{
    "title": "Apple gets record shipments in India. This iPhone is sold most",
    "date": "2/11/2024",
    "url": "https://www.hindustantimes.com/technology/apple-gets-record-shipments-in-india-this-iphone-is-sold-most-101707662966378.html",
    "text": "Subscribe Now! Get features like In the October- December quarter, Apple achieved record shipments in the Indian smartphone market, capturing a 7 per cent market share, according to Canalys research. The report says that Indian smartphone vendors capitalised on robust festival season demand, propelling Q4 shipments to an impressive 3.89 crore units, representing a substantial 20 per cent year-on-year rebound. ALSO READ- Xiaomi says suppliers concerned over India's heavy scrutiny of Chinese firms The premium segment experienced notable growth during this period, attributed to factors such as easy financing options, incentive schemes for retailers, and a rise in disposable income. Apple, strategically leveraging the Diwali celebration in November 2023, pushed its latest iPhone 15 series during festive sales, contributing over 50 per cent to its Q4 shipments, the report said. Additionally, discounts on the previous-generation iPhone 14 and iPhone 13 models during online sales further boosted Apple's shipments, allowing it to secure a 7 per cent market share, it added. ALSO READ- Apple announces five major changes for iPhones in Europe. Details According to the report, Samsung maintained its leading position in Q4 2023 with a 20 per cent market share and shipments totalling 76 lakh units. Xiaomi continued its robust performance, claiming the second spot by shipping 72 lakh units, followed by Vivo in third place with shipments of 70 lakh units. Realme and OPPO (excluding OnePlus) rounded out the top five, shipping 45 lakh and 37 lakh units, respectively. ALSO READ- Apple Vision Pro underlines a world with virtual overlays, and flagship phones are changing For the entire year of 2023, India's smartphone market demonstrated stability, with 14.86 crore shipments overall, experiencing only a marginal 2 per cent drop. Despite challenges such as inventory issues, minimal inflation improvements, and fluctuating demand, the market showcased resilience, with improved consumer confidence in the latter part of the year, the report said. Looking ahead to 2024, Canalys anticipates mid-single-digit growth in the Indian smartphone market, driven by the affordability of 5G devices and the replacement cycle following the pandemic. However, managing the increasing costs of bills of materials will be a significant challenge for vendors in the coming year. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}