{
    "title": "You may lose access to your Netflix account if you're paying through Apple",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/may-lose-access-netflix-account-010146472.html",
    "text": "Netflix wants its customers to stop paying for its streaming subscription through Apple’s App Store. Members billed through Apple may soon be prompted to change their payment plan, a new addition to Netflix’s help site reads. According to a spokesperson for Netflix, if a new payment isn’t added by the monthly subscription renewal date, the member will not be able to use their Netflix account until a new payment method is added. The policy change will affect members using Netflix’s basic plan in countries including the United States and Canada, according to the spokesperson. The update by Netflix comes as Apple has faced years of pushback from apps in its iOS App Store for taking a 30% cut of all in-app purchases. Apple has said it takes a lower 15% cut in some situations. Netflix stopped accepting Apple payments for new and rejoining customers in 2018, but Netflix’s policy change means existing customers who had been grandfathered into paying through Apple will now have to make the switch. Previously, Apple had prohibited many iOS apps from skirting the 30% charge by accepting payments outside of Apple’s proprietary payment system. But in 2021, Apple relaxed its restrictions for Netflix and other streaming companies like Spotify, allowing those apps to insert a link out to external websites to let people set up or manage their accounts outside of Apple’s App Store. Apple’s in-app purchase fees have been the subject of ire from app developers for years. Last month, in a blow to Apple, the US Supreme Court declined to review a lower court’s order requiring Apple to allow all developers to add buttons or links that direct customers to purchase in-app content through other payment channels. The decision was connected to a 2020 lawsuit against Apple by Epic Games, the maker of the popular video game Fortnite, which accused Apple of antitrust violations for its in-app fee collection practices. - CNN’s Brian Fung contributed to reporting. For more CNN news and newsletters create an account at CNN.com Related Quotes "
}