{
    "title": null,
    "date": "2/4/2024",
    "url": "https://www.moneycontrol.com/news/technology/foxconn-sees-slightly-better-2024-warns-on-ai-chip-shortage-12189101.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Taiwan’s Foxconn, Apple’s biggest iPhone assembler and the world’s largest contract electronics maker, expects its business this year to be \"slightly better\" than last year but is facing a shortage of chips for AI servers. \"We did pretty well last year, although we had a rather large write off in the first quarter,\" Foxconn Chairman Liu Young-way said on Sunday, referring to a writedown related to its 34% stake in Japanese electronics maker Sharp Corp. \"As for this year’s outlook, I think it might be slightly better than last year,\" Liu told reporters on the sidelines of the company’s annual employee party in Taipei. Foxconn in November said it had a ”relatively conservative and neutral” outlook for 2024. Demand for artificial intelligence (AI) servers will ”of course” be good, but global economic uncertainty given geopolitical problems will affect consumer product demand, he added. \"One (market segment) will be good, but very many others – uh-oh.” Apple on Thursday forecast a drop in iPhone sales and targeted overall revenue $6 billion below Wall Street expectations as its China business took a hit. The results confirmed some analysts’ concerns that the company’s signature product is losing ground in the key Asian market where consumers are buying foldable phones and phones from Huawei, powered by a China-made chip. Liu said production capacity for chips for servers is limited, even with strong demand. \"When it comes up to keeping up with demand, perhaps there need to be new factories,\" he added. Foxconn, formally called Hon Hai Precision Industry Co Ltd, will report fourth quarter earnings next month when it will also update its outlook for this year. It releases January sales data on Monday. Foxconn’s shares have slid 2.4% so far this year, compared with a 0.7% gain for the broader market.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}