{
    "title": "Apple rejects antitrust charge ahead of €500m EU court ruling",
    "date": "2/23/2024",
    "url": "https://thesun.my/world/apple-rejects-antitrust-charge-ahead-of-500m-eu-court-ruling-BB12132470",
    "text": "BRUSSELS: Ahead of a highly anticipated decision by the European Commission on a heavy fine against Apple, the iPhone maker has denied any violations of European competition law, reported German news agency (dpa). A representative of the company rejected the accusation that Apple had impaired competition in the digital music market in any way. The Financial Times recently reported that Apple is facing a fine of around €500 million (US$541 million) for breaches of EU competition law. The European Commission intends to announce the exact amount in March. The antitrust dispute centres on the question of whether or not Apple, as the operator of the app store for the iPhone and iPad, has distorted competition on the music streaming market. The world's largest streaming provider Spotify, in particular, has been complaining for years that Apple favours its own service Apple Music and prevents competitors from offering Apple users alternative ordering and payment options for music subscriptions. Specifically, the two sides are arguing about whether the conclusion of a paid subscription via the Spotify app can be prohibited if Spotify does not want the iPhone manufacturer to share in the revenue. Apple emphasised that business had developed exceptionally favourably for Spotify during this period since the first complaint in Europe in 2013. With a market share of 59 per cent, the Swedish company is now the market leader – ahead of Amazon Prime Music with 18 per cent and YouTube Music with nine per cent. Apple is only in fourth place with a market share of eight per cent. Spotify's share on Apple smartphones is even higher than on Android devices. The company left open how it would react should the European Commission actually impose a fine in the region of €500 million. Apple has legal recourse, similar to the tax dispute with the EU in 2016, when the European Commission instructed EU member Ireland to demand €13 billion in back taxes from Apple. The decision was annulled four years later by the General Court of the European Union in Luxembourg. The Commission had not been able to prove that the company had paid too little tax in Ireland and that the local tax authorities had granted Apple unfair advantages. However, the tax proceedings have not yet been finalised, as an appeal to the European Court of Justice is still pending. -Bernama  Tel: +603-7784 6688      Fax: +603-7785 2625 "
}