{
    "title": "Federal judge rejects lawsuit claiming that Tim Cook was overpaid",
    "date": "2/8/2024",
    "url": "https://9to5mac.com/2024/02/08/federal-judge-rejects-lawsuit-claiming-that-tim-cook-was-overpaid/",
    "text": "A federal judge has dismissed a lawsuit claiming that Apple CEO Tim Cook was overpaid by tens of millions of dollars. A lawsuit brought by a pension fund invested in AAPL claimed miscalculations meant that the company paid far more than the compensation committee intended … Cook and other senior Apple execs receive much of their compensation as performance-related pay, and in the form of what are known as restricted stock units (RSUs). An RSU is a provisional grant of stock, which is only paid out if certain future conditions are met. Typically, they will be contingent on hitting particular performance metrics, and remaining employed by the company. For a CEO, they are often conditional on the value of the stock hitting particular targets. Once the conditions are met, then the stock ‘vests’ – that is, the promised shares are actually given to them. They are a common way of ensuring that key execs commit to the company for the next several years, as if they leave the company before their RSUs vest, they get nothing. In Apple’s case, RSU awards are decided on by a compensation committee appointed by the board of directors, whose job it is to reach a fair and objective agreement on how much each exec should be paid. However, Reuters reports that a pension fund affiliated with the International Brotherhood of Teamsters alleged that the committee got its sums wrong in the case of Tim Cook and four other senior Apple execs. The plaintiff said Apple in 2021 and 2022 awarded a respective $92.7 million and $94 million of performance-based restricted stock units to Cook and four other executives, though its compensation committee intended to award just $77.5 million each year. It attributed the alleged error to the committee’s improper calculation of the RSUs’ fair values at the time of the grants. Shareholders don’t get to override the compensation committee, but they are entitled to voice their opinions, and to have those opinions considered. The pension fund said that the miscalculation meant that shareholders were effectively misled. However, U.S. District Judge Jennifer Rochon said that the information provided to shareholders by Apple was “precisely” as the SEC requires, and therefore dismissed the case. FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Breaking news from Cupertino. We’ll give you t… The CEO of Apple… Ben Lovejoy is a British technology writer and EU Editor for 9to5Mac. He’s known for his op-eds and diary pieces, exploring his experience of Apple products over time, for a more rounded review. He also writes fiction, with two technothriller novels, a couple of SF shorts and a rom-com! "
}