{
    "title": "iOS 18 To Bring Major Visual Design Changes Later This Year, Potentially \nBolstering AI Features For The iPhone",
    "date": "2/26/2024",
    "url": "https://wccftech.com/ios-18-to-bring-visual-design-changes-to-iphone/",
    "text": "iOS 18 could be the company's biggest update the iPhone has ever received, considering the number of front-facing features it will bring. We have previously reported that Apple is planning to incorporate a plethora of AI features in the platform, which will be available to all users later this year. It is now being reported that iOS 18 could also undergo a redesign in terms of visuals. This will make iOS 18 a bigger upgrade than originally expected with AI features. While iOS 18 will house a number of AI features, the iPhone 16 models could get a handful of exclusives, all thanks to the new A18 chip with an upgraded Neural Engine. Mark Gurman shares in his latest Power On newsletter that iOS 18 is expected to bring several design changes to the mix, suggesting that the company will update the platform's design \"as early as this year\". Apart from iOS 18, Gurman also claims that Apple has plans to revamp macOS design as well, but it will not be released this year. The analyst claims that it will take another year or two for the company to redesign macOS. Apple redesigned its watchOS platform for the Apple Watch last year. The company changed how users use apps on a smaller display. Apple also brought a new user interface within apps, oriented toward Apple Watch models with a bigger display. It appears that the company is planning to revamp its entire software line for its products. A sketchy rumor also previously suggested that Apple plans to introduce design changes in iOS 18 and will take cues from the visionOS. The rumor talked about translucent elements in the operating system and how they are utilized by the Vision Pro. Besides design changes, Apple is planning to embed a plethora of AI changes throughout the platform. The company is developing a wide range of tools that take into account large language models. We have previously covered Apple's tools that deal with editing, manipulating, and animating still images. Potentially, all of these tools could be transformed as potential features for the Photos app in iOS 18. As mentioned, iOS 18 could take further advantage of the iPhone 16's A18 chip to deliver on-device AI capabilities. We could see the first glimpse of iOS 18 at the company's WWDC event in June, so be sure to stick around for more details. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}