{
    "title": "iPhone 16 Mold Leaks To Show A Vertical Camera Setup In A Pill-Shaped \nHousing, As Apple Takes A Step Back In Terms Of Design",
    "date": "2/19/2024",
    "url": "https://wccftech.com/iphone-16-mold-leaks-to-show-camera-design/",
    "text": "Apple has planned a plethora of changes for the iPhone 16 and iPhone 16 Pro models. While the final word rests with Apple, we are hearing details on the potential changes that will be part of this year's iPhone. According to the latest, a photo has been leaked online that appears to show the mold of the standard iPhone 16, revealing a vertical layout for the camera sensors. If you are not familiar, it was previously reported that Apple will ditch the diagonal layout of the camera sensors and bring back the vertical approach. Apple has used the vertical camera setup on its handsets since the launch of the iPhone X. However, with the iPhone 13, Apple pivoted the camera layout in a diagonal fashion. The iPhone has been using the diagonal layout for three generations now, and it appears that the company is planning to bring some differentiating elements to the table with the iPhone 16. Majin Bu shared an image of a mold on X, which potentially belongs to the iPhone 16. It can be seen that the camera sensors are arranged in a vertical fashion, giving heft to prior rumors. It can be seen that the iPhone 16 will feature two individual camera sensors stacked vertically. Potentially, the company will house the sensors in a slim plateau, as previously reported. It can also be seen that the sensors are stacked in a pill-shaped housing, similar to the iPhone X. It was recently reported that Apple is testing a prototype of the iPhone with the same layout for the camera sensors. The leaked schematics of the device also shared similar details on the design and the pill-shaped housing. It is unclear if the company is switching back to the vertical layout only for visual purposes. Currently, the iPhone 15 Pro models can record Spatial Video. The company could be working to bring the feature to the standard models as well, and the redesigned camera position could have something to do with it. Apple is testing multiple prototypes at this stage, and it remains to be seen if the company will move ahead with the changes on the iPhone 16. It was also previously rumored that Apple is planning to redesign the camera housing on the iPhone 16 Pro models. Take note that it is too early to draw conclusions as the iPhone 16 models are months away from launch at this stage. Potentially, the company could opt for an all-new design ahead of mass production. Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada  "
}