{
    "title": "Apple @ Work: Device management arrives on Vision Pro within days instead \nof years",
    "date": "2/10/2024",
    "url": "https://9to5mac.com/2024/02/10/device-management-arrives-on-vision-pro-within-days-instead-of-years/",
    "text": "Apple @ Work is exclusively brought to you by Mosyle, the only Apple Unified Platform. Mosyle is the only solution that integrates in a single professional-grade platform all the solutions necessary to seamlessly and automatically deploy, manage & protect Apple devices at work. Over 45,000 organizations trust Mosyle to make millions of Apple devices work-ready with no effort and at an affordable cost. Request your EXTENDED TRIAL today and understand why Mosyle is everything you need to work with Apple. With the beta release of visionOS 1.1, Apple IT managers were greeted with a surprise: device management support would now be available. With the folks at Mosyle and Jamf adding early support for their customers, it’s evident to me what’s happening here: Apple expects Vision Pro to be used at work, and device management support is their signal to businesses that Vision Pro means business. About Apple @ Work: Bradley Chambers managed an enterprise IT network from 2009 to 2021. Through his experience deploying and managing firewalls, switches, a mobile device management system, enterprise grade Wi-Fi, 1000s of Macs, and 1000s of iPads, Bradley will highlight ways in which Apple IT managers deploy Apple devices, build networks to support them, train users, stories from the trenches of IT management, and ways Apple could improve its products for IT departments. Looking back to the Apple Watch as an example, it was initially released in 2015. It didn’t receive device management support until…2023. The Apple Watch took eight years to become a “work” device, whereas the Vision Pro took less than eight days. “Apple’s continued innovation with Apple Vision Pro creates countless opportunities for growth and will help chart a new future of working, learning, and more,” said Alcyr Araujo, founder and CEO at Mosyle. “We’ve seen a big surge in interest around the new product and are ready to help customers seamlessly test and embrace it moving forward.” “Apple Vision Pro offers businesses an exciting opportunity to transform the way employees get work done,” says Matt Vlasach, VP of Product Management at Jamf. “And importantly, it supports all of the core foundations of an enterprise-grade device, from Secure Enclave, to device management, to biometric authentication, to zero trust networking. We are looking forward to helping our shared customers adopt each of these foundations on Apple Vision Pro by leveraging native APIs and the complete Jamf platform, enabling organizations to explore new ways of working while maintaining security, performance, and privacy.” Businesses might or might not begin looking at Vision Pro as a potential work device. Without device management support, they definitely won’t. Device management support is table stakes for any new Apple product in the workplace. It’s why Apple TV supports remote management as well. At a $3500 price point, it’s not going to replace the MacBook Air anytime soon, but this Vision Pro isn’t the one that will see rapid business adoption. It’ll be a future version that weighs less, has a longer battery, and costs less. Spatial computing is a completely new computing world, and it’s going to take time for businesses to figure out where it makes an impact. It’s not about Vision Pro working for certain use cases. It needs to be better. Just as there are tasks that the Mac excels over the iPad, it doesn’t discount the benefits of the iPad.  I suspect that we will see strong use cases in healthcare and manufacturing. I am just using my imagination, though. I don’t know where we go from here. Will it stay a niche product on the high end? Will it take a decade to get it down to the price of a MacBook Air? Will the weight get shrunk enough that you could wear it all day? These are all major questions that we don’t know. I know that when the Apple Watch was originally released, it was all about the digital connection aspect and morphed into a health and fitness device over time. The original iPhone couldn’t record video or send picture messages, but today, those are probably the most common use cases. My advice to anyone looking at the possible use cases of Vision Pro at work is to stay curious. Even if you don’t want any part of the Vision Pro today, don’t judge what the platform can evolve in 5-10 years. Apple bringing device management support to the Vision Pro is your signal to begin dreaming. Be Curious, Not Judgmental FTC: We use income earning auto affiliate links. More. Check out 9to5Mac on YouTube for more Apple news: Apple @ Work is a 9to5Mac series where Bradley C… Bradley lives in Chattanooga, TN. Tips, feedback, corrections and questions can be sent to Bradley@9to5mac.com. The MacBook Air is the best value on the market for laptops. The best day to day headphones for iOS and macOS. "
}