{
    "title": "Mark Zuckerberg responds to the 'Apple fanboys'",
    "date": "2/16/2024",
    "url": "https://www.businessinsider.com/mark-zuckerberg-apple-vision-pro-fanboys-steve-ballmer-iphone-2024-2",
    "text": "       Mark Zuckerberg drew the ire of some Apple fans after he ripped into the tech giant's $3,500 Apple Vision Pro in a video posted on Instagram earlier this week. But the Meta CEO doesn't believe he said anything out of line — and doesn't think history will view the moment as similar to former Microsoft CEO Steve Ballmer famously laughing at the original iPhone's high price and lack of keyboard. \"I don't think so,\" Zuckerberg told the Morning Brew Daily podcast. \"First of all, I'm not laughing at them. I take Apple seriously.\" Zuckerberg said that just because he thinks the Vision Pro is inferior to his company's Quest 3, that doesn't mean he's dismissing Apple or failing to account for the idea that they'll likely be able to make improvements in future models. \"I think it's a good company. They do good work,\" Zuckerberg said. \"I'm just laying out the facts as I see them today,\" the CEO added, regarding his criticisms of the Vision Pro's high price tag and design trade-offs. \"I'm not saying they're not going to improve, but hey, we're going to improve too. I actually think we'll probably improve faster. \" He used the moment to share his thoughts on die-hard Apple fans. Related stories \"I do think there's this whole vibe with Apple fanboys, which I find kind of a little funny, where a lot of people get upset if you dare to question if Apple will lead in a new space,\" Zuckerberg said. Zuckerberg said that competition can be a good thing, adding a sense of urgency to the Meta teams working on rival products. He's also not shying away from the fight. \"I think we have a really good chance at winning, and I'm really committed to doing that,\" Zuckerberg said. \"I'm a competitive person, I'm passionate about what we're doing. We're planning to win.\" Zuckerberg's thoughts on his video come after he said in it that the Quest 3 headset is superior to the Vision Pro. \"I was surprised by how many trade-offs they had to make in the quality of the device — in comfort and ergonomics and other aspects of the display and artifacts to get to that [higher resolution],\" Zuckerberg said in regards to Apple's headset. Zuckerberg may not be alone in reaching that conclusion. Just weeks after the mixed reality headset hit the market, some customers have decided to return their devices. They complained about the device's heavy design, the motion blur accompanying the device's pass-through view, and a lack of killer apps — a combination of factors they said just didn't justify the $3,500 price point. Business Insider's Jordan Hart said she began to feel she was running out of reasons to wear the headset after using it for a week. Meta didn't immediately respond to Business Insider's request for comment ahead of publication.  Read next Jump to "
}