{
    "title": "Apple's iPhone maker sets record high as AI mania persists",
    "date": "3/27/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/telcos-media-tech/apple-s-iphone-maker-sets-record-high-ai-mania-persists",
    "text": "SHARES of Hon Hai Precision Industry soared as artificial intelligence (AI) mania outweighs concerns over a sluggish recovery in the smartphone sector. Hon Hai, which makes iPhones for Apple, rose as much as 3.7 per cent to a record intraday high on Thursday (Mar 28). It was a big laggard in Taiwan last year due to concerns that Apple’s China sales would slow due to sluggish demand for premium phones, but fourth-quarter earnings that beat estimates fuelled optimism over demand for the company’s AI servers. It is now up 46 per cent year-to-date. The AI craze has meant big gains in companies such as Nvidia, as investors see the sector at a crucial point of growth. At Hon Hai, AI revenue may contribute half of the server revenue this year if it succeeds in winning orders from key clients, JPMorgan Chase & Co analysts including Albert Hung wrote in a research report. The figure was about 30 per cent last year. To be sure, Hon Hai’s total revenue exposure to AI is likely to remain at 10 to 12 per cent this year, compared with about 20 per cent for its competitors such as Wiwynn, Quanta Computer and Wistron, according to JPMorgan. What’s more, its gains may be getting extended. Han Hai is now the most overbought stock on Taiwan’s benchmark index, in terms of 14-day relative strength, according to Bloomberg-compiled data. Still, analysts see the positive story for Hon Hai continuing. Morgan Stanley, Citigroup and UBS Group all upgraded their price targets for the stock this month after the company posted net income jump during the quarter that ended in December. BLOOMBERG Start and end each day with the latest news stories and analyses delivered straight to your inbox. BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}