{
    "title": "Mark Zuckerberg just slammed the Apple Vision Pro again",
    "date": "3/9/2024",
    "url": "https://www.businessinsider.com/mark-zuckerberg-slams-apple-vision-pro-again-meta-quest-vr-2024-3",
    "text": "       Mark Zuckerberg just keeps dumping on Apple's Vision Pro. In a Friday post on Threads, the Meta CEO exchanged messages with Mosaic Ventures partner Benedict Evans, calling out the \"tradeoffs\" in Apple's VR headset that, in his view, make its $3,500 product worse than Meta's $500 competitor, Quest. \"There are a lot of limitations to the Vision Pro, but I am genuinely baffled by Meta VR engineers claiming it's 'basically just the same thing' as the Quest,\" Evans wrote, prompting the initial response. \"Apple is selling pretty much the device Meta wants to reach in 3-5 years. The Quest is selling at the price Apple wants to reach in 3-5 years.\" Related stories Zuck just wasn't having it. \"I don't think we're saying the devices are the same,\" he replied. \"We're saying Quest is better. If our devices weigh as much as theirs in 3-5 years, or have the motion blur theirs has, or the lack of precision inputs, etc, then that means we'll have regressed significantly.\" Zuckerberg added: \"Yes, their resolution is higher, but they paid for that with many other product tradeoffs that make their device worse in most ways. That's not what we aspire to.\" Representatives for Meta and Apple did not immediately respond to requests for comment from Business Insider. Apple has sold more than 200,000 Vision Pro units since the headset became available for preorder in January, compared to Meta's 20 million Quest units sold between its debut in 2019 through February of last year. In Meta's fourth-quarter financials in 2023, the company's Reality Labs division crossed $1 billion in revenue for the first time, which Meta attributed to \"Quest having a strong holiday season.\" Evans and Zuckerberg continued their thread, discussing the benefits — and drawbacks — of the higher resolution on Apple's device, with Zuck ultimately saying Apple's choice to trade higher resolution for better ergonomics and motion blur wasn't \"a clear win,\" especially \"when Quest's resolution is also quite good.\" Friday's social media posts were just the latest in a series of snarky comments Zuckerberg has pointed toward Apple's Vision Pro. In a pointed review on Instagram, he reamed the device on everything from price to specs, and he critiqued the headset at a company meeting, telling Meta employees that Apple's vision of a VR headset is \"not the one I want.\" Read next Jump to "
}