{
    "title": null,
    "date": "3/20/2024",
    "url": "https://www.saltwire.com/prince-edward-island/business/reuters/meta-microsoft-x-and-match-join-epic-games-battle-against-apple-100949677/",
    "text": "SaltWire.com would like to send you notifications for breaking news alerts. Activate notifications? SaltWire.com would like to send you notifications for breaking news alerts. Activate notifications? Important information regarding Saltwire's CCAA filing STORY CONTINUES BELOW THESE SALTWIRE VIDEOS Barley Risotto and Kimchi: A Culinary Crossroads| SaltWire #food #cookingshorts #kimchi By Jonathan Stempel (Reuters) -     Meta Platforms, Microsoft, Elon Musk's X and Match Group on Wednesday joined \"Fortnite\" video game maker Epic Games' protest that Apple has failed to honor a court-ordered injunction governing payments in its lucrative App Store. The technology companies, which developed some of the most popular apps in the App Store, said Apple was in \"clear violation\" of the Sept. 2021 injunction by making it difficult to steer consumers to cheaper means to pay for digital content. Apple declined to comment specifically on the accusation, which was contained in a filing with the Oakland, California federal court. It referred to its Jan. 16 statement that it had fully complied with the injunction, which it said would protect consumers and \"the integrity of Apple's ecosystem\" while ensuring that developers do not get a free ride. Epic had sued Apple in 2020, saying it violated antitrust law by requiring consumers to obtain apps through the App Store and charging developers up to 30% commissions on purchases. The injunction required Apple to let developers provide links and buttons to direct consumers to alternative payment options. Last week, Epic demanded that Apple be held in contempt, saying new rules and a new 27% fee on developers made the links effectively useless. In Wednesday's filing, the technology companies said Apple's conduct \"for all practical purposes\" entrenches anti-steering rules that the court found illegal, propping up Apple's \"excessive\" commissions and harming consumers and developers. \"Apple's restrictions on where and how developers can communicate with their users about their options for purchasing in-app content create significant barriers to competition and artificially inflate prices,\" the filing said. In January, the U.S. Supreme Court decided not to hear Apple's appeal from the injunction. It also decided against hearing Epic's appeal of lower court findings that Apple's policies did not violate federal antitrust law. Apple has until April 3 to formally respond to Epic's filing. The company is based in Cupertino, California, while Epic is based in Cary, North Carolina. The case is Epic Games Inc v Apple Inc, U.S. District Court, Northern District of California, No. 20-05640. (Reporting by Jonathan Stempel in New York; Editing by Bill Berkrot) "
}