{
    "title": "Alibaba goes where Apple isn't: The US bond market",
    "date": "3/28/2024",
    "url": "https://ca.movies.yahoo.com/movies/news/alibaba-goes-where-apple-isnt-225737433.html",
    "text": "Out with the Americans and in with the Chinese-that could be the next trend in U.S. bond markets as demand for high-quality investments outruns supply. This week, Chinese e-commerce giant Alibaba (BABA) priced $8 billion in U.S. dollar bonds with maturities spanning from three to 20 years. The move follows its highly successful IPO in late September. Demand for the deal is extraordinary: Alibaba has received orders for well over $50 billion in bonds and may expand the offering size slightly to accommodate them, according to a person familiar with the matter. Alibaba declined to comment to CNBC. Why the appetite? Certainly, Alibaba is a high growth company that some stock investors see as a once-in-a-lifetime opportunity. The stock has soared 64 percent since its IPO. But bond investors don't think that way. They are far more concerned with the stability of Alibaba's future cash flows that will eventually allow it to repay what it borrows. In that regard, Alibaba isn't quite as exciting. The company is rated A1 by Moody's, or several notches below the highest possible rating enjoyed by a handful of blue chip companies such as Microsoft (MSFT). Moody's says that Alibaba has a well-established brand name but also points out certain risks. One is that Alibaba's history as a public company is short. There are also questions about how Alibaba can expand its business scope both within and outside  China . Despite those risks, investors seem to be falling all over each other to buy Alibaba bonds. Another explanation may be that there simply aren't that many new bonds up for sale in the U.S. market these days. Read More Apple's latest move: Acting like a hedge fund Indeed, the last few weeks have seen a wave of U.S. companies issue bonds in euros rather than dollars to take advantage of lower rates on the continent. Apple (AAPL) sold 2.8 billion euros in bonds earlier this month in its first non-dollar deal. It was followed by big U.S. issuers including 3M (MMM), Walgreen (WAG), and most recently IBM (IBM). So far this year, U.S. companies have sold $79 billion in euro-denominated bonds, the highest level since the same period of 2007, according to Dealogic. Given the huge gap between dollar and euro interest rates at the moment, there's reason to believe the trend will continue for some time. Read More Is Apple disrupting the U.S. bond market? Back in the U.S., Alibaba and others are already helping fill the gap. Chinese companies have sold $28 billion in U.S. dollar bonds so far this year, the highest on record by a long way, Dealogic says. Chinese issuers also account for 5.3 percent of total U.S. dollar bonds issued by foreign companies. That's up from 0.2 percent in 2009. What does the Chinese money invasion mean for U.S. investors? One issue is that Chinese corporate governance structures are different those in the U.S. Alibaba is actually a Cayman shell company. Indeed, Moody's pointed out that there are \"potential contingent liabilities\" associated with a private company called Ant Financial Services Group that is separate from Alibaba but controlled by its senior management. Read More China wants to build the world a railway In theory, the Cayman domicile could be abused because local laws there are somewhat laxer than Securities and Exchange Commission rules. Disclosure of material information, for instance, isn't required as quickly in the Cayman Islands. In practical terms, a large, high profile company such as Alibaba is likely to hold itself to a higher standard. Baidu, China's version of Google, is also a Cayman company and hasn't run into any major problems linked to its Cayman listing. Another issue to consider is what happens if more Chinese companies tap U.S. bond markets. In the unfortunate event of another U.S. credit crisis, China could find itself much more affected than in the 2008 crisis, according to Brian Reynolds, chief market strategist at Rosenblatt Securities. \"When the U.S. credit boom ends, bonds of Chinese companies are going to suffer,\" he said. Last time around, Chinese companies had almost no connection to the U.S. credit market. That allowed China to continue growing apace while much of the West fell into recession. \"The more the Chinese become hooked on U.S. credit, the more they have to worry,\" Reynolds said. Key Insights The considerable ownership by private companies in Paramount Resources indicates that they collectively... Shareholders might have noticed that Jefferies Financial Group Inc. ( NYSE:JEF ) filed its first-quarter result this... IBKR EventTrader - A new, straightforward way to trade CME futures markets Local Bounti Corporation (NYSE:LOCL) Q4 2023 Earnings Call Transcript March 27, 2024 Local Bounti Corporation misses on earnings expectations. Reported EPS is $-8.1 EPS, expectations were $-3.18. LOCL isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning, and welcome […] The actress celebrated her daughter Matilda's first birthday on Saturday There's no doubt that money can be made by owning shares of unprofitable businesses. For example, biotech and mining... Thanks to the attention it’s getting on TikTok and Instagram, stores around the world are selling out of this lean muscle builder. But, before you... Police in southern Russia have arrested three men from Central Asia for allegedly plotting a bomb attack, a week after Islamic State terrorists from Tajikistan killed 144 people at a rock concert in Moscow. Women working for the Office for National Statistics face disciplinary action if they object to male-born colleagues using single-sex lavatories and changing rooms, documents leaked to The Sunday Telegraph reveal. Spurs welcome the Hatters to town looking to get back on track  Molina Healthcare (NYSE:MOH) has had a great run on the share market with its stock up by a significant 14% over the... Bunnyville at the Detroit Zoo A few scattered snow showers are possible in Colorado's higher elevations, but it will remain dry across the metro and plains.  Passive investing in index funds can generate returns that roughly match the overall market. But you can significantly... Scrub Daddy, pimple patches and an awesome upholstery cleaner: The 'net is gaga over these picks. Iran International journalist Pouria Zeraati is recovering in hospital after being attacked on Friday.  Cuts to central funding leaves lower tier of local government left to look after libraries, street cleaning and other facilities The French actress (\"The English Patient\") will succeed Polish director Agnieszka Holland (\"Europa\") in the honorary role. Key Insights Given the large stake in the stock by institutions, Wynn Resorts' stock price might be vulnerable to their...  ProSomnus, Inc. Common Stock (NASDAQ:OSA) Q4 2023 Earnings Call Transcript March 27, 2024 ProSomnus, Inc. Common Stock misses on earnings expectations. Reported EPS is $-0.42 EPS, expectations were $-0.31. OSA isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, […] COMMENT: Why is it that, in 2024, age-gap relationships still cause such brouhaha? There is no escaping the whispers and judgement if you choose to date someone much older or younger – but when it comes to love, we’ve all got skin in the game, writes Olivia Petter Photo Illustration by Luis G. Rendon/The Daily Bast/Getty Images/Courtesy of Keianna MillerThe family of a Black 4-year-old boy who was shot dead by police responding to a bloody domestic violence incident are considering taking legal action. Lawyers representing Keianna Miller, whose son Terrell was killed by Macomb Police two weeks ago, told The Daily Beast she may file a civil lawsuit.“Police would lead a criminal investigation. The civil would be by a personal injury law firm like ours for a "
}