{
    "title": "KARL STORZ Launches CollaboratOR 3D for Apple Vision Pro",
    "date": "3/8/2024",
    "url": "https://www.biospace.com/article/releases/karl-storz-launches-collaborator-3d-for-apple-vision-pro/",
    "text": "Skip to main content Published: Mar 07, 2024 Powerful new technology further extends possibilities for education and collaboration in the surgical suite. EL SEGUNDO, Calif.--(BUSINESS WIRE)-- Pioneering MedTech company KARL STORZ is proud to announce the release of the CollaboratOR 3D app for Apple Vision Pro. Designed in concert with innovative software developer T1V, the CollaboratOR 3D app complements the functionality of the integrated operating room solution known as OR1. This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20240307439295/en/ With the CollaboratOR 3D app for Apple Vision Pro, surgical staff can immerse themselves in 3D content from surgical procedures—without even entering the operating room. (Photo: Business Wire) KARL STORZ has a longstanding commitment to training and educating healthcare professionals to help them take full advantage of emerging medical technologies. Working closely with healthcare providers, the company identified a need to improve the educational experience and collaboration opportunities for new surgical residents as well as practicing surgeons across a wide range of specialties. With the CollaboratOR 3D app for Apple Vision Pro, surgical staff can immerse themselves in 3D content from surgical procedures—without even entering the operating room. This provides residents and surgeons with enhanced learning opportunities while allowing teams to scale their training efforts. The CollaboratOR 3D app serves as an extension of the CollaboratOR, an interactive ecosystem for the OR1 integrated operating room. The app leverages Apple Vision Pro’s ability to seamlessly blend digital content with the physical world, allowing for closer coordination, communication, and education among the surgical team, wherever they may be. While not intended for use by the surgeon during surgery, CollaboratOR is designed to take full advantage of the breakthrough display, which offers exceptional 3D/4K surgical video quality provided by KARL STORZ endoscopy systems. “KARL STORZ has built a reputation for exceptional surgical visualization and integration technologies,” says Christy Gaudet, VP of Surgical Sales & Marketing at KARL STORZ United States. “CollaboratOR is designed to boost efficiency in the operating room while empowering greater collaboration for the entire surgical staff, from any location, for any surgical specialty. The new CollaboratOR 3D app for Apple Vision Pro, developed with our partners at T1V, takes this to the next level, with a clear focus on the needs of healthcare providers and their patients.” “We will continue to work with T1V to explore the future of medical education and collaboration in the OR,” says Connie Padden, Director of OR1 Technology Integration at KARL STORZ United States. “The release of the CollaboratOR 3D app for Apple Vision Pro aligns with our long-term vision to apply tomorrow’s technology to today’s most pressing healthcare needs. Harnessing the power of fully immersive spatial computing further advances our mission of enabling anywhere care.” The CollaboratOR 3D app is available for free download on the App Store. About KARL STORZ KARL STORZ is an innovative leader in endoscopic technology and surgical imaging solutions across virtually all surgical specialties. Its integrated operating room solutions enhance collaboration to improve clinical efficiency and outcomes inside the hospital and other sites of care. With subsidiaries around the world, KARL STORZ is a family-owned company based in Tuttlingen, Germany, that designs, engineers, manufactures, and markets all its products with an emphasis on visionary design, precision craftsmanship, and clinical effectiveness. For more information, visit www.karlstorz.com. About T1V With 19 patents in visual collaboration software, T1V is a leading innovator in large-scale, interactive software technology. The company’s software ecosystem supports total interoperability with the many devices, programs, and platforms of today’s hybrid meeting and learning spaces—enabling users to truly collaborate anytime, anywhere. To learn more, visit www.t1v.com.  View source version on businesswire.com: https://www.businesswire.com/news/home/20240307439295/en/ Contacts Susan Mancia\r\nMarketing Communications\r\nKARL STORZ United States\r\n(562) 841-1515 Source: KARL STORZ With the CollaboratOR 3D app for Apple Vision Pro, surgical staff can immerse themselves in 3D content from surgical procedures—without even entering the operating room. (Photo: Business Wire)  The CollaboratOR 3D app serves as an extension of the CollaboratOR, leveraging Apple Vision Pro’s ability to blend digital content with the physical world to promote closer coordination, communication, and education among the surgical team. (Photo: Business Wire)   View this news release and multimedia online at:\nhttp://www.businesswire.com/news/home/20240307439295/en Back to news Back to top © 1985 - 2024 BioSpace.com. All rights reserved. Powered by Madgex Job Board Software "
}