{
    "title": "CHART: We analyzed Apple's revenue per employee to show how it's avoided \ntech bloat and delayed layoffs",
    "date": "3/19/2024",
    "url": "https://ca.movies.yahoo.com/movies/chart-analyzed-apples-revenue-per-113215965.html",
    "text": "Apple has avoided layoffs longer than others by avoiding illogical bets and focusing on core operations. Data shows its revenue per employee trumps the rest of Silicon Valley, a sign of its efficiency. Apple employees each generate a whopping $2.4 million. Silicon Valley's year of efficiency has been brutal, with Alphabet, Amazon, Meta, Microsoft, Salesforce, and Twitter slashing more than 84,000 jobs in recent months as they seek leanness and efficiency. One company has been able to delay job cuts longer than the rest: Apple. The iPhone maker has talked about comparatively small-scale potential job cuts, but so far avoided the broad layoffs hitting its competitors. That's down to a number of factors, experts told Insider. \"Apple has outperformed others and avoided the over-expansion we saw at some other tech firms during the pandemic period,\" John Van Reenen, economics professor at the London School of Economics, told Insider via email. \"It hasn't gone big on the metaverse like Meta and its business model is less reliant on online shopping (Amazon) or remote working (Zoom).\" Apple's comparative efficiency is visible through one particular metric that is back in vogue: Revenue per employee. Insider analyzed revenue per employee at major tech firms between 2018 and 2022. We found Apple outperformed by some margin, with revenue per employee soaring 20% in the past five years, according to analysis of public filings. It rose from $2 million in 2018 to a high of $2.4 million in 2022 – a half-decade period in which Apple's employee base also grew from 132,000 to 164,000. Revenue per employee is a get-back-to-basics measure of efficiency and productivity, assigning a hard dollar value to individual workers. It's calculated by dividing a company's annual revenue by the number of its employees. In the aftermath of large-scale job cuts in tech, hawkish CEOs and investors say execs should be looking closely again at the metric. \"You'll hear revenue per employee again, in tech, no one was looking at these metrics at least in the private world, the VC world for at least five years,\" investor Keith Rabois told an event held by Evercore investment bank last month. Rabois also criticized tech firms, specifically Google and Meta, for \"over-hiring\" — a practice Apple avoided during tech's boom years. Apple's revenue-per-employee numbers buck the broader downward trend for its peers.  Twitter's revenue per employee in 2022, which we calculated on an annualized basis using financial data for its first two quarters, was down an estimated 18% from 2018 to 2022, the steepest drop of the last five years. Meta has seen a 14% decrease in its revenue per employee in the same period, falling from $1.6 million to $1.3 million. Both firms have aggressively cut jobs over the past six months. Leo Gebbie, principal analyst at CCS Insight, said Apple's performance has come from being \"focused on its core business, which remains hugely profitable,\" giving it \"more of a cushion to ride out a period of economic and geopolitical instability.\" That said, Apple is taking several belt-tightening measures to navigate the downturn, such as implementing a hiring freeze and restructuring bonus plans for employees. The company also saw revenue growth slow in 2022 as consumers in many of its key markets grappled with a cost of living crisis in the face of inflation. The firm's continued ability to outperform may be challenged by its complex relationship with China, as well as a potentially risky venture into mixed reality with a headset expected to debut this year. \"It's likely that any such device would require heavy investment before it can realize a profit and will further the need for tight financial governance internally,\" Gebbie added. Read the original article on Business Insider Key Insights The considerable ownership by private companies in Paramount Resources indicates that they collectively... Shareholders might have noticed that Jefferies Financial Group Inc. ( NYSE:JEF ) filed its first-quarter result this... He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Local Bounti Corporation (NYSE:LOCL) Q4 2023 Earnings Call Transcript March 27, 2024 Local Bounti Corporation misses on earnings expectations. Reported EPS is $-8.1 EPS, expectations were $-3.18. LOCL isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning, and welcome […] The actress celebrated her daughter Matilda's first birthday on Saturday There's no doubt that money can be made by owning shares of unprofitable businesses. For example, biotech and mining... IBKR EventTrader - A new, straightforward way to trade CME futures markets Police in southern Russia have arrested three men from Central Asia for allegedly plotting a bomb attack, a week after Islamic State terrorists from Tajikistan killed 144 people at a rock concert in Moscow. Women working for the Office for National Statistics face disciplinary action if they object to male-born colleagues using single-sex lavatories and changing rooms, documents leaked to The Sunday Telegraph reveal. Spurs welcome the Hatters to town looking to get back on track  Molina Healthcare (NYSE:MOH) has had a great run on the share market with its stock up by a significant 14% over the... Bunnyville at the Detroit Zoo A few scattered snow showers are possible in Colorado's higher elevations, but it will remain dry across the metro and plains.  Passive investing in index funds can generate returns that roughly match the overall market. But you can significantly... Scrub Daddy, pimple patches and an awesome upholstery cleaner: The 'net is gaga over these picks. Iran International journalist Pouria Zeraati is recovering in hospital after being attacked on Friday.  Cuts to central funding leaves lower tier of local government left to look after libraries, street cleaning and other facilities The French actress (\"The English Patient\") will succeed Polish director Agnieszka Holland (\"Europa\") in the honorary role. Key Insights Given the large stake in the stock by institutions, Wynn Resorts' stock price might be vulnerable to their...  ProSomnus, Inc. Common Stock (NASDAQ:OSA) Q4 2023 Earnings Call Transcript March 27, 2024 ProSomnus, Inc. Common Stock misses on earnings expectations. Reported EPS is $-0.42 EPS, expectations were $-0.31. OSA isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, […] COMMENT: Why is it that, in 2024, age-gap relationships still cause such brouhaha? There is no escaping the whispers and judgement if you choose to date someone much older or younger – but when it comes to love, we’ve all got skin in the game, writes Olivia Petter Photo Illustration by Luis G. Rendon/The Daily Bast/Getty Images/Courtesy of Keianna MillerThe family of a Black 4-year-old boy who was shot dead by police responding to a bloody domestic violence incident are considering taking legal action. Lawyers representing Keianna Miller, whose son Terrell was killed by Macomb Police two weeks ago, told The Daily Beast she may file a civil lawsuit.“Police would lead a criminal investigation. The civil would be by a personal injury law firm like ours for a "
}