{
    "title": "Crash of the Titan: a short history of Apple's doomed car project",
    "date": "3/3/2024",
    "url": "https://www.theverge.com/2024/3/3/24085995/apple-car-project-titan-timeline-driverless-ev-doomed",
    "text": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Apple’s long-rumored driverless car project, also known as Project Titan, has been shuttered. But the company didn’t announce its cancellation. In fact, Apple barely ever mentioned the secretive project despite laboring on it for nearly a decade. Project Titan was obvious from the outside — from automotive industry hiring to heavily documented, public testing of self-driving cars, there was no way it could stay a secret. But the company still tried to preserve the mystery — when CEO Tim Cook was asked about the project on an investor call in 2016, he responded with cryptic talk about how exciting Christmas Eve is, adding that “it’s going to be Christmas Eve for a while.” Now we know Cook’s Christmas never came. This week, Bloomberg’s Mark Gurman broke the news that Apple will not be making a car, dashing the hopes of any Apple fan who dreamed of cruising around in a Jony Ive-designed roadster. But Apple’s car considerations go back a bit farther than 2014, the year early reports pegged the company’s first real moves to spin up Project Titan. A little over eight years ago, Nest founder Tony Fadell revealed that, while he was still at Apple, he and Steve Jobs had tossed around the idea for an Apple Car in 2008. They agreed that, as cool as they thought that would be, Apple was just too busy. The company had only just released the iPhone — the iPad, Apple’s services business explosion, and Siri were still ahead of it. But six years after Fadell and Jobs’ idle conversations, things were different. The company itself was the most valuable in the world, and its products were selling like hotcakes. Apple was full of momentum and growing fatter with cash every day, but there was no guarantee that its devices would keep the company expanding with their upward sales trajectory. Looking down the line, Apple already had its hands, quite successfully, in so many pies — computers, phones, audio players, for instance, and it was preparing to launch its smartwatch and line of Bluetooth headphones. If it was going to light the world on fire again, it needed to go big with something — why, then, shouldn’t it make a car? So began a nearly 10-year slog of sky-high expectations that even the world’s richest company couldn’t hope to meet. Apple has done a lot to push consumer electronics forward over the years. But nobody can do everything, and the Apple Car is as fine a cautionary tale about that as any. February 2015: The rumor mill starts cranking in earnest after a self-driving Dodge Caravan with chunky sensors adorning the roof is spotted driving around California’s San Francisco Bay Area. A CBS News story at the time finds it’s leased to Apple, which has no testing permit for driverless cars. Nevertheless, it sparks speculation that the company is making an autonomous car. Within days, reports emerge that Apple has been heavily recruiting auto experts for what it calls “Project Titan,” a secret effort to make an all-electric self-driving car. Cook reportedly approved the plan a year prior, and the company has set a team of 1,000 people on it, led by former Ford engineer Steve Zadesky. Apple hopes to start selling the car in 2020. But can Apple actually pull this off? Former GM CEO Dan Akerson is maybe a touch skeptical. He tells Bloomberg, “We take steel, raw steel, and turn it into a car. They have no idea what they’re getting into if they get into that.” July 2015: Reports said that Cook visited BMW’s headquarters in 2014. He and other executives wanted to learn about how the company makes its cars, and were reportedly keenly interested in the i3, BMW’s tiny electric hatchback. It’s the first rumbling of potential partnerships between Apple and an automaker, but the Reuters report on the meetings suggests that their talks have already faded. September 2015: The Wall Street Journal reports that Apple expects to ship its car in 2019, and has tripled the original 600-person team. This same month, the California DMV confirms that it recently met with Apple to go over the DMV’s autonomous vehicle regulations. October 2015: Sources from Mission Motors, an electric motorcycle startup, claim the company was bankrupted by Apple’s aggressive poaching. Fall of 2015: Cook and Jony Ive meet at the project’s headquarters in Sunnyvale for an odd demo of what riding in a Siri-powered car could be like. According to the New York Times: The two men sank into the seats of a cabinlike interior. Outside, a voice actor read from a script of what Siri would say as the men zoomed down the road in the imaginary car. Mr. Ive asked Siri what restaurant they passed and the actor read an answer, said two people familiar with the demonstration. January 2016: Reports show that Apple, or at least a registrant claiming to be Apple, bought apple.cars and other, similarly automotive-themed domain names. But the first signs of trouble also appear as Zadesky departs Apple, leaving his post as head of the car project vacant. April 2016: German outlet Handelsblatt reports that BMW / Daimler has given up on talks with Apple because Apple wants the platform to be built “into its own cloud software,” which apparently doesn’t sit well with BMW’s future strategy for customer data protection. July 2016: Zadesky’s vacancy is filled by Bob Mansfield, Apple’s former hardware engineering boss, who had left the company’s executive team in 2013 but stayed on for special projects. At the same time, reports say the car is delayed to 2021, and that Mansfield has hired a former BlackBerry automotive software executive to focus on autonomous driving. Bloomberg reports that internally, employees are confused about Project Titan’s direction. September 2016: Apple reportedly fires “dozens of employees” as it reconsiders its approach to the car project. Later that month, rumors circulate that Apple is thinking about buying British supercar company McLaren and self-balancing motorcycle startup Lit Motors. Neither ever happens. October 2016: Apple has reportedly parked its plans to build its own car and will focus on creating self-driving software for other companies to use in their vehicles. Even so, Cook tosses a morsel to investors during an earnings call, saying that cars are “an area that it’s clear that there are a lot of technologies that will either become available or will be able to revolutionize the car experience.” April 2017: The California DMV gives Apple a permit to test-drive three 2015 Lexus RX 450h SUVs outfitted with autonomous driving tech. One of these cars is seen driving around Silicon Valley. June 2017: Cook tells a Bloomberg interviewer that Apple is “focusing on autonomous systems,” calling it “the mother of all AI projects.” He repeats the same thing — almost verbatim — during an investor call in August 2017, but suggests it is about more than cars. October 2017: The Apple Lexus SUV is spotted again, this time with its collection of sensors encased in white plastic, rather than the makeshift rig from the April sighting. May 2018: Apple reportedly partners with Volkswagen to use its T6 Transporter vans as self-driving shuttles to cart around Apple employees, representing something of a back-to-basics approach. Apple has more autonomous test vehicles registered in California than Uber and Waymo combined, for the moment. July 2018: Apple employee Xiaolang Zhang is arrested and accused of stealing the company’s trade secrets to bring back to a Chinese automotive company called XMotors. At the same time, The Washington Post reports that the company has 5,000 employees working on its car project either directly or indirectly. August 2018: Someone rear-ends an Apple autonomous test vehicle that is trying to merge onto an expressway. The same month, Apple hires Doug Field, who’d previously left for Tesla in 2013, to help lead Project Titan. January 2019: Project Titan shrinks as Apple shuffles 200 of its workers to “support machine learning and other initiatives” elsewhere in the company. Also, another Apple employee is arrested for allegedly stealing trade secrets. June 2019: Apple buys autonomous driving startup Drive.ai, a company that was founded four years earlier by Stanford University researchers and that ran a small self-driving shuttle service in Texas. The move is seen as an instance of “acqui-hiring” to gain access to the startup’s small team of AV engineers. November 2019: Jony Ive leaves Apple. While he may not have been fully hands-on with the Apple Car project, he did reportedly give lots of input, including that the car shouldn’t have a steering wheel. February 2020: Data shows that Apple had logged fewer autonomous testing miles in 2019 than 2018 — by over 70,000 miles, in fact. Which isn’t great, since it put down 79,745 miles in 2018. December 2020: Apple reportedly shifts oversight of its car project to John Giannandrea, who’s been heading up Siri and artificial intelligence for the company since 2018. The same month, reports suggest that Apple is, once again, considering building its own car. February 2021: But it’s hard for Apple to make friends. Apple analyst Ming-Chi Kuo corroborates other rumors suggesting that the company is working with Hyundai on an electric car. Later that month, Hyundai and Kia downplay the rumor, saying that they are no longer in talks to do so. Nissan also issues a statement, saying it isn’t discussing a car project with Apple. September 2021: Field leaves Apple to work for Ford. Two days later, the company reportedly puts Apple Watch executive Kevin Lynch in charge of its car ambitions, under COO Jeff Williams rather than Giannandrea. October 2021: Foxconn shows off three electric car prototypes under the brand “Foxtron.” Although the company isn’t planning to build cars itself, it’s interesting that the company most responsible for assembling Apple’s iPhones has been apparently developing an EV platform to sell to automakers. November 2021: Apple hires another former Tesla employee, Christopher Moore, to work on self-driving software for the company. May 2022: Moore quits. June 2022: Some of Apple’s work bears fruit at WWDC 2022 when it debuts the next-gen version of Apple CarPlay, designed to take over the entire dash of a car. The company also announces several partners, including Ford, Audi, Jaguar-Land Rover, and Nissan. (To date, it isn’t in any cars.) July 2022: The struggles of Project Titan are laid out in a report from The Information that claims Apple software boss Craig Federighi was “particularly skeptical” of it, and that employees outside of the project regularly mocked it. The report also said that a test vehicle nearly hit a jogger earlier in 2022. The Information details some design possibilities for the car as well, including that the company sought the National Highway Traffic Safety Administration’s blessing to create a car that had no traditional steering wheel or brake pedal, and that Ive had advised the design team to “lean into the weirdness of the vehicle’s design and not try to hide its sensors.” October 2022: Foxconn again unveils EV prototypes, this time a crossover and a pickup truck. This time, the company says it wants to become a Tesla supplier. December 2022: Apple yet again scales back its plans for the car to have less ambitious self-driving capabilities than it originally planned. Also, the company is apparently targeting a sub-$100,000 price tag for the vehicle and has now moved its launch plans back to 2026. December 2023: After a slow year in Apple Car news, Apple announces that Porsche and Aston Martin would incorporate bespoke versions of the dashboard-wide next-gen CarPlay infotainment system. January 2024: Project Titan suffers two heavy blows as Apple reportedly pushes the car’s launch back two more years to 2028. Shortly thereafter, hardware executive DJ Novotney, who was ostensibly instrumental in starting Titan, leaves to work for Rivian. February 2024: Signs of life! The California DMV records show that Apple logged nearly half a million miles of autonomous driving throughout most of 2023 — significantly more than the year before But that was 2023. On February 27th, 2024, Bloomberg reports that the Apple Car is, after 10 years and billions spent, not to be. Rest in peace, little buddy. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}