{
    "title": "Epic rants against unfair practices by Apple, publicly posts correspondence \nwith company",
    "date": "3/7/2024",
    "url": "https://www.news9live.com/technology/epic-rants-against-unfair-practices-by-apple-publicly-posts-correspondence-with-company-2459347",
    "text": "Apple has terminated the recently approved Epic Games Sweden AB developer account, which Epic Games was intending to use to bring the Epic Games Store and Fortnite to iOS devices in Europe, in line with the Digital Markets Act (DMA). The act requires companies to allow sideloading of apps in their ecosystems, along with third-party application stores. Epic alleges that Apple has taken down one of the largest potential competitos to the App Store, and signaling to other developers the harsh consequences of being critical of Apple or their practices. Apple has accused Epic of not acting in good faith, entering into agreements with Apple, and then breaking them. Apple has also highlighted Epic’s public criticism as one of the motivating factors in terminating the Epic Sweden account. Epic has accused Apple of unfair and illegal practices, and for retaliating against Epic for speaking out against Apple. Epic has also highlighted a number of ongoing agreements with Apple, going back to the release of Epic Citadel for iOS devices in 2010, followed by the Infinity Blade series of games, that were originally developed for consoles. Epic has indicated that it intends to continue to fight to ensure healthy competition in the iOS ecosystem. Epic has put up a detailed explanation on its site, along with juicy correspondence with Apple executives. Epic has also pointed at ongoing contracts for two Apple Arcade games, Horizon Chase 2 and Wonderbox. Epic’s Unreal Engine has been used in a number of applications and games that are highlighted during Apple events over the years, with a number of titles in the App Store and Apple Arcade. The Unreal Engine 5.4 is also shipping with experimental support for Apple Vision Pro. Despite the rift, the two companies continue to work together in various ways. OpenAI has recently publicly shared its correspondence with Musk as well. "
}