{
    "title": "Forbes Daily: Investors Uneasy Over Apple's Next Move",
    "date": "3/1/2024",
    "url": "https://www.forbes.com/sites/forbesdaily/2024/03/01/forbes-daily-investors-uneasy-over-apples-next-move/",
    "text": "Plus: The SEC will likely pass final judgment on spot ether ETF applications in May. But unlike bitcoin’s decision day in early January, ether’s outlook is far less certain. Good morning, With the weekend just a few short hours away, it’s understandable to already be contemplating what you might order when you go out tonight. If you’re hitting the bar, it’s best to keep up with the latest trends in the world of cocktails—from savory, umami-forward drinks like one called “Cold Pizza,” to interactive options that include flair and special glassware, cocktail fanatics are all-in on getting experimental in 2024. One of the trends that seems like it’s here to stay: the increase in low- and non-alcoholic options available to order. “The non-alc category continues to grow at an astonishing rate,” says Adam Montgomerie, bar manager at Hawksmoor NYC. Tata Steel steel mill close to the North Sea coast and port of IJmuiden on October 5, 2023 in Velsen. Global carbon dioxide emissions hit another record high in 2023, but the increase was smaller than the previous year due to the strong expansion of renewable sources. Extreme droughts across the world were key contributors to the rise in emissions last year, as they led to a shortfall in hydropower output and caused countries like the U.S. and China to turn to fossil fuels to cover the gap. Caitlin Clark, one of the biggest stars in women’s basketball, announced she will enter the WNBA draft this April. Clark has broken a number of records in her final season at the University of Iowa, including becoming the all-time leading scorer in Division I women’s basketball, and is estimated to make $910,000 on name, image and likeness deals this season. It was a hot February for stocks, as each of the three major indexes registered all-time highs for the month, while the S&P 500 and Nasdaq each notched their best February returns since 2015, and the Dow Jones Industrial Average had its best February since 2021. It’s a notable accomplishment for stocks to register such a big month, considering February is typically associated with below-trend returns due to the hangover of portfolio readjustments A SPAC formed by Korean billionaire Chey Tae-won’s SK conglomerate is acquiring Webull Corp., a Chinese-owned online broker rival to Robinhood Markets, the companies said on Wednesday, in a deal that values the stock trading platform at approximately $7.3 billion. Webull, which offers commission-free online stock trading services, expanded into the U.S. in 2018. The company surged in popularity in the country during the meme-stock mania of 2021. Goya Foods heir Andy Unanue has listed this $32.7 million home for sale in Palm Beach, Florida. The luxury housing market is continuing on an upward trajectory that started at the end of 2023, according to the Institute for Luxury Home Marketing, and heirs to companies like Goya Foods, Bacardi and Bass Oil Producers have recently listed homes worth tens of million of dollars. Luxury homes in seasonal resort locations are expected to outperform traditional markets this year, according to Coldwell Banker. Shares of Apple dipped below $180 for the first time in nearly four months on Thursday, highlighting a difficult stretch for the stock as investors gravitate toward Apple’s big tech peers who appear more readily positioned to capitalize on the AI boom. Long heralded for its market-beating returns, Apple has provided a worse return to investors than the S&P on a 6-month, 12-month and 2-year basis, according to FactSet data. A Yangwang U8 giant SUV is seen on the stand of the Chinese carmaker BYD at the Geneva International Motor Show in Geneva, on February 27, 2024. The Biden Administration announced Thursday that Chinese cars could eventually pose a risk to the U.S. by potentially collecting sensitive data about Americans and sending it back to Beijing. The president said he has directed Secretary of Commerce Gina Raimondo “to conduct an investigation into connected vehicles with technology from countries of concern,” though a senior official said that there is no imminent threat, and that the looming risk of Chinese cars is a “next few years’ problem.” Two founders of Trump’s media business are suing the company they once started, claiming the business is trying to dilute their stakes in the company. United Atlantic Ventures—a partnership founded by former Apprentice contestants Andy Litinsky and Wes Moss—alleges the former president and other leaders recently attempted to “drastically dilute UAV’s interests,” in what the filing describes as “11th hour, pre-merger corporate maneuvering” to increase the amount of authorized stock from 120 million shares to one billion shares. The Senate’s Committee on Energy and Natural Resources heard testimony this week about geologic hydrogen, a promising new form of clean energy generated naturally underground, which has attracted growing interest and investment in the past year. “This new source of hydrogen could lower energy costs and increase our nation’s energy security and supply chains,” Evelyn Wang, director of DOE’s Advanced Research Projects Agency-Energy told senators. UnitedHealth-owned Change Healthcare has confirmed the ransomware group “ALPHV/Blackcat” is behind its recent cyber attack, as disruptions to pharmacies continue nearly a week after the attack was reported. The group reportedly posted about the attack on the dark web, claiming it had accessed “more than 6 TB of highly selective data,” including medical and dental records, payment information and patients’ private information from a variety of Change Healthcare partners. Former President Donald Trump renewed his calls Thursday for President Joe Biden to undergo a cognitive test, suggesting such a test should be mandatory—but legal precedent suggests a required exam would defy the Constitution. Presidents are not required by law to undergo a physical or cognitive examination, though publicizing the results of annual physicals became routine practice under former President Richard Nixon. Though he’s just four years older than Trump, polling suggests voters’ concerns about Biden’s age far outweigh those surrounding Trump. The crypto industry has long resisted having its tokens classified as securities. However, the success of bitcoin’s spot ETFs, could prompt issuers to break ranks depending on the SEC’s next move. TOPLINE Spring has come early to cryptoland. Bitcoin is trading above $60,000, up more than 167% in the last 12 months and more than $7 billion has poured into the new bitcoin ETFs. The market is buzzing with anticipation for an ETF backed by bitcoin’s little brother ether, the native token associated with the Ethereum blockchain and used to create such things as NFTs. Ether has a market cap of more than $400 billion, second only to Bitcoin, whose market cap exceeds $1.2 trillion. In May, the SEC will likely pass final judgment on nine spot ether ETF applications. But unlike bitcoin’s decision day in early January, which seemed to be a fait accompli, ether’s outlook is far less certain. The most immediate concern is whether the SEC believes that ether is a security, which means that it would be subject to registration and regulatory oversight by the SEC under the Investment Company Act of 1940. Most ETFs, like the QQQ or the SPDR S&P 500 trust, fall under the so-called 40 Act, precisely because they are bundles of stocks, or registered securities. Despite the fact that cryptocurrencies seem to trade and behave much like any number of stocks in the market, the digital asset community believes that the thousands of different cryptocurrencies behind the $1.8 trillion dollar industry are not securities. In fact, they bristle at the thought, calling it anathema to the decentralized ethos that launched bitcoin 15 years ago. To some extent, these beliefs were vindicated when the SEC greenlit spot bitcoin exchange-traded funds (ETFs) in January after a 10-plus year wait under the 1933 Securities Exchange Act, which recognized the underlying bitcoin in these funds as commodities. WHY IT MATTERS If the SEC decides that ether is a security, it will insist on ETF issuers treating it as such in their applications for approval. While this might seem like just a bunch of legal paperwork, doing so would be an affront to crypto industry insiders and idealists, and throw into question the status of thousands of cryptocurrencies. However, given the potential billions at stake for early movers in the new booming market for crypto ETFs, those that can gain market share rapidly as Blackrock, Invesco, Fidelity have with their bitcoin ETFs could benefit from such an SEC ruling. When it comes to asset gathering and profits, “crypto community ideals” aren’t likely to carry much weight. Said one applicant who requested anonymity, “At the end of the day, we'll file under whatever jurisdiction or regulation the SEC wants.” MORE Crypto Billionaire Mike Novogratz On Bitcoin’s Next Bull Run Forbes 30 Under 30 alum Timothy Latimer announced on Thursday new funding for his company Fervo Energy, which is pursuing the dream of harvesting limitless, zero-carbon energy from the Earth: $244 million: The total funding announced this week, led by Devon Energy, with help from billionaire John Arnold, Liberty Mutual and others 250 degrees Fahrenheit: The temperature of the naturally hot rock that Fervo Energy drills into, in a process that can be thought of as fracking for geothermal energy—with no oil or gas coming from underground 8 megawatts: The amount of power from each of the three wells at a Utah pilot project that the company aims to produce—enough to power about 8,000 homes with zero-carbon emissions In today’s job market, it’s not uncommon to see hundreds (or even thousands) of applicants on a job posting on LinkedIn, which can make it all the more confusing when a role like that is reposted. Counterintuitively, this might be the right time to apply: Job listings get the largest volume of applicants within the first 48 hours, and this brief window tends to yield enough quality candidates for recruiters to move forward. But if a role is later reposted, it probably means no candidate was selected, and there may even be a greater sense of urgency this time around. Senate Democrats reintroduced a voting rights act that has already stalled twice due to Republican opposition. The bill, which would provide a major update to the 1965 Voting Rights Act, is named after which Civil Rights leader? A. John Lewis B. Martin Luther King Jr. C. Rosa Parks D. W.E.B. Du Bois Check your answer. Curated for today's and tomorrow's leaders and decision-makers, Forbes’ CEO newsletter is an expert rundown of smart business insights and the latest must-know headlines—sent straight to your inbox every Sunday. You can sign up here.   "
}