{
    "title": "Evercore ISI reiterates Apple as outperform with $220 price target",
    "date": "3/12/2024",
    "url": "https://macdailynews.com/2024/03/12/evercore-isi-reiterates-apple-as-outperform-with-220-price-target/",
    "text": "Update font size. Reset  Amit Daryanani, Evercore ISI senior managing director, joins CNBC’s “Squawk on the Street” to discuss what will reverse Apple’s downside momentum, the rotation into Nvidia from Apple, and how Apple will include new AI technology into its flagship products.  Daryanani has a $220 price target on Apple shares. MacDailyNews Take: From Amit’s lips to Mr. Market’s ears!\n ‎\nPlease help support MacDailyNews. Click or tap here to support our independent tech blog. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon. Daryanani and MDN are whistling past the graveyard. All things must pass and the Apple boom has now run its course. Nice value stock. That’s it. If you hold a lot of AAPL, as I do, trim it back and place the trimmings in something with a better return. Anyone who understands investing understands this. I tend to agree this time – Trimming 5% and of your holding will not stop the AAPL train and open up new opportunities.  But if I would have listened to the street, my broker, mutual fund nuts, millions of people in my ear at every cocktail party, and all the noise about diversification.  I would not be in a place with over a 35,000% return.  Everyone has told me to sell along the way, and I never have….but diversifiaction in real estate, education, and other ways to generate cash flow is key.  AAPL is solid, and despite the sell-off, this is the time to accumulate.  Buying at 169 this time around will be a gift to those that bought a little more. Sorry but I think Apple has run its course this decade. Maybe something will change after Cook but it may even get worse with his successor left holding an empty pipeline. Outside of a miracle with AI, which I would not count on, Apple will not break $200. It’s a value stock that pretends to be a growth stock once every few years before settling back to the price from 2 years earlier. All good things come to an end and Apple’s growth story will too, it has probably already happened. OLED iPads and folding MacBooks aren’t going to catch up to Microsoft or match Nvidia’s innovation. I cannot say I disagree wholeheartedly, as I’ve been trimming too for a couple of yrs.  With that said, MS was in the “nice value stock” realm for a number of yrs and they’ve taken off the Ballmer Boots and a now are causing others to break a sweat. Cook is the the big_?_ and there are too many vigorous people once in the Jobs sphere that still have the fight of the pirate to let the ship dawdle, imo. Good point on MS, Ingmar. The stock seemed to hover at $150 a share forever. OS and Excel dominance have proven unbeatable. These products permeate the users everywhere in the world. Balmer was certainly a clown prince. Would love to see the “next Steve” at the head of Apple post-Cook but would not bet my money on it. The pipeline is DRY. Goggles will not move the needle, useless personal geek satisfaction toy generating intermittent interest. Cook killed Titan desperate act from an indecisive CARETAKER WOKE CEO, certainly proves he is not a product guy or a good manager. For Apple to grow next decade, the ONLY WAY forward is the SECOND COMING of Steve Jobs. Elon, Scott and many others would be 1,000X better on Day One. BRING… IT… ON!!!… This site uses Akismet to reduce spam. Learn how your comment data is processed. “Ted Lasso” star and writer Brett Goldstein is set to appear in a guest star role in “Shrinking” Season 2 at Apple TV+… Apple’s M3 Ultra chip may be designed as a unique standalone chip, rather than two M3 Max chips joined together as in the M1 Ultra and… Alphabet subsidiary Google’s Android website has added a new landing page for Google Messages which touts that RCS on Apple’s iPhone… Sunshine is launching a new AI product, Shine. The product offers a photo-sharing app and an events website. Co-founder Marissa Mayer tells… Apple filed a lawsuit earlier this month against former software engineer Andrew Aude, alleging he leaked info about products he hated… Enter your email address to follow MacDailyNews and receive notifications of new posts by email. Email Address Follow :-) "
}