{
    "title": "A Look at Tesla's Bold Bet on Affordability",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/news/look-teslas-bold-bet-affordability-190154540.html",
    "text": "In the rapidly evolving electric vehicle landscape, Tesla Inc.'s (NASDAQ:TSLA) strategy of reducing the average selling price to expand market reach and bolster its technological ecosystem represents a pivotal shift. Today, we delve into Tesla's calculated move to reduce ASPs, a visionary step for market expansion and pioneering advancements in the EV and tech sphere, especially amidst the rising challenge from competitors like BYD (BYDDF). Warning! GuruFocus has detected 5 Warning Sign with NOW. Tesla's gross profit margin has been on a downward trend for the last six quarters, driven by a declining ASP of its vehicles and a relatively stable cost of sales per vehicle. The company has been lowering its ASP to make its vehicles more affordable and tackle the increasing competition from BYD, its biggest rival for now, especially in the Chinese market, which contributes 21.8% to total revenue. The gross profit margin dropped to 17.9% during the third quarter of 2023, down from 25.1% in the prior-year quarter, since the ASP of Tesla's vehicles dropped to $44,493 from $53,436, registering a 16.7% year-over-year decline. The vehicle model mix partially influenced the decline. The proportion of Tesla's more affordable Model 3/Y increased to 96.3% of total vehicles delivered, up from 94.6% a year earlier. Nevertheless, the primary driver behind the decrease in the ASP was Tesla's deliberate price cuts to expand its market reach. Concurrently, Tesla managed a modest 4.8% year-over-year reduction in the cost of sales per vehicle. Although the decreasing ASP adversely impacts Tesla's margins, it is a deliberate strategy the company's leadership envisioned long ago. Elon Musk articulated this vision in 2006 when he outlined his master plan, which aimed to start with a sports car, leverage the profits to develop an affordable car and subsequently use those funds to create an even more budget-friendly vehicle. Hence, this intentional shift aligns with Tesla's long-term goal of making its cars more accessible and gradually expanding its market reach. The deliberate decline in ASP is a strategic necessity for Tesla, aiming to extend its market reach while simultaneously fortifying the entire ecosystem of artificial intelligence-driven automotive technology. This approach is crucial for realizing the ultimate vision of fully autonomous driving. As Tesla broadens its market presence, it gains access to a larger dataset. This influx of data enhances the capabilities of the Tesla Dojo, the recently launched supercomputer designed for computer vision video processing and recognition. The amplified processing power of Tesla Dojo, in turn, significantly bolsters the training capabilities of its full self-driving advanced driver-assistance system, propelling it toward greater efficacy. Tesla isn't merely an automobile manufacturer; it's transforming into an automotive technology powerhouse, essentially a supercomputer on wheels. Beyond integrating its native supercomputer into vehicles, the company's strategic developments pave the way for licensing its advanced machine learning algorithms to third parties. This shift enhances Tesla's core business and unlocks lucrative opportunities for the EV maker in diverse markets. Realizing the utmost potential of its supercomputer capabilities compels Tesla to accumulate substantial data and log extensive driving miles. This initiative accentuates the need for Tesla to elevate its car sales volume, emphasizing the critical role of enhancing affordability across its vehicle lineup. This unified strategy underscores the company's grander visionnot confined to mere car production, but aiming to establish itself as a pivotal force in the evolving realm of automotive technology and machine learning. The following chart's upward trajectory will intensify as Tesla aims to make its cars more accessible, catering to the mass market. This strategic move will concurrently enhance the supercomputer's capabilities in training FSD systems. Reaching the mass market also hinges on Tesla rapidly expanding its supercharger stations, which have exhibited robust growth, averaging 32.5% year over year for the past five quarters. Therefore, this expansion has outpaced the impressive average car delivery growth of 43.9% over the same period. Source: Tesla's Third-Quarter 2023 Disclosure In its third-quarter disclosures, Tesla revealed a significant milestone: the company doubled the capacity of its supercomputer and successfully assembled 10,000 GPU clusters of H100s. The Tesla Dojo system is specifically optimized for video training, demanding substantially higher computing power than large language models due to the elevated computer-to-memory bandwidth required for training through visual recognition. While quantification remains challenging at this juncture, implementing Dojo implies that each vehicle sold could contribute significantly more to the company's valuation, contingent on the success of FSD initiatives. Finally, introducing Dojo and ongoing software development and capacity expansion initiatives will keep capital expenditures at elevated levels. While this exerts downward pressure on free cash flow, Tesla sees it as a strategic trade-off, willingly accepting this temporary setback to unlock higher value in the future. Tesla is recalling over 1.6 million EVs in China, addressing concerns related to assisted driving functions and door-locking systems through remote over-the-air software updates. While the recalls will not have an immediate major direct impact on Tesla's business fundamentals, they may affect the company's stance on its high-profile lawsuits related to crashes on autopilot affected by them. This is the second time that Tesla has made such a large number of recalls. Previously, the company also recalled 2 million vehicles in the U.S. over the autopilot system. The company's recalls have become extensive recently as the EV maker is progressing fast in its FSD vision, which requires a lot of computing and algorithm technology that is still in the trial-and-error phase. In 2023, Tesla's recall instances (including investigations of vehicles) based on several vehicles stood at 2.8 million, and the company started 2024 with 1.6 million recalls in China. Hence, this suggests its journey toward FSD will be bumpy, involving recalls, ongoing lawsuits and investment to make the technology safer and more marketable. In a recent development, BYD overtook Tesla in its fourth-quarter sales numbers. BYD sold 526,409 EVs, while TSLA logged 484,507. Thus, BYD's rise as one of the top EV makers signifies the company's competitive strength and China's fast adoption of EVs. BYD has swiftly gained traction in the EV market with its cost-effective electric cars, presenting a potential threat to Tesla in China. While not a significant concern, BYD's absence in the U.S. market, where substantial tariffs and other obstacles could nullify its price advantage, mitigates potential challenges for Tesla. Source: Bloomberg However, as BYD expands its market presence beyond the U.S., it could emerge as a formidable competitor. Moreover, it's not just BYD's ascent that Tesla needs to consider; China's increasing influence on car exports also poses a potential challenge for the electric car giant. China spearheaded becoming one of the largest exporters of passenger cars (see chart below). China is close to catching up with the two largest car-exporting countries, Japan and Germany. Tesla may need to work on growing its market outside the U.S. and widening the addressable market as China's threat looms and may have to play with price points longer than many estimates. Source: The Economist Tesla's non-core segment includes energy generation, storage, services and others. This segment contributed 16% to total revenue during the third quarter, up from 12.9% a year earlier. The segment has been growing at a 60.7% average year-over-year rate for the last five quarters. Moreover, the non-core segment's gross margin improved by 754 basis points compared to the year-ago quarter, demonstrating the segment's potential to be a significant profit contributor to Tesla's business. Tesla has surpassed its 2023 guidance of delivering 1.8 million cars. As monetary tightening and inflationary pressures ease, alleviating macro headwinds, its sales growth is expected to persist and align with its targeted 50% CAGR. Although the initial deliveries of the Cybertruck commenced in November 2023, this model will contribute a relatively smaller portion to total revenue for the next couple years. Musk has indicated the company may take 12 to 18 months to achieve volume production and positive cash flow with the Cybertruck, which is a plausible expectation. Finally, Tesla is poised to maintain a capex-heavy approach in the coming quarters, channeling investments into AI, supercomputers and other technological improvement projects. The ongoing trend of declining prices may persist, punctuated by some volatility between quarters, primarily driven by an assertive expansion strategy aimed at capturing a broader market and addressing competition, particularly from BYD in China. Tesla's strategy to lower vehicle prices marks a calculated move toward expanding market reach and technological leadership in the EV sector. Despite reduced margins, this approach aligns with Tesla's vision of making EVs more accessible and advancing AI-driven automotive technology. The Tesla Dojo supercomputer's role in this strategy highlights a shift from just car production to becoming a leader in automotive technology and machine learning. Finally, challenges like increased capex and market competition, notably from BYD, are part of Tesla's broader plan for future growth and technological supremacy. This article first appeared on GuruFocus. Related Quotes "
}