{
    "title": "China's BYD is rivaling Tesla in size. Can it also match its global reach?",
    "date": "1/3/2024",
    "url": "https://apnews.com/article/byd-biyadi-tesla-ev-automaker-9389c7355326c6b84091389d3616b44a",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. Easter 2024 FILE - A model stands next to a car from BYD during the Shanghai auto show in Shanghai, on April 18, 2023. BYD Co., based in the southern China tech hub of Shenzhen, dethroned Texas-based Tesla Inc. as the top seller of electric cars in the last three months of 2023, according to sales figures released by the companies this week. (AP Photo/Ng Han Guan, File) A BYD Dolphin EV car, right, parked near a Tesla Model 3 on a street in Beijing, Wednesday, Jan. 3, 2024. (AP Photo/Andy Wong) * FILE - Attendees look at the electric Han EV sedan from Chinese automaker BYD during the Auto Shanghai 2023 show in Shanghai on April 19, 2023. YD Co., based in the southern China tech hub of Shenzhen, dethroned Texas-based Tesla Inc. as the top seller of electric cars in the last three months of 2023, according to sales figures released by the companies this week.(AP Photo/Ng Han Guan, File)       BEIJING (AP) — A less flashy Chinese electric vehicle maker is fast closing the gap with Tesla, the longtime, market-leading pioneer. BYD Co., based in the southern China tech hub of Shenzhen, dethroned Texas-based Tesla Inc. as the top seller of electric cars in the last three months of 2023, according to sales figures released by the companies this week. Tesla retained the crown for all of 2023, but BYD’s sales have skyrocketed on the back of a government-driven EV boom in China. The rise of BYD and other Chinese electric vehicle makers is a challenge not only for Tesla but also the world’s major automakers as Chinese competitors push into Europe, Southeast Asia and other overseas markets with a relatively affordable option for drivers who want to go green. Car makers like Volkswagen, Ford, Honda and Toyota all are playing catch-up with both BYD and Tesla, said James Attwood, acting managing editor at Autocar magazine. “I think perhaps the most interesting thing is less about the battle between Tesla and BYD and more about what the big established manufacturers that have a hundred years of history in making cars are going to do to catch these upstarts,” he said. Aggressive price cutting helped Tesla beat analysts’ estimates for sales in the October to December quarter, but BYD did even better. The Chinese automaker sold 526,409 electric cars in the three-month period, topping Tesla’s 484,507 units.  Its results were boosted by a surge in sales of small, low-cost EVs such as its Seagull and Dolphin models, said Cui Dongshu, secretary-general of the China Passenger Car Association. Whether that growth in small vehicles can be sustained remains to be seen, he said. For the entire year, BYD’s EV sales rose 73% in 2023 to nearly 1.6 million vehicles, the company said in a filing Monday with the Hong Kong Stock Exchange. The total still fell short of Tesla, which announced the next day that its annual sales were up 38% to 1.8 million cars. Unlike Tesla, BYD also makes hybrid vehicles. Including its 1.4 million hybrids, BYD far outpaced its American competitor in 2023 with sales of 3 million passenger cars. China’s subsidies for EVs were phased out at the start of this year, but a fierce price war among makers including BYD and Tesla has kept sales buoyant. China is a major market and production base for Tesla, which exports cars to Europe and elsewhere from China. BYD’s growth has been primarily at home, where it has benefited from the huge Chinese market and government policies to encourage the EV industry. It rivals Tesla in size but not yet in reach. “Most of BYD’s EVs were sold in China despite its fast-growing overseas sales, whereas Tesla is already a global player,” said Jing Yang, the director of China corporate research at Fitch Ratings. The company is expanding into new markets. Its exports more than quadrupled to 242,765 vehicles in 2023, accounting for 8% of its sales, and BYD announced last month that it would build an electric vehicle factory in Hungary, its first in Europe. Chinese EV makers are still in the early stages of going abroad and may run up against regulatory or trade barriers, Yang said, particularly in markets that are home to major automakers such as the U.S., Europe, Japan and South Korea. The EU has launched a trade investigation into subsidies to electric vehicle makers in China and the U.S. has passed legislation that blocks consumers from getting a full $7,500 tax credit for an electric vehicle if its battery components come from China and a few other countries. “The main concern for global automakers is the influx of cheap Chinese EVs into their home markets and other major markets before they can produce EVs at lower costs,” Yang said. Company founder Wang Chuanfu has said that BYD, or “Biyadi” in Chinese, was chosen mainly because it was a simple and unusual name, two characteristics that make it easier to register a new company in China. At the time, it was a rechargeable battery maker that Wang set up in Shenzhen in 1995. From batteries, BYD expanded into other fields including consumer electronics. BYD launched an automobile subsidiary in 2003 that initially made gasoline-fueled cars. By 2008, Wang was eyeing the electric vehicle market. BYD has stopped producing gasoline cars. It also manufactures electric buses, including at a U.S. factory in Lancaster, California. While the origins of its name are unclear, the company has turned its acronym into a slogan: “Build Your Dreams.” Associated Press researcher Yu Bing in Beijing and video journalist Cassandra Allwood in London contributed. Copyright 2024 The Associated Press. All Rights Reserved. "
}