{
    "title": "Warren Buffett once said he didn't want to compete with Elon Musk — but one \nof his holdings just overtook Tesla as the ...",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/news/warren-buffett-once-said-didnt-110000935.html",
    "text": "Legendary investor Warren Buffett holds Tesla (TSLA) CEO Elon Musk in high regard. He called him “a brilliant, brilliant guy” at his company Berkshire Hathaway’s (BRK.B) annual shareholders meeting in 2023. “He dreams about things, and his dreams have got a foundation.” He also noted, “We don't want to compete with Elon in a lot of things.” Commercial real estate has outperformed the S&P 500 over 25 years. Here's how to diversify your portfolio without the headache of being a landlord Take control of your finances in 2024: 5 money moves to start the new year off strong The US dollar has lost 87% of its purchasing power since 1971 — invest in this stable asset before you lose your retirement fund Buffett’s right-hand man, the late Charlie Munger, concurred. “We don’t want that much failure,” he said. Musk’s accomplishments, often overshadowed by his controversial statements and actions, are indeed remarkable. As an electric vehicle (EV) pioneer, Tesla has transformed the automotive industry and provided enormous returns to investors, with shares soaring over 900% in the past five years. Today, the company boasts a market cap of about $764 billion, which is several times bigger than Ford and General Motors combined. Yet, Buffett hasn't entirely sidestepped the EV race. Enter BYD, a Chinese EV manufacturer that has been a part of Buffett's closely-watched portfolio for more than a decade. BYD stands for Build Your Dreams. In 2008, Berkshire Hathaway acquired 225 million shares of BYD for $232 million. The investment proved highly lucrative. By the end of 2020, as stated in Berkshire’s shareholder letter, their stake was valued at approximately $5.9 billion. However, despite Buffett’s preference for long-term investments — he famously said that his favorite holding period is “forever” — he's not opposed to trimming positions. Since late 2022, the Oracle of Omaha has been reducing his stake in BYD. An October 2023 stock exchange filing reported on by Reuters revealed Berkshire sold another 820,500 Hong Kong-listed shares of BYD, though it still retained a sizable 7.98% stake. And while BYD might not be well-known to North American investors, it certainly warrants attention, having recently surpassed Tesla in a key metric. Read more: Find out how to save up to $820 annually on car insurance and get the best rates possible In Q4 of 2023, Tesla delivered 484,507 EVs, marking a notable increase from the 405,278 EVs it delivered in the same period the previous year. BYD sold 526,409 EVs in Q4 of 2023, surging past its American rival for the first time. The Chinese company's success has been attributed to various factors, including its broad lineup with inexpensive models, price cuts, its battery-manufacturing capability, and the Chinese government's support of the country's EV sector. BYD's shares are not listed in the U.S., but they are traded over-the-counter here, so American investors who want to buy the stock would need to choose a broker that supports trading them. And while BYD has surpassed Tesla in sales in the most recent quarter, its passenger EVs are not yet available in the U.S., where Tesla continues to dominate. “In the U.S., Tesla is still the dominant EV name,” Barclays analyst Dan Levy said in a recent Bloomberg interview. Musk is also confident about the company’s growth prospects. During Tesla’s earnings conference call in October, an analyst asked about 2024 projections, citing Wall Street’s forecast of Tesla delivering 2.3 million vehicles, and inquired about the timeline for the company's return to its long-term compound annual growth rate (CAGR) of 50%. “At the risk of stating the obvious, it is not possible to have a compound growth rate of 50% forever, or you will exceed the mass of the known universe,” Musk replied. “I think we will grow very rapidly, much faster than any other car company on earth by far.” The market’s optimism for Tesla is also evident, as shares surged 101% in 2023. Wall Street sees further upside ahead. For instance, Morgan Stanley has an “overweight” rating on Tesla and a price target of $380 — roughly 60% above where the stock sits today. This Pennsylvania trio bought a $100K abandoned school and turned it into a 31-unit apartment building — how to invest in real estate without all the heavy lifting Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2024 Rising prices are throwing off Americans' retirement plans — here’s how to get your savings back on track This article provides information only and should not be construed as advice. It is provided without warranty of any kind. Related Quotes "
}