{
    "title": "Tesla (TSLA) stock resumes its decline after judge voids Musk's $56 billion \ncompensation plan",
    "date": "1/30/2024",
    "url": "https://www.shacknews.com/article/138529/tesla-tsla-elon-musk-55-billion-compensation-denied",
    "text": "New to Shacknews? Signup for a Free Account Already have an account? Login Now Tesla (TSLA) shares were down as much as 3 percent after the decision from a Delaware judge. Both Tesla and Elon Musk took a major hit today when the CEO’s $56 billion compensation plan was struck down by a Delaware judge. It caused Tesla (TSLA) stock to dive and Musk’s net worth to drop by a considerable amount. The payment plan was originally presented five years ago and propelled Elon Musk to becoming the world’s richest person. With this plan now denied, Musk will become the world’s third-richest person.  $TSLA downtrend is real. Stock is in a bear market. pic.twitter.com/sxqFVhLfO9  Developing... Donovan is a young journalist from Maryland, who likes to game. His oldest gaming memory is playing Pajama Sam on his mom's desktop during weekends. Pokémon Emerald, Halo 2, and the original Star Wars Battlefront 2 were some of the most influential titles in awakening his love for video games. After interning for Shacknews throughout college, Donovan graduated from Bowie State University in 2020 with a major in broadcast journalism and joined the team full-time. He is a huge Scream nerd and film fanatic that will talk with you about movies and games all day. You can follow him on twitter @Donimals_ Donovan Erskine posted a new article, Tesla (TSLA) stock resumes its decline after judge voids Musk's $56 billion compensation plan Score another one for the Delaware Judges v Elon Won't someone think of the poor berated big brained tech leaders???? Oh no, he's dropped down to only third richest! Incoming X rants to soothe his ego... Apparently he deleted a tweet that said: \"Never incorporate your company in the state of Delaware\"\r Source: https://x.com/bestofdyingtwit/status/1752461415632568576?s=20 Still there.\r https://twitter.com/elonmusk/status/1752455348106166598 Would it be possible to provide more background in these articles? This one's very skimpy on details. https://www.cnbc.com/2024/01/30/tesla-shares-slide-after-judge-voids-elon-musks-56-billion-compensation.html Ggggggggget fucked "
}