{
    "title": "Tesla Suspending Most Production At Giga Berlin Due To Red Sea Disruption - \nTesla (NASDAQ:TSLA)",
    "date": "1/11/2024",
    "url": "https://www.benzinga.com/news/24/01/36602756/tesla-suspending-most-production-at-giga-berlin-due-to-red-sea-disruption",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The escalation over the Red Sea continues to impact shipping for major companies and industries around the world after a U.S.-controlled tanker transporting oil Thursday morning was seized. What Happened: Continued attacks on shipping vessels in the Red Sea will impact one of the largest automotive companies worldwide. Tesla Inc TSLA is suspending most car production at its Giga Berlin factory for two weeks according to a report from Reuters. \"The armed conflicts in the Red Sea and the associated shifts in transport routes between Europe and Asia via the Cape of Good Hope are also having an impact on production in Gruenheide,\" Tesla said in a statement. Related Link: Tesla Q3 Earnings Highlights: Revenue Miss, EPS Miss, Cybertruck Launch Set For November And More Why It's Important: Several companies have warned of delivery delays with Tesla being among the first to call out a disruption to production and deliveries as a result. Tesla said longer transportation times are impacting the supply chains. Attacks on transportation vessels in the Red Sea have been ongoing for months in an act of showing support for militant fighting groups in the Middle East. The Red Sea accounts for around 12% of maritime traffic worldwide, which could lead to further disruptions for companies globally. Several major shipping companies including Maersk have been taking longer and more expensive routes to avoid the area. Read Next: Here’s How Many Vehicles Tesla Has Delivered, Produced In Each Quarter Since 2019 Photo: Giga Berlin, courtesy Tesla © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}