{
    "title": null,
    "date": "1/13/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/teslas-german-factory-suspends-production-over-red-sea-delays",
    "text": "ELECTRIC car manufacturer Tesla has announced it is suspending most production at its factory in Germany for two weeks, citing a shortage of parts due to shipping delays caused by Huthi rebel attacks in the Red Sea. The suspension was disclosed just hours before the United States and Britain announced early Friday (Jan 12) they had carried out air strikes against the Iran-backed rebels over their repeated threats to vessels in the key waterway. The Red Sea attacks had led to delays that created a “gap in the supply chains”, resulting in production at the facility southeast of Berlin being suspended “with the exception of a few sectors”, Tesla said in a statement sent to AFP. “From Feb 12, production will resume in full,” it added. Meanwhile, Volvo said Friday that its factory in the Belgian city of Gand would close for three days next week due to a lack of transmissions due to deliveries being delayed by a change in shipping routes. The factory produces the XC40 SUV as well as the electric C40 model. Start and end each day with the latest news stories and analyses delivered straight to your inbox. Since the start of the Israel-Hamas war, the Iran-backed Huthis have stepped up attacks on commercial and military vessels in the Red Sea in what they say is solidarity with Palestinians in Gaza. As a result, some shipping firms have opted to avoid the waterway, the gateway to the Suez Canal, forcing them to take much longer routes between Europe and Asia. Early Friday morning, heavy US and British air strikes targeted an airbase, airports and a military camp in rebel-held Yemen, the Huthi’s Al-Masirah TV station said, with AFP correspondents and witnesses also reporting hearing bombardments. US President Joe Biden called the strikes a “defensive action” after the Red Sea attacks and said he “will not hesitate” to order further military action if needed. The Tesla factory outside Berlin opened in 2022 and employs around 11,500 people, turning out about 250,000 vehicles a year, according to the company, which plans to expand the facility to double production. AFP BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}