{
    "title": "Elon Musk is no longer the world’s richest person",
    "date": "1/29/2024",
    "url": "https://fortune.com/2024/01/29/elon-musk-tesla-richest-person-world-lvmh-bernard-arnault/",
    "text": "Elon Musk has lost bragging rights as the world’s wealthiest tycoon to Bernard Arnault, the French patriarch behind luxury goods giant LVMH, following a disastrous January during which Tesla shed a staggering $200 billion in market value. The drop reflects a litany of setbacks the EV maker suffered in a month that saw a 26% plunge in Tesla’s stock price. As a result, Musk’s personal net worth is now currently estimated by Forbes at $205 billion, down from a peak of $320 billlion in November 2021. First Tesla surrendered the crown as the leading EV manufacturer to China’s BYD in the fourth quarter. Official data later suggested Tesla had deep-rooted problems in Europe’s largest car market, while frigid temperatures in the U.S. prompted a wave of fear regarding the general reliability of EVs outside of the warm climes found in California. Allegations also surfaced in the Wall Street Journal that Tesla’s board knew Elon Musk was abusing a wide range of narcotics. The Tesla CEO then compounded the company’s problems after leaning on his fellow directors for a pay package that could double his stake to 25%—lest he develop his AI and robotics plans elsewhere. Finally, the company’s Q4 earnings last week turned into a stock price fiasco after Tesla refused to provide guidance beyond a vague warning that vehicle sales would grow at a “notably lower” pace than in 2023, when it cut prices and sacrificed profits in a bid to prop up demand. Even as revenue rose by a fifth to a record $97 billion in 2023, earnings and free cash flow declined across the board. Investors are now looking to parse through the annual 10-K filing published on Monday for any further red flags, beyond the windfall $5.9 billion accounting gain booked in the fourth quarter. Tesla’s only saving grace came in the form of Musk suggesting a low-cost $25,000 entry-level model would arrive in the second half of next year, even though investors have yet to see so much as an official design rendering. Musk’s personal fortune now rests heavily on one question: whether Tesla should be valued as an AI company, as the CEO insists it is—in which case 2024’s low growth is little more than an anomaly—or whether it is closer to a cyclical goods manufacturer that deserves much lower multiples. By comparison, French luxury goods giant LVMH is riding high after Q4 sales that bucked a trend for the broader sector. Chief executive Bernard Arnault is now worth $208 billion, according to Forbes, after Friday’s 12% share price gain. Musk is still easily within striking distance of Arnault. But if investors decide Tesla is not a tech stock after all—and is in essence just a carmaker that for a time enjoyed a first mover advantage—his wealth could tumble much further. BYD, at the vanguard of a Chinese EV industry, offers a cautionary tale in that regard. While Musk predicts the automaker could demolish the global competition, it is worth just $70 billion. That’s significantly less than the 13% stake in Tesla that Musk owns, so there is potentially a lot of downside still to go should his carmaker be re-rated. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}