{
    "title": "Tesla share price plunges 12%, erasing $80 billion in valuation after Elon \nMusk warns sales slowdown despite price cuts | Mint",
    "date": "1/26/2024",
    "url": "https://www.livemint.com/auto-news/tesla-stocks-plunge-12-erasing-80-billion-in-valuation-after-elon-musk-warns-sales-slowdown-despite-price-cuts-11706231204956.html",
    "text": "Tesla plummeted over 12 per cent on January 25 after CEO Elon Musk hinted slowdown in sales this year despite price cuts that have already hurt margins at the world's most valuable automaker and fueled investor concerns about soft demand and Chinese competition, according to a Reuters report. Tesla's stock suffered its sharpest intraday percentage loss in more than a year, with $80 billion in market value wiped out on January 25. That pushed its market capitalization loss for the month to about $210 billion. Elon Musk said on January 24 that growth would be \"notably lower\" as Tesla is focusing on a cheaper, next-generation electric vehicle to be made at its Texas factory in the second half of 2025, which is expected to spark the next boom in deliveries. \"The Tesla headlines have essentially gone from bad to worse,\" said TD Cowen analysts, noting that the fourth-quarter revenue and profit were also below expectations. According to Elon Musk, revisiting the production of the new model would be a challenge because it would involve cutting-edge technologies. Shares of other EV makers also fell, with Rivian Automotive Inc, Lucid Group and Fisker down between 4.7 per cent and 8.8 per cent. The EV industry has been grappling with a slowdown in demand for more than a year and the price cuts by Tesla will likely worsen the pressure on the startups and automakers such as Ford. \"The problem for Tesla is any significant attempt to boost sales from here on will probably need to be achieved at the cost of further falls in operating margin, due to having to compete with BYD in China, as well as increased competition elsewhere,\" said Michael Hewson, chief market analyst at CMC Markets, as quoted by Reuters. At least nine brokerages downgraded the stock, while seven raised their ratings. The company, on average, has a \"hold\" rating with a median price target of $225, 23 per cemt higher than the share's closing price of $182.63 on Thursday. Tesla short sellers have made $3.45 billion so far this year, making it the most profitable U.S. short trade, according to data and analytics firm Ortex. The company's stock trades at nearly 60 times its 12-month forward earnings estimates, according to LSEG data. That gives it a more premium valuation than the other \"Magnificent Seven\" stocks – a group that includes Apple, Microsoft and Nvidia. Some analysts said valuation could become tough to justify if Tesla's sales growth and margin weaken further. \"Tesla is increasingly looking like a traditional auto company,\" said Bernstein analyst Toni Sacconaghi, as quoted by Reuters. (With Inputs from Reuters) Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}