{
    "title": "What to Expect in the Markets this Week",
    "date": "1/21/2024",
    "url": "https://www.investopedia.com/what-to-expect-in-the-markets-this-week-8546676",
    "text": "Coming up this week: earnings from Tesla, Netflix, Intel, and more Mario Tama / Staff / Getty Images Several heavyweights will report earnings this week, with Netflix scheduled to release its latest results on Tuesday, followed by Tesla on Wednesday, and Intel on Thursday. We'll also get a key update on the U.S. economy with the government's first estimate of economic growth for the fourth quarter on Thursday. Other economic indicators due this week will include new and pending home sales, durable-goods orders, Purchasing Managers' Indexes (PMIs), and the Personal Consumption Expenditures Price Index—the Federal Reserve’s preferred measure of inflation. Monday, Jan. 22 Tuesday, Jan. 23 Wednesday, Jan. 24 Thursday, Jan. 25 Friday, Jan. 26 Earnings will likely take center stage this week with several widely held companies set to deliver updates on their performance. One of them is Tesla (TSLA), which reports on Wednesday and has seen its share price decline about 15% so far this year after cutting prices on some models in Europe and China. Investors will be looking to see if the escalating price wars impact the electric vehicle (EV) maker’s bottom line after it reported weaker-than-expected revenue and profit last quarter. On Tuesday, earnings from Netflix (NFLX) could show if its ad-supported subscription tier helped boost growth after subscriptions rose last quarter. When Intel (INTC) reports on Thursday, investors will be looking for an update on the chipmaker’s progress capitalizing on surging interest in artificial intelligence (AI), as well as its foundry business and demand for PCs. Earnings reports from Visa (V) on Thursday and American Express (AXP) on Friday could offer insights into the health of consumer credit markets, while reports from AT&T (T), Verizon Communications (VZ) and T-Mobile(TMUS) will highlight telecommunications earnings. Other companies set to report include IBM (IBM), Johnson & Johnson (JNJ), Procter & Gamble (PG), Comcast Corp (CMCSA), United Airlines (UAL), General Electric (GE), and 3M (MMM). The latest updates on the economy and inflation will come with Thursday's estimate of U.S. gross domestic product (GDP) growth for the fourth quarter and Friday’s report on the Personal Consumption Expenditures (PCE) Price Index for December. December’s jobs report showed employers added more positions than expected as wages rose, while retail sales continued to increase at a robust pace, adding to some worries that rate hikes by the Fed may not have curbed inflation enough for the Fed to start cutting rates soon. The most recent measurement of the Consumer Price Index (CPI) showed inflation ticked higher in December after easing over the past several months. Friday’s PCE release comes after the Federal Reserve’s preferred measure of inflation fell to an annual rate of 2.6% in November, its lowest since early 2021. Correction—Jan. 22, 2024: This article was updated to correct the earnings date for United Airlines. "
}