{
    "title": "Will Tesla's Profits Keep Falling in 2024?",
    "date": "1/22/2024",
    "url": "https://www.fool.com/investing/2024/01/22/will-teslas-profits-keep-falling-in-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Tesla (TSLA -2.25%) was a big winner last year as the stock doubled as part of the broader boom in artificial intelligence (AI) stocks. In 2024, however, Tesla stock has gotten off on the wrong foot. The stock is down 15% on various negative news items, including price cuts in Europe and China; a decision by Hertz to sell 20,000 electric vehicles, primarily Teslas, in a reversal of an earlier strategy to embrace EVs; and recent antics from CEO Elon Musk calling for 25% voting power and threatening to build products outside of Tesla. Despite Tesla's surge last year, the company's financial performance didn't warrant much of a gain in the stock. Revenue growth slowed over the course of the year, coming in at 9% in the third quarter, or just 5% automotive sales growth. Meanwhile, profits have also taken a dive due to price cuts and increasing competition in the industry. Net income fell nearly 50% from $3.33 billion in the third quarter of 2022 to $1.88 billion in the third quarter of 2023. Musk also spent much of the last earnings call bemoaning the impact of higher interest rates and production challenges related to the new Cybertruck and a slower ramp in factory production in Mexico as it awaits clear signs of an economic rebound. Meanwhile, the company is also losing the benefit of some EV tax credits in the U.S. With Tesla already slashing prices twice this year and expectations now muted for interest rates to fall soon, the company's return to profit growth seems in doubt. The average Wall Street analyst expects its profit to increase from $3.15, which it has not yet reported, to $3.74, or an increase of 19%. That essentially matches the revenue growth forecast at 20%. Image source: Tesla. According to some Tesla bulls, like Ark Invest's Cathie Wood, the company's price cuts are a sign of strength as they will help it gain market share and block out rivals that can't compete at lower price points. However, the price cuts, in the 10% range, have the immediate impact of weighing on Tesla's already narrowing automotive gross margins, which came in at 18.7% in the third quarter. The chart below shows the company's production cost per vehicle over each quarter over the past year. Source: Tesla. As you can see, Tesla was able to lower its cost of goods sold per vehicle by $2,000 over the last four quarters, and the company could do that again, though the introduction of the Cybertruck is likely to push that higher. In addition to the potential savings in production costs, Tesla is expected to ramp up production again next year, as indicated by the 20% revenue growth estimate. Tesla has yet to give a production forecast for 2024, but the price cuts coming on the heels of last year's reductions imply that its price per vehicle sold will almost certainly fall again. If it can continue to bring down costs, Tesla may be able to eke out some profit growth this year, especially as its energy and services segments are growing. However, the business looks poised to face another challenging year. International rivals, like Hyundai and BYD, are becoming more competitive; interest rates remain elevated; and there are broader signs of weakening demand in the electric vehicle industry. We'll learn more when the company reports fourth-quarter earnings next week, but investors should be prepared for the stock to drift lower unless a new growth catalyst, like full self-driving, emerges. The stock is pricey, and its financials alone don't seem to justify its valuation. Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends BYD and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}