{
    "title": "3 Doomed Nasdaq Stocks to Dump Before They Dive: February 2024",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/news/3-doomed-nasdaq-stocks-dump-195019776.html",
    "text": "The market continues to make new all-time highs, but the gains remain lopsided. Some stocks, such as Meta Platforms (NASDAQ:META) are soaring. Yet others, like Moderna (NASDAQ:MRNA), continue to sink. The reality is that mega-cap technology stocks are driving the market at the expense of small-cap stocks and just about every sector of the economy. Fourth-quarter 2023 earnings season hasn’t helped level the playing field. Several well-known companies are seeing their share prices dive after delivering disappointing financial results and offering weak guidance for the year ahead. As is often the case, analysts and investors are not forgiving of poor earnings and outlooks from companies. It’s not unusual for a stock to drop 10% or more immediately after a dismal earnings print. So, many companies are grappling with problems that seem insurmountable, making their stocks ones to avoid. Therefore, consider dumping these three doomed Nasdaq stocks before they tank further. InvestorPlace - Stock Market News, Stock Advice & Trading Tips Source: Roschetzky Photography / Shutterstock.com Some recent phrases to describe Tesla’s (NASDAQ:TSLA) recent Q4 2023 financial results include “train wreck” and “disaster.” And those were the nice reviews. TSLA has already dived, falling 24% since the start of the year. This occurred amid growing signs that the company’s sales are slowing worldwide. Further, the slowdown might be irreversible. During their Q4 earnings call, Tesla executives said that they expect electric vehicle volume growth this year to be “notably lower.” The big problem is that Tesla has already done just about everything it can to try and fix its problem of slumping sales. That includes slashing prices at the expense of profit margins and introducing new vehicles such as the heavily hyped Cybertruck. Now, the company is teasing a new, lower priced EV. But it remains to be seen if that will help Tesla in the face of growing competition. Plus, the company continues to grapple with recalls, lawsuits, and its mercurial CEO Elon Musk. It’s time to sell TSLA stock. Source: Grand Warszawski / Shutterstock.com It could have been worse. That’s the best thing that can be said about the latest earnings from Starbucks (NASDAQ:SBUX). The company missed Wall Street forecasts across the board as both its domestic and international sales declined. However, SBUX staged a momentary relief rally because analysts and investors had been expecting a much worse result from the Seattle-based coffee roaster. Over the past 12 months, SBUX stock fell 12%, remaining flat this year after the brief earnings rally. The issues at Starbucks are two-fold. The company is facing a boycott in its U.S. market over perceptions that the company supports Palestinians in the current war between Israel and Hamas. At the same time, Starbucks overseas sales are in decline, notably in China, which is going through an economic downturn. Also, their consumers have cut back their spending on lattes and cappuccinos. International same-store sales grew 7% in Q4, about half of the 13%. Additionally, Starbucks continues to wrestle with unionization efforts by its workers in the U.S.. And, it’s adjusting to new CEO Laxman Narasimhan, making this a doomed Nasdaq stock to dump before it dives further. Source: Sundry Photography / Shutterstock.com Things keep going from bad to worse at Peloton Interactive (NASDAQ:PTON). The maker of internet-connected treadmills and stationary bikes just guided for a loss in the current first quarter of as much as $30 million. Wall Street had a $2 million loss penciled in for the company. So much for the turnaround strategy. Shares of Peloton have been among the worst performers in the Nasdaq index. They dropped 73% in the last 12 months and now trading as a penny stock. Peloton has never recovered from the end of the Covid-19 pandemic. Its sales and stock soared during lockdowns when people were forced to exercise from home. But sales and the share price have steadily fallen as people returned to their local gym and fitness center to workout. Barry McCarthy, who previously worked at Netflix (NASDAQ:NFLX) was brought in as Peloton’s new CEO. He pivoted to focus on monthly subscriptions rather than treadmill and stationary bike sales. However, in its just released Q4 2023 results, the management team said that they are struggling to grow their paid app subscribers and see an uncertain road ahead. PTON stock is definitely doomed and a security to sell before it dives more than it already has in the past year. On the date of publication, Joel Baglole did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The post 3 Doomed Nasdaq Stocks to Dump Before They Dive: February 2024 appeared first on InvestorPlace. Related Quotes "
}