{
    "title": "Tesla ordered 4,000 pies before cancelling, Musk forced to take care of bill",
    "date": "2/29/2024",
    "url": "https://www.wionews.com/trending/tesla-ordered-4000-pies-before-cancelling-musk-forced-to-take-care-of-bill-694402",
    "text": "The bakery in San Jose, California got a last-minute order of 2000 pies from the company on Valentine's Day. This meant a business of USD 6000 for the small bakery. As per reports, Tesla doubled the initial order to 4000 pies, and later cancelled the whole order Elon Musk, CEO of electric carmaker Tesla, had to step-in after the company ordered 4000 pies from a small bakery and then cancelled it. Giving Pies, the bakery in California, has now said that the outstanding bill is paid, said reports in media. The Guardian reported that Voahangy Rasetarinera, the African-American owner of the bakery, told the news outlet that Tesla has paid, \"...the $2k that I was out of\". The bakery in San Jose, California got a last-minute order of 2000 pies from the company on Valentine's Day. This meant a business of USD 6000 for the small bakery. As per reports, Tesla doubled the initial order to 4000 pies, and later cancelled the whole order. Giving Pies owner Rasetarinera took to social media to say that to cater to Tesla, her bakery had to overlook other Black History Month catering inquiries before getting ready for the mammoth order. The bakery then had to purchase large amount of supplies in advance and the owner had to prepare the workforce “demanding production schedule”. Sudden cancellation of the order made all these efforts, and money, go to waste. Also Read | ‘No kitchen, no bathroom,’ video of ‘tiniest apartment of New York’ leaves internet fuming, watch “To me, it was clear that Tesla’s corporate culture prioritized convenience over accountability, disregarding the livelihoods of small business owners like myself,” said Rasetarinera. “This experience serves as a stark reminder of the vulnerability faced by small businesses when dealing with larger corporations. Despite our best efforts to uphold our commitments and provide quality service, we are often left at the mercy of decisions made in corporate boardrooms.” Watch | International Polar Bear Day: Scientists to study cubs tucked up in their dens The incident got traction online and was covered widely in the media. The bakery saw support in-person and online from across the world. The increasing coverage made Musk take notice. \"Just hearing about this. Will make things good with the bakery. People should always be able to count on Tesla trying its best,\" he posted on X on Saturday (February 24). Just hearing about this. Will make things good with the bakery.\n\r\nPeople should always be able to count on Tesla trying its best. “As I reflect on this ordeal, I am reminded of the resilience and determination that have propelled me forward as a black woman entrepreneur,” she said. “While Tesla’s actions may have caused temporary setbacks, they will not deter me from pursuing my passion and serving my community with integrity and pride.” Rasetarinera was quoted by The Guardian. (With inputs from agencies) "
}