{
    "title": "Out of Control! What the Elon Musk Compensation Case Reminds Us about \nTransactions with Controlling Stockholders",
    "date": "2/9/2024",
    "url": "https://www.jdsupra.com/legalnews/out-of-control-what-the-elon-musk-2315638/",
    "text": "Process still matters.  That’s the main takeaway from the Delaware Court of Chancery’s 200-page opinion striking down Tesla’s 2018 incentive package awarded to Elon Musk.  The court rescinded the incentive package mainly because Musk was found to control Tesla and the process, the directors authorizing the package were not independent and the stockholder vote approving it was not properly informed.  The ruling is a stark reminder of the importance of both director independence and an informed stockholder vote when transacting with a control stockholder. The 2018 Stock Option Grant In 2018, the Tesla board approved a new stock option package for Elon Musk and then submitted the proposal for stockholder approval. At a special meeting of stockholders, 81% of the shares voted in favor (or 73% without counting Musk’s and his brother’s shares). If exercised in full, the option package would have allowed Musk to purchase a number of shares constituting 12% of Tesla’s outstanding stock, subject to both milestone and leadership-based vesting.  The options vested in 12 tranches, with each tranche vesting on Tesla achieving one capitalization milestone and one operational milestone, and only if Musk continued serving as either CEO or both executive chairman and chief product officer at each vesting juncture.  In the most optimistic case, if Tesla’s capitalization grew from $59 billion at the time of the grant in 2018 to $650 billion by 2028 (the option expiration), all the options would vest and be worth approximately $56 billion.  As things turned out, Tesla’s market cap did hit $650 billion by the end of 2020 and all the options vested in full. Was Musk a Controlling Stockholder? Normally, corporate boards may compensate their executives however lavishly as they wish because Delaware courts will show tremendous deference to board decisions under the business judgment rule and not second guess them.  The exception to the general rule is when the compensation is being paid to a controlling stockholder, in which case the compensation or transaction is evaluated under the stricter entire fairness standard which demands a fair price and fair process.  The threshold issue then is whether Elon Musk was a controlling stockholder at the time of the 2018 grant. Control can be established either through mathematical voting control or effective operational control.  On the surface, Musk’s 22% ownership stake at the time of the 2018 grant did not constitute mathematical voting control.  But perhaps it did when combined with Tesla’s supermajority vote requirement for any amendment to its bylaws governing stockholder meetings, directors, indemnification rights and the supermajority vote requirement itself.  The court’s main focus, however, was on Musk’s “outsized influence” over Tesla’s business affairs in general and over the compensation package in particular. As to general control, the court found Musk exerted significant influence over Tesla’s board, and that as founder, CEO and chairman he “occupied the most powerful trifecta of roles”. Musk also frequently exercised managerial authority over all aspects of Tesla, in many cases ignoring the Board’s authority such as when he appointed himself Tesla’s “Technoking”, disclosed in a Form 8-K, without consulting the Board.  The Court was also swayed by Musk’s “Superstar CEO” status, which it said resulted in shifting the balance of power toward himself and away from the board, which was supposed to exercise authority over him. The court also found Musk exerted transaction-specific control.  He almost unilaterally controlled the timing of the grant. There was no negotiation between Musk and the Board over the size of the grant, and no meaningful negotiation over the other terms.  Neither the compensation committee nor the board engaged in any benchmarking analysis.  Directors testified at the trial that they viewed the process as “cooperation”, not a negotiation. Musk’s controlling stockholder status meant that the applicable standard of review would be the entire fairness standard.  As a procedural matter, the defendants have the burden of proving fair price and fair process.  But defendants (in this case, Musk, the other directors and Tesla) can shift the burden to the plaintiff if the transaction was approved by either a well-functioning committee of independent directors, or an informed vote of the majority of the minority stockholders.  As a practical matter, burden of proof in these cases is determinative; the party with the burden almost always loses. Lack of Director Independence; Uninformed Vote The defendants failed to shift the burden.  First, a majority of the eight directors (including Elon Musk and his brother Kimbal) were not independent.  They invested in Musk’s other companies and he in theirs, and they often vacationed together.  Second, although the compensation package was ostensibly approved by a majority of the minority stockholders, the court found the stockholder vote was not fully informed.  The proxy statement relating to the vote to approve the grant failed to disclose the directors’ potential conflicts (instead referring to the directors as independent), omitted material information regarding the process of the 2018 grant and did not describe Musk’s control over the entire process and timeline. The opinion mostly focused on one particular omission in the proxy statement: the initial discussion of Musk’s award, which took place in a phone conversation between the compensation committee chair and Musk, during which Musk proposed the key terms of the grant. Notably, this conversation was included in at least four earlier drafts of the proxy statement, but the final draft instead stated that discussions first took place among the members of the compensation committee.  The court determined that the initial phone conversation between the compensation committee chair and Musk was material because it set the terms of discussion for the grant, and its omission from the proxy statement was a material deficiency. Having failed to shift the burden of proof, the defendants needed to prove the fairness of both the terms of the grant and the process that produced it. No Fair Dealing or Fair Price The court found the defendants failed to prove either fair dealing or fair price. As to fair dealing, courts typically look to the initiation and timing of the deal, how the deal was structured and negotiated and how the deal was approved.  Here, Musk proposed the terms and controlled the timing by setting aggressive approval timelines and then delaying or stopping the process when it suited his needs.  There were no arms-length negotiations; instead, the process was collaborative and there was no evidence that any changes in stock option terms resulted from negotiations or a desire of the board to make the milestones harder to achieve.  As to director independence, the court had already determined that five of the six directors who approved the grant were beholden to Musk. And although Tesla voluntarily conditioned the award on a majority-of-the-minority stockholder vote, the vote was not fully informed. As to whether the price was fair, the court noted that the incentive compensation package was “the largest potential compensation opportunity ever observed in public markets by multiple orders of magnitude.” Nevertheless, the defendants’ first defense was that Tesla “got” significantly more than it “gave”, and that Tesla’s stockholders risked nothing and gave “6% for $600 billion”.  The court’s response was that despite the stated goal of keeping Musk fully engaged, there was no requirement that he devote substantial time to Tesla’s operations and no indication that he would depart Tesla absent a new grant.  After all, the court reasoned, he already had a significant equity stake prior to the 2018 grant, which would provide sufficient motivation.  Personally, I think the court here overlooked the fact that Elon Musk was managing and was a significant stockholder in several other companies at the time of the grant, and it was reasonable for the directors to conclude that he needed to be appropriately incentivized to devote enough of his energies to Tesla.  The defendants also argued that the stockholder vote demonstrated that the price was fair, but the court’s response was that a stockholder vote is only compelling evidence of fairness when the vote is fully informed. Takeaways for Companies and their Boards The Delaware Court of Chancery’s decision to strike down Elon Musk’s 2018 incentive package with Tesla serves as a reminder of the importance of process, director independence and informed stockholder votes in transactions with a controlling stockholder. The court found Musk exerted significant influence over Tesla’s board and the compensation package, leading to a lack of independent decision-making and a misinformed stockholder vote. The ruling highlights the need for companies to ensure procedural safeguards are in place when making grants to executives with large shareholdings and deep relationships with the board. Elon Musk reacted to the ruling by announcing that Tesla would ask its stockholders to vote on whether to reincorporate from Delaware to Texas.  He should hope they vote no.  The reason Tesla – and two-thirds of S&P 500 companies and what seems like 99.9% of all venture backed startups – are organized in Delaware is that Delaware ensures predictability.  It does that through a well-developed and detailed corporate statute and a specialized Court of Chancery with experienced judges (no juries) who hear and decide corporate law disputes and have produced enormous volumes of precedent in the form of judicial opinions.  If you’re a Delaware corporation, you have relative certainty when engaging in business transactions.  The ground rules are relatively clear: Delaware courts will generally defer to directors under the business judgment rule, unless the transaction is with a controlling stockholder in which case you’ll need to simulate an arms’ length process with independent directors and disinterested stockholders who are given material information so they can make informed decisions.  I imagine that Texas also has statutory or case law limitations on transactions with controlling persons to protect minority shareholders, but you don’t have the predictability that you have in Delaware and you don’t know how a jury will decide.  They say everything is bigger in Texas, including jury awards. [View source.] See more » DISCLAIMER: Because of the generality of this update, the information provided herein may not be applicable in all situations and should not be acted upon without specific legal advice based on particular situations. © Farrell Fritz, P.C.  |  Attorney Advertising Refine your interests » Back to Top Explore 2024 Readers' Choice Awards Copyright ©  JD Supra, LLC "
}