{
    "title": "Tesla's Bitcoin Blunder: Here's How Much EV Giant Could Have Made If It \nListened To Michael Saylor's 'One",
    "date": "2/27/2024",
    "url": "https://www.benzinga.com/markets/cryptocurrency/24/02/37341152/teslas-bitcoin-blunder-heres-how-much-ev-giant-could-have-made-if-it-listened-to-michael-s",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Electric vehicle giant Tesla Inc TSLA was one of the largest companies to add Bitcoin BTC/USD to its balance sheet with a $1.5 billion addition disclosed in February 2021. While Tesla profited from selling portions of its Bitcoin holdings previously, the company could have made even more if it had listened to Bitcoin bull Michael Saylor. What Happened: Tesla disclosed the purchase of $1.5 billion worth of Bitcoin in February 2021, a purchase that happened in January 2021. Tesla later announced that it had sold portions of its Bitcoin in multiple transactions, capitalizing on gains from the apex digital currency. Tesla sold $272 million worth of its Bitcoin in the first quarter of 2021 and later announced in July 2022 that it converted 75% of its Bitcoin into fiat, helping bring $936 million in cash to its balance sheet. The two sales combined represent a potential profit of $1.208 billion for Tesla from its original $1.5 billion purchase. Tesla ended the most recent fourth quarter with $184 million in digital assets, which could consist of Bitcoin and Dogecoin DOGE/USD, which it accepts as a payment option for select merchandise. While Tesla may end up making a profit overall on its $1.5 billion Bitcoin purchase, the company could have made even more if CEO Elon Musk had taken advice shared by Saylor, the executive chairman of MicroStrategy. \"If you want to do your shareholders a $100 billion favor, convert the $TSLA balance sheet from USD to #BTC. Other firms on the S&P 500 would follow your lead & in time it would grow to become a $1 trillion favor,\" Saylor replied to Musk on X, formerly known as Twitter. Musk replied asking if \"such large transactions\" was even possible. Saylor answered that he had purchased $1.3 billion over the past months and would be happy to share his playbook with Musk. \"From one scientist to another,\" Saylor said. Economist Peter Schiff, who is a noted Bitcoin bear, joined the conversation and warned Musk not to \"fall for this con.\" \"Michael, like all involved in the Bitcoin pyramid scheme, must recruit new buyers into the scheme to keep it going,\" Schiff tweeted. Related Link: EXCLUSIVE: Why Does Cathie Wood Think Bitcoin Is Going To $1 Million — What Does She Know That We Don’t? Why It's Important: Bitcoin traded between $23,147.71 and $24,209.66 on the day of Saylor's reply to Musk. Tesla ended the third quarter of 2020 with $14.5 billion in cash, adding $5.9 billion in the quarter that it reported in October 2020. Tesla ended the fourth quarter of 2020 with $19.4 billion in cash, which it reported in January 2021. Based on the $14.5 billion cash on hand that Tesla had at the end of the third quarter, the company could have bought 598,934.4749 BTC. This amount may not have been able to have been purchased in one chunk or at all given its large size and percent of the total capped supply of 21 million. The hypothetical purchase of 598,934.4749 Bitcoin would be worth $34,025,293,828.10 today based on a price of $56,809.71 for Bitcoin at the time of writing. This means Tesla could have made nearly a $20 billion profit if Musk had listened to Saylor's original pitch to add Bitcoin to the balance sheet of Tesla. Saylor remains one of the biggest Bitcoin bulls and told Benzinga previously that \"acquiring high-quality property with free cash flow is generally a really good investment strategy.\" \"We have a simple strategy and our strategy is we just acquire Bitcoin, and we hold the Bitcoin,\" Saylor told Benzinga. MicroStrategy remains one of the largest owners of Bitcoin, recently adding 3,000 BTC between Feb. 15 and Feb. 25 totaling $155 million. The software company owns 193,000 Bitcoin with an average price point of $31,544. Read Next: If You Invested $1,000 In Bitcoin When Tesla Bought The Crypto, Here’s How Much You’d Have Now Image created using artificial intelligence with MidJourney. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}