{
    "title": "Tesla Stock Pops On Filing Showing Elon Musk Owns 20.5%: Here's What \nHappened - Tesla (NASDAQ:TSLA)",
    "date": "2/14/2024",
    "url": "https://www.benzinga.com/news/management/24/02/37143781/tesla-stock-pops-on-13g-filing-showing-elon-musk-owns-20-5-heres-what-happened",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Leading electric vehicle company Tesla Inc TSLA saw shares pop slightly after-hours Wednesday after a 13G was filing related to CEO Elon Musk's ownership. The news comes after a recent ruling concerning Musk's ownership in the company by a Delaware judge. What Happened: On Wednesday, Tesla filed a 13G that shows 20.5% ownership by Musk, which comes after previous filings showed the CEO with a 13% stake in the company. The filing said Musk owns 715,022,706 shares, which consists of 411,062076 shares of common stock and options to purchase 303,960,630 shares. The ownership stake is as of Dec. 31, 2023. The total 715,022,706 shares represents 20.5% of the company based on 3,184,519,865 shares outstanding, the filing reads. While shares traded higher off the news, it appears that Musk's ownership has not changed in the company. As of May 2023, Musk had ownership of 411,062,076 shares of Tesla stock representing 13% ownership and could own 20.6% based on his stock and options ownership. Several Tesla investors took to X, now known as Twitter, to share their thoughts on the filing. \"Elon's 13G filing that just came out just tells you how much $TSLA stock he owns. He owns ~12.9% of Tesla outright, with another 7.6% (304M shares) in unexercised stock options. This is all inf we knew. Nothing has changed,\" Tesla influencer Sawyer Merritt tweeted. Related Link: Tesla Q4 Earnings Highlights: Revenue Miss, EPS Miss, Model Y A Global Bestseller, Next-Gen Vehicle Update And More Why It's Important: Another X user pointed to the number of shares and options owned by Musk being dated as of Dec. 31, 2023, which was before a ruling from a Delaware judge to void a 2018 compensation plan. The judge ruled against Musk being paid stock options as part of the compensation plan, which are still accounted for in the latest 13G filing. Tesla and the board of directors can appeal the decision or submit a new compensation plan. The filing comes as Musk has voiced his displeasure with owning 13% of the company and wanting to be closer to 25% ownership to keep his artificial intelligence initiatives under the Tesla umbrella. TSLA Price Action: Tesla shares are up 1% to $191 in after-hours trading Wednesday, versus a 52-week trading range of $152.37 to $299.29. Read Next: Tesla Investors Pledge Support For Elon Musk, His 25% Ownership Goal: Shareholder Letter Calls For Tesla To Surpass Apple, Saudi Aramco’s $4.9-Trillion Combined Market Cap Image created using artificial intelligence on MidJourney. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}