{
    "title": "SAP Drops Tesla From Company Fleet Over Price Volatility",
    "date": "2/6/2024",
    "url": "https://driveteslacanada.ca/news/sap-drops-tesla-from-company-fleet-over-price-volatility/",
    "text": "SAP, Europe’s largest software company, will no longer include Tesla vehicles in its company car fleet. The decision to remove Tesla from their list of eligible company vehicles was mainly attributed to Tesla’s unpredictable delivery schedules and frequent price adjustments. According to a report by the German publication Handelsbatt, SAP’s fleet manager, Steffen Krautwasser, highlighted the difficulties in planning and the heightened financial risk posed by Tesla’s inconsistent pricing strategy, which diverges markedly from the more stable list prices of other manufacturers. (via  Reuters) This unpredictability, while understandable from Tesla’s perspective as it seeks to remain competitive and stimulate demand, presents a significant problem for SAP. The company, with a fleet of 29,000 vehicles, seeks predictability and stability in managing its assets. This move by SAP is part of a broader trend where companies, including major rental firms like Hertz and Sixt, are reconsidering their commitments to Tesla due to the automaker’s aggressive price cuts. These reductions, aimed at boosting sales, have inadvertently impacted the resale value of Tesla vehicles, thereby increasing the financial risks for fleet owners. Hertz, for example, has pointed to lower than expected demand for EVs and higher repair costs as additional challenges, leading to a strategic shift back towards internal combustion engine (ICE) vehicles to improve its financial outlook. Tesla’s frequent price adjustments have been a double-edged sword. While beneficial for new consumers, they have complicated fleet management and investment recovery for corporate clients. Tesla Cybertruck Could Appear in Germany this Spring Ford Promises More Adjustments to EV Certification Program to Ease Dealer Concerns Currently living in California, formerly from Ontario, I love all things tech, EVs, and Tesla. Contact me to share any tips or stories! Email: matt@driveteslacanada.ca Hoping to cash in on Elon Musk’s love for Texas, a local rancher is offering 100 acres of land if Musk picks up and moves Twitter’s headquarters from San Francisco to the Lone Star State. […] Zoom has officially announced it will soon be adding its video conferencing app to Tesla vehicles. The company announced the addition at its annual Zoomtopia 2022 Event on Tuesday. Earlier this year Tesla released a […] After disclosing its intention to raise $5 billion cash through a common stock offering on Tuesday, Tesla has announced it has completed the sale in just 24 hours. According to a Form 8-K filing with […] Enter your email address to subscribe to Drive Tesla and receive notifications of new articles by email. Email Address Subscribe "
}