{
    "title": "Cybertruck engineer addresses claims the Tesla EVs rust in rain",
    "date": "2/19/2024",
    "url": "https://www.businessinsider.com/cybertruck-engineer-addresses-claims-the-tesla-evs-rust-in-rain-2024-2",
    "text": "       A Cybertruck engineer, Wes Morrill, addressed claims that Tesla's electric pickup truck rusts in the rain and said the specks of rust were the size of a \"pinhead\" and not part of its stainless-steel body. Over the past week, some new Cybertruck owners have taken to social media to complain about what they say are spots of rust on their brand-new electric vehicles, which cost up to $99,900. One owner even said they'd been warned when the truck was delivered that it could rust in the rain. \"The advisor specifically mentioned the Cybertrucks develop orange rust marks in the rain and that required the vehicle to be buffed out,\" a member of the Cybertruck Owners Club forum wrote. In a post on X, Morrill said it wasn't the Cybertruck's metal itself that was rusting and gave some advice on how to address the orange spots, which were explained as apparent rusting from metal particles that may have collected from the factory or when the vehicles were transported via railway. The engineer — who has worked at Tesla for more than 13 years, according to his LinkedIn — referenced a YouTube video on the issue. \"Good myth busting. Stainless is reactive and free iron that sits on it will rust,\" the Cybertruck engineer said. \"It's surface contamination only and can be cleaned off easily.\" Tesla CEO Elon Musk also appeared to confirm Morrill's comments, writing \"Yeah\" in response to the post. Justin Demaree, the host of the YouTube channel Bearded Tesla Guy, said in his video on the issue that a Cybertruck owner had brought the truck to him the day after it was delivered when he'd noticed the specks. Related stories In his video, Demaree said the tiny orange specks were probably the result of \"rust dust\" or particles that had landed on the surface of the truck and embedded into the material. He said rust dust could come from the grating of metal on metal at a train track or even from areas in an automotive factory where vehicles go through their final polishing. The small specks of metal in the air could collect on the vehicle and rust over time, he said. The issue doesn't appear to be entirely unique to the Cybertruck. Demaree told Business Insider he'd seen the issue before but said the Cybertruck seemed to be even more prone to collecting the dust, probably due to its stainless-steel exterior. \"When I finally had a chance to see the issue first hand, I recognized what I was looking at right away,\" Demaree wrote over email. \"Sometimes when new cars would arrive at a dealership, especially white ones, it would look like the car was 'rusting.' It doesn't just wipe away, it has to be buffed off. That's when I first learned about 'rust dust' or 'rail dust.'\" For the most part, automakers have avoided using stainless steel. The Cybertruck is the first production vehicle to be made out of stainless steel since the Delorean was produced in 1983. The metal can be difficult to shape and prone to smudging. The YouTuber tried a handful of methods to address the issue, including wiping the car with Windex and a liquid form of Bar Keepers Friend. Demaree said the latter method appeared to do the trick but advised Cybertruck owners to be careful using the polish on the truck. \"Every time you do this, you're basically cutting it down to a fresh layer,\" the YouTuber said. Morrill recommended using either Bar Keepers Friend or Citrisurf 77 to address the issue. \"Clean it anytime or don't if it doesn't bother you,\" Morrill wrote on X. \"It's not the base metal. The specs are about the size of the pin of a pinhead.\" Morrill and a spokesperson for Tesla didn't immediately respond to a request for comment. It's no wonder some Tesla owners are taking note of the specks. The much-hyped electric pickup comes with a price tag from $60,990 to $99,990. And millions of Tesla fans have been waiting for the truck since 2019. It's unclear how many Cybertrucks have been delivered. Tesla delivered its first dozen on November 30, and several celebrities have been spotted with their own Cybertrucks in the months since. Do you own a Cybertruck or work for Tesla? Reach out to the reporter from a non-work email and device at gkay@businessinsider.com Correction: February 20, 2024 — An earlier version of this story included a photo caption that misstated when Cybertruck deliveries began. They started in November, not January. Read next Jump to "
}