{
    "title": "Musk's Tesla enters the mainstream as it embraces Biden's EV charger money",
    "date": "2/20/2024",
    "url": "https://www.eenews.net/articles/tesla-masters-a-new-realm-federal-ev-infrastructure-dollars/",
    "text": "Celebrate 25 years of reporting on the ever-evolving world of energy and the environment. Join us\n\n\n\n\n                                                7-DAY                                              \n                                            UNLIMITED ACCESS                                        \n\n\n\n                                                FREE TRIAL 7-DAY                                              \n                                            UNLIMITED ACCESS By David Ferris |  02/20/2024 06:32 AM EST An analysis of public records shows Tesla has won the highest percentage of electric vehicle charging awards of any company from the president’s infrastructure law. Electric vehicles charge at a Tesla station in Emeryville, California. Godofredo A. Vásquez/AP Elon Musk is a constant critic of President Joe Biden — but his car company is the biggest winner from Biden’s effort to expand the nation’s supply of electric vehicle chargers. Tesla is installing more charging plazas than any other company funded by Biden’s 2021 bipartisan infrastructure law, according to an exclusive analysis of public records for POLITICO’s E&E News by the data consulting firm EVAdoption. Tesla has won almost 13 percent of all EV charging awards from the law, earning it a total of more than $17 million in infrastructure grants. This comes on the heels of other wins for Tesla, which makes more electric vehicles and operates more charging stations than anyone in the United States, and is cementing its charging technology as the nation’s de facto standard. And it comes despite repeated friction between Musk and Biden: The Tesla CEO has mocked the president as “a damp sock puppet in human form” who “is treating the American public like fools,” while the White House has condemned Musk for actions such as endorsing an antisemitic post on his social media network X. The government funding will effectively embed Tesla’s distinctively shaped red-and-white chargers into the experience of not just Tesla drivers, but of all EV users on America’s highways. It is a win for Tesla, but also a form of capitulation: By agreeing to build federally funded stations, the iconoclastic company is also agreeing to play by the same rules as everyone else. lead image People who study federal electric vehicle policy say they see few downsides to having Tesla, with the country’s largest and most reliable network of charging stations, take a leading role in creating a government-supported network. “It should lead to a generally larger and more robust network of stations,” said Aaron Kressig, manager of the transportation electrification program at Western Resource Advocates, an environmental policy nonprofit based in Boulder, Colorado. And Musk’s behavior, erratic as it is, doesn’t dent the EV community’s opinion. “Tesla is a company full of very smart engineers and other professionals who have accelerated the transition to electric vehicles,” said Nick Nigro, the founder of Atlas Public Policy, an EV analysis shop based in Washington. “While their CEO gets disproportionate attention because of his antics, he does not define the company, and the company does not need his input to succeed.” Meanwhile, Tesla’s nearly-13-percent share of the monetary awards appears far too low to raise antitrust concerns. The federal funds are being channeled to state departments of transportation, which after long delays are now making specific awards. It is within these pots of money that Tesla is winning the race. The federal EV-charging program supported by the infrastructure law is known as the National Electric Vehicle Infrastructure program, or NEVI. Tesla is taking a different tack than other firms seeking the federal infrastructure money. First, it is proposing stations that are bigger than what other companies are building. Meanwhile, it is building those stations at sharply lower costs. According to EVAdoption’s data, Tesla has won $17 million to build a total of 41 charging stations. The next-biggest winner of grants, Oklahoma-based Francis Energy, was awarded much more money — almost $30.4 million — to build just 37 stations. At the same time, Tesla is putting fewer of its resources on the line in its efforts to win federal dollars. Many states have tried to entice charging companies to pay for a higher percentage of the cost of building each station than the federal government requires. More than other firms, Tesla has refused to do so, meaning states have to pick up more of the tab. lead image Biden promised in his 2020 campaign to catalyze the building of half-a-million charging stations by 2030. The bipartisan infrastructure law set aside $7.5 billion over five years to build a charging network. The first priority under the infrastructure law is to build a network of charging stations at 50-mile intervals along major highways. That is where Tesla’s stations will be built. The company won bids in seven of the 15 states that have announced which private companies are receiving funds. Tesla scored federal dollars in Alaska, Colorado, Maine, New Mexico, Pennsylvania, Texas and Tennessee, but none in Georgia, Hawaii, Kansas, Kentucky, Michigan, Ohio, Vermont or Utah, according to the EVAdoption data. Other states, including California, haven’t announced their winners yet. Tesla, which has no public relations department, did not respond to a request for comment for this story. Musk has been silent on the role of federal aid in building his company’s Supercharger stations. On an earnings call in 2021, he said the company’s goal “is not to create a walled garden and use that to bludgeon our competitors.” Tesla’s federal funding surge caps a rapid role reversal for the company in the young world of EV charging. A year ago, Tesla’s charging network stood entirely apart from competitors. Its Supercharger stations were an exclusive perk for Tesla drivers, and were for the most part incompatible with other makes of EVs. The company’s network is vast, accounting for more than half of all public fast chargers in the U.S., according to a Department of Energy database. The Biden administration, too, kept its distance from Tesla, with the president and his surrogates rarely mentioning the company in his first two years in office — a slight related to contrasting views of labor unions. Biden is a famously pro-labor president, and Musk opposes efforts by labor unions to organize workers at Tesla factories. Then, last February, Tesla agreed to open several thousand of its chargers to non-Tesla drivers — a deal with the White House that opened the door to the company getting federal funds. That same month, Tesla opened its first station designed to charge a non-Tesla vehicle. In the spring came an even more significant development: Ford Motor said it would build Tesla’s charging technology into its vehicles by 2025. Automaker after automaker followed suit. This month, one of the last holdouts, Stellantis, said it would also adopt the Tesla plug. The company is the maker of the Jeep, Dodge and Ram brands. Companies rushed to the Tesla standard because charging stations using the main competing standard, the Combined Charging System, or CCS, have proven to be buggy. That lack of reliability has started to undermine EV sales. The widespread adoption of Tesla’s standards could have two material impacts for EV drivers: It would make it easier for drivers of future EVs from all brands to use Tesla’s existing Supercharger stations. And Tesla’s plug would start to appear everywhere. As automakers have adopted the Tesla standard, other, non-Tesla charging networks have followed suit. The industry shift toward Tesla technology left government agencies in a difficult position. Federal EV-charging investments are overseen by the Federal Highway Administration, an office of the U.S. Department of Transportation. In 2022, the FHWA had designed regulations under the law so that only CCS chargers could receive federal money. In December, the highway office bowed to a new reality. It said a charging station using Tesla’s technology could get federal funds — as long as it also included a CCS plug. The Joint Office of Energy and Transportation, a new agency stood up by the bipartisan infrastructure law, applauded the technical adoption of Tesla’s standard, and FHWA started the process of updating federal regulations to include it. Tesla’s system goes by several names. The industry has adopted Tesla’s name for it: the North American Charging Standard. Meanwhile, SAE International, a body that sets technical standards for a wide variety of products, has given it a different designation: J3400. As the FHWA started embracing the Tesla system, the White House began delivering a similar message. At a briefing in December, Heather Boushey, a member of Biden’s Council of Economic Advisers, said Tesla’s standard is “providing flexibility” for the federal program and “is rapidly increasing in popularity.” Meanwhile, the White House has gone from ignoring Tesla entirely to occasionally mentioning it, though Biden continues to object to Musk’s animus toward labor unions. In late January 2023, Musk met with Mitch Landrieu, then the administration’s infrastructure czar, and John Podesta, the president’s chief clean energy adviser. Afterward, a reporter asked White House press secretary Karine Jean-Pierre if this suggested a rapprochement between the administration and the company. “The outreach and the meeting says a lot of how important the president thinks the bipartisan infrastructure legislation is and how the Inflation Reduction Act is,” Jean-Pierre said, referring both to the infrastructure law and Biden’s climate law. “Senior members of his team had a meeting with Elon Musk today to do just that.” Even as it gets millions in federal EV-charging support, Tesla is giving something up. The dollars are attached to specific requirements, such as submitting data about charging sessions to the Department of Energy. And like it or not, Tesla will have to follow the rules. “To a large extent, this is a new endeavor for them, going for public funding,” said Nigro, of Atlas Public Policy. It’s not that Tesla is a stranger to federal aid. In 2010, it got a crucial $452 million loan that helped it buy and build its first factory. Last year, the company got research and development and federal renewable energy tax credits to the tune of more than $1.6 billion. People who buy the company’s cars also have for years gotten federal EV tax breaks. Its energy storage systems and solar panels get tax aid that “allow us to lower our costs and encourage customers to buy our products and investors to invest in our solar financing funds,” Tesla said in a recent financial filing. But until now, Tesla’s charging stations have not received lots of federal funding. The dollars come with requirements that can run contrary to Tesla’s wishes. For example, new rules demand that charging stations accept payment via a credit card reader — a rule that Tesla has resisted whenever it has been proposed because it prefers to run payments through its own smartphone app. “That is an adjustment for them in how they approach things,” Nigro said. A major goal of the EV charging funding in the infrastructure law was to impose this sameness. Many of the reliability problems for EV charging occur because the U.S. doesn’t have a single charging network — it has an uncoordinated scrum of software, hardware, payment systems and network protocols that aren’t designed to work together. Tesla has advantages that would appeal to states that want an effective charging-infrastructure build-out, people studying the industry say. Loren McDonald, the founder of EVAdoption, pointed out that Tesla has deep experience in finding locations best supplied with electricity for charging, and working with utilities to get grid interconnections permitted and built. States may have more confidence in Tesla’s ability to build charging stations because it has done it so many times before. “They’re just a machine,” said McDonald about Tesla. “They have a massive team of suppliers and vendors. They can just get this done at the speed of light.” Because Tesla plans to build larger charging plazas than its competitors and make them at lower cost, it may save states money in some cases. Federal guidelines call for the highway plug plazas to have at least four stations. While sometimes Tesla has proposed the standard four, in many cases it has proposed eight, or even a dozen. Tesla’s senior charging policy manager, Francesca Wahl, laid out the reasons for the numbers in a letter to Colorado’s Department of Transportation. “Based on Tesla’s experience building out travel corridor charging infrastructure, we have found that a minimum of 8 to 12 DC fast chargers at a site is necessary,” she wrote. At the same time, Tesla is generally asking the federal government for less money per project. Tesla’s average funding per site — $414,554 — is dramatically lower than most other suitors for infrastructure law funds. For example, another major winner, Pilot Travel Centers, won NEVI funds at an average of $631,069 per site. Another, BP Pulse, the charging arm of oil major BP, asked for an average of $525,854 per site. The most expensive chargers are being built in Hawaii by Sustainability Partners, an infrastructure financing firm, and Aloha Charge, a Hawaii-based charging company, at an average price tag of $1.7 million — more than four times Tesla’s average costs. Behind Tesla in the fight for NEVI dollars are Francis Energy, which won over 11 percent of all federally funded stations, and Pilot, which nabbed almost 10 percent. Only one company, Kum and Go, a service station chain based in Des Moines, Iowa, pledged per-project costs lower than Tesla. Its three winning bids averaged $346,322. FHWA, which oversees the federal spending, had no comment on Tesla’s high share of funding wins, nor on its low project costs. “States must follow federal contracting requirements, as well as their own state procurement processes, in selecting charging providers,” said Angela Gates, an FHWA spokeswoman, in an email. “EV charger costs range significantly based on the level of work required, location, and more.” Tesla’s lower costs mean that states can build more charging stations for a smaller outlay of federal dollars. Conversely, the higher-cost stations mean that fewer of them will be built, since each state gets a prescribed amount of money per year through the infrastructure law. Yet Tesla is not biting at incentives offered by states that ask charging providers to chip in more money per project. Federal guidelines say that at minimum, a company must pay for 20 percent of the cost of an installation. However, the actual amount the company pays can vary because states can set their own rules on top of federal guidelines. Many states have taken advantage of this flexibility and created scoring systems that award additional points for behavior such as offering to pay more than 20 percent. More points makes it more likely the company will get funding. In most cases, Tesla is capping its contribution at 20 percent. “Other companies are doing a 30, 40, 50 percent match,” McDonald said. Tesla’s stations are cheaper to build because the company has achieved a larger economy of scale. Also, as one of the world’s richest car companies, it can rely on its own money, while other bidders must scrounge for capital. “Their cost structure is just so much lower than everybody else,” McDonald said. In essence, Tesla is in a better position to win federal funds for the same reasons it can make EVs cheaper than other, traditional automakers: It has been focused on the goal of a full EV ecosystem longer than anyone, and in doing so has built up a capacity no one in the U.S. can match. “It is much more set up for the future of charging compared to other companies, and those other companies are still needing to play catch-up to some extent,” Nigro said. “It’s going to put a strain on a lot of the other companies that are not as well capitalized. Maintaining equipment is expensive.” Request a FREE trial to receive unlimited access to  The transformation of the energy sector. Policy. Science. Business. Congress. Legislator. Politics. The leader in energy and environment news. Late-breaking news. © POLITICO, LLC "
}