{
    "title": null,
    "date": "2/3/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240203169/nullification-of-elon-musks-56-billion-pay-package-could-be-a-wakeup-call-for-corporate-boards",
    "text": "By Therese Poletti The ruling by the Delaware chancellor that essentially nullifies Elon Musk's $55.8 billion pay package could have broader implications on the rest of corporate America. Late Tuesday, Delaware Chancery Court Chancellor Kathaleen  McCormick voided the Tesla (TSLA) chief executive's pay package, siding with a shareholder plaintiff who had sued the electric-vehicle maker over Musk's compensation package from 2018, contending it was dictated by Musk and a \"product of sham negotiations.\" The suit alleged that Tesla's directors breached their fiduciary duty in awarding Musk his comp plan. In a strongly worded 201-page document, McCormick seemed to be aware she could be setting a precedent in Delaware, where a majority of U.S. corporations are incorporated, in terms of corporate governance. \"Delaware courts have been presented with this question thrice before, when more adroit judges found ways to avoid definitively resolving it,\" McCormick wrote. \"This decision dares to 'boldly go where no man has gone before,' or at least where no Delaware court has tread.\" The central issue in the case, forced by the plaintiff, she said, was whether Musk controls Tesla. And in this transaction, she wrote, he did. In addition to his 21.9% equity stake at the time, Musk, dubbed a \"Superstar CEO,\" \"enjoyed thick ties with the directors tasked with negotiating on behalf of Tesla, and dominated the process that led to board approval of his compensation plan.\" Musk's extensive ties and relationships with every board member on Tesla's compensation committee at the time were divulged during the trial, including with Tesla's former general counsel, Todd Maron. For example, Maron was also Musk's former divorce attorney, and McCormick wrote that Maron's \"admiration for Musk moved him to tears during his deposition. In fact, Maron was a primary go-between for Musk and the committee, and it is unclear on whose side Maron viewed himself.\" The issue of Musk's close ties to Tesla's board has come up before, notably in the 2016 lawsuit by investors over Tesla's acquisition of SolarCity, with allegations that he coerced Tesla board members to accept an overpriced buyout of the solar company run by his cousins. Last year, Delaware's Supreme Court ruled the deal was fair to shareholders and \"negotiations were conducted at arm's length.\" \"I think it's going to be an important case and other boards are going to have to pay attention,\" said Carl Tobias, a professor at the University of Richmond's School of Law. \"Other board members are going to be worried that if anything similar is happening in their companies and they haven't protected shareholders or the corporation from an overzealous CEO.\" It is not clear yet if Tesla will appeal the ruling to the Delaware Supreme Court. Musk tweeted on X after the ruling: \"Never incorporate your company in the state of Delaware.\" Stephen Diamond, an associate professor of law at Santa Clara University Law School, noted that the impact of the decision on Tesla's current board, though, would be limited, since the makeup of the board has changed. \"It will certainly make future negotiations over Musk's compensation at least appear more adversarial,\" he said in an email. \"The decision also expressly moves the needle in Delaware corporate law when it comes to CEOs - even where they do not own a majority of outstanding stock they may be deemed to control a firm, and that can lead to closer scrutiny of board behavior.\" It is not clear yet if or how the case could affect Musk's current attempt to get even more control - or as he has stated, \"influence\" - of Tesla, which he has talked about on X and in the company's conference call with analysts. Musk currently has just under 13% of the company's shares. Still, Tuesday's ruling was a rare check on Musk's power. -Therese Poletti This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 02-03-24 0654ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}