{
    "title": "Elon Musk may be done with Delaware, but don't expect other corporations to \nfollow his crusade",
    "date": "2/21/2024",
    "url": "https://ca.finance.yahoo.com/news/elon-musk-may-done-delaware-230643279.html",
    "text": "Elon Musk is moving SpaceX after a Delaware judge voided his $55 billion Tesla compensation package. Experts don't believe there will be a mass migration out of Delaware because of Musk's rhetoric. Musk's criticism of the judge and Delaware's legal system has been dismissed as unfounded. Elon Musk has had it with Delaware — but don't expect other corporations to flee the business-friendly state, too. Musk announced last week SpaceX was relocating from Delaware to Texas, along with this warning: \"If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible.\" The move came after a Delaware judge struck down Musk's $55 billion Tesla compensation package last month after a shareholder argued in a lawsuit the pay plan was excessive. Musk quickly took to X to blame the outcome of the case on the location of Tesla's incorporation, declaring: \"Never incorporate your company in the state of Delaware.\" But here's the thing — corporations love Delaware. In 2022, over 68% of Fortune 500 companies were incorporated in the state, while 79% of US IPOs were registered there. It's known as a low-tax and favorable home for businesses, with a history of case law that makes the legal landscape more predictable for corporations. \"There will be neither a stampede nor a trickle,\" Lawrence Cunningham, an expert on corporate governance and board member of Markel Group and Constellation Software, told Fortune of what to expect after Musk's warnings. \"There will always be frustrated and delighted customers in Delaware. All of this is both familiar and desirable.\" Musk also specifically went after the judge who ruled to void his pay package, Kathleen McCormick, calling her an \"activist and politician\" in an X post. It wasn't Musk's first brush up with Delaware or even McCormick, who also thwarted the billionaire in 2022 when he tried to back out of his $44 billion Twitter purchase. But like his complaints against the state, legal experts The Washington Post spoke with dismissed his criticisms of McCormick too, describing her as a tough but fair jurist who has won the respect of the corporate law. \"The reason Elon Musk frequently escapes account from other judges is because they don't see through his phantabulating,\" Lauren Pringle, editor of the Chancery Daily, which covers Delaware courts, told the outlet. \"They get wrapped up and star-struck. Not McCormick. She is clear-eyed as ever, and willing to take the slings and arrows that she knows will come with making a tough ruling.\" The legal experts also told the Post her ruling on the pay package was well-reasoned, in line with precedent, and unlikely to spook other business leaders. \"I don't expect a mass migration of firms from Delaware,\" Michal Barzuza, a professor at the University of Virginia who researches corporate law and governance, told the Post. \"Uncharted waters are not lawyers' favorite places to swim, generally speaking. No general counsel in their right mind is going to recommend that the company 'wing it' in a state with very little case law.\" John Coates, a law and economics professor at Harvard, told Fortune it wasn't even the first time there's been angry calls for businesses to leave the state. \"Over the past 100 years, Delaware has periodically irritated one or two executives by enforcing the law, and even led some prominent lawyers to call for companies to move elsewhere from time to time,\" Coates said. So, despite Musk's latest crusade against the state, it seems unlikely many other Delaware-based corporations will jump ship anytime soon. Read the original article on Business Insider Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. Trade 24 hours a day on the world's most popular platform. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia.  \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o  They soft-launched their relationship at the supermodel's cookbook event in Miami. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  The president mocked his campaign rival for doing the one thing he claimed he wouldn’t have time for. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" "
}