{
    "title": "Tesla driver shares how long he had to stop for battery charge on 1,000 \nmile trip",
    "date": "2/17/2024",
    "url": "https://www.ladbible.com/news/technology/tesla-driver-electric-car-charging-time-783581-20240217",
    "text": "To make sure you never miss out on your favourite NEW stories, we're happy to send you some reminders Click 'OK' then 'Allow' to enable notifications Advert Joe Harker A Tesla driver has wanted to debunk the idea that electric cars need to stop for a whole hour to be charged up. One day we might all be driving electric cars but for now there's a bit of a squabble going on over whether they provide enough range or not. There are more and more charging points popping up all over the place and how long you'll need to plug your car in for depends on whether you're just topping the thing up or going for a full recharge. Advert According to Tesla themselves you can get a charge that'll give your car up to 200 miles of range from just 15 minutes of plugging in, and one driver wanted to put that to the test. They took a trip from from Ohio to Florida and mapped out all the places they went to charge at along the way, totting up the total time they spent refilling their motor.  All in all he was stuck charging his car for a grand total of 126 minutes, or just over a couple of hours, and made a total of seven stops to replenish the juice in his battery. Advert Not everyone was convinced, as someone 'playing devil's advocate' said the Tesla driver spent over two hours charging their car for a trip of over 1,000 miles. They argued that there were hybrid cars which only really needed to stop every 500 miles, meaning that instead of seven stops they'd only have to pull over twice. While that might be the case, the electric car driver argued back that when accounting for stops to get food or use the toilet it all worked out pretty similar in time 'unless you have an iron bladder'. There were other arguments over the number of stops the driver took as some thought stopping seven times in a journey of over 1,000 miles was a bit excessive. Meanwhile, others pointed out that plenty of motorists took a break to get out of the driver's seat, stretch their legs, empty their bladder and potentially find something to eat more regularly. Advert As with any car you want to make sure it's got enough fuel to get where it's going, and if not, you'll need enough to reach the next point where you can top things up. Charging an electric car will take much longer from a home outlet instead of one of the 'superchargers', as Tesla reckon you'll get about 44 miles of range per hour of charge from a wall connector. That's going to cost you a bit of money on the leccy bill, and if you want to drive that cost down then you'll need to spend thousands on a 'powerwall' battery which uses solar panels and sticks the excess charge into filling up your car. Topics: Tesla, Cars, Technology, US News Joe graduated from the University of Salford with a degree in Journalism and worked for Reach before joining the LADbible Group. When not writing he enjoys the nerdier things in life like painting wargaming miniatures and chatting with other nerds on the internet. He's also spent a few years coaching fencing. Contact him via [email protected] @MrJoeHarker Advert Advert Advert Myth: It takes an hour to charge your EV!\nFact: My longest charging stop from OH to FL is 21 minutes! "
}