{
    "title": "`Nothing short of remarkable`: THIS is how much Elon Musk earns in one \nminute",
    "date": "2/16/2024",
    "url": "https://www.wionews.com/trending/nothing-short-of-remarkable-this-is-how-much-elon-musk-earns-in-one-minute-690652",
    "text": "Elon Musk Net worth: As per the World's Real-Time Billionaires' index by Forbes, Musk's net worth stands at a staggering $198.9 billion. This is how much he makes in one second, one minute, one hour and more Elon Musk Net worth: Last year, Elon Musk lost the title of the 'world's richest person,' however, a new report on Thursday (Feb 15) revealed that every minute of the tech billionaire is worth a whopping $6,887. As per the World's Real-Time Billionaires' index by Forbes, Musk's net worth stands at a staggering $198.9 billion. As per Finbold, despite his net worth dropping from $229 billion to the current 198.9 billion, the Tesla CEO in 2023 logged a total earnings of $3.6203 billion. Also read | Elon Musk's X received payments from terrorists, claim campaigners Upon dividing his earnings, the publication came up with significant figures that put a normal man's earnings to shame. In a year, there are 31,536,000 seconds. A division of his earnings of $3.6203 by the number of seconds in a year brings up the mighty number: $114.80. This is what Musk makes every second. Watch | Elon Musk's X received payments from terrorists This is equal to $6,887 per minute, $413,220 per hour, $9,917,280 per day, and $69,420,960 per week. Musk has a diverse portfolio, consisting of big tech companies like X (formerly Twitter), space research company SpaceX, automobile maker Tesla, The Boring Company, xAI, and Neuralink. Also read | SpaceX moves to Texas after Delaware judge axes Musk's $56bn Tesla pay \"Elon Musk’s financial prowess is nothing short of remarkable. Despite a dip in net worth from last year, he remains one of the wealthiest individuals globally, largely due to his diverse array of successful ventures,\" states the report. \"Through Tesla's electrifying innovations, SpaceX’s ambitious space endeavours, and his involvement in various other ventures, Musk continues to leave an indelible mark on the world stage. And when you break down his earnings per second, it’s clear that time is indeed money for this visionary entrepreneur,\" it concludes. (With inputs from agencies) "
}