{
    "title": "Tesla Sweden’s sales jump over 100% in Jan-Feb 2024 despite IF Metall strike",
    "date": "2/26/2024",
    "url": "https://www.teslarati.com/tesla-sweden-100-percent-increase-vehicle-deliveries-if-metall-strike/",
    "text": "It could be said that Tesla is a company that thrives under pressure. This was the case with the Model 3, a mass-market car that made Tesla into a mainstream automaker — but one that nearly killed the company in the process. It is then unsurprising that Tesla Sweden appears to be thriving despite its ongoing conflict with trade union IF Metall. IF Metall launched a strike against Tesla Sweden back in late October 2023 due to the company’s lack of a collective agreement. Over the next four months, IF Metall and its allies initiated a number of efforts to disrupt the EV maker’s operations. Yet despite multiple sympathy strikes, blockades, and other efforts, Tesla Sweden has continued to operate. Citing data from Car.info, Sweden’s online vehicle database, motoring publication CarUp noted that Tesla Sweden seems to be on track for a record 2024. As of late February, Tesla Sweden has delivered 1,545 cars to customers in the country. That’s more than double the number of vehicles that Tesla delivered in Sweden in the same period last year. For context, Tesla Sweden delivered 745 cars from January to February 2023. “During the first month of the year, Tesla delivered roughly 4.5 times more Model Y than the previous year, i.e. an increase from 104 cars in January 2023 to 577 cars in January 2024. For Model 3, deliveries increased from 96 cars in January 2023 to 142 cars in January 2024, thus an increase of almost 50%,” Tesla Sweden reportedly noted. Tesla Sweden previously highlighted that it has faced many challenges in the past, but it has always succeeded due to its unique approach to problem-solving. The EV maker also doubled down on the idea that its workers are encouraged to be creative and collaborative and that they enjoy a good working environment. “During Tesla’s twenty-year history, we have faced many challenges, but we have always succeeded thanks to our unique approach to problem-solving. Every day, our employees are encouraged to be creative and collaborate with other teams in order to offer an even higher customer experience. In return, they are rewarded with fair conditions and a good working environment,” Tesla Sweden noted. Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... Tesla appears to be ready to roll out wireless EV charging, according to the... While reports have emerged alleging that Giga Shanghai is slowing down on its electric... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Copyright © TESLARATI. All rights reserved. "
}