{
    "title": "Ford's free Tesla NACS adapter surfaces online",
    "date": "2/25/2024",
    "url": "https://finance.yahoo.com/news/fords-free-tesla-nacs-adapter-140000013.html",
    "text": " Ford was the first automaker to jump on board with Tesla’s charging standard (NACS), and we’re now learning how the transition from the company’s current CCS1 connectors to a Tesla NACS port. An X/Twitter user recently grabbed a screenshot from Ford’s online parts catalog that shows a J3400 (NACS) adapter on sale for the shockingly low price of $1. User @Eric_L_Roe captured the screenshot just in time, as Ford quickly pulled the page down shortly after. It’s possible that Ford posted the page to generate a part number and shipping process for the item and didn’t intend for it to be public-facing. The @Ford J3400 to CCS adapter is now showing up on https://t.co/TJGGZlOQTl. pic.twitter.com/rFqvBZUnxM — Eric Roe (@Eric_L_Roe) February 21, 2024 Though it shows a price, the adapter will be free for Mustang Mach-E and F-150 Lightning owners in the U.S. and Canada, and Ford has confirmed that its owners can continue using its app to charge rather than needing the separate Tesla app. They will also be able to use their vehicle’s infotainment system to start a charging session. The device looks a lot like Tesla’s Magic Dock it employs at some Superchargers to enable cross-brand charging. It could be manufactured by Tesla, as the X/Twitter user pointed out, which, as InsideEVs pointed out, would be in its best interest since it’s on the hook for any problems with the charging experience. Moving to Tesla’s charging standard gives Ford owners a wealth of new options to top up their EVs, and it should help alleviate some of the hassles using subpar and often unreliable third-party chargers. A portion of Tesla’s Supercharger network is already open to outside brands, and the automaker has installed its Magic Dock adapter at those locations to accommodate them. We’ll likely see other automakers offering similar products as time goes on, though near-future vehicles will come with the NACS plug built-in. There’s more good news for potential EV owners, as several automakers have banded together to create additional charging networks that should make it less of a hassle to own an EV without a home charging setup. You Might Also Like 2024 Toyota bZ4X Review: A ground ball single up the middle BMW i5 Luggage Test: How much fits in the trunk? Afeela Deep Dive: Our closest look yet at Sony Honda Mobility's electric sedan Related Quotes "
}