{
    "title": "Electric SUVs compared: New Rivian R2 vs Tesla Model Y",
    "date": "3/10/2024",
    "url": "https://www.businessinsider.com/rivian-r2-vs-tesla-model-y-compared-review-ev-suv-2024-3",
    "text": "Rivian is taking aim at Tesla with the R2, a smaller and more affordable SUV that will compete with the Model Y. The two vehicles will go head-to-head in the mass-market electric SUV segment, with matching starting prices of around $45,000 and battery ranges of around 300 miles. The Model Y will be stiff competition for Rivian's R2. Tesla's mass-market SUV has been a massive success for Elon Musk's EV company since its launch in 2020, with Model Y and its smaller counterpart, the Model 3, leading the company's global sales last year at 1.7 million deliveries. Set to arrive in 2026, the R2 is showing up at a critical time for Rivian. The company has struggled with the launch of its R1 products, and a more unforgiving economic environment has led to a few rounds of layoffs in the past year. Here's how Rivian's R2 stacks up against its top competitor, the Tesla Model Y. The R2's boxy design takes after its larger R1 predecessor. Unlike Tesla's more bubble-shaped silhouettes, Rivian leans into the SUV's history as a tall, squared-off vehicle with a wide and commanding stance. Rivian has always targeted a different buyer from Tesla, building what the company calls \"adventure-seeking\" vehicles for outdoorsy people. Tesla, on the other hand, appeals to a more techie customer who is probably more interested in self-driving and software innovations than things like towing and off-road performance. Tesla has set the standard for car interiors with its buttonless approach to controls. Both vehicles' interiors are built around large, iPad-like screens that house almost all of the controls. The R2 sports a 15.6-inch touchscreen, while the Model Y's is slightly smaller at 15 inches. One of the big draws for the R2's interior is that every seat in the SUV can fold down to accommodate either large cargo or offer a more spacious in-vehicle camping experience. Rivian hasn't released the interior dimensions of the R2 yet, but looking at these two interiors side-by-side, it's probably safe to say the Rivian offers more space than the Tesla. The Model Y still has significant storage for a vehicle of its size, with 30 cubic feet of storage with the back row up and 72 cubic feet of space with the seats folded down. At first glance, it's hard to tell which front trunk — known affectionately in the EV world as a \"frunk\" — offers more space or if the two SUVs are tied. The Model Y's frunk offers 4.1 cubic feet of space. Rivian hasn't released the dimensions for the R2's frunk yet, but the frunks on the larger R1 vehicles are roomier at 11 cubic feet of storage. Read next Jump to "
}