{
    "title": "Tesla Stock: Mag Seven May Be Shrinking (NASDAQ:TSLA)",
    "date": "3/2/2024",
    "url": "https://seekingalpha.com/article/4675469-tesla-stock-mag-seven-may-be-shrinking",
    "text": "jetcityimage/iStock Editorial via Getty Images jetcityimage/iStock Editorial via Getty Images The following segment was excerpted from this fund letter. The introduction of two new companies to FANG, FAANG, MAMMA and so forth is on the scale of college football realignment. Now known as the Magnificent Seven, including Nvidia (NVDA) and Tesla is like merging the SEC and Big Ten and picking up Coach Prime, SI Sportsperson of the Year, and his Golden Buffaloes. One super conference. One group of stocks so charmed and necessary in an investment portfolio to be simply magnificent. In case you are wondering, occasionally magazines release multiple covers of their really big editions. One new hip down, one to go, a new knee next and a little time in the weight room. I told Coach with one year of eligibility remaining (maybe two thanks to the Covid year) I'm coming. He's elated.  There are numerous interesting aspects of investing. One is that most people believe past performance is a guarantee of future results. Tech stocks at large flew close to the sun in 2021 and saw their wings of wax melted, sending them hurtling to earth. Unlike Icarus, tech has multiple lives, and like the Phoenix sprouted new wings and rose from the ashes. Tesla was spectacular over two sprints, most recently in 2020 when it rose 743% and was added to the S&P 500 (SP500,SPX), its selection committee known for adding past winners and kicking out dogs. At its peak in 2021, Tesla was priced at nearly $1.4 trillion (fully diluted shares to reflect the CEO being granted 20% of the company), 28x $50 billion in sales and 280x a 10% profit margin. The stock may be down 55% from its high (his brother and board member sold that day, Elon happened to tweet the next day that he too might sell and then did the next trading day). Tesla's decade to year-end 2021 was pretty impressive. Sales grew from $200 million (with an \"m\") to $54 billion. That's 74.6% per year, albeit from a nascent base. Making cars requires money, lots of it, and until 2020 Tesla made no money, profits that is. It did raise equity and debt capital, doubling the share count. In all, the stock compounded by 68.5% annually and a market capitalization over $1 trillion. It traded at 217x earnings at the end of the decade. Not quite the high from the prior month, but high. 2022 was quite a year. Dollar sales grew 51.4%. Check. Dilution was minimal at 2.1%. Check. The profit margin exploded from 9.3% to 14.2%. Check. However, the P/E multiple came down a bit, from 217.4x to 33.7x, an 84.5% decline that crimped all of the good news, sending the stock down 65% for the year. Recalling the necessity of tripling to offset a two-thirds loss to break even, Tesla's stock had a better 2023, just more than doubling. That was about the end of the good news. It seems the dominant robotaxi and auto insurance company to be found it necessary to lower prices to sell affordable cars. Lessons learned about operating leverage for sure. Sales growth tanked to a level far below what any Pollyanna analyst or cult member expected and rose only 18.8% in 2023. A bit more dilution and margin contraction from 14.2% to 8.6% (still somewhat high for a car company) pushed earnings per share down by 28.7%. The always intrepid Tesla shareholders, expecting better sales and margins in the near future, sent the P/E back up to 95.2x from 33.7x. What now, margins? In any event, Tesla was anointed a member of the new and exclusive Magnificent Seven Club during 2023. Rumor has it that the Tesla faithful may be fading some of their enthusiasm and thinking the stock may be ditched for up-and-coming Broadcom or the Mag Seven may be shrinking to the Sweet Six, or the Studly Six or some such thing. [Few remember the Big 6 preceded the Big 8 which preceded the Big 12 (and now never includes the number of schools in the name of the conference). We also had the Big Eight accounting firms, then the Big Six, then the Big Five, and then Enron and bye-bye Arthur Andersen. And then there were four.] SEC-registered investment advisory firms are now required to disclose 1-, 5- and 10-year returns, or the time period since performance composite or portfolio inception, if shorter. The new rule seeks to prevent \"advertisers\" from cherry-picking time periods that make returns appear more favorable. As short- and intermediate-term returns change frequently due to beginning and endpoint sensitivity, we have chosen to disclose all yearly intervals from the current 1-year return all the way back to inception. Intra-year periods will likewise be shown annually back to inception. Better, in our opinion, to provide more data than less. We are augmenting the mandated disclosure with the full data set - not to confuse - but if we must provide a few defined numbers, to the extent anybody uses them in decision making, we want you to have the information we'd want if our roles were reversed. The yearly return intervals are italicized and shaded in blue. Information presented herein was obtained from sources believed to be reliable, but accuracy, completeness and opinions based on this information are not guaranteed. Under no circumstances is this an offer or a solicitation to buy securities suggested herein. The reader may judge the possibility and existence of bias on our part. The information we believe was accurate as of the date of the writing. As of the date of the writing a position may be held in stocks specifically identified in either client portfolios or investment manager accounts or both. Rule 204-3 under the Investment Advisers Act of 1940, commonly referred to as the \"brochure rule\", requires every SEC-registered investment adviser to offer to deliver a brochure to existing clients, on an annual basis, without charge. If you would like to receive a brochure, please contact us at (303) 893-1214 or send an email to csc@semperaugustus.com. Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}