{
    "title": null,
    "date": "3/17/2024",
    "url": "https://seekingalpha.com/article/4678698-wall-street-breakfast-week-ahead",
    "text": "Listen on the go! A daily podcast of Wall Street Breakfast will be available by 8:00 a.m. on Seeking Alpha, iTunes, Spotify. Douglas Rissing/iStock via Getty Images    The Federal Reserve meeting will draw all the attention this week, even though traders consider it a fait accompli. Fed funds futures say there is a 99% chance that the Federal Open Market Committee keeps interest rates on hold.This past week’s hot inflation data has cemented that belief and put the focus on the Summary of Economic Projections, also known as the dot plot. For now, the market is still pricing in a first quarter-point rate cut in June. But if FOMC members push out their forecasts, the higher-for-longer narrative will gain steam again. Investing Group Leader James A. Kostohryz says based on the February CPI, \"the Fed needs to seriously increase the hawkish tone of its communications in order to dampen expectations regarding the timing and extent of Fed rate cuts in 2024.\"Along with the Fed, there will be a host of housing numbers to consider. The NAHB Housing Market Index for March, the February starts and permits figures and February existing home sales are all due.   Earnings spotlight: Monday, March 18 - StoneCo (STNE), Comtech (CMTL) and Science Applications (SAIC). See the full earnings calendar.Earnings spotlight: Tuesday, March 19 - Tencent Music (TME), Caleres (CAL), Citi Trends (CTRN) and Core & Main (CNM). See the full earnings calendar.Earnings spotlight: Wednesday, March 20 - Micron Technology (MU), Signet Jewelers (SIG), General Mills (GIS) and Five Below (FIVE). See the full earnings calendar.Earnings spotlight: Thursday, March 21 - Nike (NKE), FedEx (FDX), Accenture (ACN), Lululemon (LULU) and Darden Restaurants (DRI). See the full earnings calendar.  Volatility watch: Options trading volume is elevated for Chewy (CHWY). The list of highly-shorted stocks heading into the new week includes B. Riley (RILY), Imperial Petroleum (IMPP) and Atmus Filtration Technologies (ATMU). The most overbought stocks per their 14-day Relative Strength Index include Natural Resource Partners (NRP), ZoomInfo (ZI) and Ziff Davis (ZD). The most oversold stocks per their 14-day Relative Strength Index include Air Products and Chemicals (APD), Infosys (INFY) and Tesla (TSLA).  IPO watch: Reddit (RDDT) headlines the IPO calendar with its much-anticipated debut. The social media company is expected to price 22M shares between $31 and $34 per share, raising up to $748M with the deal. Intel-backed Astera Labs (ALAB) also launches its IPO this week. The semiconductor connectivity company plans to sell 17.8 million shares between $27 and $30 per share to raise up to $534M. About 3M of the shares sold come from existing shareholders. In addition, Instacart (CART) will exit its lockup period.   Investor events: Nvidia (NASDAQ:NVDA) will hold its annual GTC conference at the San Jose Convention Center over a four-day period. CEO Jensen Huang will unveil the company's latest breakthroughs in accelerated computing, generative AI, and robotics. CERAWeek in Houston, Texas will bring together global leaders to advance new ideas, insight and solutions to the biggest challenges facing the future of energy, the environment, and climate. Speakers include Exxon Mobil (XOM) CEO Darren Woods, Chevron (CVX) CEO Mike Wirth, Shell (SHEL) CEO Wael Sawan and Saudi Aramco (ARMCO) CEO Amin Nasser. Also ahead are Western Midstream Partners' (WES) Virtual Energy & Utilities Day, Brown-Forman's (BF.A) (BF.B) Investor Day, Huntington Ingalls Industries' (HII) Investor Day, Altair Engineering's (ALTR) Investor Day and Synopsys’ (SNPS) Investor Day. In Case You Missed It ... Marlboro Man eases up on the BudweiserDividend payouts hit a recordBitcoin will 'eat' goldCyclicals are more a concern than Magnificent 7China: 'This will inevitably backfire on the U.S.'Walmart selling Apple's MacBook Air for $699United chief asks Boeing to halt production of 737 Max 10UiPath paves way with AI automation This article was written by "
}