{
    "title": "The Boring Company’s Prufrock 3 in position to dig at Tesla Giga Texas",
    "date": "3/25/2024",
    "url": "https://www.teslarati.com/the-boring-company-prufrock-3-tesla-giga-texas/",
    "text": "The Boring Company’s (TBC) Prufrock 3 is in position to start digging at Tesla Giga Texas. The tunnel boring machine (TBM) has been at Tesla’s Giga Texas site for quite some time now, and many are eager to see it start digging. “The [Boring Company] crews continue what appears to be final prep to start the Giga Texas tunnel, [and] I got video of crews entering in to the front of the drill head. Unsure what the delay is to begin tunneling, but indications seem to point to this happening soon,” noted drone operator Joe Tegtmeyer on X. The @boringcompany crews continue what appears to be final prep to start the Giga Texas tunnel, & I got video of crews entering in to the front of the drill head. Unsure what the delay is to begin tunneling, but indications seem to point to this happening soon. pic.twitter.com/OIozbWGROF Tegtmeyer has been closely following The Boring Company’s progress with Prufrock 3 at Tesla Giga Texas. He was among the first to spot Prufrock 3 parts at Tesla’s Texas gigafactory. TBC started shipping and assembling Prufrock 3 parts at Giga Texas in January. Tegtmeyer and a few others closely following the project estimate that The Boring Company’s TBM will dig 14 meters (55 feet) below the highway surface. It will dig a tunnel about 300 meters long that leads to Giga Texas. Earlier this month, a photo of Prufrock 3 showed that the TBM looked lined up to launch. Recent images show that Prufrock 3 is angled to porpoise or launch directly from the surface and break into the ground. The tunnel boring machine will break the ground and resurface at the other end of the tunnel. If you have any tips, contact me at maria@teslarati.com or via X @Writer_01001101. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}