{
    "title": "Fisker Stock: Buy, Sell, or Hold?",
    "date": "3/16/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA-Q/pressreleases/24839338/fisker-stock-buy-sell-or-hold/",
    "text": "Even though Tesla share prices have been cut in half since peaking in late 2021, they're still up 1,000% over the past decade. That's pretty incredible and the type of performance that every investor likely would be happy with from stocks they own. It's also why so many investors are pouring over the electric-vehicle (EV) space trying to find the next tiny upstart that's destined to become an industry giant. EV-maker Fisker(NYSE: FSR) might be worth adding to such a list. Some may already have taken the plunge and bought the stock and are deciding if they should buy more or hold what they have. Others are becoming hesitant and considering a sale. Here are the arguments for investors who are considering selling, holding and/or buying this stock. One reason you might want to sell Fisker stock is to capture the capital losses you've suffered to help offset gains elsewhere in your portfolio. This is often called tax-loss harvesting, and the nearly 99% decline the stock has seen since its peak in 2021 makes it an excellent candidate for this portfolio-level decision. Fisker stock has lost almost all of its value in a relatively short period. Image source: Getty Images. As to other potential reasons to sell Fisker stock, from a company-specific standpoint, this EV maker is clearly on shaky ground. For example, in 2023, the company generated nearly $273 million in revenue from selling its vehicles. But the cost of making those vehicles was about $376 million. That's a more than $100 million difference in the wrong direction. Then there's the company's balance sheet. At the end of 2022, Fisker had $736.5 million in cash. A year later, it had about $395 million, including restricted cash that it can't use for everyday purposes. It burned through around $340 million in cash in a single year. If it were to do that again, it would be nearly out of cash by the end of 2024. Then there are two issues around the financial statements the company is required to provide to the U.S. Securities and Exchange Commission (SEC). First, the company has identified \"a material weakness\" in its accounting practices that will result in a delayed filing. That's not a good sign. Second, the company has issued a going-concern warning, which is basically an admission from the company that there's a real chance it will have to declare bankruptcy within the next 12 months. A company will only make that admission if it has to because of the material implications it can have on its business, notably on its ability to raise additional capital. Based on the company's warning -- let alone its actual financial performance -- only the most aggressive investors should be looking at Fisker stock today. Everyone else should probably stay away. If you've owned Fisker for a long time, you're probably sitting on material losses. You might think that you're down so much already, what does it matter if you keep holding it? The worst outcome is that the stock will become worthless. That looks like a real possibility here. If you want to salvage any of your investment, selling is probably the way to go. As for a turnaround in the business, well, it could happen, but Fisker will need to see lots of things break its way for a business turnaround to take shape.  FSR data by YCharts. That, by the way, is the main reason to buy Fisker. The belief would be that this beaten-down EV maker will somehow manage to muddle through the terrible predicament in which it finds itself. That's probably going to require a material cash infusion, though it isn't clear who will provide that cash. With the stock so low, selling shares seems likely to be off the table. And with the going-concern warning, rapid cash burn, and accounting weakness, not many lenders will likely give Fisker an attractively priced loan. Buying in the hope of a turnaround is kind of the investment equivalent of throwing a Hail Mary pass with your eyes closed. Only the most aggressive investors should try it. Equity investors should ignore a going-concern warning at their own peril, given that they're the ones who are usually wiped out in the bankruptcy process. It's among the highest-concern warnings that a company can make. All of the other performance issues noted above back up the risk this warning highlights. Most investors should stay away from Fisker. Should you invest $1,000 in Fisker right now? Before you buy stock in Fisker, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Fisker wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}