{
    "title": "Ignore the Recent Tesla Downgrade and Keep Betting on EV Stocks. These 3 \nWinners Stand Out.",
    "date": "3/13/2024",
    "url": "https://www.tradingview.com/news/investorplace:ecf012793094b:0-ignore-the-recent-tesla-downgrade-and-keep-betting-on-ev-stocks-these-3-winners-stand-out/",
    "text": "Is the electric vehicle (EV) market entering a new era? It may be and, if it does, EV stocks won’t have Tesla TLSA as their leader. TSLA stock is falling today after it received a strong downgrade from Wall Street. Wells Fargo issued a sell rating on the EV maker, downgrading shares to “underweight.” The firm also set a bearish price target of $125 per share, implying downside potential of more than 25%. Analyst Colin Langan provided a detailed analysis on TSLA: “TSLA’s growth in core markets has moderated with EU & China flattish in the [last 12 months] & the US down since Q2. More concerning, the effect of price cuts are moderating with 2H volume up only 3% [half over half] despite pricing that’s down 5% h/h […] We expect volumes to be flat in 2024 & down in 2025. In the wake of [price] cuts are lower lease residuals, disgruntled customers & the possible loss of the luxury brand premium.” If the EV market is truly shifting like it appears to be, it will mark the end of an era. But investors should note any fall for Tesla will also create opportunities for other EV stocks to grow and thrive. In fact, a new crop of winners are already getting ready to expand their market share and progress as we shift toward a more sustainable future. EV Stocks to Buy: BYD Company (BYDDY) If you’ve been watching the booming Chinese EV market, you’ve definitely seen progress from this company. BYD BYDDY has often been touted as a likely Tesla killer, and for good reason. The firm has managed to outsell its U.S. rival for the last two years, demonstrating consistent growth and also creating momentum for its smaller Chinese EV peers. However, BYD’s place at the top of China’s EV sector is undisputed. As InvestorPlace contributor Tyrik Torres notes, “BYD has managed to become the world’s largest EV maker and the second largest EV battery provider in the same year.” Consider those statistics. Now consider that it has managed to accomplish both these feats without selling in the United States. While that’s not likely to change anytime soon, investors can rest assured that BYD is still hyper-focused on expanding its global presence. Electrek reports that the company plans on tripling its market share in Europe by 2025. If it can do that (or even come close), BYDDY stock could help lead the next rally for EV stocks. Rivian Automotive (RIVN) It has been a difficult few days for Rivian RIVN, but things are starting to look up. Last week, RIVN stock rose when the electric truck maker unveiled its new line of lower-cost EVs and highly anticipated R2 platform. As InvestorPlace’s Eddie Pan reports, orders have been pouring in since then — Rivian received 68,000 orders for its new R2 in the 24 hours after the announcement. This shows that Rivian has recognized a real need for less expensive EVs and that consumer trust in the brand remains high. This new product line and platform have led to multiple upgrades for RIVN stock. Last week, analysts from Jefferies and Robert W. Baird issued positive takes, citing the R2 as exactly the catalyst Rivian needed to pull back into the green. More recently, Deutsche Bank analyst Emmanuel Rosner upgraded his price target on shares. The growing consensus from Wall Street is clear: Rivian looks like a winner among the next generation of EV stocks. EV Stocks to Buy: Beam Global (BEEM) Any discussion of the best EV stocks to buy should include an EV charging leader. Beam Global BEEM is emerging as exactly that, outperforming many of its better-known charging peers. Despite some volatility, BEEM stock has performed well so far this year, rising about 8% amid a difficult market. Beam is also one of the few companies in the EV charging space currently trading above penny stock price levels. Further, Beam has been busy recently, reminding investors that it is focused on growth. InvestorPlace contributor Ian Cooper reports: “[Beam has] announced a $4.8 million deal with Homeland Security, and a $7.4 million deal with the U.S. Army. It was even awarded city contracts with San Diego and Los Angeles. Now, after acquiring Serbian streetlight company, Amiga, it’s set to expand throughout Europe.” As Beam follows BYD’s lead and expands into Europe, the firm will likely continue to expand its market share and fill the global demand for EV charging infrastructure. The EV market may be shifting of late, but conditions should look increasingly favorable for the companies that power electric vehicles. On the date of publication, Samuel O’Brient did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Samuel O’Brient is a Reporter for InvestorPlace, where his work focuses primarily on financial markets, global economic trends, and public policy. O’Brient writes a weekly column on recent political news that investors should be following. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}