{
    "title": "Tesla V4 Superchargers Are Now Being Deployed By Other Charging Networks",
    "date": "3/22/2024",
    "url": "https://insideevs.com/news/713475/evpoint-tesla-v4-superchargers-deployed/",
    "text": "The first Tesla DC fast chargers started to appear on third-party charging networks, as Tesla expanded its business to become a hardware provider. This month, EG Group's EV Point network shared a few images of its charging station in Asda Express, Uttoxeter, UK. The site is equipped with EV Point branded chargers, which are essentially Tesla V4 Superchargers that the company ordered in 2023. Tesla EV charging business expands Tesla produces in-house AC and DC charging equipment and operates its fast charging network. In recent years, the company started to open the network to non-Tesla EVs and even sell charging hardware to third-party networks. According to the previous report, EG Group intends to deploy more than 20,000 chargers across about 3,600 sites in the United Kingdom and continental Europe. If the partnership with Tesla continues, it might become a noticeable revenue stream for Tesla. In Europe, all new DC fast chargers are currently compatible with the CCS Combo 2 (CCS2) standard, so the sites can be used by all modern EVs. Soon, we might see more third-party charging networks using Tesla chargers around the world, simply because Tesla might be very cost-competitive. The company already achieved a relatively high scale of DC charger production. In the U.S., Tesla chargers will be used in the BP Pulse charging network. The initial order, placed in October 2023, was for $100 million worth of equipment. We don't know the technical details, but we can assume that the company might deploy V4 Superchargers, with the SAE J3400 NACS plug and Tesla’s Magic Dock, which is an integrated CCS1-adapter for non-Tesla EVs. Tesla still needs to accelerate its V4 deployment in the U.S. The new V4 models, which began rolling out last fall, are designed to work with a much wider range of EVs as Tesla increasingly gets into the charging business for the rest of the industry as more cars switch to its plug standard from the factory. See also Trending Find a vehicle latest articles latest articles About this article "
}