{
    "title": "Tesla pay package lawyers ask for $5.6M payment in stock",
    "date": "3/4/2024",
    "url": "https://www.proactiveinvestors.com/companies/news/1042295/tesla-pay-package-lawyers-ask-for-5-6m-payment-in-stock-1042295.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Oliver has been writing about companies and markets since the early 2000s, cutting his teeth as a financial journalist at Growth Company Investor with a focusing on AIM companies and small caps, before a few years later becoming a section editor and then head of research. He joined Proactive after a couple of years freelancing, where he worked for the Financial Times Group, ITV, Press Association, Reuters sports desk, the London Olympic News Service, Rugby World Cup News Service, Gracenote... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 07:21 04 Mar 2024 EST The three law firms which won the case for Tesla Inc (NASDAQ:TSLA, ETR:TL0) shareholders against Elon Musk's $56 billion Tesla compensation package have requested $5.6 billion from the company in stock as legal fees. In January a Delaware judge ruled that the pay package was unlawful. The legal team's filing said: “We recognise that the requested fee is unprecedented in terms of absolute size.” For the amount of time the lawyers worked on the case, the fee works out at an hourly rate of $288,888, the filing stated. The three firms are Bernstein Litowitz Berger & Grossmann, Friedman Oster & Tejtel, and Andrews & Springer. They said in the filing that the company should pay in shares as it has “the benefit of linking the award directly to the benefit created and avoids taking even one cent from the Tesla balance sheet to pay fees,” as well as being tax-deductible to the EV maker. Musk's response to the initial judgment in January was one of frustration: “Never incorporate your company in the state of Delaware,” he said in a tweet. The disputed pay package, designed to allow Musk to purchase Tesla shares at a discount upon meeting financial milestones, was challenged for its attainability and Musk's concurrent involvement in other ventures, including SpaceX and the acquisition of X/Twitter. Tesla's directors defended the compensation's scale as necessary to maintain Musk's focus on the company, which has seen its value increase significantly since the agreement. Sign up to receive alerts and news direct to your inbox Hive Digital technologies Executive Chairman Frank Holmes joined Steve Darling from Proactive to share details about the company's engagement with NVIDIA, a pivotal player in the GPU market, particularly in Ethereum mining and the broader digital transformation landscape. Holmes highlighted... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive North America Inc., Proactive Investors LLC. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}