{
    "title": "Tesla deliveries face hit from China slowdown, soft demand",
    "date": "3/29/2024",
    "url": "https://www.brecorder.com/news/40296335",
    "text": "BEIJING: Tesla is expected to report sluggish first-quarter deliveries next week as the boost from its price cuts wanes and the US automaker grapples with strong competition for buyers in a slowing electric-vehicle market. After years of rapid sales growth that helped turn it into the world’s most valuable automaker, Tesla is bracing for a slowdown in 2024. The company has been slow to refresh its aging models at a time high interest rates have sapped consumer appetite for big-ticket items and rivals like Xiaomi in China, the world’s largest auto market, are rolling out cheap models. “Tesla may be witnessing price-cut fatigue with consumers and may be testing profitability levels that the company may not find acceptable,” Morgan Stanley analyst Adam Jonas said in a report to clients earlier this month. “Such conditions may not significantly improve near-term given the age of Tesla’s product line-up.”  The dire expectations have sent Tesla’s shares down nearly 30% so far this year, making them the worst performer in the S&P 500 index. Tesla is expected to deliver 458,500 vehicles in the quarter to March 31, according to 17 analysts polled by Visible Alpha. That is higher than the 422,875 units it handed over in the same quarter last year, but would mark a decline of more than 5% from the previous three months. Since late 2022, Tesla CEO Elon Musk aggressively cut Tesla prices at the expense of margins, helping boost sales but frustrating many of its customers who have seen the value of their cars slump. Musk said price cuts are needed to keep factories humming, blaming winter and high borrowing costs for curbing demand. Tesla continued its price cuts early this year in the United States, China and Germany, while boosting discounts and incentives to drive demand. For example, Tesla offers more than $7,000 discounts on some new Model Ys in the US  “Teslas have the dubious honour of being the fastest-depreciating vehicles in the US,” HSBC said in a report this week. “We can see how cheaper works for consumables, but we are less convinced it works for consumer durables for which residuals are part of the cost equation.”  In January, Tesla warned of “notably lower” sales growth this year as it focuses on the production of its next-generation electric vehicle. Tesla shares were down 1.7% on Thursday, ending three days of gains partly driven by Musk’s comments that Tesla will offer a free one-month trial of its Full Self-Driving driver assistant system to US customers. A protracted price war has turned China into a tough market for automakers and Tesla lost the crown of the world’s top-selling EV maker in the fourth quarter to BYD, which has been spear-heading the deep price cuts in the country. In the first two months of the year, Tesla delivered 131,812 vehicles that were made in China, down 6.2% from a year ago. In the United States, its Model 3 compact sedans are among cars that do not qualify for a $7,500 federal tax credit this year due to curbs on battery material sourcing from China. Buyers in the US have also been opting for less expensive hybrid vehicles, which are also more fuel efficient than gas-powered cars and provide greater driving range than battery-powered EVs. "
}