{
    "title": "Tesla (TSLA) to Produce Semi Truck at Gigafactory Berlin",
    "date": "3/15/2024",
    "url": "https://www.zacks.com/stock/news/2241303/tesla-tsla-to-produce-semi-truck-at-gigafactory-berlin",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    March 15, 2024 GM Quick QuoteGM TSLA Quick QuoteTSLA ALSN Quick QuoteALSN MOD Quick QuoteMOD Better trading starts here. You follow Analyst Blog - edit You follow Zacks Equity Research - edit Zacks Equity Research Analyst Blog Tesla, Inc. (TSLA Quick QuoteTSLA  -  Free Report)     plans to produce Tesla Semi, its electric semi truck, at Gigafactory Berlin. Elon Musk, CEO of TSLA, revealed this plan during his visit to Gigafactory Berlin following an arson attack on the factory, which resulted in a halt in production.Tesla is currently manufacturing Model Y at Gigafactory Berlin.Musk did not provide a specific timeline for the project. The company had not yet unveiled any new vehicle production programs for the factory beyond the Model Y.The automaker’s announcement to produce the Tesla Semi at Gigafactory Berlin reflects Elon Musk’s commitment to expanding the European factory despite facing massive resistance from Grünheide locals.Per the expansion plan, Gigafactory Berlin aims to build another plant to increase the annual production capacity of the factory to 1 million units from the current capacity of 500,000 units. Although Tesla Semi's contribution to Gigafactory Berlin’s 1 million unit goal would be limited, it suggests progress in the right direction.Lars Moravy, the company's vice president of vehicle engineering, confirmed that the fleet of Tesla Semi has increased to around 100 units.Per Moravy, TSLA has partnered with Pepsico, which is using Tesla Semi for delivery to monitor the durability of Class-8 trucks. The data provided by PepsiCo is crucial to enable the volume production of the Semis scheduled to commence this year.Currently, Tesla Semi is in low-volume production in a plant outside Gigafactory Nevada. In January 2023, the EV pioneer announced its plan to expand Gigafactory Nevada to integrate the production of Tesla Semi trucks and 4,680 battery cells. The company also announced its plan to develop the factory to its originally intended size.  However, there was no progress reported on the expansion plan of Gigafactory Nevada for a year. In January 2024, the company started working on the project but is yet to start the volume production of semi trucks in the United States. In Europe, regulations do not endorse big trucks. Long-nose trucks have been wiped out of European roads due to a current length limit of 18.75 meters. Utilizing valuable cargo space for the truck's engine is not productive, so cab over truck dominates the European market. Tesla Semi would be considered as an outlier, given the regulatory requirement unless the legislation states otherwise. Discussion is in progress to allow longer and more aerodynamic cabs without compromising cargo volume in case of electric trucks.Per an ING report dated December 2023, the composition of European truck sales is set to transform in the next 10 years. Europe has been pushing auto manufacturers to decarbonize the continent’s fleet quickly because of which the manufacturers are scaling up the production of electric trucks.Considering Europe’s efforts to decarbonize the auto sector, Tesla Semi would be a perfect choice for the continent. However, there’s no clarity on whether the automaker would revamp Tesla Semi for the European market. TSLA currently carries a Zacks Rank #3 (Hold).Some better-ranked players in the auto space are Modine Manufacturing Company (MOD Quick QuoteMOD  -  Free Report)    , General Motors Company (GM Quick QuoteGM  -  Free Report)     and Allison Transmission Holdings, Inc. (ALSN Quick QuoteALSN  -  Free Report)    , each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.The Zacks Consensus Estimate for MOD’s 2024 sales and earnings per share (EPS) suggests year-over-year growth of 4% and 67.2%, respectively. The EPS estimates for 2024 have improved 22 cents in the past 60 days. The EPS estimates for 2025 have improved 12 cents in the past 30 days.The Zacks Consensus Estimate for GM’s 2024 sales and earnings suggests year-over-year growth of 1.8% and 17.2%, respectively. The EPS estimates for 2024 and 2025 have improved 17 cents and 32 cents, respectively, in the past 30 days.The Zacks Consensus Estimate for ALSN’s 2024 sales and earnings suggests year-over-year growth of 2.1% and 3.2%, respectively. The EPS estimates for 2024 and 2025 have improved 67 cents and 71 cents, respectively, in the past 30 days. General Motors Company (GM) - $25 value - yours FREE >> Tesla, Inc. (TSLA) - $25 value - yours FREE >> Allison Transmission Holdings, Inc. (ALSN) - $25 value - yours FREE >> Modine Manufacturing Company (MOD) - $25 value - yours FREE >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}