{
    "title": "Tesla is the worst performing stock in the S&P 500. Analysts say it has \nfurther to fall",
    "date": "3/14/2024",
    "url": "https://www.ctvnews.ca/business/tesla-is-the-worst-performing-stock-in-the-s-p-500-analysts-say-it-has-further-to-fall-1.6807625",
    "text": "lon Musk’s Tesla once represented the future of automaking. Now the company’s own future is in question. The once red-hot electric vehicle maker — heralded as part of the so-called Magnificent Seven behemoth tech stocks — is currently the worst performer in the S&P 500 this year, down nearly 32 per cent since January. The story of Tesla’s (TSLA) decline has been well documented. The company has been plagued by safety issues and recalls, slowing growth and has even been forced to slash prices. But a new report by Wells Fargo analyst Colin Langan on Wednesday offers a darker picture than previously imagined. Tesla, he wrote, is a “growth company with no growth.” Langan predicts that Tesla’s growth will remain flat this year and then decline in 2025 as competition increases, deliveries disappoint and the beleaguered auto and tech company is forced to cut prices again. UBS also downgraded its forecast for Tesla on Wednesday. Analysts said concerns are mounting as demand for electric vehicles slow and China begins to compete in the market. With the exception of Tesla, all of the Magnificent Seven companies (that also includes Apple, Amazon, Meta, Google, Nvidia and Microsoft) saw double- or triple-digit earnings growth in the final three months of 2023. Tesla reported a 40 per cent decline in profit from the year before. Tesla has been navigating through a perfect storm.The EV environment is getting more crowded right as the company’s fundamentals have come into question. Its share price has dropped about 60 per cent from its 2021 all-time high of US$407. But even with the recent drop in price, Tesla’s stock is still very expensive when compared to its actual earnings and profits, said Langan. The company’s former propensity for rapid growth is no longer certain, he said, and shares likely have further to fall. Wells Fargo has lowered its price target for the stock from US$200 to US$125, predicting another 25 per cent decrease in value. UBS, meanwhile, has lowered its price target to a more moderate US$165 from US$225. The driver of the vehicle that was at the centre of the road rage incident in Brampton last week is speaking out about the 'scary' ordeal he, his wife, and her friend went though.  The Liberals are deploying a new pre-budget marketing strategy that will see most of the upcoming federal budget announced before it is actually tabled in the House of Commons on April 16.  During a 2022 interview with 'The Daily Show,' Parton was asked about the hundreds of cover versions of her 1973 country classic 'Jolene' and the one artist yet to record the song who Parton hoped would do so, Beyoncé.  Teams of engineers are now focused on the formidable job of hauling the shattered remains of the Francis Scott Key Bridge out of Maryland's Patapsco River, the first step toward reopening the Port of Baltimore and recovering the bodies of four workers who are still missing and presumed dead.  Foreign diplomats in Russia laid flowers on Saturday at the site of last week’s attack on a suburban Moscow concert hall that killed 144 people.  The Vancouver Canucks weren’t the only ones who stumbled during Thursday night’s game against the Dallas Stars.  There were no facilities to treat those with mental illness or developmental disabilities in what was then the Alaska territory, so they were sent — often by dog sled, sleigh or stagecoach — to a waiting ship in Valdez. The 2,500-mile (4,000 km) journey ended at Morningside Hospital.  Two men from Senegal froze to death were found in the snow of a wooded area close to the Canadian border, New York state police said.  A three-ship convoy left a port in Cyprus on Saturday with 400 tons of food and other supplies for Gaza as concerns about hunger in the territory soar.  The driver of the vehicle that was at the centre of the road rage incident in Brampton last week is speaking out about the 'scary' ordeal he, his wife, and her friend went though.  Niagara Region says it has declared a state of emergency 'out of an abundance of caution' as it prepares for an influx of visitors for next month’s total solar eclipse.  An historic downtown Toronto bar is closing its doors next week after nearly 200 years in business.  Ontario's top doctor is calling on the province to immediately enact policy that will restrict access to alcohol, vapes and cannabis as the number of people who have died or visited a hospital due to using multiple substances has spiked in recent years.  A 17-year-old boy is dead and three youth suspects have been arrested after a stabbing in Prince George, B.C.  An \"indecent offender\" who allegedly exposed himself in view of children last weekend on Vancouver Island was arrested again days later for a similar offence, according to the RCMP.  Teams of engineers are now focused on the formidable job of hauling the shattered remains of the Francis Scott Key Bridge out of Maryland's Patapsco River, the first step toward reopening the Port of Baltimore and recovering the bodies of four workers who are still missing and presumed dead.  As Donald Trump campaigns on promises of mass deportations and pardons for those convicted in the Jan. 6, 2021, riot at the Capitol, his ideas are being met with little pushback and some enthusiasm by a new era of Republicans in Congress.  A three-ship convoy left a port in Cyprus on Saturday with 400 tons of food and other supplies for Gaza as concerns about hunger in the territory soar.  Foreign diplomats in Russia laid flowers on Saturday at the site of last week’s attack on a suburban Moscow concert hall that killed 144 people.  Dutch police detained a man Saturday after he left a nightclub where four people had been held hostage for hours, bringing a peaceful end to a tense standoff.  U.S. President Joe Biden's reelection campaign is raising gobs of cash. And it has an election-year strategy that, in a nutshell, aims to spend more — and spend faster.  The Liberals are deploying a new pre-budget marketing strategy that will see most of the upcoming federal budget announced before it is actually tabled in the House of Commons on April 16.  Salmon farms have long been a point of contention between environmentalists and fish farmers in British Columbia, but a much bigger net is now being cast on the topic.  Premier Wab Kinew and federal Conservative Leader Pierre Poilievre met at the Manitoba legislature Thursday afternoon.  Ontario's top doctor is calling on the province to immediately enact policy that will restrict access to alcohol, vapes and cannabis as the number of people who have died or visited a hospital due to using multiple substances has spiked in recent years.  Not getting enough sleep may cause you to feel five to 10 years older than you really are, according to two new studies.  A breakthrough discovery made by doctors at the Montreal Children's Hospital about the causes of cerebral palsy is giving new hope to one West Island family.  The range of April Fools' Day marketing pranks gone awry is as varied as their reception. Met with everything from smiles and social media shares to confusion, derision or even fury and falling stocks, the puckish promotional tactic represents a risk that can endear customers to a brand as swiftly as it can sour them on it.  Neuroscientist Emma Duerden says social media can alter children's brains and have negative impacts on their mental health.  A new poll indicates 51 per cent of Canadians support banning the social media app TikTok, after a U.S. bill aiming to do just that passed in the House of Representatives.  During a 2022 interview with 'The Daily Show,' Parton was asked about the hundreds of cover versions of her 1973 country classic 'Jolene' and the one artist yet to record the song who Parton hoped would do so, Beyoncé.  Just like the evil movie exes who can't get over her \"Scott Pilgrim\" alter ego Ramona Flowers, Mary Elizabeth Winstead can't get over Toronto.  A year after her reality TV mega-breakup “Scandoval,” life for “Vanderpump Rules” cast member Ariana Madix is better than ever.  If you've been the victim of workplace harassment, it can be difficult to feel you're not alone - and even more difficult to know where to go with a complaint.  Canadian exports of thermal coal increased another seven per cent last year, reaching the highest level in almost a decade.  A federal judge on Thursday ordered Sam Bankman-Fried to repay more than US$11 billion as part of his sentence for defrauding customers and investors in his failed crypto exchange FTX.  After a number of failed IVF rounds, health issues and the death of their beloved dog, a U.S. couple was in need of a change of scenery. They took a short trip to Andalusia, Spain, but neither could have predicted they'd end up relocating there just months later.  An historic downtown Toronto bar is closing its doors next week after nearly 200 years in business.  Luxury operator Regent Seven Seas Cruises is raising their price tag to eye-watering levels, with a suite on an upcoming 140-day world voyage costing US$1.7 million.  Preparations are underway for the gardens of the Versailles Palace to welcome Olympic horse riders and tens of thousands of visitors when it hosts equestrian and modern pentathlon events during this summer's Paris Games.  The St. Paul Saints quickly found out that not everyone was amused by the pig's name, Ozempig, or the team's posting of a backstory about the pig's embarrassment at gaining weight and promise to try to remain trim.  The Toronto Maple Leafs have signed defenceman Simon Benoit to a three-year contract extension.  Infiniti, Nissan’s luxury vehicle division, just revealed a feature in its new full-sized SUV that can allow everyone else in the vehicle to keep listening to whatever they want while the driver takes a phone call and no headphones are needed.  Xiaomi, a well-known maker of smart consumer electronics in China, is joining the country's booming but crowded market for electric cars.  Ontario has among the highest rates for auto insurance premiums in Canada -- just below Alberta and Nova Scotia -- however, the introduction of an insurance reform in the provincial budget could soon lower prices.  A Toronto restaurant introduced a surprising new rule that reduced the cost of a meal and raised the salaries of staff.  The spring allergy season has started early in many parts of Canada, with high levels of pollen in some cities already. Experts weigh in on which areas have it worse so far this season.  It was a typical Tuesday for Mabel Beharrell, 84, until she got the call that would turn her world upside down. Her teenaged grandson was in trouble and needed her help.  B.C. conservation officers recently seized a nine-foot-long Burmese python from a home in Chilliwack.  A New Brunswicker will go to bed Thursday night much richer than he was Wednesday after collecting on a winning lottery ticket he let sit on his bedroom dresser for nearly a year.  The Ontario government is introducing changes to auto-insurance, but some experts say the move is ill-advised.  Newfoundland’s unique version of the Pine Marten has grown out of its threatened designation.  A Toronto man is out $12,000 after falling victim to a deepfake cryptocurrency scam that appeared to involve Prime Minister Justin Trudeau.  It started small with a little pop tab collection to simply raise some money for charity and help someone — but it didn’t take long for word to get out that 10-year-old Jace Weber from Mildmay, Ont. was quickly building up a large supply of aluminum pop tabs.  Salmon farms have long been a point of contention between environmentalists and fish farmers in British Columbia, but a much bigger net is now being cast on the topic.  One person was transported to hospital in serious condition Friday after a crash temporarily closed the Sea to Sky Highway.  Efforts to coax an orphaned whale calf out of a lagoon off Vancouver Island have been paused and fisheries officials are now monitoring the animal from afar until the tidal situation improves, Fisheries and Oceans Canada says.  Ontario’s police watchdog invoked its mandate after an officer was involved in a collision in north Etobicoke late Friday afternoon.  The driver of the vehicle that was at the centre of the road rage incident in Brampton last week is speaking out about the 'scary' ordeal he, his wife, and her friend went though.  Toronto Police Service’s (TPS) professional standards unit is investigating after video footage surfaced on social media of several officers arresting a man on a packed TTC subway train.  What began as a race to pick a new leader for Alberta’s Opposition NDP has triggered a broader existential debate over why being provincially orange must automatically tie you to the federal brand.  Canada's Christa Deguchi defeated Brazil's Jessica Lima on Friday to win gold in the under-57 kilogram category at the Antalya Grand Slam judo competition.  The Hurricanes dominated play in the last two periods of their playoff opener against the Broncos Friday night, but they drew a blank on the scoreboard as Swift Current took a one-game series lead with a 3-0 victory.  The Ottawa Police Service says its fraud unit has been seeing a rise in the numbers of Marketplace scams.  The Ontario Provincial Police took to X to thank the community and MeowTown for the help they offered to locate the owner of an English Mastiff dog who was found on Highway 401 on Friday.  The Ontario Provincial Police says a driver from South Stormont is facing charges after being caught going 64 km/hr above speed limit on Highway 401 Saturday morning.  A breakthrough discovery made by doctors at the Montreal Children's Hospital about the causes of cerebral palsy is giving new hope to one West Island family.  A major fire broke out at the Les Fruits de mer de l'Est du Québec shrimp processing plant in Matane Friday evening.  Future Hall-of-Fame Montreal Canadiens goalie Carey Price's home on Montreal' South Shore has sold for $1.5 million, about $300,000 less that the original asking price.  An Edmonton broadcasting pioneer has passed away.  What began as a race to pick a new leader for Alberta’s Opposition NDP has triggered a broader existential debate over why being provincially orange must automatically tie you to the federal brand.  A new store in Manchester Square is building up the small business community one shelf at a time.  Feed Nova Scotia says ahead of the Easter holiday, many individuals and families are facing food insecurity and festivities can amplify their struggles.  A 40-year-old man from Richibouctou-Village, N.B., has died following a single-vehicle crash in the community on Thursday.  Halifax Regional Police are investigating a robbery that happened Friday night at the Shoppers Drug Mart in the city's Fairview neighbourhood.  Hundreds of community members marked Good Friday with the 35th annual Public Way of the Cross, presented by the Archdiocese of Winnipeg.  Winnipeg Fire Paramedic Service responded to calls on Selkirk Avenue and Keewatin Street just over six hours apart.  A housing development south of Winnipeg’s Grant Park neighbourhood is one step closer to reality after years of back-and-forth in city hall and court.  The University of Regina’s Hill Business Students’ Society wrapped up their ‘5 Days for the Homeless’ campaign Friday.  As more snow dumps on some parts of the province, Saskatchewan RCMP is reporting poor road conditions.  A Saskatoon mother says the Ministry of Social Services ignored several requests to have black mold removed from her provincial housing corporation home.  Kitchener Rangers playoff hockey is back.  It was a busy day at Morty's Pub on Good Friday, as people flocked to the Waterloo hot spot to get their fill of fish and chips.  In a story of discovery and connection, two musicians from southern Ontario have found themselves not just united by music, but by blood, thanks to DNA testing.  Good Friday in Saskatoon brought the Christian community out into the snow for the annual hallmark way of the cross prayer walk for the second time since the pandemic.  As more snow dumps on some parts of the province, Saskatchewan RCMP is reporting poor road conditions.  Heading to the Easter long weekend, the City of Saskatoon along with numerous partners hosted the very first community round dance and feast Thursday evening.  Officers in the Parry Sound area started the long weekend with an early morning call about a single-vehicle crash Friday, Ontario Provincial Police say.  The Liberals are deploying a new pre-budget marketing strategy that will see most of the upcoming federal budget announced before it is actually tabled in the House of Commons on April 16.  A lot of concern and speculation is circulating in the small northern Ontario community of Field on Friday after a massive police search for \"dangerous\" suspects.  Injuries have been reported as non-life-threatening after the driver of a vehicle was taken to a local trauma centre following a single--vehicle crash.  After being called to two fires caused by unattended cooking in two days, London fire is spreading the message that, \"Cooking fires are preventable.\"  An investigation by the Ontario Special Investigations Unit has determined is was reasonable for a police officer to shoot her gun at a man in Aylmer, Ont.  More than a hundred kids participated in Drysdale's annual Easter Egg hunt on Good Friday.  Two individuals have been arrested and charged after an impaired driving incident at a local care home in Orillia.  Huronia West OPP is asking for the public's help in identifying a suspect in a Wasaga Beach robbery.  Windsor police responded to a crash on Riverside Drive West on Thursday night.  A city committee has backed a new gated entry for a downtown parking lot that has prompted partying complaints.  On Friday night, police were called to a home on Florence Street where they learned a man allegedly assaulted two other people with a hockey stick.  A Victoria-area business association says the region is at risk of losing more than a quarter of its workforce in the next 12 years unless local municipalities allow greater housing density to provide more affordable homes for workers.  Efforts to coax an orphaned whale calf out of a lagoon off Vancouver Island have been paused and fisheries officials are now monitoring the animal from afar until the tidal situation improves, Fisheries and Oceans Canada says.  Salmon farms have long been a point of contention between environmentalists and fish farmers in British Columbia, but a much bigger net is now being cast on the topic.  A 49-year-old man has been charged with assault, uttering threats and possession of a weapon for a dangerous purpose after an incident in Kelowna Monday night.  A B.C. judge has given the City of Vernon 14 days to make a decision on a business licence application it has left pending without explanation for more than a year.  A protester who unleashed a \"race-based tirade\" outside a vaccination clinic in B.C.'s Okanagan at the height of the COVID-19 pandemic did not cause a criminal disturbance, a judge has ruled.  The Hurricanes dominated play in the last two periods of their playoff opener against the Broncos Friday night, but they drew a blank on the scoreboard as Swift Current took a one-game series lead with a 3-0 victory.  Canada's Christa Deguchi defeated Brazil's Jessica Lima on Friday to win gold in the under-57 kilogram category at the Antalya Grand Slam judo competition.  A fog advisory was issued for Calgary and most of southern Alberta early Saturday morning.  A northern Ontario man wanted since September for debit card theft was arrested this week at a downtown Sault business, where he uttered threats at security staff, police say.  Officers in the Parry Sound area started the long weekend with an early morning call about a single-vehicle crash Friday, Ontario Provincial Police say.  A complaint about a 'suspicious' snowmobiler stuck on a trail in northern Ontario has resulted in impaired driving charges against a 43-year-old woman.  Brad Gushue is approaching this year's men's world curling championships like it could be his last.  Roughly 50 children will gather in a St. John’s classroom for the first time on Saturday for unique lessons on Ukrainian language, culture and history.  Newfoundland’s unique version of the Pine Marten has grown out of its threatened designation.  The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. © 2024 \n\n All rights reserved. Use of this Website assumes acceptance of Terms & Conditions and Privacy Policy "
}