{
    "title": "Tesla owners' class-action lawsuit over driving range falls apart",
    "date": "3/8/2024",
    "url": "https://www.businessinsider.com/tesla-owners-lawsuit-battery-range-evs-2024-3",
    "text": "       An attempt by several Tesla owners to bring a class-action lawsuit against the company over its advertised driving ranges has broken down. In a ruling reported on by Reuters, a judge said Thursday that the owners, who claimed in a lawsuit that it intentionally overinflated the driving range of its EVs, will have to go through individual arbitrations. The drivers accused Tesla of false advertising in the lawsuit last August. The plaintiffs claimed that the company was trying to sell its EVs  by overstating how far they could drive on a single battery charge. Related stories The lawsuit said, \"Had Tesla honestly advertised its electric vehicle ranges, consumers, either would not have purchased Tesla model vehicles or else would have paid substantially less for them.\" US district judge Yvonne Gonzalez Rogers made the decision on the basis that when the Tesla owners bought their vehicles, they signed an \"order agreement,\" which includes an arbitration provision. This means they must follow Tesla's resolution process in the agreement. If their issues are not resolved within 60 days, they must be dealt with by an individual arbitrator, not a judge or jury, the court said, citing the agreement. The lawsuit cited a Reuters investigation, which reported Tesla had exaggerated vehicles' driving range. The report cited a source with knowledge of an early design of Tesla software, who claimed it rigged the range-estimating software on the cars' dashboards. The Reuters report, which cited archived versions of Tesla's website, said the company lowered the driving range estimates for its X, S, Y, and 3 models. It said the Model Y's range estimate was lowered from 303 miles to 285 miles. A post on Tesla's website said it's \"natural for estimated range to change, particularly over time or with a recent change in temperature.\" The company was subpoenaed by the Department of Justice for information on its driving range, Tesla disclosed in a regulatory filing last year. Tesla did not immediately respond to a request for comment from Business Insider, made outside normal working hours. Read next Jump to "
}