{
    "title": "Charged up: Tulsans share their experiences in owning electric vehicles",
    "date": "3/28/2024",
    "url": "https://www.tulsapeople.com/city-desk/charged-up-tulsans-share-their-experiences-in-owning-electric-vehicles/article_db5ac518-eb9c-11ee-8e30-a7b6d0e82fc0.html",
    "text": "Cloudy skies this morning will become partly cloudy this afternoon. High 78F. Winds S at 5 to 10 mph.. Partly to mostly cloudy. Low 64F. Winds S at 5 to 10 mph. Updated: March 30, 2024 @ 10:32 am    Editor Pete and Priscilla Sanstead have been Tesla owners since 2019 and will often use the recently installed Tesla Superchargers located in the Tulsa Hills shopping area. It’s hard to miss the increasing number of electric vehicles making their way across Tulsa intersections and down neighborhood streets. If you’re out running errands around Tulsa Hills shopping center on a Saturday, you might see Priscilla and Pete Sanstead, Tesla owners since late 2019. The couple first spotted a Tesla in Oshkosh, Wisconsin, earlier that summer. Priscilla started following Tesla groups on Facebook and watching YouTube videos — “like anything else you do in life,” she says with a laugh — before making the call and deciding to sell her 14-year-old Honda Odyssey van for a Model 3. Shortly after, the couple drove their new EV to Austin, Texas, stopping in Ardmore and Fort Worth along the way to charge, and booking an AirBnB with a destination charger. Even though the couple primarily charges at home, the supercharger network is one of the things that sold the Sansteads on making the EV jump. Pete also loves the modern Danish interior. It didn’t take long for Pete to swap his 15-year-old Toyota Prius for the Model Y. The SUV came in handy after the June windstorm and subsequent power outage. They put their Y in “camp mode” and slept in the car in comfort with air conditioning while only losing 5%-6% power overnight. According to the U.S. Department of Energy’s alternative fuels data center, Oklahoma has 1,284 public electric charging stations. In 2022, there were 16,300 EVs registered in the state, as well as 11,500 plug-in hybrid EVs and 47,000 hybrid EVs. According to Statista.com, there were 1,056,367 cars registered in the state in 2021. The Sansteads are active in multiple EV and Tesla-focused organizations, including the Oklahoma Electric Vehicles Enthusiasts, Tesla Divas, Tesla Owners of Oklahoma and Tesla Owners of Tulsa. Along with meetups in different parts of the state, Priscilla says Tesla owners tend to wave to one another or flash their lights to say hello while driving. “It’s really fun to drive, speedy, quiet, comfy and the cost of ownership is low,” Pete says. For their Model 3 he says the only maintenance and upkeep has been to rotate the tires, add windshield wiper fluid and replace the cabin air filter. Like a smartphone, Priscilla says her Tesla gets over-the-air updates that install new software features. A self-proclaimed “techie light,” Priscilla says, “I want to stay on top of tech advancements.” She’s seriously considering purchasing her third Tesla — the Cybertruck — when the time is right. Harold Briggs owns a Rivian R1T and frequently gets people asking questions about it and driving an EV while he’s about town. Another company making its mark on the EV truck market is Rivian, whose R1T has impressed owner Harold Briggs since he bought his in September 2022. When it comes to kids, family and personal needs, “I’ve always been a practical car buyer,” he says. “But now I bought a car for me.” After buying his son a truck in high school he began to love the versatility a pickup provided. Now retired, Briggs drives his Rivian around town — whether that’s to the gym, appointments or to pick up groceries. He says driving it is more fun than he ever thought and has been impressed with its significant power and its capabilities in ice and snow. Briggs also used his EV in the June outage to plug in fans to help cool his home’s interior. It was also the only time he’s had to charge away from home. For Briggs, that meant utilizing the Francis Energy supercharger at a nearby Target. Francis Energy is a Tulsa-based company focused on building and expanding the country’s EV charging network. While Briggs values his cut in emissions (“I like taking care of what God’s given us,” he says), he ultimately bought his Rivian for himself. His wife drives a traditional internal combustion engine automobile. “We’ve always had and will have a gas car,” he adds.  Editor       Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}