{
    "title": "Electric Vehicles Are Going Mainstream Whether You Like It Or Not",
    "date": "3/30/2024",
    "url": "https://www.forbes.com/sites/jamesmorris/2024/03/30/electric-vehicles-are-going-mainstream-whether-you-like-it-or-not/",
    "text": "One of the latest arguments against electric cars, at least in the UK, is that they aren’t selling well because they are only being purchased by fleet customers. Industry data in 2023 showed that 76% of BEV sales were to fleets, and only 24% to private buyers. However, this could be a misunderstanding of the sales figures. It’s certainly being used to downplay an EV market that in reality is going from strength to strength – and about to enter a new phase. You can now buy a used 2020 Tesla Model 3 for under £15,000 ($19,000). The key factor is what counts as a fleet vehicle. In the UK, “salary sacrifice” schemes have been hugely popular, because they provide the opportunity to save you thousands on owning an EV, and can even make them cheaper to buy than the equivalent internal combustion engine model. Because your car payments are deducted from your gross salary before tax, they reduce your taxable income, saving lots of money on income tax, reducing the effectively monthly payments on the car. You do still pay some tax for the use of the company car because it is considered a “Benefit in Kind” (BiK). This tax is a percentage of the new price of the vehicle you get to use as a perk from your company (even if you have sacrificed salary to get it). A few years ago, the percentage was zero for an EV, and it’s still only 2% per year for 2023-24 and 2024-25. The rate will then rise 1% per year until 2027-28, when it will reach 5%. But rates are much higher for fossil fuel cars. A typical non-hybrid car rated at 150g/km of CO2 emissions currently pays 35% BiK tax. This makes owning a non-EV through a salary sacrifice scheme almost pointless, because you don’t save any money this way. Conversely, if you can buy an EV through salary sacrifice, you’d be a fool to buy it directly yourself. You could miss out on saving thousands for the same vehicle, and some schemes even include insurance, maintenance, and other bonuses on top. Throw in the cheaper running costs, and it’s a no brainer to buy an EV this way if you have the option available. Fleet car sales are often salary sacrifice purchases in the UK. The key element here is that a salary sacrifice car counts as a company car, which means it is a fleet vehicle and is included in this category of sales data. News articles arguing that the higher fleet sales mean that the public aren’t interested in BEVs are missing the point that a lot of these sales being counted to fleets are salary sacrifice purchases being used as personal vehicles. The exact figures are hard to come by, but 61,937 of third quarter 2023 fleet sales were salary sacrifice, and 42% of Q3 fleet sales were BEVs. So that implies that the considerable skew of BEV sales to fleet buyers is likely to be cars for personal use purchased via salary sacrifice. In other words, people aren’t disinterested in buying BEVs. They’re just generally smart enough to buy them via the most cost-effective route – salary sacrifice. Whether or not EVs have been selling for personal or fleet driver use, the dramatic upswing in sales since 2019 is now starting to result in another important development that means the beginning of the end for internal combustion – the growth in secondhand sales. Most leases are for 3 or 4 years, and that’s also a typical timeframe of ownership for new cars even when not leased. Arguably, the current era of more affordable, general-purpose BEVs arrived with the Tesla Model 3 in 2018/2019, and then a whole slew of non-Tesla models arrived in 2020 and 2021. Those cars began to hit three or four years old last year, and the volume will be arriving in earnest this year and next. The Dacia Spring is arriving in the UK for under £15,000 ($19,000). Another regular criticism of BEVs is that they are too expensive. There are some very affordable options arriving at last, such as the Dacia Spring, which has been available in Europe for a few years but is only just arriving in the UK in October, priced starting at £14,995 ($19,000). But generally, it’s still true that BEVs come with a significant premium. Just look at BMW’s iX2, which starts at £11,000 ($14,000) more than the ICE X2 equivalent. However, secondhand prices are much more comparable. At the time of writing, the cheapest 2020 Tesla Model 3 on the AutoTrader website was £15,950 ($20,000) whereas the cheapest BMW 3-series was £11,530 ($14,500), with both cars having done just over 100,000 miles. So there’s still a premium for the BEV, but not so great. Naysayers are now complaining about the “loss in residual values” from BEV ownership, but this is unsurprising given the premium they had when new. You can pick up a 2004 Bentley Continental GT for £11,000 ($14,000) now, and that would have set you back at least £124,000 ($157,000) new. Unless they become prized collectable classics, premium vehicles tend to drop further than cheaper vehicles because they have further to fall. When I recently asked a Tesla employee where the $25,000 car was, he cheekily said it was already here – a secondhand Model 3. But while that was dodging the question of the delay in arrival of Tesla’s much-anticipated cheaper model, it’s also not so far from the truth. Contrary to myths, EVs are very reliable, and the batteries are now generally warrantied for eight years with over 70% capacity. So a four-year-old BEV is a very sensible purchase choice now, and it’s probably going to still be in very good shape. If you buy a used Tesla from Tesla, you generally get a warranty on the whole vehicle too, not just the battery. A secondhand Model 3 is already the $25,000 Tesla... The rise of the secondhand EV market will have other knock-on effects. One of these will be the growing importance of the home charger business. Lots of new EVs have been sold with a charger in the past, but that’s unlikely to come with the car when it’s purchased used. This is clearly being seen as an opportunity for new entrants into the charger market, with the latest being South Korean consumer electronics giant Humax, which launched into the UK market at the Everything Electric show in London this weekend. Commercial and public charging will become increasingly lucrative businesses as the market grows, too. Unexpected “black swan” events such as Covid, the cost-of-living crisis due to the war in Ukraine, and the Houthis attacking the supply chain through the Red Sea have slowed down economies and with them the adoption of new green technologies. In 2020, I expected EVs to reach parity with ICE by 2023 or 2024, so we’re behind schedule on that. But EVs are now mainstream in Europe and China, and the secondhand market is picking up pace, dragging devices like home chargers along with it. Perhaps the “point of no return” for the switch from ICE to BEV has been delayed, but it’s coming very soon now.  "
}