{
    "title": "Tesla-CATL 'Power Couple' Can Recharge US EV Market, Says Morgan Stanley \nAnalyst Adam Jonas: '...Could Be A ...",
    "date": "3/26/2024",
    "url": "https://www.tradingview.com/news/benzinga:632886f74094b:0-tesla-catl-power-couple-can-recharge-us-ev-market-says-morgan-stanley-analyst-adam-jonas-could-be-a-game-changer/",
    "text": "Morgan Stanley analyst and Tesla Inc TSLA bull Adam Jonas believes a partnership between the U.S. EV giant and Chinese battery maker CATL could be a game-changer with the ‘power-couple’ potentially recharging the U.S. EV market. What Happened: Jonas believes that the U.S. EV market is in dire need of high-quality cheaper batteries for which it needs to rely on China despite the complicated geopolitics and security concerns. While the U.S. EV market is under-penetrated, China’s is highly penetrated with an oversupply of batteries, he noted. The analyst was referring to recent reports that CATL is working with Tesla on a fast-charging battery in Nevada. Neither of the two companies have confirmed the report. However, the U.S. EV giant is looking to make a cheaper EV, expected to be priced around $25,000, and would require Chinese cooperation to enable this price point, as per Jonas. Currently, CATL cannot sell directly into the U.S. but can license their battery tech for a royalty fee. “We’ve long written about the need for the US to engage with (‘on-ramp’) Chinese EV technology to drive higher EV penetration. In our view, this will require a degree of westernization of Chinese tech to be palatable in the US given the rising protectionist sentiment (both in the US and Europe),” the note read. Jonas has a price target of $320 on Tesla and an ‘overweight’ rating. Price Action: Tesla shares closed up 2.92% at $177.67 on Tuesday. The stock is down nearly 28.5% year-to-date, according to Benzinga Pro. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Cybertruck Lead Engineer Fires Back After User Pokes Fun At Tesla’s Advice Against Auto Wash: ‘Manual Doesn’t Suggest You Shoot It Either’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @youngtraderwealth @tradingauto6 @rok_trader @johndollery @jamurai82 @forex.alex @cryptoplayhouse @Tom Killick @andyoh6666 @jackentrepreneur @Trading_Jazz @ketoryfx @Onlnternet @scott.trades @udcovers @mytradingsetup @mytradingsetup @mikeoreaofficial Whatever the trade "
}