{
    "title": "Tesla's German gigafactory reconnected to grid after week-long outage",
    "date": "3/11/2024",
    "url": "https://www.saltwire.com/cape-breton/business/reuters/teslas-german-gigafactory-could-get-power-monday-energy-firm-says-100946591/",
    "text": "SaltWire.com would like to send you notifications for breaking news alerts. Activate notifications? SaltWire.com would like to send you notifications for breaking news alerts. Activate notifications? Important information regarding Saltwire's CCAA filing STORY CONTINUES BELOW THESE SALTWIRE VIDEOS Barley Risotto and Kimchi: A Culinary Crossroads| SaltWire #food #cookingshorts #kimchi By Christoph Steitz FRANKFURT (Reuters) -Tesla's German gigafactory near Berlin has been reconnected to the electricity grid following a week-long outage caused by arson, the power firm in charge of fixing the disruption said in a statement late on Monday. The outage, which began on March 5 at the site in Gruenheide, was a result of an arson attack on a nearby power pylon for which activists from the far-left Vulkangruppe claimed responsibility. E.dis, a division of German energy network firm E.ON, said speedy weekend assembly work had enabled it to carry out a multi-hour high voltage test and get a green light from engineers. It reconnected Tesla to the grid at 8:45 p.m. local time (1945 GMT). Tesla said earlier on Monday that it would gradually start up systems in the factory, which employs around 12,500 staff, after the resumption of power. \"It is not yet possible to say how long it will take until production can be fully resumed,\" the company said in emailed comments. Tesla said last week it expected the outage to last until March 15, while the works council chief of the electric vehicle (EV) maker's Brandenburg plant said on March 8 it would restart this week, without giving a specific date. Joerg Steinbach, the economy minister in Brandenburg, said E.dis employees had been working in a three-shift mode to ensure electricity could flow as soon as possible. The outage meant Tesla could not produce around 1,000 cars a day, with the factory's head saying that the disruption would cause hundreds of millions of euros in damages. (Reporting by Christoph Steitz; Additional Reporting by Sarah Marsh; editing by Alexander Smith, Kirsten Donovan and Nia Williams) "
}