{
    "title": "Tesla China’s insurance registrations rise 9.4% to 12.8k in January’s 4th \nweek",
    "date": "1/30/2024",
    "url": "https://www.teslarati.com/tesla-china-domestic-sales-january-4th-week-results/",
    "text": "Tesla China’s domestic sales in January seem to be on a steady rise, with new vehicle insurance registrations reaching 12,800 in the week of January 22-28, 2024. The results represent a 9.4% improvement from the 11,700 registrations that were tracked in the week prior. Tesla does not report its domestic sales in China, though a general idea of the company’s performance in the local market can be inferred from new vehicle insurance registrations. Fortunately, industry watchers, as well as some automakers like Li Auto, have taken it upon themselves to track and post the EV sector’s registrations on a weekly basis. $TSLA 🇨🇳NEWS: Tesla China insured units1-7 : 3,2008-14 : 7,40015-21 : 11,700• 22-28 : 12,700 pic.twitter.com/yNv4nWznqO Considering Tesla China’s insurance registrations last week, it would appear that the company has sold 35,200 vehicles domestically between January 1 and January 28. This number is significantly lower than the 75,805 vehicles that were sold in the domestic Chinese market in December. However, Tesla tends to export vehicles in the first months of a quarter, so local deliveries in China tend to be tempered when a new quarter begins. Tesla China had an impressive December, with the company’s wholesale figures reaching 94,139 vehicles. From this number, 75,805 were sold locally and 18,334 were exported abroad, as per data from the China Passenger Car Association. Tesla China’s January 2024 wholesale figures are expected to be released sometime next week. $TSLA China weekly insured units for Jan 22-28 was a very strong 12.8K vs an avg 10.0K for Week 4 over the past year. Highest 4th week of a quarter ever. 1Q to date after 4 weeks is 35.0K +28% QoQ and +37% YoY. Source: @piloly pic.twitter.com/XZrIQxvwFb Tesla is seeing quite a lot of interest in China, and ironically enough, it is primarily due to a vehicle that has not even been released in the country. Over the weekend, Tesla formally started its Cybertruck tour in eight Chinese cities. The tours have so far been very successful, with large crowds showing interest in the all-electric pickup truck. Recent reports have also suggested that Tesla is preparing to launch the upgraded Model 3 Performance sometime in the second quarter. The vehicle, which is expected to be released with special seats, new aero parts, and a special badge, among other upgrades, is reportedly poised to be priced at around RMB 400,000 ($56,300). Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... Tesla appears to be ready to roll out wireless EV charging, according to the... While reports have emerged alleging that Giga Shanghai is slowing down on its electric... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Copyright © TESLARATI. All rights reserved. "
}