{
    "title": null,
    "date": "1/28/2024",
    "url": "https://www.businessinsider.com/elon-musk-tesla-sell-more-japan-reluctant-adopt-evs-2024-1",
    "text": "       Back in 2010, Elon Musk predicted that Japan would become Tesla's largest market outside of the US. But more than a decade later, the EV maker isn't doing as well in the country as Musk had hoped. \"There are some geographies where our market share is remarkably low, like Japan,\" Musk said in a fourth-quarter earnings call earlier this week. \"We should at least have a market share proportionate to, say, other non-Japanese carmakers like Mercedes or BMW, which we do not currently have,\" he added. But while Tesla is already up against major Japanese carmakers like Toyota, Honda, Suzuki, and Nissan, the reality is that all EV makers are struggling to make an impact in Japan. EV sales have soared in recent years in the US and Europe, but Japan has been slow to sell all-electric cars, despite being one of the world's biggest auto markets. Related stories One reason for this is that hybrids have tended to dominate the Japanese market — sales of the cars beat out the combined share of gasoline and diesel cars for the first time in 2023, Bloomberg reported. \"In Japan, hybrids are popular because they're affordable and reliable, since they don't rely on the existence of strong charging infrastructure,\" Bloomberg Intelligence senior auto analyst Tatsuo Yoshida said. And leaders appear reluctant to pivot away from this strength to battery-powered alternatives. Toyota's chairman and the head of Japan's automotive association, Akio Toyoda, has previously accused the Japanese media of exaggerating the commercial and environmental advantages of EVs, calling the benefits a \"mirage,\" per The New York Times. That hesitancy has also held back the development of charging infrastructure — there are only about 30,000 EV charging connectors in the whole country — and kept price tags higher. But Japanese carmakers do have some plans to boost their EV efforts. Toyota has said it will roll out 30 battery electric vehicle models by 2030 while Honda wants EVs and hydrogen fuel cell cars to make up 100% of sales by 2040. Tesla and Toyota did not immediately reply to Business Insider's requests for comment. Read next Jump to "
}