{
    "title": "Tesla Stock Bull Cuts Price Target As Global EV Momentum Stalls",
    "date": "1/22/2024",
    "url": "https://www.investors.com/news/tesla-stock-bull-cuts-price-target-ahead-of-earnings-as-global-ev-momentum-stalls/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     With Tesla (TSLA) stock slumping to begin 2024, as the EV giant continues to cut vehicle prices and put pressure on margins, a bull decided to slash his TSLA stock price target Monday. Morgan Stanley analyst Adam Jonas on Monday cut his TSLA price target to 345, down from 380, but kept an overweight rating on the shares. The longtime Tesla bull wrote he expects Tesla's 2024 volume and profitability outlook to be modest when it announces fourth-quarter earnings late Wednesday. \"Global EV momentum is stalling. The market is oversupplied vs. demand,\" Jonas wrote. Jonas outlined several pieces of evidence that EV supply is growing while demand is slowing. This includes Tesla continuing its strategy of offering vehicle discounts and slashing prices early in 2024 and Hertz (HTZ) announcing on Jan. 11 it is selling about one-third of its EV fleet. \"Negative developments in the global EV market very much matter to Tesla and should reasonably have a negative near-term impact on the price of the stock,\" Jonas said. Jonas values Tesla's core auto business at 75 per share, around 22% of the 345 price target. Meanwhile, Tesla began rolling out FSD Beta Version 12 to some paying customers on Sunday night. Tesla stock dropped 1.6% to 208.79 Monday during market action. On Friday, TSLA edged up 0.15% to 212.19 but fell 3% for its fifth straight weekly decline. The stock has fallen below its moving averages. Last week, Chief Executive Elon Musk posted on X, formerly Twitter, that he needs more TSLA shares and voting power before making the EV giant an AI and robotics leader. Jonas, who has issued bullish notes on Tesla's AI and robotics potential, wrote Monday that his overweight rating is \"highly dependent upon Tesla accruing value as an AI enabler.\" \"Any change of organizational or legal structure that impedes Tesla's ability to participate in the development of AI could be detrimental,\" Jonas said. The analyst consensus for 2024 EPS is down to $3.70 a share vs. $3.81 at the end of last year. It was $5.65 at the end of January 2023. TSLA shares have retreated nearly 16% in January. In the last two weeks, Tesla has tumbled below the 50-day and 200-day lines. Investors could use 265.13 and 278.98 as potential buy points. Tesla stock is technically in an awkward double-bottom base, according to MarketSmith analysis. The relative strength line, which tracks a stock's performance vs. the S&P 500, is at its lowest level since late May, according to MarketSmith. In 2023, Tesla doubled, easily outperforming the broader S&P 500 index. Tesla stock ranks fifth in the 35 member IBD Auto Manufacturers industry group. The stock has a 69 Composite Rating out of a best-possible 99. Tesla stock also has a 77 Relative Strength Rating and an 88 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla Stock A Buy Or A Sell? Stocks Near A Buy Zone Learning How To Pick Great Stocks? Read Investor's Corner MarketSmith: Research, Charts, Data And Coaching All In One Place Is Rivian A Buy Right Now With The Cybertruck Hype? Market Rally Shows Bullish Breadth; Apple Leads 6 New Buys 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}