{
    "title": "Stock market today: Asian stocks are mixed after Wall Street slips to its \nworst loss in 4 months",
    "date": "1/31/2024",
    "url": "https://apnews.com/article/stock-markets-china-fed-rates-fe589343fe63b3434e0fc66085cb0064",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. Easter 2024 FILE - A person looks at an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Friday, Jan. 26, 2024, in Tokyo. Asian shares were mixed on Thursday after Wall Street fell to its worst loss since September as the Federal Reserve indicated cuts to interest rates are not imminent. (AP Photo/Eugene Hoshiko, File) FILE - Currency traders watch monitors at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Monday, Jan. 29, 2024. Asian shares were mixed on Thursday after Wall Street fell to its worst loss since September as the Federal Reserve indicated cuts to interest rates are not imminent. (AP Photo/Ahn Young-joon, File) Specialist Anthony Matesic works at his post on the floor of the New York Stock Exchange, Wednesday, Jan. 31, 2024. Technology stocks are slumping Wednesday as several of Wall Street’s most influential stocks feel the downside of ultrahigh expectations. (AP Photo/Richard Drew)       BANGKOK (AP) — Asian shares were mixed on Thursday after Wall Street fell to its worst loss since September as the Federal Reserve indicated cuts to interest rates are not imminent. U.S. futures and oil prices rose. Hong Kong’s Hang Seng advanced, but ceded much of its early gains. It was up 0.8% at 15,601.77 while the Shanghai Composite index lost 0.4% to 2,779.15. Tokyo’s Nikkei 225 sank 0.9% to 35,975.44 and the Kospi in Seoul climbed 1.7% to 2,538.76. In Australia, the S&P/ASX 200 skidded 1.2% to 7,588.20. Bangkok’s SET rose 0.5% while the Sensex in India edged 0.1% higher. On Wednesday, Big Tech stocks burned by the downside of high expectations triggered a sharp slide. The S&P 500 dropped 1.6% for its worst day since September, falling to 4,845.65. The slide for Big Tech stocks dragged the Nasdaq composite to a market-leading loss of 2.2%. It closed at 15,164.01. The Dow Jones Industrial Average, which has less of an emphasis on tech, fell a more modest 0.8%, to 38,150.30. Alphabet was one of the heaviest weights on the market, shedding 7.5% despite reporting stronger profit and revenue for the latest quarter than analysts expected. Underneath the surface, analysts pointed to some concerning trends in how much Google’s parent company is earning from advertising. Microsoft fell 2.7% even though it delivered stronger profit and revenue than expected. One analyst, Dan Ives of Wedbush Securities, even called its quarterly report “a masterpiece that should be hung in the Louvre.”  Tesla, another member of the group of tech stocks nicknamed the “Magnificent Seven,” fell 2.2%. A judge in Delaware ruled a day earlier that its CEO, Elon Musk, is not entitled to the landmark compensation package earlier awarded to him. Three more Big Tech stocks will report results on Thursday: Amazon, Apple and Meta Platforms, the parent company of Facebook and Instagram. The Fed on Wednesday left its main interest rate steady and made clear it “does not expect it will be appropriate” to cut rates “until it has gained greater confidence that inflation is moving sustainably toward” its goal of 2%. “We’re not declaring victory at all,” said Fed Chair Jerome Powell. The Fed is unlikely to attain that level of comfort by its next meeting in March. “It’s probably not the most likely case,” he said, sending stocks skidding late in trading. Powell also said Fed officials just need to see more months of data confirming that inflation is heading sustainably lower. “We have confidence,” he said. “It has been increasing, but we want to get greater confidence.” Treasury yields in the bond market swung up and down following the Fed’s announcement. They had been lower earlier following a couple softer-than-expected reports on the economy. One report said that growth in pay and benefits for U.S. workers was slower in the final three months of 2023 than economists expected. While all workers would like bigger raises, the cooler-than-expected data could further calm what was one of the Fed’s big fears: that too-big pay gains would trigger a vicious cycle that ends up keeping inflation high. A separate report from the ADP Research Institute also suggested hiring by non-government employers was softer in January than economists expected. The Fed and Wall Street are hoping that the job market cools by just the right amount, enough to keep a lid on inflation but not so much that it causes a recession. A more comprehensive jobs report from the U.S. government will arrive Friday. The yield on the 10-year Treasury was at 3.95% early Thursday, up from 3.92% late Wednesday. It was at 4.04% late Tuesday. In October, it was above 5% and at its highest level since 2007. In other trading Thursday, U.S. benchmark crude oil gained 16 cents to $76.01 per barrel in electronic trading on the New York Mercantile Exchange. Brent crude, the international standard, added 14 cents to $80.69 per barrel. The U.S. dollar slipped to 146.88 Japanese yen from 146.92 yen. The euro fell to $1.0803 from $1.0817. AP Business Writer Stan Choe contributed. Copyright 2024 The Associated Press. All Rights Reserved. "
}