{
    "title": "History Says the Nasdaq Should Soar in 2024: Here's the Stock Cathie Wood \nThinks Will Help",
    "date": "1/9/2024",
    "url": "https://www.fool.com/investing/2024/01/09/history-says-the-nasdaq-should-soar-in-2024-heres/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More What a year 2023 was for the Nasdaq Composite index. After the technology-heavy index plunged more than 33% in 2022, it rebounded by soaring more than 43% last year. Since the index launched in 1971, the year following a rebound year (like 2023) has also been very lucrative, delivering double-digit returns. Of course, every economic backdrop is different, and there are fundamental reasons why the 2024 Nasdaq returns could differ. In fact, the first week of the year showed that some investors are selling technology and moving into dividend payers, like utilities and real estate investment trusts (REITs). But whether or not the overall index thrives again this year, there is one unique Nasdaq stock that one famous investor is now buying. There are some compelling reasons others should follow that move, but it's not without risk. Widely followed money manager Cathie Wood has been loading back up on Tesla (TSLA -2.25%) shares. Wood was a seller of Tesla for much of last year as the stock more than doubled in 2023. But the longtime Tesla bull started adding shares again at the end of the year and jumped in with both feet to start 2024. Her ARK Innovation and ARK Next Generation Internet exchange-traded funds (ETFs) combined to purchase more than 105,000 Tesla shares on the second trading day of 2024. That followed another purchase of more than 110,000 shares on Dec. 20. Wood thinks there's plenty of upside to Tesla shares. But her thesis also includes a massive deployment of self-driving robotaxis in coming years. I'm not at all convinced that will happen, but there are other potential drivers for Tesla stock to move higher. There was too much early excitement for the rate of electric vehicle (EV) sales growth. Tesla set a high bar when it guided for 50% average annual production growth for several more years. While it did grow vehicle sales by 38% and production by 35% in 2023, estimates are for an even lower growth rate for 2024. 2023's volume growth came at a cost, too. A fight for market share has cut into profit margins, leading to decreasing net income. Data source: Tesla. Chart by author. But Tesla is also one of only a few global automakers generating profits selling EVs at scale. And EVs aren't its only business. Revenue from its energy segment has grown from about $600 million in Q1 2022 to more than $1.5 billion in Q3 2023. As utilities and businesses look to deploy more energy storage facilities, that should continue to increase. The Nasdaq Composite could continue to gain ground in 2024, as has been the pattern in the past. But if the Federal Reserve does begin a cycle of cutting interest rates, it's more likely that dividend-paying stocks will become leaders in 2024. Either way, it's important to remember that the market comprises individual stocks and businesses. Tesla will continue to generate profits and expand its vehicle production and energy businesses. It has also been adding revenue from other automakers essentially being forced to utilize Tesla's charging network to entice more potential EV buyers. But these are longer-term growth plans, and Tesla will need to see profit margins rebound from either lowering costs or raising EV prices to see its stock move higher in the near term. Investors who believe in the business over many future years should look to buy the dip if the stock gives up some of its huge 2023 gains. That's what Cathie Wood is doing as the year begins. Howard Smith has positions in Tesla. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}