{
    "title": "Elon Musk says he wants 25% of Tesla stock for AI development",
    "date": "1/16/2024",
    "url": "https://www.upi.com/Top_News/US/2024/01/16/elon-musk-AI-Tesla-25-stock/1751705407362/",
    "text": "Jan. 16 (UPI) -- Tesla founder Elon Musk went public with his desire to own 25% of the electric vehicles' shares to grow its artificial intelligence and robotics sector.\nMusk, who is already the company's largest shareholder with a 13% stake, said in comments on X Monday that he would grow the products outside of the company if he is unable to secure the larger share.\nAdvertisement\n\"I am uncomfortable growing Tesla to be a leader in AI and robotics with having 25% voting control,\" Musk said on X. \"Enough to be influential but not so much that I can't be overturned. Unless that is the case, I would prefer to build products outside of Telsa.\"\nMusk went on to say that Tesla is more than an electric vehicle company and its focus should be diversification.\nRelated\nTesla to halt German production for two weeks due to Red Sea delays\nSamsung unveils updated roving, AI-powered companion robot at CES\nTesla recalls 1.6 million vehicles in China for automatic steering issue\n\"You don't seem to understand that Tesla is not one startup, but a dozen,\" Musk said. \"Simply look at the delta between what Tesla does and GM. As far as stock ownership itself being enough motivation, fidelity, and other similar stakes to me, why don't they show up for work?\"\nIn his post Monday, Musk also said Tesla's board is \"great\" and added the company was holding back on introducing a new compensation plan as a 2018 lawsuit by shareholder Richard Tornetta, alleging that a previous package that granted him billions of dollars in stock had yet to be resolved.\nAdvertisement\nHe added, however, that his effort to secure 25% of Tesla stock was \"primarily about ensuring the right amount of voting influence\" at the company.\n\"If I have 25%, it means I am influential but can be overridden if twice as many shareholders vote against me versus for me,\" he said.\nMusk currently holds about 411 million shares of Tesla which has 3.19 billion in common stock outstanding, according to third quarter financial filings.\nHe previously had a greater share in the company, but dumped nearly 95 million shares of stock worth about $22.93 billion in 2022, largely to facilitate his purchase of X, the social media company then known as Twitter.\nAt the time, Musk had predicted, that Tesla's work in AI and robotics would become more valuable to the country than its electric car and automated driving divisions and he late last year described Tesla as \"an AI/robotics company\" in a post on X.\nThe company has already spent billions in AI initiatives. Tesla has pumped a significant amount of money into the humanoid prototype robot Optimus and spent more than $1 billion on the self-driving system supercomputer Dojo.\nLast November, Musk testified in a trial over his compensation package from Tesla in Delaware. A shareholder sued Musk and Tesla, charging that the Tesla board breached its fiduciary duty, calling Musk's pay as CEO excessive.\nAdvertisement\n\n\n\nTopics\nBusinessElon MuskTESLA Motors\n\n\n\n\n\n\nLatest Headlines\n\n\n\n\n\n\n\nU.S. News // 27 minutes ago\nTrump, Giuliani, others appeal to remove Willis and dismiss Georgia case\n March 30 (UPI) -- Former President Donald Trump, Rudy Giuliani and seven co-defendants say a Georgia judge erred in allowing Fulton County District Attorney Fani Willis to continue her racketeering case against them.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 1 hour ago\nReport: Biden administration makes new arms transfer to Israel\n March 30 (UPI) -- The Biden administration has approved the transfer of more bombs and fighter jets to Israel even after voicing its disapproval of a planned new ground offensive in southern Gaza, according to published report.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 2 hours ago\nMajor storm to drench Southern California on Easter weekend\n  A potent storm will grab Pacific Ocean moisture and fling it at Southern California as multiple rounds of heavy rain and gusty thunderstorms into Easter Sunday, forecasters say.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 1 day ago\nAs largest crane on East Coast arrives, Baltimore bridge collapse cleanup underway\n March 29 (UPI) -- The biggest crane on the eastern seaboard arrived Friday in Baltimore as cleanup efforts get underway to clear the Patapsco River of wreckage after this weeks Francis Scott Key Bridge collapse.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 18 hours ago\nCalif. Gov. Gavin Newsom says 480 street cameras to be installed in Oakland, East Bay\n March 29 (UPI) -- California Gov. Gavin Newsom on Friday announced a contract to install 480 high-tech cameras in Oakland and East Bay to battle crime.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 19 hours ago\nKia recalling 427,000 Telluride SUVs over parking safety concerns\n March 29 (UPI) -- Kia is recalling 427,000 of its Telluride SUVs over concerns that the vehicles can keep rolling after being parked, according to the National Highway Traffic Safety Administration.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 19 hours ago\nUSNS Harvey Milk completes maiden voyage to San Francisco\n March 29 (UPI) -- The U.S. Navy ship named after gay rights icon Harvey Milk made its first voyage through the Golden Gate Bridge and docked in San Francisco Thursday.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 1 day ago\nBiden says government working to free Gershkovich 1 year after arrest by Russia\n March 29 (UPI) -- President Joe Biden said that diplomats are continuing to work on gaining freedom for Wall Street Journal reporter Evan Gershkovich on the first anniversary of his arrest by Russian authorities.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 20 hours ago\nJudge grants N.J. Rep. Andy Kim injunction tossing state 'county line' ballot design\n March 29 (UPI) -- Federal Judge Zahid Quraishi Friday eliminated a New Jersey ballot design that gave party-backed candidates an advantage in the June primary.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 20 hours ago\nDemocratic senators raise concerns over ICE solitary confinement\n March 29 (UPI) -- Twelve senators signed a letter Friday to Homeland Security Secretary Alejandro Mayorkas expressing concern over alleged solitary confinement policy violations by U.S. Immigration and Customs Enforcement. Jan. 16 (UPI) -- Tesla founder Elon Musk went public with his desire to own 25% of the electric vehicles' shares to grow its artificial intelligence and robotics sector. Musk, who is already the company's largest shareholder with a 13% stake, said in comments on X Monday that he would grow the products outside of the company if he is unable to secure the larger share.\nAdvertisement \"I am uncomfortable growing Tesla to be a leader in AI and robotics with having 25% voting control,\" Musk said on X. \"Enough to be influential but not so much that I can't be overturned. Unless that is the case, I would prefer to build products outside of Telsa.\" Musk went on to say that Tesla is more than an electric vehicle company and its focus should be diversification.\nRelated\nTesla to halt German production for two weeks due to Red Sea delays\nSamsung unveils updated roving, AI-powered companion robot at CES\nTesla recalls 1.6 million vehicles in China for automatic steering issue \"You don't seem to understand that Tesla is not one startup, but a dozen,\" Musk said. \"Simply look at the delta between what Tesla does and GM. As far as stock ownership itself being enough motivation, fidelity, and other similar stakes to me, why don't they show up for work?\" In his post Monday, Musk also said Tesla's board is \"great\" and added the company was holding back on introducing a new compensation plan as a 2018 lawsuit by shareholder Richard Tornetta, alleging that a previous package that granted him billions of dollars in stock had yet to be resolved.\nAdvertisement He added, however, that his effort to secure 25% of Tesla stock was \"primarily about ensuring the right amount of voting influence\" at the company. \"If I have 25%, it means I am influential but can be overridden if twice as many shareholders vote against me versus for me,\" he said. Musk currently holds about 411 million shares of Tesla which has 3.19 billion in common stock outstanding, according to third quarter financial filings. He previously had a greater share in the company, but dumped nearly 95 million shares of stock worth about $22.93 billion in 2022, largely to facilitate his purchase of X, the social media company then known as Twitter. At the time, Musk had predicted, that Tesla's work in AI and robotics would become more valuable to the country than its electric car and automated driving divisions and he late last year described Tesla as \"an AI/robotics company\" in a post on X. The company has already spent billions in AI initiatives. Tesla has pumped a significant amount of money into the humanoid prototype robot Optimus and spent more than $1 billion on the self-driving system supercomputer Dojo. Last November, Musk testified in a trial over his compensation package from Tesla in Delaware. A shareholder sued Musk and Tesla, charging that the Tesla board breached its fiduciary duty, calling Musk's pay as CEO excessive.\nAdvertisement "
}