{
    "title": "Tesla Q4 earnings preview: What investors are expecting",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/video/tesla-q4-earnings-preview-investors-222050716.html",
    "text": "Tesla (TSLA) will report its fourth-quarter earnings after the closing bell on Wednesday, with analysts forecasting revenue of around $25.9 billion and adjusted earnings per share of $0.74. The print comes amid recent stock pressure and controversy over CEO Elon Musk's demands for more shares. Yahoo Finance's Pras Subramanian discusses what he will be focusing on — including Tesla's EV delivery figures and margins — alongside Josh Schafer and Alexandra Canal. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith PRAS SUBRAMANIAN: Looking ahead to Wednesday, after the bell, for me, it's Tesla. Tesla investors, fanboys, and the haters, and short sellers, eagerly awaiting what the company will report tomorrow night. Revenue expected to come in at $25.87 billion, a 6% jump from a year ago, with adjusted EPS coming in at $0.73 or thereabouts. Now big things to watch here, I'm watching here the delivery target for 2024, price cuts versus the profit debate, and of course, Elon Musk's pay situation. I mentioned that big sort of discussion there with what they're going to do with pricing and profitability. That's a margin question, like you mentioned with Netflix. We might see a little bit of a bump up there in margins, potentially, finally, a trough. That's a big thing people want to watch for. And then, of course, that Musk's pay package, tweeting about how you want more control of the company, otherwise he'll take the AI ventures outside the company. What he's talking about is he wants more shares. That's a compensation issue. That's a big problem if you're asking for demanding more shares and you're on the board too. ALEXANDRA CANAL: Yeah, we were talking about this during the break. It got me thinking about Disney because CEO Bob Iger, his pay has come under some scrutiny. And one of the main sticking points with this Nelson Peltz proxy fight is that Iger and members of the board do not have that much stock comparatively. So apparently, they don't have as much skin in the game. Now, Musk wants more skin in the game. So that just reminded me of what's going on. PRAS SUBRAMANIAN: Is that what Peltz wants to hear, right? ALEXANDRA CANAL: That's what Peltz wants to hear. JOSH SCHAFER: I'm just fired up to see the stock action. Tesla is one of those stocks that's just always fun to watch on newsy days. And when you take a look at Tesla year-to-date, the stock's been awful. The top 20 stocks have absolutely ripped and carried the market to start January. That's why the S&P is at a record high. And the one stock that has not helped that narrative has been Tesla stock. And I'm wondering, Pras, if we do get that margin trough, if we do see beats on the top and bottom line, what's kind of the reaction? When you look kind of broadly at the S&P 500, the reactions haven't been that strong for companies that have beat. The average coming into the day with a little bit over 10% of the index reporting, so not a ton. But you're getting beats of about 0.7-- or sorry, rises of about 0.7%, if a company beat on both the top lines. And then if you miss, you can see, pretty heavily scrutinized here, down 1.8% if you missed on both. So I think, broadly, I'm just curious, investor sentiment, investor appetite, for what we know is a popular retail name in Tesla. PRAS SUBRAMANIAN: So a few things, right? So the stock is down around 15%, compared to the S&P up around 2% or so this year. A lot of the estimates for Tesla have been coming down as we enter earnings. So there might be a bit of a surprise to the upside there, potentially, right? Stock down a lot, earnings estimates have come down, maybe they can beat there. But if you see some good things, talking about Cybertruck, talking about AI initiatives, talking about the margin trough, we hit that 18% gross margin. Those are the catalysts that can move the stock a lot higher. Look at Netflix and Tesla, very similar, they move a lot on earnings. The next-day move is what we need to watch, though. ALEXANDRA CANAL: What do you think is the biggest catalyst? Like, what do you think investors really want to see in this report in particular? PRAS SUBRAMANIAN: I mean, I don't think we're going to hear, but if Musk says we're done with price cuts, we're done with that. We're good where we are right now. We're going to focus more on profitability. ALEXANDRA CANAL: The margins. PRAS SUBRAMANIAN: Yeah. We're going to get probably a 2.2 million, 2024 delivery target, which is a bit lower than what we think that they wanted, based on their 50% cap rate. But it might be better for them, more profitability, not so much volume. Don't sacrifice profits for volume. JOSH SCHAFER: All right, Pras is going to be looking at those fundamentals. I just want to hear if the Cybertruck is getting a price cut, so maybe we can get in on that action. But I don't know if that's going to be happening quite yet, guys. Related Quotes "
}