{
    "title": "Elon Musk Tells Tim Cook He's Looking Forward To 'Trying' Apple Vision Pro \nHours After Taking A Swipe At",
    "date": "1/21/2024",
    "url": "https://www.benzinga.com/news/24/01/36710585/elon-musk-tells-tim-cook-hes-looking-forward-to-trying-apple-vision-pro-hours-after-taking-a-swipe-a",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Just hours after Tesla Inc. TSLA and SpaceX CEO Elon Musk took a swipe at mixed reality headsets, the billionaire seems to have changed his mind. What Happened: Over the weekend, when a user on X, formerly Twitter, shared a meme depicting how people in the 90's wanted their kids to not sit too close to the TV, Musk seemed to agree. The indication was clear. While people in the 90s were concerned about eye strain, modern-day users are not. In fact, with technologies like Apple Inc.'s AAPL Vision Pro and Meta's Quest lineup, that thinking has been replaced with TV “on your nose.\" See Also: Elon Musk Takes A Dig At BCG Ranking Tesla Behind Apple In Most Innovative Companies Of 2023 List: ‘The Amazing Part Is…’ However, in less than 24 hours, the entrepreneur seemingly took a U-turn. When Apple CEO Tim Cook took to X and announced that Vision Pro's pre-orders had begun, Musk took little time to express his desire to try the new headset. Some people in the comment section were curious to know if Musk pre-ordered the headset and if he would share his review later on, while others shared the previous meme comparing the '90s and today's era, possibly suggesting that they are still not fully onboard with the idea of headsets. The device is scheduled for launch on Feb. 2. Why It's Important: Priced at $3,499, the Apple Vision Pro falls on the higher end of the cost spectrum. However, this hasn’t dampened the excitement surrounding the headset among both tech enthusiasts and investors. It was previously reported that Apple, based in Cupertino, California, could prioritize its wearable business, including the Vision Pro, over its flagship and most successful product, the iPhone this year. However, given the price of Vision Pro, there are concerns among tech analysts about how much the product will be able to increase Apple’s revenue. However, Deepwater Asset Management managing partner Gene Munster previously said that eventually, 10% of Cupertino’s revenue would come from Vision Pro. Image Via Shutterstock Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Elon Musk Tried To Sell Tesla To Apple — But CEO Tim Cook Refused To Even Meet With Him: ‘You Know, I’ve Never Spoken To Elon. I Don’t Remember It Being Like That. But He Said That He Did, And So I Assume That’s Correct.’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}