{
    "title": "Elon Musk compares the AI race to playing poker — you need to spend \nbillions every year just to sit at the tab",
    "date": "1/29/2024",
    "url": "https://www.businessinsider.in/tech/news/elon-musk-compares-the-ai-race-to-playing-poker-you-need-to-spend-billions-every-year-just-to-sit-at-the-table/articleshow/107235926.cms",
    "text": "Liked the article? Share it with your friends... or copy link Elon Musk has compared the AI arms race to a high stakes game of poker, with companies needing to spend billions on AI hardware just to stay competitive. The billionaire said that Tesla would spend more than $500 million on Nvidia AI chips alone in 2024 — but he warned that it would need \"several billion dollars\" worth of hardware just to keep up with its biggest rivals. \"$500M, while obviously a large sum of money, is only equivalent to a 10k H100 system from Nvidia,\" said Musk in a post on X. \"Tesla will spend more than that on Nvidia hardware this year. The table stakes for being competitive in AI are at least several billion dollars per year at this point,\" he added. The world's largest tech companies are all scrambling to get their hands on as many Nvidia H100 GPUs as possible right now. The microchips, which are estimated to cost between $25,000 to $30,000 apiece — or $40,000 on eBay — are vital for building and training the large language models that power chatbots like ChatGPT. Earlier this month, Meta CEO Mark Zuckerberg told The Verge that Meta was building a huge stockpile of GPUs, with the company aiming to amass a total of 600,000 chips by the end of the year. Musk is aiming to build his own stockpile, saying in a post on X that Tesla will buy chips from both Nvidia and its rival AMD this year. The billionaire previously said on X that Tesla is an AI and robotics company rather than a carmaker. Earlier this year, he said that the electric vehicle giant is planning to spend more than $1 billion to build a giant \"Dojo\" supercomputer. But Musk has also cast doubt over Tesla's AI push in recent weeks. In a post on X, he said he was \"uncomfortable\" building up Tesla's AI capacity without having more control of the company. The SpaceX founder also owns xAI, a dedicated AI company that he started last year as a rival to ChatGPT-developer OpenAI. xAI, which released its own foul-mouthed chatbot Grok last November, has reportedly been raising funding in a bid to be valued at $20 billion — though Musk has denied this is the case. Tesla did not immediately respond to a request for comment from Business Insider, made outside normal working hours. Advertisement "
}