{
    "title": "Tesla Cybertruck Owners Say It's Starting to Rust After Rain",
    "date": "2/15/2024",
    "url": "https://www.entrepreneur.com/business-news/tesla-cybertruck-owners-say-its-starting-to-rust-after-rain/469823",
    "text": "Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            Jyoti Mann\n          \n                                                    •\n            \n            \n              Feb 15, 2024 Share This story originally appeared on Business Insider. Some Tesla owners say their Cybertrucks are starting to rust after being caught in the rain. In a post on the Cybertruck Owners Club forum, a member with the username Raxar wrote that they'd collected their vehicle on February 1 — and were warned that day that rain could cause it to rust. \"The advisor specifically mentioned the Cybertrucks develop orange rust marks in the rain and that required the vehicle to be buffed out,\" the forum member wrote. \"I know I heard the story of never take out your Delorean in the rain but I just never read anything about rust and Cybertrucks.\" In another post, Raxar said the car started developing rust spots after just two days in the rain. The user also shared photos of what they said were small specks of rust on the car's stainless-steel body. The user said the photos were taken after a \"dish soap wash.\" According to Mead Metals, a Minnesota metal services company, stainless steel is prone to rust in certain environments. A blog post on its website says that rust is often a result of water exposure, although it can also be caused by \"exposure to damaging chemicals, saline, grease, or prolonged exposure to heat.\" Vertigo3pc, another Cybertruck Owners Club forum member, wrote on Monday that they took their Cybertruck to a service center to have it checked out after experiencing rain in Los Angeles. \"I noticed the corrosion was forming on the metal like other people have noted,\" they wrote, \"so I decided to start documenting it and bringing it to Tesla's attention.\" The forum member added that a service center worker \"documented the corrosion\" and said they could repair the damage. Vertigo3pc also posted images of what they said were corrosion spots on the Cybertruck. \"The spots are definitely everywhere in the metal,\" they said. Elon Musk said the Cybertruck was \"literally bulletproof\" with its \"ultrahard stainless-steel\" body when he revealed the electric vehicle in 2019.  Elon Musk at a Cybertruck event. Tesla via BI In a post on X from September, Musk said Tesla might be able to offer owners an option to get tungsten-carbide coating, a ceramic material that helps protect against corrosion. He added that the coating was \"basically scratch-proof to everything below diamond hardness.\" In two YouTube videos, the posters claimed to have access to the Cybertruck's owner's manuals (which Tesla hasn't shared publicly). The materials the videos show say the EV doesn't have \"a clear coat\" on its exterior stainless-steel body. The videos give a glimpse of the apparent owner's guide, which says: \"To prevent damage to the exterior, immediately remove corrosive substances (such as grease, oil, bird droppings, tree resin, dead insects, tar spots, road salt, industrial fallout, etc.).\" Tesla didn't immediately respond to a request for comment from Business Insider, made outside normal working hours.   Want to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join. DEI shouldn't be just a buzzword. Recently unsealed court documents detail \"Project Ghostbusters,\" Meta's project to work around Snapchat's end-to-end encryption to intercept data. With Headway Premium, you can gain knowledge at a rapid rate. Southern District of New York Judge Lewis Kaplan said that the loss amount to the victims of Bankman-Fried's crimes surpassed $550 million. Everything Tom Rinks touched turned to gold until he took on a brand launch at Target that fizzled. Then, he found a creepy doll on Ebay, and he saw a way forward. Using these simple but effective approaches will help a person in their business, life and relationships. Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  "
}