{
    "title": "Tesla Cybertruck owners claim $80K, stainless steel vehicles developed \n'corrosion,' 'rust': reports",
    "date": "2/18/2024",
    "url": "https://nypost.com/2024/02/18/business/tesla-cybertruck-owners-claim-80k-vehicles-rust-corrode/",
    "text": "Thanks for contacting us. We've received your submission. Two Tesla Cybertruck owners voiced their concerns over their discovery that their expensive electric trucks had quickly developed “corrosion” and “orange rust marks.” Tesla-owner Will posted on the Cybertruck Owners Club forum that he began documenting the “corrosion” on his new Cybertruck. He said he noticed his new vehicle had developed rust marks after just eleven days of ownership. He said that he had 381 miles on it when he first discovered the odd specks. “I received my AWD Cybertruck on February 1, 2024,” Will said. “Throughout the LA rain, I noticed the corrosion was forming on the metal like other people have noted, so I decided to start documenting it and bringing it to Tesla’s attention. I figured it was already on their radar, but I want it attended to under the warranty.” The Tesla owner said he brought his truck to a service facility and that they washed the exterior to ensure the marks were not merely “specks of dirt” but actual rusting. At the facility, the man said that he was told by a Tesla employee that while they had a procedure on how to fix the rusting issue, they did not have the tools on hand to immediately fix it. He was told they would give him a call when the supplies arrived at the service facility. Another Cybertruck-driver, named Max, echoed Will’s experience. In the same Tesla forum, Max wrote that he picked up his new Cybertruck in Dublin, California and drove it up to Sacramento in the “pouring rain” on Feb. 1. Upon completing the over 2-hour drive, he claimed that he found a “bunch of tiny orange specks and a few water spots” along the exterior of his brand-new vehicle. “I picked it up in Dublin yesterday, it was pouring raining, drove it up to Sacramento and there’s a bunch of tiny orange specks and a few water spots,” Max said. “The orange dots aren’t huge, they’re very tiny, but they’re apparent. Sure I haven’t washed the car yet but it’s only been two days in the rain.” He said that he was “explicitly” told that the trucks “develop orange rust marks in the rain and that required the vehicle to be buffed out.” “I know I heard the story of never take out your Delorean in the rain, but I just never read anything about rust and Cybertrucks,” Max wrote. Sign up to get the best stories straight to your inbox. Please provide a valid email address. By clicking above you agree to the \t\t\t\t\tTerms of Use\n\t\t\t\t\t and \t\t\t\t\tPrivacy Policy. Never miss a story. According to Tesla’s website, the electric truck boasts an “ultra-hard stainless-steel exoskeleton” where every “component is designed for superior strength and endurance, from stainless-steel structural skin to Tesla armor glass.” The monochrome exoskeleton is also designed to reduce dents, damage and long-term corrosion, Tesla said. According to Tesla, the Cybertruck’s low center of gravity will give drivers “extraordinary traction control and torque”, allowing the vehicle to accelerate from 0-60 mph in 2.9 seconds with up to 500 miles of range. The truck was also designed to handle up to 3,500 pounds of payload with a towing capacity of over 14,000 pounds for both the “rugged to refined”, Tesla said, while including on-board power and compressed air. Tesla did not respond to Fox Business’ request for comment. Advertisement "
}