{
    "title": "Tesla screwed a Black-owned bakery out of $16000 during Black History \nMonth: 'It felt like we didn't matter'",
    "date": "2/23/2024",
    "url": "https://fortune.com/2024/02/23/tesla-black-owned-bakery-black-history-month/",
    "text": "A baker in San Jose, Calif., blasted Tesla on Wednesday after the electric car company ordered $16,000 of pies for a Black History Month event, only to cancel the order on short notice and leave her out thousands of dollars. The Giving Pies owner Voahangy Rasetarinera wrote on Instagram that Tesla approached her bakery on Feb. 14 with an order of 2,000 mini pies to be delivered the following week. That afternoon, despite receiving a quote and getting approval for the order, Rasetarinera did not get payment from Tesla’s vendor City Flavor, where the order was redirected. Instead, she got a call from her Tesla point person after 9 p.m. the next evening asking her to double the order, she said on Instagram. By the end of the week, Rasetarinera still had not gotten payment. To make matters worse, the next time her Tesla contact reached out, it was to say that Tesla no longer required the order. “This abrupt reversal left me reeling, realizing the extent of the impact on my small business,” she wrote. “I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry.” Tesla and City Flavor did not respond to Fortune’s requests for comment. Read more: Black bakery owner jilted by Tesla credits Elon Musk effect with surge in business: ‘You either love him or hate him’ The Giving Pies has a cancellation policy, but because Tesla had not paid the invoice, Rasetarinera was not able to recover the $2,000 the bakery lost working on the order. Rasetarinera had employees work extra hours to fulfill the order, and she bought pricier vegan supplies and turned down three other Black History Month catering opportunities to make time for Tesla’s order. This was the first time Rasetarinera had received an order from Tesla, she said — City Flavor had reached out to the bakery with a catering job last year for a Black History Month event, but turned down Rasetarinera’s quote. The baker told Fortune that a Tesla representative reached out to her on Wednesday to apologize, saying the original point person did not have the authority to promise to pay her. The representative invited Rasetarinera on a factory tour and offered her an opportunity to cater two Tesla events in March. Rasetarinera, who is Black, told Fortune that the snub had nothing to do with racism and that it was just a miscommunication. Still, there is a deep irony in the carmaker’s snub of a Black-owned business during Black History Month—coming on the heels of multiple accusations of racism against the company. The Equal Employment Opportunity Commission sued Tesla in September, accusing the company of tolerating anti-Black racism and retaliating against Black employees who spoke out. The suit claimed that in instances as early as 2015, non-Black employees at Tesla’s Fremont facility repeatedly used racial slurs. In April, Tesla paid a Black former employee $3.2 million after a federal jury in San Francisco ruled that the EV company did not condemn severe racial harassment in a California factory. Tesla also came under fire last month for ditching diversity language in its annual report right before Black History Month. In its report released Jan. 24, Tesla removed language in the “Human Capital Resources” section that read, “With a majority-minority workforce, empowering our employee resource groups to take charge in driving initiatives that attract, develop and retain our passionate workforce is vital to our continued success.” Tesla published its first diversity, equity, and inclusion report in 2020 and has included diversity information in the “Employees” section of their annual report since 2021, adding 606 words that year, including outlining efforts to “attract a pool of diverse and exceptional candidates and support their career growth.” While the 2023 report includes a statement about Tesla not tolerating harassment or discrimination on any basis, the section no longer includes any diversity information, Quartz reported. The removal of diversity language in the report follows Tesla CEO Elon Musk’s criticism of diversity, equity, and inclusion, which he called “propaganda words” and “literally the definition of racism.” But Musk also wields DEI-oriented language to bolster his own arguments. On Friday, Musk called Google’s now-suspended AI model Gemini an “insane, racist, anti-civilizational programming” after it generated historically inaccurate images, such as a woman pope and a Black U.S. founding father. Musk posted on X that a Google executive reached out to him in response to the criticism. “He assured me that they are taking immediate action to fix the racial and gender bias in Gemini,” Musk wrote. “Time will tell.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}