{
    "title": "Does Elon Musk Deserve His Billions?",
    "date": "2/7/2024",
    "url": "https://nationalinterest.org/blog/reboot/does-elon-musk-deserve-his-billions-209185",
    "text": "While charismatic leaders like Elon Musk receive the lion’s share of attention, many of us would surely prefer to have a boss who is less grandiose and more modest in their leadership style. Maybe the Tesla directors who agreed to pay Elon Musk US$56 billion were just feeling generous. Or maybe, as the judge who canceled this “unfathomable” deal suggested, they really were “starry-eyed” and swayed by Musk’s “superstar appeal”. In her ruling, Kathaleen McCormick said those who decided to give Musk the biggest pay cheque in corporate history could have been “swept up by the rhetoric” surrounding one of the world’s best-known CEOs. Certainly Musk – and his style of leadership – seems to be constantly in the spotlight. The German sociologist Max Weber (1864-1920) might have described his leadership style as “charismatic”. Weber saw charisma as the possession of a particular type of authority which stemmed from admirers attributing extraordinary qualities to a single person. He said such leaders, whether they worked in politics or industry, appeared to have a “gift of grace” (from the Greek origins of the word “charisma”) – a special something which sets them apart, and allows them to create change in a way that would be impossible for lesser mortals. My research suggests that charismatic leadership seems to be enjoying a renaissance, having fallen out of fashion over the past two decades. Charismatic leaders used to be everywhere. They seemed to be the ideal of big business in the West from the late 1970s until the turn of the century. In the US, for example, Lee Iacocca was often credited as being the savior of Chrysler for making the car manufacturer profitable after it had been on the verge of bankruptcy. Similarly, Jack Welch, as CEO of General Electric, was famous for his management style and merciless cost-cutting, which preceded extraordinary growth at the company founded by Thomas Edison and J.P. Morgan. In the UK, the likes of Richard Branson and Alan Sugar were celebrated as characterful innovators who made large amounts of money. But a series of business scandals during the early 2000s – such as the collapse of Enron and telecommunications giant WorldCom – saw charismatic leadership start to fall out of favor. This trend was accelerated by the global financial crisis in 2008, and a growing awareness about climate change and gender inequality – issues which seemed to call for new, more responsible, and democratic styles of leadership. So, the charisma-based model of management went out of fashion, replaced by leadership styles described as “authentic” (leaders who are true to themselves) or “shared”, when leadership is a deliberately collective endeavor. The CEOs of the most famous global companies ten years ago, such as ExxonMobil and Walmart, were not household names. But today, the bosses of corporations such as Meta, Amazon, and Tesla are world-famous. So why the change? Partly, this came about after the economic boom following the 2008 global financial crisis saw tech firms rapidly increase in value – success that was often credited to the founder. Figures such as Jeff Bezos and Sam Altman came to be perceived as entrepreneurial heroes rather than “mere” CEOs, increasing their prominence and public profiles.  Another factor comes from living in a time of crisis. The Harvard sociologist Rakesh Khurana warned back in 2002 that the adulation enjoyed by some charismatic CEOs as “saviors” distracts us from other people’s contribution to a particular company’s success. The search for Khurana’s “savior” figures seems to offer a simple escape route from worries over climate change, war, and economic turbulence. When Musk fantasizes about saving humankind by colonizing space, and the disgraced crypto entrepreneur Sam Bankman-Fried proposes the eradication of world poverty, they present themselves as redemptive figures to audiences beyond their investors and employees. Furthermore, in a world increasingly reliant on algorithms, business has become somewhat dehumanized. People may be yearning for leadership with a (super)human face. None of this means, however, that charismatic leaders will attain the same degree of dominance they did in the 1980s and ’90s. If the charismatic leader is making a comeback, it is a comeback on a more crowded stage. They may be popular in certain circles, but so too is the leader as a champion of diversity, or ethics, or human relationships.  While charismatic leaders receive the lion’s share of attention, many of us would surely prefer to have a boss who is less grandiose and more modest in their leadership style. That could be someone like Mary Barra at General Motors or Lars Fruergaard Jørgensen at Danish pharmaceutical company Novo Nordisk. Or it could be one of the countless leaders whose names do not appear in the media nearly every day. As a recent biography of Musk shows, the Tesla boss holds history-defining influence via his business interests in a social media platform, satellite technology, and cars. So, perhaps the big question is how we can best moderate the enormous concentration of power accumulated by some charismatic leaders. Cutting US$56 billion from an enormous personal fortune might be a step in the right direction. Sverre Spoelstra is Associate professor, Copenhagen Business School, Lund University. This article was first published by The Conversation. Image Credit: Shutterstock. © Copyright 2024 Center for the National Interest All Rights Reserved "
}