{
    "title": "In Elon Musk Tesla pay package lawsuit, lawyer cried during deposition",
    "date": "2/1/2024",
    "url": "https://qz.com/elon-musk-tesla-pay-lawsuit-todd-maron-1851217016",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters You want your lawyer to be on your side. The more passionate they are, the better. If they’re so passionate they can’t control their emotions, though, you might be in trouble. That’s exactly what happened to Elon Musk in a recent court case. Todd Maron, former General Counsel for Tesla and the billionaire’s former divorce attorney, broke down crying over his love for Elon during a deposition about how much the billionaire got paid. The waterworks came amidst the most devastating financial blow of Musk’s career. On Tuesday, a Delaware court struck down his $56 billion compensation package at Tesla. In a scathing opinion, Judge Kathaleen McCormick said the process of approving the CEO’s pay was “deeply flawed” and unfair to Tesla’s shareholders. “Musk controlled Tesla” through a series of incestuous relationships with the same people who were supposed to be representing the company’s interests, McCormick wrote. McCormick cited Maron’s weeping as a key example. Maron wrote many of the documents that Musk’s legal team highlighted to show the process of negotiating his compensation was fair. But Maron was so beholden to the CEO that his “admiration for Musk moved him to tears during his deposition,” McCormick wrote. That’s a problem. A company’s General Counsel isn’t the CEO’s lawyer; they’re supposed to represent the company’s interests. It seems like that wasn’t the situation at Tesla, however. In fact, Maron was the primary middleman between Musk and the committee that determined his pay, and Maron didn’t seem clear whether he was on Tesla’s side or Musk’s. Maron didn’t just cry at the deposition. Apparently, he was holding back tears when he testified about leaving Tesla during the trial, calling it “the most difficult decision” he ever made in his life. Maron and Tesla did not immediately respond to requests for comment. It wasn’t just Maron. Musk had a 15-year relationship with Ira Ehrenpreis, who chaired the committee that determined the CEO’s compensation. Antonio Gracias, another member of the compensation committee has a 20-year business relationship with Musk, and they’re such good friends that the two even go on vacation together. All that could make for a conflict of interest. According to the judge, that’s exactly what happened. A publicly traded company has a legal responsibility to maximize the money it’s making for shareholders. Presumably, that includes negotiating the lowest possible salary for an employee—or at least a reasonable one—whether that employee is the CEO or a janitor. But the negotiation for Musk’s compensation was a “cooperative” process, Maron told the court. “We were not on different sides of things,” Ehrenpreis said, and Gracias admitted there was no “positional negotiation” over the size and structure of Musk’s compensation. That’s surprising given the fact that when Tesla awarded Musk 20.3 million stock options in 2018, worth $55.8 billion dollars at the time, it was the biggest compensation package in the history of business. Judge McCormick said this “unfathomable sum” wasn’t calibrated to match what Tesla got in return. McCormick said Musk alone determined the value of his compensation, a figure that had “no relation to Tesla’s goals.” A lot of Tesla’s shareholders, many of whom bought into the company because of their passion for Elon Musk, were perfectly fine with how much the CEO got paid. But Richard J. Tornetta, a drummer in a thrash metal band and a man who owns Tesla stock, thought the compensation for Musk and the rest of the board was unfair. He sued Tesla, and after a lengthy court battle, the Delaware court system agreed. A lot of businesses are incorporated in Delaware because, among other benefits, the state has a generous tax system. But a peculiarity of Delaware law allowed the case against Musk and Tesla to go through, something that might not have happened in other states. That’s something Musk latched onto after the news about the case. “Never incorporate your company in the state of Delaware,” Musk said in a tweet on Tuesday. He posted a poll, asking X/Twitter users what they thought about the matter, a classic decision-making process recommended by most business schools. “Should Tesla change its state of incorporation to Texas, home of its physical headquarters?” Musk asked in the poll. Just over 87% of the 1.1 million people who voted said yes. “The public vote is unequivocally in favor of Texas!,” Musk tweeted. “Tesla will move immediately to hold a shareholder vote to transfer state of incorporation to Texas.” This article originally appeared on Gizmodo. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}