{
    "title": "Joe Rogan Shares His First Electric Car Experience Crediting Elon Musk for \nIncredible Accomplishment With Tesla",
    "date": "2/27/2024",
    "url": "https://www.essentiallysports.com/ufc-mma-news-joe-rogan-shares-his-first-electric-car-experience-crediting-elon-musk-for-incredible-accomplishment-with-tesla/",
    "text": "Latest NBA NFL NASCAR Golf Tennis ES Fancast Latest NBA NFL NASCAR Golf Tennis ES Fancast Home UFC Follow Us via Imago Image Credits: Imago The Joe Rogan Experience podcast could quite easily be one of the most popular podcasts in the world. Given the number of viewers it has and the fact that it doesn’t really budge from the No. 1 position on Spotify, given all its fresh topics, it is just another testament to the popularity of the podcast. During a podcast episode of Joe Rogan Experience with Aaron Rodgers that aired earlier this month, the two talked delved into the evolution of the motor industry. However, their conversion to how electric cars took over has piqued the interest of quite a lot of people. ADVERTISEMENT Article continues below this ad On episode 2099 of the JRE podcast, Joe Rogan and Aaron Rodgers talked about how electric motors took over despite being heavily criticized in the early years. Rogan mentioned the documentary “Who Killed the Electric Car” as they talked about how the concept was scrapped back in the ’90s and early 2000s. March 24, 2024 01:03 PM EDT March 29, 2024 09:33 AM EDT March 30, 2024 05:06 AM EDT March 29, 2024 06:47 PM EDT March 29, 2024 04:21 PM EDT Get instantly notified of the hottest UFC stories via Google! Click on Follow Us and Tap the Blue Star. Follow Us The podcast host credited Elon Musk for bringing the technology back to life, as he said, “But if it wasn’t for Elon Musk, how long would it take before we figured out an electric car? You know, I mean, Elon was a part of Tesla early on, and Tesla’s been around I mean, I remember the first time I saw a Tesla. God, I feel like it was like the early 2000s.” He recalled the saying that the first person he saw driving a Tesla on the streets was Bill Maher in LA. What made the experience more memorable was the Maher’s license plate, which wrote “F*** OPEC.” It’s quite astonishing to see how much electric cars have evolved and made their mark on the motor industries. Rogan shows his appreciation for Musk whenever he gets a chance. The CEO of Tesla doesn’t skip a beat to do the same thing. Joe Rogan’s Opinion Makes NFL Legend Tag MMA as the Most Dangerous Sport- “Micro\nConcussions” American politician, Robert F. Kennedy has been a guest on the JRE podcast in the past. And it would seem that the podcast host has made quite an impressive impression on RFK. During a speech, Kennedy didn’t miss a beat to compliment the 56-year-old, as he said, “If you’re young, and you have parents, you need to lock them up somewhere and get them to listen to a Joe Rogan podcast.” ADVERTISEMENT Article continues below this ad A repost of the speech on X (Twitter), seems to have made quite a big splash on the social media platform. This even got Elon Musk backing Kennedy’s statement on Joe Rogan, as he commented on the post with a simple comment which wrote, “He’s right”. NOW — RFK Jr Says Baby Boomers Need to Listen to More Joe Rogan & Less Legacy Media pic.twitter.com/ghWCuyxOFD — Chief Nerd (@TheChiefNerd) January 28, 2024  ADVERTISEMENT Article continues below this ad Joe Rogan manages to make quite a decent impression on the people he meets, as there aren’t a lot of people who dislike the man. What is your opinion about the JRE podcast host? Let us know your opinions in the comments section below. Joe Rogan’s $200M Worth Venture Gets Public Approval From Elon Musk and Robert\nF. Kennedy Jr. – “You Need to Lock Them Up…” SHARE THIS ARTICLE : Written by: Imtikokba Jamir 446Articles One take at a time Edited by: Joyita Das EssentiallySports is a digital-first sports media house that surfaces the best stories on America's favorite sports celebrities with a fan's perspective to 30+ M average monthly readers. Sports All Boxing Formula One Golf NASCAR NBA NFL ONE Championship Tennis UFC WWE Bodybuilding WNBA EssentiallySports About Us Advertise With Us Authors Editorial Team Behind The Scenes Humans of EssentiallySports Contact Us FAQs Our Brands FanCast On The Ropes Bodybuilding Bros Club Golf Lucky Dog on Track Sports All Boxing Formula One Golf NASCAR NBA NFL ONE Championship Tennis UFC WWE Bodybuilding WNBA Privacy Policy ES Pressroom Ethics Policy Fact-Checking Policy Corrections Policy Cookies Policy GDPR Compliance Terms of Use Editorial Guidelines Ownership and funding Information Full Spectrum Services LLP © 2024 | All Rights Reserved "
}