{
    "title": "Polestar secures £750m lifeline after Volvo pulls backing",
    "date": "2/28/2024",
    "url": "https://www.telegraph.co.uk/business/2024/02/28/tesla-rival-polestar-750m-lifeline-volvo-pulls-backing/",
    "text": "‘Tesla of Europe’ given three-year loan as it races to break even next year Swedish electric car maker Polestar has secured a $950m (£750m) funding lifeline after the struggling luxury brand lost the backing of Volvo. The company, which has been called “the Tesla of Europe”, on Wednesday said it had secured the three-year loan from a consortium of 12 banks that includes HSBC, Standard Chartered and BNP Paribas. It will give the company much-needed breathing space as it races to break even next year. Polestar has previously said it needs $1.3bn (£1bn) to get to that point, meaning it will have to raise a further $350m. It is facing headwinds from slowing EV sales and increased competition from low-cost Chinese brands. The funding announcement comes weeks after Volvo said it would stop funding Polestar, which was spun out of the European car maker in 2017. The decision was taken after the brand fell short of key targets. Polestar had vowed to deliver 70,000 cars in 2023 – a target already lowered from 80,000 – but in November said it would only manage 60,000. Its New York-listed shares have tumbled 80pc in the past year but were trading 12pc higher following Wednesday’s announcement. Earlier this month Volvo said it would hand over responsibility for Polestar to its Chinese parent, Geeley, which already had a direct stake in the EV maker. On Wednesday, the company announced proposed changes to its ownership that will see Volvo’s stake fall from 48pc to 18pc while China’s Geely will take around 23-24pc. Eric Li, Geely’s founder, will retain a 39pc stake through his personal investment vehicle PSD. Thomas Ingenlath, chief executive of Polestar, said the loan deal reflected “support for Polestar’s growth course”. He added: “We have reinforced our path towards cash flow break-even targeted in 2025.” Daniel Li, chief executive of Geely Holding Group, said the Chinese company would provide “full operational and financial support” to the company, pledging to participate in future funding rounds. He said: “Polestar will have full access to technologies and engineering expertise from Geely to realise its global growth targets.” Polestar has also vowed to slash costs as it seeks to break even. It is cutting 450 jobs this year, having already cut hundreds in 2023. The company currently has a lineup of four cars, including two SUVs. "
}