{
    "title": "Why Tesla Stock Fell This Week",
    "date": "3/8/2024",
    "url": "https://www.fool.com/investing/2024/03/08/why-tesla-stock-fell-this-week/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Shares of Tesla (TSLA -2.25%) were falling again this week, according to data from S&P Global Market Intelligence. The electric vehicle (EV) leader is seeing increased pricing competition from Chinese players and weak sales in the important East Asian market. It also had to deal with a fire that has temporarily halted production at its German factory. The once-beloved stock is now off 56% from its all-time high and down 10% in the last three years. Over the same time period, the Nasdaq-100 is up 47%. This week, it was down by 11.8% as of 9:13 a.m. ET on Friday. Tesla saw an onslaught of bad news this week. For February, the company reported that it only shipped around 60,000 cars from its China factory, its lowest level since December 2022. China has been a huge market for Tesla, but the country is currently struggling economically. This has led Tesla to lower its prices there in order to spur demand. BYD, the other large global electric vehicle maker and Chinese competitor, has lowered its own prices again as it races to the bottom with Tesla. The Warren Buffett-backed company is doing quite well at the moment with its lower-priced cars, and recently surpassed Tesla in unit sales. BYD is now planning to expand its sales footprint beyond China, and is targeting Europe and Australia, which are also Tesla markets. The prospect of increasing competition is likely spooking some Tesla investors. On top of competition worries, Tesla is dealing with the temporary halt of operations at its factory near Berlin due to a power outage that is believed to have been caused by arson. As-yet-unidentified individuals are alleged to have set ablaze a high-voltage transmission line on a electricity pylon near the factory. In a letter, a far-left extremist organization from Germany called the Volcano Group claimed responsibility for the fire, which the country's top prosecutor is investigating. Tesla has had to pause production at the factory, which could reduce the company's output for the quarter and possibly add to its costs. With the stock down, it would be logical for investors to think Tesla might be a buy now. But the numbers tell a different story. Tesla currently trades at a price-to-earnings (P/E) ratio of 41, which is well above the market average. At the same time, its gross profit and operating earnings are declining. So you have a combination of an expensively valued stock with a bottom line that's headed down rather than up. That will push its forward earnings ratio higher, which means the stock is likely headed lower from here. That makes Tesla a risky stock to own, even after its latest slide this week. Brett Schafer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends BYD and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}