{
    "title": "Forget Tesla: I Think This Stock Should Replace It in the \"Magnificent \nSeven\"",
    "date": "3/10/2024",
    "url": "https://www.fool.com/investing/2024/03/10/forget-tesla-i-think-this-stock-should-replace-it/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Struggling basketball players sometimes get replaced in their team's starting lineup. So do athletes who play other sports. Corporate executives, politicians, and TV personalities are subject to losing their spots as well. This idea should apply to popular stock groups too, in my opinion. Look at Tesla (TSLA -2.25%), for example. It has lost more than half of its value since reaching a peak in late 2021. The electric vehicle maker's share price is down close to 30% so far this year. Tesla is a member of the so-called \"Magnificent Seven\" stocks, but it's without question the least magnificent of the group right now. Here's my idea: Forget Tesla. I think another stock should replace it in the Magnificent Seven. On Thursday of last week, Novo Nordisk's (NVO 0.27%) market cap vaulted higher than Tesla's. It's not just that the Denmark-based drugmaker is now bigger than Tesla, though; Novo Nordisk is beating Tesla on multiple fronts. Perhaps most importantly, Novo Nordisk is on the rise while Tesla is on the decline. I've already mentioned Tesla's dismal stock performance. Novo Nordisk's stock chart is practically a mirror image of the EV maker's chart. The two companies' financial results also present stark contrasts. Tesla's fourth-quarter revenue and earnings were lower than Wall Street expected. Novo Nordisk beat expectations with sales soaring 37% year over year -- the best performance among the top 25 biopharmaceutical companies ranked by market cap. Tesla is having to resort to price cuts to compete in the important Chinese EV market. Meanwhile, Novo Nordisk has had a much more pleasant \"problem\": It hasn't been able to supply enough of its weight-loss drug Wegovy to keep up with demand. Sure, Tesla's fortunes could turn around. However, I don't look for Novo Nordisk to stumble and crash. Actually, the company's future should be quite bright. Novo already has huge winners in its lineup with the aforementioned weight-loss drug Wegovy and blockbuster type 2 diabetes drug Ozempic. Investors are now excited about a new drug that could be on the way. At its Capital Markets Day event on March 7, Novo Nordisk reported results from a phase 1 clinical trial of its experimental obesity drug amycretin. The company stated that participants in the study who took amycretin achieved an average weight loss of 13.1% after 12 weeks. There are two main reasons why these results generated so much enthusiasm. First, the weight loss was even better than the 6% average weight loss achieved by patients in clinical testing of Wegovy. Second, amycretin is a pill whereas Wegovy is administered via subcutaneous injection. The convenience factor could be a huge selling point for Novo Nordisk. Amycretin isn't Novo Nordisk's only promising pipeline candidate. The company is evaluating an oral version of semaglutide (the drug that's sold under the brand names Ozempic, Rybelsus, and Wegovy) in late-stage studies as a treatment for diabetes and obesity. It's testing the injectable version of semaglutide in treating Alzheimer's disease and rare liver disease metabolic dysfunction-associated steatohepatitis (MASH). Novo's other late-stage programs include a new diabetes and obesity drug called CagriSema, which combines semaglutide with amylin analog cagrilintide. There's a compelling argument that Novo Nordisk is more magnificent than Tesla is these days. Boot Tesla from the Magnificent Seven and include Novo. While we're at it, I say throw Eli Lilly (LLY -0.03%) into the mix, too. Lilly's share price has soared even more than Novo Nordisk's has so far in 2024. And that's true even with the U.S. Food and Drug Administration announcing a surprise delay of its approval decision for Lilly's experimental Alzheimer's disease drug donanemab. Eli Lilly's market cap of close to $725 billion is much higher than Tesla's or Novo Nordisk's. Its prospects look at least as promising as Novo's thanks to type 2 diabetes drug Mounjaro, obesity drug Zepbound, and a pipeline loaded with potential winners. Maybe the number of the Magnificent Seven should be increased. Keith Speights has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool recommends Novo Nordisk. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}