{
    "title": null,
    "date": "3/9/2024",
    "url": "https://www.businessinsider.in/thelife/news/fords-secret-weapon-in-the-fight-against-tesla-hybrids/articleshow/108336555.cms",
    "text": "Liked the article? Share it with your friends... or copy link Electric vehicle sales aren't going the way Ford expected when CEO Jim Farley took direct aim at Elon Musk's Tesla in 2022. Wealthy early adopters that companies like Ford were relying on to usher their EV business to profitability are dropping out of the market, and being replaced by a more frugal and practical green car shopper. Tesla's Elon Musk has room to drop prices to meet these new customers' needs, inciting a price war that Ford can't win right now. But that's where hybrids come in. Ford's hybrid lineup is doing something important for the brand as it establishes itself with green car shoppers: bringing in new customers at a higher rate for hybrid vehicles than any of its other vehicles. The Ford Maverick pickup truck hybrid, for example, has a \"conquest\" rate of about 60%, according to Jim Baumbick, Ford's vice president of product development operations and quality. That means more than half of people who drive off the lot with a hybrid Maverick are buying a Ford for the first time. And it's a figure that's dramatically higher than most models, which can see conquest rates in the single digits. \"We like to think of it as freedom of choice for customers,\" Baumbick told Business Insider. In the end, whether a customer drives off with an EV or a hybrid, \"They are buying a Ford,\" he said \"and what excites us is bringing new customers to the brand.\" For years, the automotive industry has been split into two camps on the way forward to an electric future. The first, including GM and Volkswagen, aimed to skip hybrids and go straight to an all-electric lineup. And of course, Tesla has always been all-electric and never has offered hybrids. Meanwhile, companies like Toyota and Stellantis, the owner of Jeep, focused on plug-in hybrids for the near term with more EVs down the road. Toyota in particular was criticized as an EV laggard for years, only to be proven right this year when hybrids started growing in popularity again. Ford fell somewhere in the middle of that dichotomy, taking big swings on new EV offerings under its most iconic nameplates while still investing heavily in hybrid and plug-in hybrid technology. That middle-of-the-road approach appears to be paying off right now. Last month, Ford saw hybrid sales increase 31.5% compared to the same month a year ago, while EV sales grew 80% over the same period. \"I know that hybrids will play a role for an extended time,\" Baumbick said. \"For us, the freedom of choice and democratizing the technology for customers to select what's best for how they live their lives is really important.\" Advertisement "
}