{
    "title": null,
    "date": "3/17/2024",
    "url": "https://finance.yahoo.com/news/10-biggest-lithium-stocks-invest-154158705.html",
    "text": "In this article, we discuss the 10 biggest lithium stocks to invest in. If you want to read about some more lithium stocks, go directly to 5 Biggest Lithium Stocks to Invest In. Lithium prices are some of the most volatile in the metals market. This has been the case over the past few years despite rising demand for electric vehicles and clean energy equipment. After surging to record highs in the post-pandemic economic boom, lithium prices have undergone a massive correction in the past few months, decreasing nearly 70% year-on-year at the end of last month. In China, slowing EV demand has resulted in prices dropping from highs of over $81,000 per tonne in November 2022 to around $20,000 per tonne in February. This slowdown has coincided with a macro crunch in the global economy as well as oversupply from the market as lithium capacity comes online at an accelerated pace compared to the previous years. In response to falling prices, some of the biggest lithium companies have started cutting down their operations or suspending them altogether until prices stabilize. Estimates from the US Geological Survey suggest that global lithium output was around 180,000 metric tons last year, even as demand slowed. This slowdown had been predicted by market analysts at investment bank Goldman Sachs as early as 2022. In June, Nicholas Snowdon and Aditi Rai wrote in a note to clients that there would be a sharp correction in lithium prices. They predicted that there had been a surge in investor capital into supply investment tied to the long term EV demand story, essentially trading a spot driven commodity as a forward-looking equity. Per the experts, this fundamental mispricing had in turn generated an outsized supply response well ahead of the demand trend. Despite short-term headwinds, there is general consensus in the mining and auto industries that long-term demand for lithium will continue to outpace that of other metals in the years ahead. The present marketplace presents an attractive opportunity for investors to pick up shares of the biggest lithium stocks like Tesla, Inc. (NASDAQ:TSLA), Albemarle Corporation (NYSE:ALB), and QuantumScape Corporation (NYSE:QS) at discounted prices. These firms are leading the lithium revolution. For example, here is what Jagdeep Singh, the CEO of QuantumScape Corporation (NYSE:QS), said during the fourth quarter earnings call of his firm. “We've made remarkable progress towards commercializing solid-state lithium metal batteries, from the single-layer pouch cells we showed in December 2020, all the way to our 24-layer A0 cells shipped in December 2022. The best performing of these have now yielded impressive cycle life performance, over 1,000 cycles with 95% capacity retention as reported by Volkswagen's battery arm PowerCo based on testing in their own labs in Germany. In 2023, we set out to turn these A0 prototypes into a commercial product. And with advances in cathode loading, packaging efficiency, and process quality, we now have our first commercial product, QSE-5 in our sites. When it comes to the combination of product development, customer engagement, and financial strength, I believe our leaders in next-generation batteries is stronger than it’s ever been. When we begin shipping QSE-5, it will mark a world-first for automotive solid-state lithium metal battery technology, representing the culmination of years of development on the part of the QuantumScape team and further solidifying our leadership in next-generation battery technology. But starting low-volume production of our first product is not the end of the journey, it’s just the beginning. To truly fulfill the promise of our breakthrough technology, we will need to increase production by orders of magnitude from where we are today. For that reason, early last year, I set out to recruit a leader with extensive experience in high-volume manufacturing of sophisticated technology products.\" Our Methodology The biggest companies in the lithium sector were selected and ranked based on hedge fund sentiment. Pure-play lithium firms were preferred for the list. The analyst ratings of each stock are also discussed to provide readers with some context for their investment choices. The hedge fund sentiment around each stock was calculated using the data of around 900 hedge funds tracked by Insider Monkey in the fourth quarter of 2023. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator. An assembly line of lithium-ion batteries for energy storage solutions with workers in the background. Number of Hedge Fund Holders: 9 Lithium Americas Corp. (NYSE:LAC) operates as a resource company in the United States and Argentina. On March 15, investment advisory Evercore ISI maintained an Outperform rating on Lithium Americas Corp. (NYSE:LAC) stock and lowered the price target to $9 from $13. At the end of the fourth quarter of 2023, 9 hedge funds in the database of Insider Monkey held stakes worth $15 million in Lithium Americas Corp. (NYSE:LAC), the same as in the previous quarter worth $48 million. In addition to Tesla, Inc. (NASDAQ:TSLA), Albemarle Corporation (NYSE:ALB), and QuantumScape Corporation (NYSE:QS), Lithium Americas Corp. (NYSE:LAC) is one of the biggest lithium stocks to invest in. In its Q4 2023 investor letter, Massif Capital, an asset management firm, highlighted a few stocks and Lithium Americas Corp. (NYSE:LAC) was one of them. Here is what the fund said: “Currently, we remain, at a small size, invested in two lithium mining firms, Lithium Argentina (LAAC) and Lithium Americas Corp. (NYSE:LAC). Both companies were part of a single entity (Lithium America Original) as recently as October. That entity was a long-time Massif Capital Investment initiated in March 2020 at roughly $2.5 per share. At the time, the firm was in pre-production at two assets, an Argentina-based lithium brine deposit and a US-based clay deposit, to which we attributed little value because of the state of processing technology. We used the stock’s volatility to great advantage throughout 2020, 2021, and 2022 as we repeatedly sold both puts and calls on the company, reducing our entry cost below zero via premium earned on those options trading activities. In 2021, the stock peaked at roughly $39 a share, a roughly 1,460% gain on our purchase price. Given the state of the firm’s assets, we should have cut the entire position instead of just trimming. We had confidence in the management team, and momentum and enthusiasm for all things EV and battery were strong, offering the potential for the market to run the price well past any reasonable value. Furthermore, at the time, the lithium prices we were seeing implied a fair value of the two development assets well north of $40 a share, and we were having trouble understanding how long the trend of sky-high prices would last….” (Click here to read the full text) Number of Hedge Fund Holders: 11 Microvast Holdings, Inc. (NASDAQ:MVST) provides battery technologies for electric vehicles and energy storage solutions. In mid-December, investment advisory Cantor Fitzgerald maintained an Overweight rating on Microvast Holdings, Inc. (NASDAQ:MVST) stock with a price target of $8. At the end of the fourth quarter of 2023, 11 hedge funds in the database of Insider Monkey held stakes worth $14 million in Microvast Holdings, Inc. (NASDAQ:MVST), compared to 13 in the previous quarter worth $24 million. Number of Hedge Fund Holders: 11 FREYR Battery (NYSE:FREY) engages in the production and sale of battery cells for energy storage systems, electric mobility, marine, and aviation applications. At the end of the fourth quarter of 2023, 11 hedge funds in the database of Insider Monkey held stakes worth $35 million in FREYR Battery (NYSE:FREY), compared to 16 in the previous quarter worth $96 million. Number of Hedge Fund Holders: 12 Piedmont Lithium Inc. (NASDAQ:PLL) an exploration stage company that engages in the exploration and development of resource projects in the US. On February 16, investment advisory BMO Capital initiated coverage of Piedmont Lithium Inc. (NASDAQ:PLL) stock with a Market Perform rating and a price target of $10. At the end of the fourth quarter of 2023, 12 hedge funds in the database of Insider Monkey held stakes worth $19 million in Piedmont Lithium Inc. (NASDAQ:PLL), compared to 10 the preceding quarter worth $43 million. In its Q4 2023 investor letter, Massif Capital, an asset management firm, highlighted a few stocks and Piedmont Lithium Inc. (NASDAQ:PLL) was one of them. Here is what the fund said: “On the short side of the book, we engaged in two types of Lithium shorts throughout 2023. The first is a traditional alpha-focused company short. Specifically, we assessed Piedmont Lithium Inc. (NASDAQ:PLL), a junior developer with exposure to assets from Canada to Ghana, which is helmed by a management team that, while capable of selling a story, cannot achieve its lofty goals in the real world. Piedmont is a classic mining stock promotion with little chance of becoming anything substantive. During 2023, we generated a 23% return on the short before exiting it during the 4th quarter. We re-entered the short recently and are currently up a further 50%.” Number of Hedge Fund Holders: 17 ChargePoint Holdings, Inc. (NYSE:CHPT) provides electric vehicle (EV) charging networks and charging solutions. On March 6, investment advisory Benchmark maintained a Buy rating on ChargePoint Holdings, Inc. (NYSE:CHPT) stock with a price target of $4.25. At the end of the fourth quarter of 2023, 17 hedge funds in the database of Insider Monkey held stakes worth $9 million in ChargePoint Holdings, Inc. (NYSE:CHPT), compared to 16 in the previous quarter worth $50 million. Along with Tesla, Inc. (NASDAQ:TSLA), Albemarle Corporation (NYSE:ALB), and QuantumScape Corporation (NYSE:QS), ChargePoint Holdings, Inc. (NYSE:CHPT) is one of the biggest lithium stocks to invest in.  Click to continue reading and see 5 Biggest Lithium Stocks to Invest In.  Suggested Articles: Dividend Contenders List Ranked By Yield: Top 25 13 Best Mining Stocks To Buy Now 11 High Growth Micro-Cap Stocks to Buy Disclosure. None. 10 Biggest Lithium Stocks to Invest In is originally published on Insider Monkey. Related Quotes "
}