{
    "title": "350-510 km range with just 15-min charging! Xiaomi's Tesla-killer boasts \nimpressive specs",
    "date": "3/30/2024",
    "url": "https://www.dtnext.in/news/business/xiaomis-tesla-killer-boasts-impressive-specs-here-is-the-essential-guide-777102",
    "text": "MORE Xiaomi's SU7 (Image: Reuters) CHENNAI: Chinese tech giant Xiaomi, which disrupted smartphone business with its value-for-money offerings that upstaged traditional behemoths Apple and Samsung, on Friday made an impressive entry into the electric vehicle (EV) market with its electric car named SU7. According to reports, 'SU', stands for 'Speed Ultra,' and comes in three variants: an entry-level version, a Max version, and a limited Founders Edition. Let’s explore the features of this new electric-tech sedan Design and Dimensions Xiaomi's SU7 is a full-sized sedan measuring 4,997 mm (L), 1,963 mm (W), and 1,440 mm (H). It has a wheelbase of 3,000mm and weighs between 1,980 and 2,200 kg. All three variants sport 19-inch Michelin alloy wheels as standard option. The front-end design of the car seems to be inspired by McLaren, with sleek 'waterdrop' designed headlights. At the rear-end, the car offers slim wraparound connected tail-lights. Earlier, at the MWC held in Barcelona, three colour options (Aqua Blue, Mineral Gray, and Verdant Green) of the car were displayed. Now the company has released 6 more options.  Powertrain options Entry level variant: Rear-wheel-drive (RWD). It is equipped with a 299 hp engine and has a claimed top speed of 210 km/hr. Max variant: Dual-motor, four-wheel-drive (AWD). The engine boosts up to 673 hp and a top speed of 265 km/hr and can accelerate from 0-100 km/hr in just 2.78 seconds, Xiaomi claimed. Limited Founders Edition: This is like the 'Max' but delivers nearly 986hp of power and can sprint from 0-100 km/hr in a mere 1.98 seconds. Battery packs, Range and Charging This is a feature that would make EV enthusiasts and potential customers sit up and take note. The SU7 supports ultra-fast charging, thanks to its innovative 486V and 871V build-ups. Xiaomi has partnered with CATL to equip the SU7 with two battery options: a 73.6 kWh pack for entry-level variants and a larger 101 kWh pack for the top-of-the-line variant. The company claims that just 15 minutes of charging  can replenish it with enough power to cover 350 km and 510 km for the entry-level and top line variants, respectively. These batteries are touted to provide at least 700 kms of range on a single charge. Xiaomi plans to introduce a larger 150 kWh battery pack later next year, promising an extended range of 1,200 km. That is, even those who want to shift to EVs but are holding themselves back due to concerns over range and charging time will have those apprehensions addressed. Interiors and Infotainment The SU7’s interior has a futuristic cockpit with multiple screens and runs on Xiaomi's Hyper OS, which can be connected to any smartphone or other devices. It also gets a 16.1-inch 3K central console, a 7.1-inch rotating dashboard, and a 56-inch HUD (heads-up display). Higher-spec cars will have an active rear wing, Li-Dar technology, 11 high-definition cameras, and 12 ultrasonic radars. In terms of autonomous driving capabilities, the SU7 comes with features such as Adaptive BEV Technology, Road-Mapping Foundational Model, and Super-Res Occupancy Network Technology. Reports added that there are two NVIDIA Orin high-performance chips that power the vehicle's hardware. Pricing and Availability SU7 Standard (entry-level): Priced at CNY 215,900 (approximately Rs. 25 lakh). SU7 Max: Priced at CNY 299,900 (approximately Rs. 35 lakh). Deliveries for the SU7 and SU7 Max will begin by the end of April in China, sources said. However, there is no official confirmation of the brand to launch its debut EV in India as of now.  Xiaomi's venture into the electric vehicle (EV) industry sparks excitement, with the SU7 positioning itself to rival renowned competitors such as BMW, Porsche, and Tesla. With its sleek design, advanced features, and competitive pricing, the SU7 is set to make waves in the electric vehicle segment.  © Copyright  | Powered by Hocalwire "
}