{
    "title": "Tesla Offers Early Cybertruck Delivery To Long-Term Shareholders: How To \nCheck If You Qualify",
    "date": "3/12/2024",
    "url": "https://www.tradingview.com/news/benzinga:eec471a47094b:0-tesla-offers-early-cybertruck-delivery-to-long-term-shareholders-how-to-check-if-you-qualify/",
    "text": "EV giant Tesla Inc TSLA has announced an exclusive offer for its long-term shareholders, allowing them to receive early delivery of the Foundation Series Cybertruck. What Happened: The program is open for registration until March 22, 2024, 11:59 PM CDT. The delivery is limited to one reservation per customer and is available for both U.S. and Canadian shareholders, the company website reads. Eligibility Criteria: The Cybertruck reservation must be in the participant's name and made before March 1, 2024. The participant must also not have taken delivery of a Cybertruck yet. Each participant must provide brokerage statements showing that they owned Tesla shares on Feb. 28, 2021, and owned at least 500 Tesla shares on Feb. 29, 2024. The more recent brokerage statement must also show that the participant still owns at least 50% of the shares they owned as of Feb. 28, 2021. Cybertruck Demand: During Tesla's fourth-quarter earnings call in January, Tesla Supply Chain Vice President Karn Budhiraj said that the conversion of reservations to orders for the vehicle has been \"very encouraging.\" The company is also receiving new orders since the vehicle’s launch in late November, he added. “If the trend continues as it's very likely to be, we will soon [sell] out all the builds in 2024,” the executive said. Musk also noted that the trouble with the Cybertruck is not demand but production. “Obviously, we could dramatically raise the price, but that doesn’t feel right to us to sort of gouge people for early delivery,” Musk said while reiterating his target of delivering 250,000 Cybertrucks in North America ultimately. The CEO had previously said that the delivery target would be met in 2025. During Tesla’s third-quarter earnings call in October, a month before the Cybertruck's delivery event, Musk had said that over a million people had already reserved the vehicle. This means that those lower down on the reservation list before deliveries even started might have to wait for their vehicles until 2026 or later, unless they use these incentives from the company. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Tesla’s Director Of Product Design Says $3K Cybertruck Tent ‘Looks Great’ When Set Up Properly, Blames Bad Photos For ‘Wrinkled Suit’ Look Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo Courtesy Shutterstock.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}