{
    "title": "Elon Musk bemoans selling Tesla stock to buy Twitter - and pokes fun at \nMichael Burry for deleting his profile",
    "date": "3/24/2024",
    "url": "https://ca.movies.yahoo.com/movies/elon-musk-bemoans-selling-tesla-132249368.html",
    "text": " Elon Musk lamented selling Tesla stock to buy Twitter, and flagged the risks of margin debt. He made light of \"The Big Short\" investor Michael Burry deleting his Twitter profile this week. Musk has warned stock pickers they face a choppy market and potential recession. Elon Musk has bemoaned selling Tesla stock to finance his Twitter takeover last year, poked fun at Michael Burry of \"The Big Short\" fame for quitting the social-media platform this week, and warned stock pickers about the risks of leverage. A Twitter user, @WholeMarsBlog, joked on Thursday that they couldn't believe Musk had acquired Twitter. \"Me neither,\" the Tesla, SpaceX, and Twitter CEO replied. \"Sucks that I had to sell so much Tesla stock to do so (sigh).\" Musk sold about $23 billion worth of Tesla stock last year, largely to finance his $44 billion Twitter purchase. The sales represent a significant chunk of his estimated $174 billion fortune as of Thursday's market close. Tesla shares have rallied 74% to $188 this year, but still trade well below their peak price of over $400 in November 2021. —Elon Musk (@elonmusk) February 3, 2023 Burry has publicly bet against Tesla during the pandemic, and accused Musk in late 2021 of selling the automaker's stock because he knew it was hugely overvalued. The Scion Asset Management boss, who has predicted a stock-market crash and prolonged recession lie ahead, ominously tweeted \"sell\" and deleted his Twitter profile this week. \"michael burry deleting his account every time he shorts the local bottom will never stop being funny,\" a Twitter user who goes by foobar wrote this week. Musk replied with a pair of emojis crying tears of joy, suggesting he didn't take Burry's departure from the platform too seriously. Musk has previously labeled Burry a \"broken clock\" and teased him for betting against Tesla. —Elon Musk (@elonmusk) February 2, 2023 \"In turbulent economic times, be wary of using margin loans to buy stock,\" Musk tweeted on Thursday. The billionaire was referring to investors borrowing against the value of their shares and other securities to bolster their portfolios. Musk considered but ultimately didn't use a $12.5 billion margin loan to acquire Twitter last fall. The decision may have spared him a margin call — a demand from lenders to put up more collateral due to his Tesla stock plunging in value. The close shave may explain why Musk has been underscoring the risks of margin debt in recent weeks, especially when investors face a volatile stock market and a potential recession. —Elon Musk (@elonmusk) February 2, 2023 Read the original article on Business Insider The middle class has long been considered the backbone of the American economy. But the American middle class is shrinking. The percentage of adults living in middle-income households in the United States fell by more than 10 percentage points over … Continue reading → The post What It Takes to Be Middle Class in America's Largest Cities – 2023 Study appeared first on SmartAsset Blog. Money can't buy you happiness, but what about working with a financial advisor?  Hollie AdamsAccording to London’s Metropolitan Police and social media footage, a pedicab burst into flames directly in front of Buckingham Palace on Saturday, leaving behind only charred, melted remains. Explosion and fire outside Buck Palace! pic.twitter.com/nUWojD8Ji8— Michael Wright (@Michael_HiFi) March 30, 2024 In video of the incident on X, captioned “Explosion and fire outside Buck Palace,” the pedicab can be heard cracking and popping as it burns, emitting billowing clouds of black smok “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by … The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Follow all the action from Stamford Bridge I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. The Blues sit 11th in the Premier League table heading into the match  SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x … In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story. Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action. Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset.  ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset. St Michael and All Angels Church in Tirley was \"marooned\" by water in January. Play this game for 1 minute and see why everyone is addicted. The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics. April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off "
}