{
    "title": "Industry lawyer says crypto is more like a Tesla than a stock or bond",
    "date": "3/1/2024",
    "url": "https://www.dlnews.com/articles/regulation/crypto-more-like-a-tesla-than-a-security-industry-lawyer/",
    "text": "Copy link Crypto is rife with buzzwords: ‚Äúcommunity,‚Äù ‚Äúprotocol,‚Äù ‚Äúpermissionless,‚Äù ‚Äúdecentralised.‚Äù The US Securities and Exchange Commission has honed in on one, ‚Äúecosystem,‚Äù in its bid to convince courts that cryptocurrencies are much like stocks and bonds ‚Äî in other words, within its regulatory purview. Crypto lobbyists, along with nine state attorneys general, pushed back in a flurry of court documents Thursday. The Blockchain Association and DeFi Education Fund filed a joint amicus brief in which they derided the SEC argument that cryptocurrencies amount to ‚Äúinvestment contracts‚Äù because the digital assets exist within ecosystems that founders and developers are actively trying to improve. The industry lobbyists were joined by state attorneys general from Montana, Arkansas, Iowa, Mississippi, Nebraska, Ohio, South Dakota, and Texas. An amicus, or friend of the court, is a legal document offering support or information on legal cases from parties not directly involved. The brief was filed in support of crypto exchange Kraken, which is being sued by the SEC for commingling customer funds with its own and for acting as an unregistered securities exchange, broker, dealer, and clearing agency. The SEC‚Äôs argument is akin to mistaking a company‚Äôs product for the company itself, Marisa Coppel, the Blockchain Association‚Äôs top lawyer, told DL News, echoing an argument made in the lobbyist group‚Äôs brief. That Tesla, the electric car manufacturer, is building its own network of chargers doesn‚Äôt mean the cars themselves should be treated like stocks and bonds. ‚ÄúWhen you buy a Tesla, you‚Äôre relying on the company to maintain and create its charging network, because otherwise you wouldn‚Äôt be able to use your car,‚Äù she said. ‚ÄúBut that doesn‚Äôt make the Tesla a security.‚Äù The SEC is charged with policing the US securities markets to protect investors from fraud and abuse. Since the collapse of crypto exchange FTX in November 2022, the SEC has cracked down on the crypto industry, suing players large and small for offering unregistered securities. Chair Gary Gensler has said the ‚Äúvast majority of crypto assets are investment contracts and thus subject to the federal securities laws.‚Äù The industry has treated the crackdown as something of an existential crisis, arguing that shoehorning crypto assets into existing securities laws would amount to a death sentence given their unique features and the cost of complying with government regulations. In March 2023, crypto exchange Kraken agreed to pay a $30 million fine and end its staking program in the US to settle an earlier SEC lawsuit alleging the staking program was itself an unregistered security. But the regulator returned in November, suing Kraken in federal court in San Francisco. Supposed securities available on Kraken include Solana‚Äôs SOL, Polygon‚Äôs MATIC, Cardano‚Äôs ADA, and several other tokens, according to the SEC. The SEC holds that an investment contract exists if there is an investment of money in a ‚Äúcommon enterprise‚Äù with a ‚Äúreasonable expectation of profits derived from the efforts of others‚Äù ‚Äî criteria known as the ‚ÄúHowey Test‚Äù for the landmark 1946 case SEC v. W.J. Howey Co. ‚ÄúA reasonable investor would have understood the offer and sale of each of the Kraken-Traded Securities as offers and sales of investment contracts,‚Äù the SEC said in its complaint against Kraken. ‚ÄúPurchasers of the Kraken-Traded Securities would reasonably have expected to profit from the efforts of these issuers and promoters to grow and maintain the technology platforms and blockchain ecosystems associated with these crypto assets because such growth or operations could in turn increase the price of the underlying crypto asset and/or provide increased value to holders of the Kraken-Traded Securities.‚Äù Coppel said it was ‚Äúabsurd‚Äù and an overly broad interpretation of the Howey Test. ‚ÄúIn my reading of Howey and all the other cases that set forth a precedent in this area, that‚Äôs just not the law,‚Äù Coppel said. ‚ÄúIt disregards certain elements of Howey, and only focuses on the expectation of profit.‚Äù She called the participation of state attorneys general a ‚Äúpowerful‚Äù move that could get the court‚Äôs attention. ‚ÄúThey don‚Äôt weigh in on every single case, even if the case could potentially impact people in their state. I think a judge would look at an amicus brief by any other government organisation slightly differently. Like maybe give that a little bit more weight.‚Äù The industry has put much of its faith in courts after a series of victories last year. But Coppel believes industry developers are still nervous about running afoul of the SEC. ‚ÄúPeople tend to be more bullish and more willing to take risks in a bull market,‚Äù she said. ‚ÄúAs the market shifts, I think the risk calculation also shifts, but I don‚Äôt think that‚Äôs due to any anxiety ease from the SEC.‚Äù Aleks Gilbert is a DeFi correspondent for DL News. Have a tip? Contact Aleks at aleks@dlnews.com. "
}