{
    "title": "Gravity opens fastest EV charger in US to public in New York City",
    "date": "3/4/2024",
    "url": "https://www.marketscreener.com/quote/stock/TESLA-INC-6344549/news/Gravity-opens-fastest-EV-charger-in-US-to-public-in-New-York-City-46083378/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) March 4 (Reuters) - Google-backed EV infrastructure\nstartup Gravity Mobility has opened the fastest charging\nsolution in the United States to the public, as it looks to\nattract fleet customers. Major fleet operators will have access to 24 of Gravity's\n500 kilowatt (kW) chargers in New York, Gravity said on Monday.\nThe devices can charge at a rate of 2,400 miles of range per\nhour or 200 miles in five minutes. The company has the capacity to manufacture and deploy\nthousands of chargers a year and more sites are already in\ndevelopment, apart from the first in Midtown Manhattan, it said. \"If you look at how many (Tesla) Superchargers are added per\nyear, we can add that many or more to grow our network. There's\nnothing blocking that,\" Gravity's CEO Moshe Cohen told Reuters. Tesla has signed a large number of agreements with\nFord, General Motors and a slew of other automakers\nto allow vehicles across brands to access its more-than 15,000\nstrong charging network. Scaling to this level could be\nchallenging. Gravity plans to raise more funds this year to expand its\nnetwork of high speed chargers across the United States. \"We will do more fundraising, of course, our goal is to\nexpand nationally immediately, and so we have quite a bit of\ninterest,\" CEO Cohen said. Gravity's chargers are the size of a carry-on suitcase,\ncompared with large stands deployed by automakers and other EV\ncharging network operators. However, most electric cars have a charging speed cap of 350\nkW, with future models expected to be able to take advantage of\nfaster chargers. Late last year, EV charger maker ChargePoint\nannounced its Express Plus Power Link 2000 product, which is\ncapable of charging two vehicles simultaneously at speeds of up\nto 500 kW, while Tesla's Superchargers have a limit of 250 kW.\n(Reporting by Akash Sriram in Bengaluru; Editing by Mrigank\nDhaniwala)  0 selected Tesla goes off script March 05, 2024 at 06:10 am EST Tesla Gaining Share From Auto EV Pullback: Cathie Wood Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}