{
    "title": "2 \"Magnificent Seven\" Stocks to Buy Hand Over Fist Right Now",
    "date": "3/23/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA/pressreleases/25006772/2-magnificent-seven-stocks-to-buy-hand-over-fist-right-now/",
    "text": "The S&P 500 index has roared higher over the past 16 months, rebounding from its bear market low to reach record levels -- and confirm a new bull market. And the movement has been led by one group of stocks in particular. Dubbed the \"Magnificent Seven\" in reference to the 1960 Western, these players are technology stocks, and each one is a leader in its specialty area. Some investors may worry that after these gains, it's too late to get in on these stock market stars. The concern is they may have become too expensive and are ready to stagnate or fall. But a stock with spectacular momentum still could have plenty of room to run if the company has strong long-term prospects. And that's the case of some of today's top-performing stocks. Let's check out two Magnificent Seven companies to buy hand over fist right now. Image source: Getty Images. Nvidia(NASDAQ: NVDA) sells the world's top-performing artificial intelligence (AI) chip, the H100 graphics processing unit (GPU) that powers crucial operations such as the training and inference of AI models. This has helped Nvidia's revenue and net income soar in the triple digits in recent times and reach record levels. And it's also helped the shares to soar more than 240% over the past year. Of course, rivals such as Advanced Micro Devices and Intel exist in this market, but so far Nvidia has shown it has what it takes to stay ahead. And at the company's GTC AI Conference this week, chief executive officer Jensen Huang announced product launches and updates that offer us reason to be optimistic. One particular bit of news was especially noteworthy, and that's the upcoming release of Nvidia's Blackwell architecture and chips. The platform, available later this year, will help customers run generative AI on large language models (LLMs) at a cost and energy consumption level 25 times lower than its predecessor. Chief executive officers of the biggest tech companies from MetaPlatforms to Tesla commented on the Blackwell announcement -- showing that they're on board to use the platform. \"There is currently nothing better than NVIDIA hardware for AI,\" Tesla's Elon Musk said in Nvidia's Blackwell launch statement. And the biggest cloud companies said they're ready to make the technology available to customers. All of this signals a new era of growth ahead for this chip giant, meaning that, trading at 36x times forward earnings estimates, Nvidia still looks like a buy today. Amazon(NASDAQ: AMZN) is a great tech stock to buy now because it's already benefiting and is set to benefit from three growth areas: e-commerce, cloud computing, and AI. The company is a leader in both e-commerce and cloud computing services, and it's investing heavily in AI to boost earnings in both of those businesses. First, AI aside, Amazon has become an e-commerce giant and continues to build its position thanks to its Prime subscription service, offering members many benefits that keep them coming back. AI has the potential to lower Amazon's costs and improve the shopping experience for customers -- and that could translate into earnings growth. Amazon uses AI to streamline e-commerce operations, find the best delivery routes to shorten delivery times, and uses AI to help customers find the products they need. And these are just a few examples. Through Amazon Web Services (AWS), the cloud business, Amazon offers a broad range of services to its customers, and these services include just about every aspect of AI: from chips to power the training of LLMs to a fully managed service that allows customers to customize top existing LLMs. Since AWS already is a cloud leader, chances are when its customers are interested in launching an AI project, they'll do that right there on AWS. So, Amazon is using AI to improve its operations and save time and money -- and it's selling AI services to customers. And this means it could score a double victory in the area of AI. Considering this and Amazon's long track record of earnings growth, the stock, trading for 42x times forward earnings estimates, looks like one to buy hand over fist today. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 21, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Adria Cimino has positions in Amazon and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Meta Platforms, Nvidia, and Tesla. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}