{
    "title": "Apple stock recovers but Elon Musk's Tesla continues its slump",
    "date": "3/22/2024",
    "url": "https://qz.com/apple-elon-musk-tesla-stock-market-1851360035",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Apple stock ticked up Friday after sinking on news of the Department of Justice’s sweeping antitrust lawsuit against the company. Apple shares had fallen in their biggest drop since August, slumping more than 4% and wiping away $113 billion of the tech giant’s value. At market close Friday, the company had gained back a small (in Apple terms) but significant $15 billion. While Apple has faced antitrust probes in the past, those were limited to the App Store. The new lawsuit focuses on “virtually every part of Apple’s business,” DA Davidson Managing Director Gil Luria told Yahoo Finance in an interview Thursday. The DOJ not only cited Apple’s iPhone and Apple Watch businesses, but also the company’s dominance beyond those services, pointing to its advertising, news subscriptions, and FaceTime. “This could be a significant drag on the company,” William Kovacic, a law professor of George Washington University, told Bloomberg on Friday. Apple isn’t the only tech company to be probed by regulators for antitrust practices. Google is in an ongoing battle with the Department of Justice over antitrust actions after losing a legal fight with Epic Games in December. Meta and Amazon have been engaged in ongoing disputes with the Federal Trade Commission over similar concerns. Still, Meta, Amazon, and Google have continued to rise on the stock market. Not to mention, Apple’s legal battle will play out over the long term, meaning the impacts of the suit to its business won’t be immediate. While Wedbush analysts told Business Insider the suit could be settled over the next 12 to 18 months, others put that timeline at three to five years. So investors should continue to shake off the immediate shock from headlines of the suit and play the “wait and see” game as litigation continues. Deepwater Asset Management Managing Partner Doug Clinton told Yahoo Finance that investors “will ultimately shrug this off,” and that none of the issues in the suit “are going to be big enough changes to crack Apple’s dominance in the smartphone market.” Apple’s fellow Magnificent Seven member that shared its Thursday woes, Tesla, had a different fate on Friday. Tesla stock continued to sink on news of production cuts in China. Tesla shares fell another 1.2% Friday after sinking 1.6% the day before. Tesla stock is down more than 30% year-to-date — another sign that the Magnificent Seven may not be so magnificent, or at least, it probably should drop some of its members from the all-star team. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}