{
    "title": "Tesla (TSLA) PT Raised to $298 at RBC Capital",
    "date": "3/5/2024",
    "url": "https://www.streetinsider.com/Analyst+PT+Change/Tesla+%28TSLA%29+PT+Raised+to+%24298+at+RBC+Capital/22882449.html",
    "text": "FREE Breaking News Alerts from StreetInsider.com! StreetInsider.com Top Tickers, 3/30/2024 RBC Capital analyst Tom Narayan raised the price target on Tesla (NASDAQ: TSLA) to $298.00 (from $297.00) while maintaining a Outperform rating. The analyst commented, \"Our view: In this report, we now include Megapacks in our Tesla PT. At the same time, we lower our Autonomy valuation given lower licensing penetration expectations. We remain conservative on the Car business, not giving credit to Model 2 affordability. Key points: Incorporating Megapacks. Post our Tesla battery storage facility visit last week (see report), we now include $117B in extra value to our Tesla valuation (+$34/share). This represents 11% of our PT and conservatively assumes Tesla market share stays flat at 15% despite a 30% cost advantage vs peers and 25% EBITDA margins despite battery costs coming down. For our upside scenario, we assume a 20% market share, and 30% EBITDA margins and arrive at a $212B valuation for the Megapack business (+$61/ share). Given conservatism embedded in our base case, we believe the business is probably worth between $100-200B. Conservative on Cars. We forecast Tesla selling ~2.5M vehicles/year in North America, ~800K in Western Europe and ~1.7M in China by 2035. We have Model 3/Y accounting for ~2.3M/year and the new affordable Model 2 selling ~3M/year at maturity. Given our expectation that management's goal is to increase volumes in order to sell autonomy, we have gross margins falling from 18% in 2023 to 11% by 2035. This conservatively assumes Model 2 at breakeven despite management expecting the car to cost $20K to make and be priced at $25K (ex-$7,500 to the consumer for the IRA credit). We value Cars at $78B using a 2.5x mass market OEM multiple (up from 2.0x) on 2024E EBITDA. Lowering Licensing but Autonomy still key. OEMs have been pulling back on organic investments and ordinarily this should be viewed constructively for FSD licensing. Commentary from CEO Musk on the Q4/23 results call suggests a reluctance on their part however. Some of this stems from customer criticisms over the product in urban areas where it drives \"overlycautious.\" While management believes with its v12 release currently underway this year that this issue will be resolved, at this time we lower our licensing penetration forecast across both FSD and Robotaxi businesses (from 20% to 10%). This reduces our Robotaxi/FSD value by $34/$2 per share, respectively. All that said, Autonomy still represents ~80% of our Tesla valuation. Raise PT to $298. On a net basis, (+$34/share from Megapacks, -$36/share from Autonomy, and +$3/share from Cars), we raise our PT to $298 from $297.\" Receive full access to all new and archived articles, unlimited portfolio tracking, e-mail alerts, custom newswires and RSS feeds - and more! "
}