{
    "title": "Tesla's Getting Gutted, but Don't Bet Against Elon",
    "date": "1/29/2024",
    "url": "https://www.energyandcapital.com/teslas-getting-gutted-but-dont-bet-against-elon/",
    "text": "Written By Jeff Siegel Posted January 29, 2024 Last week, reports surfaced about Tesla (NASDAQ: TSLA), recalling nearly 200,000 vehicles due to a software glitch affecting backup cameras.  This was actually a recall from a month ago, bu tit’s worth revisiting for the simple fact that it’s less of a “recall” and more of a software update. Of course, on the surface, this news seemed pretty unwelcomed after shares took a hit following a less-than-enthusiastic quarter and outlook.  But what most folks who don’t own Teslas don’t understand is that typically, when Tesla has a recall, it’s done so with very little effort on the part of the owner. Unlike most legacy carmakers, which require you to take time out of your busy day and make an appointment to physically bring your car in, Tesla’s recall “fixes” happen via an online software update. Those always looking for a reason to shit on Tesla used this recall as an opportunity to do so – again.  But those folks have been doing this since the company went public more than ten years ago.  And yet still, Tesla persists. The same is true for the stock, despite some headwinds the company will face this year. You see, Tesla is seen today as an EV company.  But in reality, it’s an energy company.  And in fact, one day, Tesla’s primary business will not be cars, but instead, energy production, EV charging, and energy storage. In fact, we’re now seeing evidence that Tesla’s energy storage division will likely be the biggest provider of revenue growth in 2024. According to its investor filings, total energy storage installations more than doubled from 2022 to 2023, with that division’s profits nearly quadrupling. We know that the US market for utility-scale battery storage is expected to grow by nearly 40% this year.  And globally, the market is expected to grow a CAGR of 26.4% from 2023 through 2028. And while Tesla isn’t the only game in town when it comes to battery storage, it’s one of only about a half dozen legitimate contenders in the space.  And one that could see the growth of its energy storage business bolster the value of its stock. I would also point out that the company is not in as bad of shape as some folks would have you believe. While Tesla growth projections have been lowered, the company is still growing volume by as much as 20% per year, and still making about $6,000 profit per car.  This, while most legacy carmakers that are now in the EV game, continue to lose money on every EV they produce. It won’t always be that way, but it’s an advantage Tesla has at the moment.  As well as having enough domestic sourcing and production to make it eligible for EV tax credits. Those tax credits, too, will not always be around.  But given recent price drops, coupled with those tax credits, we’ve seen that it’s no longer just rich folks being able to afford Teslas. Unit sales this year are expected to grow by around 17%.  Certainly much lower than the 38% from last year, and that is certainly something that will weigh on the stock in the near-term. But long-term, I maintain that Tesla will remain a force.  Again, because it’s not just selling cars.  It’s selling energy and it’s selling innovation. Now its energy storage business will be the star of the show in 2024.  And by the end of the decade, the company’s network of high-speed charging stations could generate as much as $20 billion. Also consider Tesla’s autonomous driving business.  Something that has made it a target for an outspoken class of influential Luddites who don’t understand that the future of personal transportation will be autonomous, but also something that could be a virtual gold mine for the company. I’m not saying Tesla will be the leader in self-driving technology, but it sure as hell has an early mover advantage, and could ultimately become worth hundreds of billions of dollars as it could be licensed to other car companies.  Many of which have already signed deals that allow their customers to use Tesla’s network of fast-charging stations. While I understand that Elon Musk can be a polarizing figure, he has created the genesis of what will likely become an unstoppable force: an energy and tech company that produces and sells everything from electric cars and charging stations to energy storage and AI-driven autonomous driving technologies. I would also suggest to those questioning the long-term value of Tesla to check out some of the company’s Q4 and FY, 2023 highlights and summary, which seem to somehow get glossed over by analysts who have been wanting Tesla to fail since 2010. They’re not trivial … Summary In 2023, we delivered over 1.2 million Model Ys, making it the best-selling vehicle, of any kind, globally. For a long time, many doubted the viability of EVs. Today, the best-selling vehicle on the planet is an EV. Free cash flow remained strong in 2023 at $4.4B, even as we focused on future growth projects with our highest capital expenditures and R&D expenses in company history. Energy storage deployments reached 14.7 GWh in 2023, more than double compared to the previous year, while Energy Generation and Storage business profits nearly quadrupled in 2023. Gross profit of our Services & Other business increased from a ~$500M loss in 2019 to a ~$500M profit in 2023. Cost of goods sold per vehicle 5 declined sequentially in Q4. Our team remains focused on growing our output, investing in our future growth and finding additional cost efficiencies in 2024. In late December, we started rolling out V12 of FSD Beta 6 . Trained on data from a fleet of over a million vehicles, this system uses AI to influence vehicle controls (steering wheel, pedals, indicators, etc.) instead of hard-coding every driving behavior. V12 marks a new era in the path to full autonomy. We are focused on bringing the next generation platform to market as quickly as we can, with the plan to start production at Gigafactory Texas. This platform will revolutionize how vehicles are manufactured. Now I’m now saying you should run out and buy shares of Tesla, but I actually see this recent stock decline as the beginning of something that could bring shares down to levels that will represent an opportunity to buy Tesla on the cheap. Make no mistake: it’s never been wise to bet against Uncle Elon.  And if given the opportunity to buy shares of Tesla at a discount, you should not hesitate. The price of lithium has been on a volatile roller coaster for years, but stability could come quicker than anticipated. In fact, lithium could be gearing up for its biggest run yet. It's all thanks to an Oregon State geologist and their discovery of a \"Lithium Volcano.\" Get the details and three stocks to play lithium's 4,000% rise in our latest investor report. Sign up for Energy and Capital now--It's free. By signing up, you'll get our latest report, 3 Stocks for Lithium's 4,000% Rise.You’ll also begin receiving the Energy and Capital e-Letter, delivered to your inbox daily. Introductory Lithium has been the front-runner in the battery technology market for years, but that is all coming\n                    to an end. Elon Musk is against them, but Jeff Bezos is investing heavily in them. Hydrogen Fuel\n                    Cells will turn the battery market upside down and we've discovered a tiny company that is going to\n                    make it happen... ENERGY AND CAPITAL 3 EAST READ ST BALTIMORE, MD 21202 TEL: (877) 303-4529 FAX: (410) 814-5959   ©  ENERGY AND CAPITAL. ALL RIGHTS RESERVED. ©  ENERGY AND CAPITAL. ALL RIGHTS RESERVED. "
}