{
    "title": "Tesla board faces familiar report of Elon Musk using drugs",
    "date": "1/8/2024",
    "url": "https://fortune.com/2024/01/08/elon-musk-drug-use-tesla-board-lsd-ketamine-journal-report/",
    "text": "Elon Musk’s reported drug use has Tesla Inc. board members facing a familiar quandary: having to decide what, if anything, to do about the chief executive subjecting directors and shareholders alike to great financial and legal risk. The Wall Street Journal’s article describing Musk’s history of recreational drug use and ongoing consumption of ketamine is the latest in a long line of tests for a board packed with the CEO’s acolytes — several of whom agreed less than six months ago to return $735 million to settle a lawsuit alleging they had excessively compensated themselves. Shareholders voiced dissatisfaction with the board last year over Tesla’s succession planning, and accused Musk of being distracted by his commitments to other companies. His chaotic 2022 takeover of Twitter Inc., the social media company he’s renamed X Corp., contributed to Tesla losing $672 billion in market capitalization that year. Read more: Elon Musk took drugs with Tesla board members: Report Before that, directors rode out litigation related to Musk’s doomed effort to take Tesla private in 2018, and his calling a cave explorer involved in the rescue of a youth soccer team in Thailand that year a pedophile. They also testified in proceedings related to the $55 billion compensation package they arranged for Musk, and in a trial challenging Tesla’s $2.6 billion acquisition of SolarCity, the struggling power provider run by Musk’s cousins. The report by the Journal — which said Musk has used LSD, cocaine, ecstasy and psychedelic mushrooms, often at private parties — isn’t even the Tesla board’s first brush with drug-related issues. Weeks after the New York Times reported in August 2018 that directors had expressed concern about Musk’s use of Ambien, he puffed a blunt containing marijuana on comedian Joe Rogan’s podcast. Tesla’s board took minimal action in the wake of those episodes. It replaced Musk as chairman and named two new independent directors as required by the settlement of fraud charges brought by the US Securities and Exchange Commission. It could face more litigation over its handling of Musk’s drug use, said Stephen Diamond, who teaches courses on corporate governance at Santa Clara University’s School of Law. “This will give ammunition to class-action lawyers on behalf of disgruntled shareholders at Tesla, if they can tie evidence of drug use to his actual role as an executive,” Diamond said. “The Tesla board has an obligation to discern what’s going on here.” While Musk’s drug use has the potential to harm his other enterprises — particularly Space Exploration Technologies Corp., a US government contractor — he derives more of his fortune from Tesla than any other company. His shares and exercisable stock options are worth $97.6 billion, or about 44% of his $219.4 billion net worth, according to the Bloomberg Billionaires Index. “Whatever I’m doing, I should obviously keep doing it!” Musk posted on X, citing Tesla and SpaceX being the world’s most valuable car and space companies. “If drugs actually helped improve my net productivity over time, I would definitely take them!” Tesla’s longest-serving directors are Musk, 52, and his younger brother, Kimbal — both have been on the board since 2004. Kimbal’s reelection to the board has gotten pushback in recent years from an investor critical of his lack of relevant industry experience and a proxy adviser concerned about objectivity. Proxy advisers also opposed the 2022 reelection of Ira Ehrenpreis, a venture capitalist who has been on the board since 2007. They cited concern about the amount of borrowing against Tesla stock by Musk and other directors, and a half measure the board took in response to a shareholder proposal for annual director elections that got majority support in 2021. The only other relatively long-tenured director on the board is Robyn Denholm, who joined in 2014 and became chair in 2018. Months after her elevation to the position, which was linked to the SEC suing Musk and Tesla over his take-private tweeting, she praised Musk’s use of the social media platform. “Twitter is part of everyday business for many executives today,” Denholm said in a March 2019 interview. “From my perspective, he uses it wisely.” Tesla’s four other directors are James Murdoch, the former 21st Century Fox CEO appointed in 2017; Kathleen Wilson-Thompson, the former human-resources chief of Walgreens Boots Alliance Inc. who joined in 2018; and Joe Gebbia and JB Straubel, who were elected to the board last year. Gebbia co-founded Airbnb Inc., and Straubel is a co-founder of Tesla. Musk has close relationships with Murdoch, Gebbia and Straubel. During testimony in Delaware Chancery Court over his Tesla compensation package in 2022, the CEO fielded questions from a plaintiff’s lawyer about vacationing with Murdoch on several occasions. After Musk tweeted about trying to take Tesla private, Gebbia texted his praise, calling it a “baller move.” Musk and Straubel’s ties date back to Tesla’s founding in 2003. While Tesla’s directors have been well-compensated, being a board member has at times been risky. In April 2020, the company disclosed that it had decided not to renew its directors’ and officers’ liability policy, due to high premiums quoted by insurers. Musk agreed to personally provide coverage, which the board determined wouldn’t impair directors’ independent judgment. After catching flak for the arrangement, which initially was planned to last a year, Tesla disclosed in October 2020 that it had lined up a customary insurance policy for its directors and officers. It paid Musk $3 million for 90 days’ worth of interim coverage that he provided. Musk’s reported drug use may temporarily hit Tesla’s shares, said Gene Munster, a managing partner at Deepwater Asset Management. But those who have held on through the CEO’s antics have been rewarded — the stock has soared 1,168% since Musk’s marijuana toke in September 2018. “A small percentage of investors will sell their stock over the next week and put some pressure on shares,” Munster said Sunday. “Most investors won’t care, because it falls into the category that if you want to profit from Elon, you have to put up with his controversies.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}