{
    "title": "A power play at Tesla could give investors a painful shock",
    "date": "1/18/2024",
    "url": "https://fortune.com/2024/01/18/elon-musk-stake-voting-control-tesla/",
    "text": "Hi folks, senior tech reporter Kylie Robison here. This week, the world’s richest man is asking for more money and power, because of course. “I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control,” Musk tweeted. “Enough to be influential, but not so much that I can’t be overturned.” He currently has a 13% stake in the electric car manufacturer after selling a big chunk of his shares in Tesla to help fund his $44 billion acquisition of Twitter (now known as X). He added that unless he’s able to secure the 25% voting control, he’d “prefer to build products outside of Tesla.” Perhaps Musk is having a touch of Zuck envy. The Meta CEO and Facebook founder has 61% voting control of his company thanks to special supervoting shares. In fact, dual share structures are the norm in founder-led tech companies: Alphabet, Snap, Pinterest, and Palantir all have them. The idea, in theory, is to give “visionary” tech entrepreneurs the leeway to focus on long-term bets without meddling from pesky investors hungry for short-term profits. And to Musk’s credit, his track record of executing on long-term bets (from electric cars to reusable rockets) looks pretty strong compared to say, the leaders of Snap or Pinterest. “If I have 25%, it means I am influential, but can be overridden if twice as many shareholders vote against me vs for me,” Musk noted in a tweet. “At 15% or lower, the for/against ratio to override me makes a takeover by dubious interests too easy. I would be fine with a dual class voting structure to achieve this, but am told it is impossible to achieve post-IPO in Delaware.” Still, Musk’s threat to move AI development out of Tesla (which livestreamed splashy “AI day” events for a couple of years) if he doesn’t get what he wants, is not exactly a diplomatic or collaborative way to go about it. And his request comes at a strange time. Musk is still in the midst of a lawsuit regarding his whopping $56 billion pay package, which he references in the post, where his time spent “on the clock,” so to speak, at Tesla is under some scrutiny. Not long ago, Tesla shareholders were concerned about Musk’s time split between his companies: SpaceX, Neuralink, Boring Company, xAI, and X, even taking to the platform he owns to voice their displeasure. “There is no TSLA CEO today,” Gary Black, managing partner of Future Fund LLC, which holds approximately $50 million in Tesla shares, posted a year ago. “The market voted today that the $TSLA brand has been negatively impacted by the Twitter drama. Where before EV buyers were proud to drive their Teslas to their friends or show off Teslas in their driveways, now the Twitter controversy is hurting Tesla’s brand equity,” Black told the Wall Street Journal at the time. What’s more, Musk’s erratic posts about anti-Semitic conspiracy theories and the Journal’s explosive exposé on his alleged drug use hardly bolster his argument for increased influence over the $675 billion automaker. Yet, as Bloomberg’s Matt Levine points out, “his companies need to compete for his attention, and that competition is expensive.” So, maybe, the board will give him what he wants. I’m doubtful it’ll get them more of his attention, though. His hands are rather full, I mean, I just watched him play Diablo for 3 hours. He’s a busy, busy man! You’re busy too, so here’s a quick rundown of today’s biggest tech news. Kylie Robison Want to send thoughts or suggestions to Data Sheet? Drop a line here. Reddit IPO. After three years of toying with an initial public offering launch, Reddit plans to publicly file its IPO in February and go public in March, Reuters reported, citing sources familiar with the matter. While the IPO market has been in a yearlong drought, Reddit may be banking on some sizzle from the value of its massive corpus of online conversations at a time when AI companies are hungry for data to train their models on. YouTube cuts. Alphabet-owned YouTube is restructuring its partnerships division for the first time in a decade, which includes laying off 100 people, Tubefilter reported. Creator management and operations teams will be impacted. OpenAI goes to college. OpenAI has announced a deal with Arizona State University, in which students will receive full access to ChatGPT Enterprise beginning next month, CNBC reported. The partnership marks the first of its kind for the ChatGPT maker. “TikTok has kept parents in the dark. It’s time we shine a light on TikTok for exposing young children to graphic materials such as sexual content, self-harm, illegal drug use, and worse. TikTok has sneaked past parental blocks by misrepresenting the severity of its content.” —Iowa Attorney General Brenna Bird said in a statement to the Verge in response to the state of Iowa filing a lawsuit against TikTok. Bird claims mature content is easily accessible to children on the app and that TikTok’s age restriction, currently set at “12+,” should be “17+.” Sundar Pichai is taking a leaf out of Mark Zuckerberg’s book and warns Google staff ‘ambitious goals’ can only be met with job cuts, by Eleanor Pringle Exclusive: Microsoft gave its venture fund $275 million this year to invest in startups aligned with its mission, by Rachyl Jones Daniel Ek dashes ‘magical’ CEO illusions and says he’s ‘probably the least powerful person at Spotify’ thanks to Scandinavian leadership model, by Ryan Hogg Sheryl Sandberg is leaving Meta’s board, cutting her last tie after joining in 2008 as Mark Zuckerberg’s chief lieutenant, by Alex Barinka, Kurt Wagner, and Bloomberg Apple will turn off blood-oxygen feature on 2 premium watches as part of patent fight with Masimo, by Michael Liedtke and the Associated Press Alaska Airlines’s faulty Boeing door plug was made in Malaysia—and that’s complicating investigations into why it ripped off mid-flight, by Nicholas Gordon Netflix’s Vision Pro reversal. Apple is selling its Vision Pro headset as the ultimate entertainment product, but in a major blow to the company, Netflix said it will not offer a dedicated viewing app for the device, Bloomberg reported. The news reverses Netflix’s previous stance that its iPad app would work with the headset. Vision Pro users will still be able to access Netflix content via the web. This is the web version of Data Sheet, a daily newsletter on the business of tech. Sign up to get it delivered free to your inbox. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}