{
    "title": "Tesla Q4 Earnings Preview: Margins Likely To Slip Again (NASDAQ:TSLA)",
    "date": "1/23/2024",
    "url": "https://seekingalpha.com/article/4664406-tesla-q4-earnings-preview-margins-likely-to-slip-again",
    "text": "Future Publishing/Future Publishing via Getty Images  Future Publishing/Future Publishing via Getty Images Tesla, Inc. (NASDAQ:TSLA) Q4 earnings are on tap after the market close on Wednesday January 24, closing up a year in which aggressive price cuts helped the automaker top Q4 delivery estimates reach a new record and narrowly beat its 1.8 million volume target. Tesla’s continued actions to improve vehicle affordability throughout the year have been detrimental to margins, as average selling price is falling quicker than production costs. We covered in the past how Tesla’s lower selling prices in China are having a detrimental effect on margins, as well as assessing how low Tesla’s margins could go. We reiterated after Q3 earnings that this continual decline in margins highlights a broader concern for investors in that Tesla has provided no concrete guidance on how far margins will decline. Tesla kicked off Q4 with price cuts in the U.S. for some Model 3 and Y versions after Q3 deliveries missed expectations, though it raised prices later in October for the Model Y Long Range and X Plaid AWD. Tesla also increased the price of the Model 3 and Y in China in Q4, reportedly due to rising production costs. Given these pricing trends, ASPs look set to remain pressured in Q4 while production costs may decline marginally, a combination likely to cause margins to slip again. It is imperative for the bull case that operating margins show sequential improvement in Q1 should it fall to the low 7% range in Q4. Assuming a ~10% QoQ increase in operating expenses, about in line with historical trends, Q4’s operating margin is projected to be ~7.2%, for a ~40 bp sequential decline. The analysis below looks at what investors need to know moving into Q4, and equally important, a few red flags we see going into Q1 and Q2 to keep an eye on. While the promise of full autonomy and its potential value entice some investors, the core story remains margins heading into the Q4 release. Notably, margins topped in Q1 2022, and shares have returned (41.0%) since the end of that quarter. YCharts YCharts Automotive gross margin excluding regulatory credits topped in Q1 at 30.03%, before slumping to 16.33% in Q3 2023. Quarterly operating margin peaked at 19.21%, before falling to 7.6% in Q3 2023. Wall Street continues to search for a bottom in margins, which look set to decline again based on current trends in ASP and production costs per vehicle. TESLA, AUTHOR CALCULATIONS TESLA, AUTHOR CALCULATIONS Aggressive price cuts pulled ASPs below $45,000 in Q3, a level likely to stay in play as recent price hikes for certain models are unlikely to aid pricing given the pace of cuts throughout 2023. Looking forward to Q4, ASP is projected to decline (1%) to (1.5%) sequentially, impacted by recent price cuts and a slightly higher mix of retail sales in China in the quarter, at just over 35% in Q4 compared to 32% in Q3. Production costs were reported to have risen slightly in China during the quarter, resulting in a price hike, but Tesla likely enjoyed favorable tailwinds to battery pack cost optimization, as lithium prices continued to fall through the quarter. In addition, BloombergNEF estimated lithium-ion battery pack prices declined 14% YoY in 2023 to $139/kWh, with passenger BEV batteries falling to $128/kWh. Based on favorable tailwinds from raw materials prices and headwinds from reports of increased production costs, COGS is estimated to have declined between (0.5%) to (1%) sequentially. As seen in the scenario analysis below, the incremental effects to gross margin from a 0.5% change in production costs are ~42 bp compared to ~50 bp for a 0.5% change in ASP – therefore, it is critical to margins bottoming that production costs decline faster and/or further than prices, or selling prices begin to increase. AUTHOR CALCULATIONS AUTHOR CALCULATIONS Our current assumptions point to a slightly larger sequential decline for ASP, an unfavorable combination for margins. For Q4, automotive gross margin is projected at ~15.1%, excluding regulatory credits and operating leasing; including operating leasing, automotive gross margin would project to 15.71%, pointing to a ~60 bp sequential decline from Q3’s 16.33%. AUTHOR CALCULATIONS AUTHOR CALCULATIONS A sequential decline in automotive margin likely spells another sequential decline for operating margins, though there is increasing evidence that operating margins might be approaching a bottom in Q4. We highlighted in late August via a competitive analysis framework that we believe Tesla’s Q3 operating margins can decline to a level between Honda and VW (HMC, VWAGY), or between 7.8% to 9.6%. However, if operating margins were to reach a level closer to — or below General Motors (GM) — that could be a sign they’re close to the bottom. This highlights the broader concern for investors in that Tesla has not provided any parameters nor guidance to assess how low margins may go. YCharts YCharts Q3’s actual operating margin came in below that level, at 7.6%, landing between Honda’s 8.5% and VW’s 6.2%, while still sitting above GM’s 6.8% margin. With automotive gross margin estimated at ~15.7%, company-wide gross margin is expected to hover around 17.5%, assuming a ~180 bp benefit from regulatory credits and positive impact from Energy Storage and Services. Assuming a ~10% QoQ increase in operating expenses, about in line with historical trends, Q4’s operating margin is projected to be ~7.2%, for a ~40 bp sequential decline. At that level, the spread between Tesla’s operating margin and GM’s would be less than 40 bp, adding evidence that operating margins are approaching a bottom. Aggressive price cuts look to be easing, a tailwind for ASP inflection, while declining lithium and Li-ion battery prices would add production cost reduction, a second tailwind for margins. It is imperative for the bull case that operating margins show sequential improvement in Q1, should it fall to the low 7% range in Q4. This is crucial for earnings estimates to begin seeing upwards revisions once more, as forward earnings estimates have fallen significantly over the past six months: Q1’s trajectory, from pointing to over 20% YoY growth to now suggesting a low single-digit YoY decline raises red flags for Q2’s growth forecast, even after a 2100 bp revision lower. Weaker than expected margins in Q4 and/or Q1 could quickly see Q2’s adjusted EPS figure revised lower for another YoY decline. The bull case would need to have concrete evidence of margins bottoming in Q4/Q1 in order to avoid multiple quarters with YoY declines for EPS. Tesla has already cut prices twice in January, by (3%) to (6%) on the Model 3 and two Model Y variants in China, followed by (4%) to (8%) cuts on Model Y variants across Europe. This raises the risk that ASPs fall much further than COGS in Q1, driving a sequential decline in margins and adding more uncertainty to when and where margins will bottom. CEO Elon Musk emphasized in Q2 that Tesla is focusing on volume growth at the detriment of margins, based on his view that unlocking full autonomy will lead to a substantial increase in the value of each vehicle and therefore for Tesla: “it does make sense to sacrifice margins in favor of making more vehicles because we think in the not too distant future, they will have a dramatic valuation increase.” CFO Vaibhav Taneja reiterated this in Q3, saying Tesla is “focused on reducing costs, maximizing delivery volumes, and continuing making investments in the future.” Q4’s production of 494,989 took FY23’s total production to 1.85 million vehicles, while deliveries of 484,507 took the full year’s total to 1.81 million vehicles — this represented delivery growth of 38% YoY and production growth of 35% YoY. This focus on volume growth via price cuts comes as Tesla is increasingly at risk of losing its title as the world’s largest BEV manufacturer on an annual basis, after losing the title on a quarterly basis this quarter to BYD Company (BYDDF, BYDDY). BYD has extended its lead against Tesla in China, especially so in Q4, proving that it can’t be ignored as a fierce competitor on the global stage. BEV sales for BYD increased 22% QoQ in Q4 to reach 526,409 vehicles, almost 9% higher than Tesla’s total. BYD had nearly matched Tesla’s deliveries in Q3 as both held ~18% of the global BEV market that quarter, and BYD’s rapid growth allowed it to take the throne in Q4. Annually, BYD’s BEV sales came in at 1.57 million, +73% YoY, putting it on track to challenge Tesla’s annual volumes in 2024. Many of the FAANGs are in the final throes of very mature long-term, uptrend patterns, some of which started in 2009. Many FAANGs are either at all-time highs, or just shy of them; however, Tesla trades roughly 50% lower than its 2021 highs, which signals relative weakness compared to other FAANGs. TRADINGVIEW TRADINGVIEW It’s worth noting the head and shoulders pattern that is close to confirming. This is the red count above, which implies that if Tesla breaks below $203, then the lower target will be sub-$100, as we likely press below the January 2023 lows. If Tesla is going to have any chance at a sharp uptrend, it would need to break above $264 and $280 in a vertical manner. If this happens, we can start discussing the possibility of $345 - $400. This is the green count in the chart, and it has a low probability of manifesting. The problem with this scenario is that no FAANG supports this type of move. This would be a 60% - 80% move higher in Tesla. Most FAANGs look like they have topped or have one more minor swing higher before topping. Even the strongest FAANGs are suggesting a final push higher that doesn’t fit with the above green count. Meta Platforms (META), being one of the stronger FAANGs, only has room for a 4% - 10% move higher before completing a mature 5 wave pattern off the January low completes. Nvidia (NVDA), being the strongest FAANG, only has room for a 5% - 18% move, at most, before it becomes a better buy at lower levels. Therefore, neither the fundamentals, nor the technicals support this type of large move higher in Tesla, which makes the red count more likely at this time. The main story for Tesla, Inc. through 2023 and now entering 2024 has been when and where margins will find a bottom. Margins have declined significantly, as Tesla prioritized growing delivery volumes via aggressive price cuts – automotive gross margin has fallen nearly 1400 bps in six quarters, while operating margin has pulled back to the mid-7% range. The two are both projected to slip again in Q4, as price cuts are expected to offset any incremental margin benefits from lowering vehicle production costs. This rather rapid decline in margins is having a direct impact on forward earnings estimates, with Tesla now expected to report a single-digit YoY decline in fiscal Q1 and almost zero growth in fiscal Q2, compared to prior views for >20% YoY growth. Operating margins are nearing a level where we believe it will find a bottom, while more constructive pricing action through the rest of 2024 and/or continued improvements in lowering production costs will also help aid margin recovery. Tech Insider Network Equity Analyst Damien Robbins contributed to this analysis. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. We offer tech sector coverage that combines fundamentals and technicals. After recommending a stock, we provide entries and exits. Our audited 3-year results of 47% prove we are a top-performing tech portfolio. This compares to popular tech ETFs at negative 46% and the Nasdaq at 19%. We are the only retail team featured regularly in Tier 1 media, such as Fox, CNBC, TD Ameritrade and more. Our services include an automated hedge, portfolio of 10+ positions, broad market analysis, real-time trade alerts PLUS a weekly webinar every Thursday at 4:30 pm Eastern. Learn more. This article was written by Beth Kindig is the CEO and lead technology analyst for the I/O fund and has ten years of experience as a professional in the tech industry. She is a regular speaker at tech conferences and on financial news programs such as: Fox Business, TDAmeritrade, CoinDesk, NPR, Bloomberg TV Asia, Motley Fool podcast, This Week in Startups and more discussing her stock analysis. She is known for making bold calls on tech stocks. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, but may initiate a beneficial Long position through a purchase of the stock, or the purchase of call options or similar derivatives in TSLA over the next 72 hours.   I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}