{
    "title": "Tesla (TSLA) launches Model 3 Highland in the US and Canada — available in \nnew Stealth Grey and Ultra Red colors",
    "date": "1/10/2024",
    "url": "https://www.teslaoracle.com/2024/01/10/tesla-tsla-launches-model-3-highland-in-the-us-and-canada-available-in-new-stealth-grey-and-ultra-red-colors/",
    "text": "Tesla offers Cybertruck vinyl wraps in 11 different colors Tesla promotes Model Y on US roads and in YouTube ads, price to increase on April 1st DJ Steve Aoki is amazed by his Tesla Cybertruck Foundation Series Cyberbeast Tesla promotes Model Y on US roads and in YouTube ads, price to increase on April 1st Tesla introduces a two-seat Model Y in France as a commercial utility vehicle Tesla to fix auto wiper issues with an OTA software update soon Tesla Model 3 Ludicrous air suspension, track mode, and more info leaked in a new video Model 3 Highland “Ludicrous” variant found in the Tesla car configurator code, performance specs leaked Ludicrous Tesla Model 3 Highland spotted with design changes in Europe Tesla to fix auto wiper issues with an OTA software update soon Stealth Gray Tesla Model X spotted next to a Midnight Silver Metallic Model 3 for the first time Watch the Unplugged Tesla Model S Plaid handle the Laguna Seca Corkscrew turn like it’s nothing, sets a new record Tesla Model Y, Model 3, and Model S are now eligible for the $2,500 Texas EV grant (TERP) Flight 4 Starship goes through 2nd static fire test, OLM gets repairs at Starbase, more Watch Starship Flight 3 (IFT-3) live stream recording and live updates from the SpaceX Starbase launch site Starship Flight 3 (IFT-3) date falls on SpaceX’s 22nd foundation anniversary, FAA approves the launch Starship Flight 3 NET launch date set to March 14 with a new flight and splashdown trajectory Tesla Robot updates: Elon Musk shares new video of Optimus walk, new 4K photo, predicts 2040 market scope Tesla Optimus humanoid robot will be able to thread a needle in a year, says Elon Musk Tesla shares Optimus robot’s AI progress, Elon Musk pledges to make it safer with convenient switch-off mechanisms Tesla joins World AI Conference in Shanghai with its Autopilot cars and Optimus robot, Chinese car companies are far behind Tesla in AI, says... How Do Autonomous Vehicles Handle Fixed Road Obstructions? New Tesla customers to get FSD Beta v12.3.1 test drives, capable cars to get a one-month free trial in the US, Elon Musk Chuck Cook tests Tesla FSD Beta v12.3 at challenging unprotected left turns (video) Tesla FSD v12.3 gets good first impressions from the beta testers (videos) New Tesla customers to get FSD Beta v12.3.1 test drives, capable cars to get a one-month free trial in the US, Elon Musk Tesla Roadster to get radical design changes, an even better 0-60 time, and shipped next year — Elon Musk Vandals fail to break the Cybertruck glass in California — Elon Musk says it’s the finest in apocalypse defense technology Tesla Model 3 involved in a terrible crash never had Full Self-Driving installed on it — confirms Elon Musk - Austin, Texas-based electric automaker Tesla (TSLA) has finally put the new 2024 Model 3 Highland refresh on sale in the United States and Canada. Tesla updated its online car configurator very early in the morning today to replace the legacy Model 3 with the new design-refreshed model. In our previous article from Sunday on the topic, we posted that Tesla updated the color palette for the Model Y with Stealth Grey and Ultra Red. The automaker did not offer these new colors for the Model 3 — hinting at the close launch of the Highland Model 3. However, it happened sooner than we expected. Interestingly, Tesla did not change the prices and range for the new Model 3, they remain the same as the previous legacy model. The new Tesla Model 3 RWD base variant starts at $38,990 and the Long Range AWD version is priced at $45,990. Like the rest of the world, Tesla isn’t offering the higher-end Performance variant of the new Model 3 Highland in the North American region as well. Tesla has kept the specifications of the Model 3 Highland the same as other regions where it’s available. The automaker has even offered the same wheels (18″ Photon and 19″ Nova) as China, Europe, and the Middle East. Tesla’s Fremont car factory was recently seen swarmed with the new Model 3 Highland cars with Chinese badges. Not just the factory, but they were also sighted across California for testing purposes. This created the speculation that pre-production had begun at the factory. However, there were no solid reports of Tesla upgrading its assembly line at the Fremont factory recently. The automaker successfully held the Model 3 Highland production line upgrades a secret. However, one Reddit comment I read earlier has proven to be correct with today’s launch, u/LloydsZ wrote: My friend works at the Fremont factory and said they built the last model 3 the night of December 29. And they will start building the new model 3 within the next coming weeks Some information about the Tesla Model 3 Ludicrous (performance version) was leaked via the car’s online parts catalog last year. But Tesla removed it and any traces as soon as the news went viral. As we can see in the Tesla Model 3 online studio screenshot above, the estimated delivery date is mentioned January to February 2024. This means Tesla has scaled up the new Model 3 production enough to meet the expected demand. Tesla also does not mention any information about the federal tax credit for the newly-launched Model 3 Highland in the car configurator. Last month, the automaker encouraged buying a Model 3 before 31st December 2023 to gain the full tax credit of $7,500 and it would phase out entirely at the start of 2024. Even with all the success in 2023 with a record number of vehicle deliveries globally, Tesla’s share price is still struggling on the stock market. According to some analysts, investors are counting on Elon Musk’s talk during the upcoming Q4 2023 earnings call to further gauge their decisions regarding Tesla’s (TSLA) investments. Tesla investor and analyst Gary Black wrote on X (Twitter): Tesla struggling the past few days as investors worry about the 4Q conf call on 1/24. #1 question: Will Elon be his usual gloom-and-doom self on the call and blame the economy for 2024 TSLA estimates coming down? Or will he put his $TSLA CEO hat on and share his vision of the product plan, pricing environment, and road to 10M vehicles/year? Updates on Optimus progress would be a plus. Stay tuned for constant Tesla updates, follow us on: Google News | Flipboard | RSS (Feedly). Save my name, email, and website in this browser for the next time I comment.  The best Tesla, SpaceX, and Elon Musk ventures news on the web. Disclaimer: We are not officially affiliated with Tesla, Inc. in any way or form. © Copyright - Tesla Oracle. All rights reserved. Privacy Policy | Contact "
}