{
    "title": "Why Toyota May Have the Best Strategy in the EV Race",
    "date": "2/18/2024",
    "url": "https://oilprice.com/Energy/Energy-General/Why-Toyota-May-Have-the-Best-Strategy-in-the-EV-Race.html",
    "text": "Click Here for 150+ Global Oil Prices Start Trading CFDs Over 2,200 Different Instruments Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Start Trading CFDs Over 2,200 Different Instruments Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Start Trading CFDs Over 2,200 Different Instruments Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Start Trading CFDs Over 2,200 Different Instruments Click Here for 150+ Global Oil Prices UAE Eyeing Investments in Europe's Nuclear Energy Sector Find us on: The oil markets are increasingly… Morgan Stanley remains pessimistic about… Despite facing existential threats like… ZeroHedge The leading economics blog online covering financial issues, geopolitics and trading. More Info Authored by Michael Lebowitz via RealInvestmentAdvice.com, Over the last four quarters, Tesla generated total revenue and earnings of $96 billion and $15 billion, respectively. Toyota’s revenue and earnings are roughly three times larger at $299 billion and $44 billion. Yet Tesla’s market cap is more than double that of Toyota. Tesla shares have soared since going public, while Toyota and other major auto manufacturers’ shares have meandered along. Since going public in 2010 at $1.59 (split adjusted), Tesla shares are up nearly 12,000%. That figure is more stunning, considering it’s down 50% since late 2021. The graph below, charting the two stocks since 2018, highlights Tesla’s outperformance versus Toyota and the extreme volatility of its returns. As shown in the second graph, 40-50+% drawdowns are not uncommon for Tesla.   Tesla shares have outperformed Toyota’s and the market because of the significant growth of EVs, a robust outlook for EV market penetration, and forecasts that Tesla will maintain its lead role in manufacturing EVs. Tesla’s market cap relies on all three coming to fruition. What if one or more of those do not occur? Might hybrids be the preferred technology until a more efficient battery evolves? Will EV competition from established and new auto manufacturers upend Tesla’s market share? Maybe most critical, could Toyota, not Tesla, be at the forefront of a significant technological advance for automobiles? With a price-to-earnings ratio of 9 for Toyota and 72 for Tesla, the answers to our questions have critical implications for shareholders of both stocks. Sales of EVs are multiplying. The latest data shows that EVs will account for 9% of all domestic new car sales in 2024. That leaves plenty of upside for EV manufacturers if the U.S. follows the path of other countries like Germany and China, in which EVs represent approximately a third of all new car sales. While the transition from internal combustion engines (ICE) to electric is sure to continue, its pace appears to be moderating. There are a few drawbacks affecting the uptake of EVs. Consider the following: The obvious benefit for EV owners is fuel costs. NADA estimates an EV owner will save approximately $5,000 in gas and a few hundred dollars in maintenance costs over five years versus an ICE owner. The market for EVs among early adapters and wealthier, environmentally concerned consumers is starting to get saturated. More car buyers will likely shift from ICE to EV, but that transition will be slower than it has been for the more eager first adapters. At one point, Tesla’s market cap was almost equal to that of the entire auto industry. Not only were Tesla investors projecting that Tesla would be the largest automaker, but also that some of their other ventures, like energy generation and robo-taxis would do fabulously well. A lot has changed since then. Tesla no longer has a monopoly on EVs. Almost every auto manufacturer, and a few new ones like Rivian and Fisker, now manufactures EV cars, as shown in the graph below, courtesy of Cox Automotive.  Further, consider the following paragraph from Cox Automotive: EV transaction prices in Q3 were down significantly from 2022. In an attempt to increase sales volume, Tesla slashed prices, which are now down roughly 25% year over year. The price cuts have helped, as Tesla’s Q3 sales grew by 19.5% year over year, surpassing the industry’s overall growth rate of 16.3%. However, Tesla’s share of the EV segment continues to plunge, hitting 50% in Q3, the lowest level on record and down from 62% in Q1. Bottom line: Tesla is losing its competitive advantage. They are relinquishing EV market share and cutting prices, ergo profits, to stay competitive. This discussion of hybrid automobiles does not refer to models with gas engines and battery packs that can be plugged into a power source. As shown in the graph above, Toyota lags every other automaker, with only 0.5% of sales coming from EVs. However, Toyota has a different strategy regarding producing environmentally friendly vehicles. They are the largest seller of hybrid cars. The hybrid Prius was introduced to the U.S. market in 2000. Toyota’s first mover experience gives them a unique advantage in profitably manufacturing hybrid vehicles. Hybrid automobiles can get 35 to 50+ miles per gallon. The technology enables a battery to capture a charge through its braking mechanism. This electricity then supplements its internal combustion engine. Consumer Reports estimates hybrids provide a 40% improvement in gas mileage versus non-hybrids. The graphic below, courtesy of CNBC, shows that U.S. sales of hybrids have easily kept up with EV sales since 2015.  Car owners prefer better gas mileage, and we presume many want to do their part to help the environment. That said, most auto consumers are not ready to fully commit to EVs. We listed some reasons for the hesitation, but likely the most important is the price. The CNBC graphic below shows hybrids and ICE vehicles are similar in price, while EVs are costlier.  We think hybrid vehicles can be the transitional technology of choice until a better EV battery evolves. Many consumers seem to agree! The following is from a recent Wall Street Journal article entitled, Toyota Motor reports rise in quarterly net profit as sales grew. Executives at Japanese automakers that are strong in hybrids, including Toyota and Honda, say they are skeptical of competitors’ ability to catch up quickly. They observe that it took some two decades for Japanese carmakers to bring their hybrids to profit-margin parity with purely gasoline-powered vehicles. Hybrid sales grew last year at a faster clip than sales for pure electric vehicles in the U.S. and some other markets. Signs have emerged that the EV push might have gotten ahead of U.S. consumers who are worried about charging problems and higher prices. That has steered them toward less expensive hybrids, which can be filled up with gasoline. Automakers that had been rushing to pivot toward full EVs are now reconsidering. General Motors said last week it would introduce some plug-in hybrid models in North America after facing pressure from dealers. Ford Motor said last year it would seek to quadruple its hybrid sales in the next five years. We now consider the next potential game changer for the auto industry: solid-state batteries. Solid-state batteries promise to eliminate many problems associated with current EV lithium-ion batteries. Lithium-ion batteries are heavy, expensive to manufacture, slow to charge, and have a mileage range considered too short by many. Solid-state batteries vastly improve on those problems. However, whether the technology can be mass-produced at reasonable costs is unclear. Many experts believe Toyota is the leader in solid-state battery development. Per Forbes: Toyota’s stated goal is for their solid-state batteries to ultimately have a range of >1,200km, and to go from 10 – 80% charge in 10 minutes or less. This compares to the Tesla Model Y, which currently has a range of 542 km, and fast-charges in 27 minutes. Other automakers are investing in solid-state battery development. Toyota believes they will be the first to produce cars with solid-state batteries. Production could come as early as 2027. The investment and production costs are enormous, and there are no promises these batteries will make economic sense for consumers or manufacturers. Tesla does not believe in the viability of solid-state technology, and, as far as the market knows, it is not developing solid-state batteries. Elon Musk is an innovator. He knows that his current battery technology will fall behind his competitors if it is not improved. Tesla is betting on 4680 batteries instead of solid-state. The 4680 battery hopes to improve cost, weight, and energy density. Per evlithium.com, the potential benefits are battery weight, which may be about 10% lighter. Additionally, the cost of the batteries could be 15% cheaper, and the driving distance on a charge could improve by 10-15%. Such would be a decent improvement, but it pales compared to the promise of solid-state batteries. So, with an appreciation for the role of hybrids, EVs, and solid-state batteries, let’s compare Toyota to Tesla and better appreciate their comparative valuations and fundamentals. Before looking at the valuation comparisons below, consider that Tesla is a high-growth company while Toyota is mature. Toyota is the world’s largest auto manufacturer, while Tesla is ranked 15th. Given its smaller size, it is much easier for Tesla to gain global market share. The potential for outsized growth is reflected in the valuations. Tesla trades at valuations 6-8 times that of Toyota, implying 6-8x excess growth for Tesla over the long run.\nADVERTISEMENT ADVERTISEMENT The PEG ratio, however, tells a different story. The PEG ratio divides each company’s P/E ratio by its 3-5-year expected earnings growth. The ratio helps normalize the P/E ratio for companies with varying growth rates. Based on the P/E and the PEG ratio, the market implies earnings growth of 19.05% for Toyota and 12.44% for Tesla.  In addition to growing more rapidly than Toyota, Tesla is more operationally and financially efficient. EV cars have fewer parts, making assembly quicker and cheaper. Additionally, Tesla’s revenue and earnings benefit from EV credits. Lastly, Tesla generates revenue from other sources. While not currently sizable, they skew the data and forecasts. Toyota’s revenue has been relatively stagnant over the last five years, while Tesla has grown by 33% a year on average. Tesla’s cash flow growth is challenging to gauge as they are heavily reinvesting into production and R&D, as shown by the tremendous growth in its capital expenditures. Another indication that the companies are in different lifecycle stages is Tesla’s lack of dividends compared to Toyota’s healthy 3.55% yield. Tesla has much less long-term debt than Toyota. However, if they are to continue growing rapidly, debt will likely grow accordingly.  Investing in Tesla or Toyota is a bet on the future of automobiles. Tesla shareholders hope the company will continue improving EV technology, expanding its charging network, and gain valuable market share. Importantly, it’s a wager that some version of the current lithium-ion battery technology is the future of EVs. Tesla has other non-manufacturing ventures that may also be very profitable. Toyota investors will do well if the company maintains its leadership in ICE vehicles and its hybrid models continue to gain market share. Further, if solid-state batteries are the preferred EV battery, then Toyota may have a huge leg up on Tesla and the industry. Toyota has a price-to-earnings (P/E) ratio of 9, less than half of the S&P 500 and well below Tesla’s 72. It appears that Toyota offers a conservative investment in the state of the current auto industry with a potentially valuable option for the future via its considerable investment in solid-state batteries. If solid-state batteries prove to be the next step in EVs, Toyota may be the next Tesla. In such a case, Tesla may struggle if they don’t adapt to comparable technology. However, if solid-state technology is too costly, Tesla may continue to gain market share and meet the lofty goals of its shareholders. It’s worth disclaiming that other potential technologies, such as hydrogen, exist. While we don’t discount them, we limit this discussion to what is probable over the coming five years. Toyota appreciates hybrid vehicles’ role in transitioning to more energy-efficient transportation. While losing the EV battle, they make up for it in hybrid sales. More importantly, they may have a better EV battery within a few years. If Toyota can continue to dominate the hybrid space and make significant inroads into EVs later this decade via a solid-state battery, its stock is cheap. Tesla is a bet on Elon Musk and his proven ability to innovate. Not only did he start the EV revolution, but he is at the forefront of other exciting technologies. How those fold into Tesla is unknown. While Musk has proven to be a great horse to bet on, Tesla’s price is very high. At a P/E of 72 and a PEG ratio more than 10x its competitors, Tesla investors are hoping for continued tremendous growth. Importantly, they are betting that Tesla will take significant market share from well-established automakers. Given all he has accomplished, it’s hard to bet against Elon Musk. However, we think Toyota may be the safer investment and the stock with more upside. By Zerohedge.com More Top Reads From Oilprice.com: Back to homepage Previous Post Carmakers' EV Enthusiasm Fizzles Out Next Post Energy Efficiency Standards Face Pushback From Consumers and Producers The leading economics blog online covering financial issues, geopolitics and trading. Over 20% of the World’s Oil Refining Capacity Is at Risk of Closure Russian Warships Enter The Red Sea amid Houthi Attacks Pump Prices Set to Hit $4 a Gallon Why Morgan Stanley Says to Buy Energy Stocks Right Now Traders Are Buying Oil At The Fastest Rate Since 2020 ADVERTISEMENT  © OilPrice.com The materials provided on this Web site are for informational and educational purposes only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record: A Media Solutions trading as Oilprice.com "
}