{
    "title": "For all of Elon Musk's criticism, Delaware has earned companies' trust. \nIt's unclear whether Texas and Nevada can do ...",
    "date": "2/16/2024",
    "url": "https://finance.yahoo.com/news/elon-musk-criticism-delaware-earned-080921379.html",
    "text": "Good morning. I first moved to New York City for a job in Connecticut, jumping on a near-empty train from Grand Central every morning as a flood of commuters came the other way. For me, living in Manhattan was a dream come true. Others saw it as an act of fiscal stupidity. One fund manager in Greenwich tossed several dollars in the air during an interview to symbolize the money I was “throwing away” on taxes. While I didn’t have any bricks to toss to illustrate the difference in housing costs, I knew he had a point. Some people move to an area because of work or access to good schools. Others pick their homes as a form of tax arbitrage. That’s especially tempting when those tax rate differences add up to meaningful money. Jeff Bezos, for one, saved almost $300 million in capital gains taxes by selling $4 billion in Amazon stock after he moved from Seattle to Miami. While Bezos claimed he wanted to live closer to his parents, Fortune questioned that motive. Then there’s governance arbitrage, most recently practiced by Elon Musk. In recent weeks, he moved Neuralink’s incorporation from Delaware to Nevada and took SpaceX out of Delaware to reincorporate in Texas. That’s in reaction to a Delaware court voiding his $55.8 billion pay package at Tesla, another company he plans to reincorporate in Texas if shareholders agree. The irony is that more than two-thirds of the Fortune 500 choose to incorporate in Delaware because, among other things, it’s an excellent tax arbitrage. More importantly, the state is also viewed as a fair place to resolve corporate disputes quickly—in effect, the right kind of governance arbitrage. Founders (or in Musk’s case, founder-like CEOs) often struggle with the realities of being a public company. They want to raise capital without giving up control. Company owners, meanwhile, logically feel they should have a proportionate say in how things are run. It’s fair for shareholders to be concerned if there’s a perceived conflict of interest or potential pay hike that’s beyond their control. These are not always easy issues to resolve. Shareholder activists sometimes do as much damage as good. But moving to incorporate in a new state is rarely a good thing for shareholders. Like tax arbitrage, it’s a way of gaming the system to get the advantages of being in one jurisdiction without having to incur the consequences. Delaware itself became popular as an arbitrage on jurisdictions with higher taxes and tougher rules. It allows companies to easily incorporate without the fuss of having to do business there. But the state has reinforced that appeal by also creating an infrastructure that’s designed to be efficient and fair when things go wrong. It’s not perfect, but it’s created a level of trust. It remains to be seen if Texas and Nevada can evolve to do the same. More news below. Diane Brady@dianebradydiane.brady@fortune.com This story was originally featured on Fortune.com "
}