{
    "title": "Tesla sells only one car in South Korea during January",
    "date": "2/7/2024",
    "url": "https://finbold.com/tesla-sells-only-one-car-in-south-korea-during-january/",
    "text": "Amid multiple issues plaguing electric vehicle (EV) sales in South Korea, Tesla (NASDAQ: TSLA) has managed to sell only one of its vehicles in this country during January in what has been its worst month since July 2022, when it failed to sell a single EV in this market, data shows. Specifically, safety concerns, high prices, rising interest rates, a lack of charging infrastructure, and the public waiting for the South Korean government to announce subsidies for buying EVs have all affected the sales of Tesla’s cars, according to a report published on February 7. Indeed, the perfect storm of the above factors has led to Tesla selling only one EV – its Model Y SUV – in the entire East Asian country that, according to the 2023 estimates by the United States Central Intelligence Agency’s World Factbook, had close to 52 million citizens. On top of that, it has contributed to a slowdown in enthusiasm and the massive decline of 80% in the number of new EVs registered in South Korea across all carmakers in January compared to December, as per data assembled by Seoul-based researcher Carisyou and the country’s trade ministry. Commenting on these results, Lee Hang-Koo, head of the Jeonbuk Institute of Automotive Convergence Technology, said many early adopters have already purchased EVs, and mass-market consumers are not looking to buy yet, in addition to concerns over quality and connections with China. As he explained: “Most Koreans who wanted to buy Tesla’s cars have bought one. (…) Some people don’t like Tesla recently after finding some of them are made in China.” Meanwhile, the price of Tesla stock at press time stood at $185.1, recording an increase of 2.23% on the day but still a decline of 3.39% on its weekly chart, in addition to losing 23.02% to its value across the past month and adding up to the cumulative drop of 5.99% in the last year. All things considered, Tesla seems to be in a bit of a pickle lately, and it is not alone, as other prominent companies in the sector have also suffered setbacks. However, some optimism remains, as the average 12-month price targets by the Wall Street experts are cautiously bullish. Buy stocks now with Interactive Brokers – the most advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}