{
    "title": "Tesla China releases domestic and export figures for January 2024",
    "date": "2/8/2024",
    "url": "https://www.teslarati.com/tesla-china-domestic-export-january-2024-results/",
    "text": "Data released by the China Passenger Car Association (CPCA) has revealed the details of Tesla’s January 2024 results. Last month, Tesla China’s wholesale figures were listed at 71,447 vehicles, which included cars that were sold in the domestic market and exported abroad. Out of the 71,447 total vehicles that Tesla China sold last month, 31,556 units were exported abroad, as per recent CPCA data. This was down 19.5% from the 39,208 vehicles that were exported from Giga Shanghai in January 2023, but up 72.2% from December 2023. Tesla China sold 39,891 vehicles in the domestic Chinese market in January 2024. This is quite an interesting result, as it represents a 48.6% year-over-year improvement from the 26,843 units that were sold in the domestic Chinese market in January 2023. It also represents the best January for Tesla China’s domestic sales to date. $TSLA 🇨🇳Tesla China registered 39,891 vehicles in domestic(retail) demand in January.– Export : 31,556– Model Y : 41,873 (YoY +2.4%)– Model 3 : 29,574 (YoY +17.6%) pic.twitter.com/x05WE5q8rO Tesla China’s domestic sales in January 2024 are quite encouraging, especially since the electric vehicle maker tends to prioritize exports earlier in the first weeks of a quarter. The company’s strong local deliveries in January suggest that the demand for the Giga Shanghai-made Model 3 sedan and Model Y crossover among local consumers is quite substantial. The CPCA also provided a breakdown of Tesla China’s sales last month. From the 71,447 vehicles that were sold domestically and exported abroad, 41,873 were Model Y and 29,574 were Model 3, as per the CPCA. This suggests that until last month, sales from Giga Shanghai were still heavily skewed towards the best-selling all-electric crossover. China reported 39,891 @Tesla sales for January. 🇨🇳• Second best first month of the quarter ever and +39% vs. the previous one• Best January ever• Year-to-date +49% over same period last year• Year-to-date is 7% or 0.8/12 of last year's totalSouce: @Tslachan pic.twitter.com/kFHZPccrcU China’s domestic sales of passenger New Energy Vehicles (NEVs), which include both battery electric cars and plug-in hybrid vehicles, were around 668,000 units in January 2024. This means that Tesla China held a 5.97% share of the domestic NEV market in January. For comparison, Tesla China held an 8.02% share of the country’s NEV market in December 2023, as noted in a CNEV Post report. Tesla China’s share in the country’s BEV segment, however, was more notable in January 2024. China saw about 376,000 sales of battery electric vehicles last month. This means that Tesla China accounted for over 10.61% of the country’s overall BEV segment in January 2024. For comparison, Tesla China’s share of the country’s BEV market was 12.68% in December 2023. Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}