{
    "title": "Tesla-Bull Cathie Wood's Ark Invest Sees 95-100% Of All Vehicles On Roads \nAs EVs By 2030, Predicts A 'Death Spiral ...",
    "date": "2/1/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/36882313/tesla-bull-cathie-woods-ark-invest-sees-95-100-of-all-vehicles-on-roads-as-evs-by-2",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Cathie Wood-led Ark Investment Management sees electric vehicles accounting for 95-100% of vehicle sales in 2030 if robotaxis gains traction and believes EV giant Tesla Inc TSLA is best positioned amongst rival players to ramp robotaxis. What Happened: ARK sees electric vehicle sales scaling at the rate of 33% annually over the next seven years to touch 74 million in 2030, aided by easing supply chain disruptions and subsequently lowering EV prices. The investment management firm lists electric vehicles among the many developing technologies that might displace older technologies and create new markets. Ark hopes to develop other technologies, including artificial intelligence, digital wallets, robotics, and reusable rockets. EVs are gaining market share and negatively impacting the share of combustion engine vehicles. If EV adoption continues to scale, traditional automakers may be forced to restructure and consolidate, the company said, while noting the struggles of legacy automakers like General Motors, Volkswagen, and Ford in scaling EVs. This is exacerbated by price cuts by ‘market leaders,’ Ark said, possibly referring to Tesla, which has been cutting prices of its vehicles across geographies since the onset of 2023, subsequently initiating a price war in the industry. “If EVs continue to gain share, as we believe they will, then used cars and new EVs will make more economic sense than new internal combustion engine (ICE) vehicles, perhaps causing a death spiral for incumbent auto manufacturers,” it said in a report. Potential In Robotaxis: Ark believes robotaxi platforms can generate $28 trillion in enterprise value in the next five to ten years. This is nine times the value of all auto manufacturers in 2023. Robotaxis are currently operating in about 20 cities across the globe, with fully driverless commercial options in at least 7 cities. “With access to 50x more driving data than Baidu and 280x more than Waymo, Tesla has a massive data advantage as it prepares to launch its robotaxi service, the largest AI project in the world,” Ark said. Tesla has already started rolling out version 12 of its full self-driving software, which is expected to make the cars capable of autonomous driving without human intervention. Tesla CEO Elon Musk has been touting the idea of fully autonomous Tesla vehicles functioning as robotaxis since 2019. In April 2022, Musk predicted Tesla would achieve the volume production of Robotaxis in 2024. \"We aspire to reach volume production of that [Robotaxi] in 2024. It will be a massive driver of Tesla's growth,\" Musk then told investors. During the company’s second-quarter earnings call in July, he reiterated the idea, saying, “In the long-term, autonomy, we think, is going to just drive volume through the ceiling next level.” Images via Shutterstock Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Elon Musk Says Tesla Will Hold Shareholder Vote On Incorporating In Texas After Twitter Poll Results Favor State © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}