{
    "title": "'Were There Any Half-Decent Ads?' Asks Elon Musk While Tesla Bull Calls EV \nGiant's No-Show At Super Bowl",
    "date": "2/12/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37063011/tesla-bull-slams-short-term-thinking-as-ev-maker-holds-back-from-super-bowl-ads-aga",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Editor’s note: This story was updated with Tesla CEO Elon Musk’s reaction to the advertisements at the Super Bowl LVIII. As Tesla, Inc. TSLA continued its stance against Super Bowl advertising, a bullish analyst on Sunday criticized the company’s short-sightedness. CEO Elon Musk, of course, had his own take on the ad blitz during the event. What Happened: Gary Black of Future Fund pointed out that a 30-second Super Bowl ad slot costs $7 million, and to justify this expense, Tesla would need to sell 875 additional cars, assuming a gross profit of $8,000 per car. “And the follow up interest from TSLA paying for a Super Bowl ad would be huge. Instead $TSLA cuts price by $1,000 per Model Y in the US for a month ($40M spend),” he said. “Short-term vs. long-term thinking by $TSLA mgmt.” See Also: Everything You Need To Know About Tesla Why It’s Important: Despite Tesla’s historical preference for a direct sales model, Black has advocated for advertising on platforms like YouTube and X — which the EV maker has started doing — to educate potential car buyers about electric vehicles’ benefits and address concerns about range and charging. Tesla supporters defended the company’s absence from the Super Bowl, arguing that the brand is already ingrained in the minds of viewers and that branding ads during the event are unnecessary. Their argument is supported by data showing that Tesla’s popularity spikes when rival companies advertise electric vehicles during the Super Bowl. Automakers like BMW, General Motors, Hyundai‘s Kia sub-brand, Stellantis‘ Jeep, and Ram EV truck maker advertised during the 58th edition of the Super Bowl. Another social media user said, “Tesla enters the mind of those who didn't even have them on their radar. It's a good investment for companies with excess cash and excess capacity.” Musk Reacts: Another Tesla influencer reshared Automotive News’ X post about BMW’s ad for its i5 EV, featuring actor Christopher Walken. The influencer commented, “The ads on the Super Bowl today were all incredibly cheesy and stupid.” “There was little said about the product, with lots of celebrity appearances and endorsements.” Musk, who watched the Super Bowl live with his son, seemed to share this sentiment. Responding to the post, the Tesla CEO asked, “Were there any half-decent ads?” Price Action: Tesla ended Friday’s session up 2.12% at $193.57, according to Benzinga Pro data. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Super Bowl As Stock Market Predictor? As 49ers Go Up Against Chiefs, Investment Firm Weighs On Potential Implication For Market Image made via pictures on Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}