{
    "title": "Elon Musk settles things with California bakery after Tesla cancels huge \norder",
    "date": "2/27/2024",
    "url": "https://www.hindustantimes.com/world-news/us-news/the-sweet-saga-elon-musk-settles-things-with-california-bakery-after-tesla-ditches-4000-pies-order-101709023275424.html",
    "text": "Subscribe Now! Get features like Days after SpaceX CEO Elon Musk vowed to “make things right” with a San Jose bakery after Tesla cancelled an order worth thousands of dollars, The Giving Pie has confirmed that the bill issue with the Silicon Valley giant has been settled. Musk's firm Tesla had placed an order for 4,000 mini pies worth $16,000 from a Black-owned bakery in California, according to bakery owner Voahangy Rasetarinera, who posted on the cafe's Instagram and Facebook pages a few days ago. After receiving the order, Rasetarinera claimed she had requested employees to work for additional hours, purchased ingredients and supplies, and even turned down at least three other catering orders. Tesla, however, surprisingly cancelled the order via text on Valentine's Day. On its Facebook page, The Giving Pie owner shared her story “how Tesla's action hurt my small Black women-owned business”. “To me, it was clear that Tesla’s corporate culture prioritized convenience over accountability, disregarding the livelihoods of small business owners like myself,” she wrote. “This experience serves as a stark reminder of the vulnerability faced by small businesses when dealing with larger corporations. Despite our best efforts to uphold our commitments and provide quality service, we are often left at the mercy of decisions made in corporate boardrooms.” Also Read: ‘It’s coming': Elon Musk hints at Xmail launch as alternative to Gmail; here's all you need to know As soon as the incident received huge media coverage, Musk himself responded to a story on X, stating, “Just hearing about this. Will make things good with the bakery. People should always be able to count on Tesla trying its best.” Prior to Musk's reaction, Rasetarinera told NBC Bay Area that she had spoken with someone at Tesla who explained that it was a misunderstanding. They also requested her to cater two events in March. She, however, has turned down that offer, stating, “Unfortunately, I cannot do their catering event because with all the business that we got we depleted our stock of crust, and then we also have Pi Day to prepare for, so there’s no way”. In an email to the Guardian, the bakery owner confirmed that “Tesla just paid the $2k that I was out of.” According to NBC Bay Area, Giving Pies has received enormous support both locally and internationally. Over the weekend, hundreds of consumers waited up at the store to purchase pies. Rasetarinera was \"blown away\" by the response. “I am blown away. I'm like, 'I didn’t do it for that.' I'm so grateful. It's amazing. People are amazing,” she said. She stated in her initial Instagram post that the incident provided her with an opportunity to reflect on her journey as a business owner. Rasetarinera also received donations from across the US as well as from the Netherlands and Sweden.    "
}