{
    "title": "‘I really need to be paid’: Tesla cancels large pie order last minute",
    "date": "2/24/2024",
    "url": "https://www.newsnationnow.com/us-news/west/tesla-large-pie-order/",
    "text": "NewsNation Amanda Hari SAN JOSE, Calif. (KRON) – A small business owner in Northern California says her pie shop is out thousands of dollars after Tesla unexpectedly canceled an order for thousands of mini pies. Voahangy Rasetarinera owns Giving Pies​ in San Jose’s Willow Glen neighborhood. Each pie is carefully assembled by hand in small batches. Despite that, the bakery has managed to put together orders for large corporations, like Apple, Google and Intuit. On Valentine’s Day, the bakery got a last-minute order request from Tesla – 2,000 pies, half to be delivered on Tuesday, the other half on Thursday. Rasetarinera said she agreed. But then the waiting game began for Tesla to pay. After not hearing from her contact, Rasetarinera says she reached out again and sent the invoice multiple times to multiple people. Finally, at 9 p.m. Thursday night, she got a call from Tesla. The company apologized for the delayed payment and asked to double the order to 4,000 pies. “So I contacted my staff and they’re like ‘Yes, we can work on Saturday, on Sunday, on Monday. We can get it done. No problem,’” Rasetarinera recalls. She says she sent Tesla a revised invoice and still did not receive a payment. She contacted them multiple times and finally got a response by text. “Sorry to bother you again, but I’m a small business. I don’t have the luxury of infinite resources so I really need to be paid so I can secure my staff. I received a message back that was like ‘Hey, so sorry, I don’t think we’re going to need this order anymore,’” Rasetarinera said. Rasetarinera had turned down other orders and already purchased resources like ingredients, boxes and stickers. After she posted about it on social media, she says Tesla saw it and reached out. “They said they wanted to make it right by me and they offered for me to do two events on March 6 and 7, but I’m still waiting for confirmation,”  she said. “If they want to make it right, I’m going to give them the opportunity to make it right.” KRON4 reached out to Tesla for comment, but as of Thursday night, they have not responded. Copyright 2024 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. After a yearlong closure, a bridge over the Puyallup River reopened in 2019 with a sturdy new span and a brand new name. It even won a national award. But today, the Fishing Wars Memorial Bridge is closed again after federal officials raised concerns about a vintage section of the nearly century-old bridge that carried […] Where does your state rank? WASHINGTON (AP) — Many Americans are in a sour mood about the economy for one main reason: Prices feel too high. Maybe they’re not rising as fast as they had been, but average prices are still painfully above where they were three years ago. And they’re mostly heading higher still. Consider a 2-liter bottle of […] DALLAS (AP) — Kyle Filipowski and Duke got pushed around again in the NCAA Tournament. This time, the Blue Devils responded to set up a Tobacco Road showdown in Big D for a spot in the Final Four. The 7-foot sophomore center had 16 points and nine rebounds, Jeremy Roach scored all 14 of his […] DETROIT (AP) — Dalton Knecht was all over the court, jumping into passing lanes for steals, shooting 3-pointers, driving and dishing to set up teammates for shots. He wasn’t alone. Tennessee, with its relentless defense from logo to rim and unselfish offense, was too much for Creighton. Knecht had 24 points, six rebounds, five assists […] DALLAS (AP) — DJ Horne blew kisses to the crowd and blew off the notion of North Carolina State as a Cinderella. As for their opportunity to create a replay of 1983, yeah, the Wolfpack are aware. Horne scored 19 points and N.C. State kept its magical NCAA Tournament run alive, beating Marquette 67-58 on […] DALLAS (AP) — Jamal Shead buried his head in his arms at his locker as reporters shuffled away from their postgame interview with the Houston point guard. The top-seeded Cougars had just lost to Duke 54-51 in the Sweet 16 on Friday night, with Shead missing the final 26 minutes after the All-American sprained his […] DES MOINES, Iowa (AP) — Lawmakers in more than a dozen states have proposed legislation to allow spiritual chaplains in public schools, a move that proponents say will ease a youth mental health crisis, bolster staff retention and offer spiritual care to students who can’t afford or access religious schools. Conservatives also argue religious foundations […] PORTLAND, Ore. (AP) — Unrattled by Stanford’s halftime lead, North Carolina State answered with a big third quarter and shut down All-American Cameron Brink for a spot in the Elite Eight. Aziaha James had 29 points and the third-seeded Wolfpack outscored the No. 2 Cardinal 28-10 in the third quarter and went on to win […] "
}