{
    "title": null,
    "date": "2/3/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36923623/cathie-wood-buys-more-tesla-shares-friday-taking-weeks-purchases-to-whopping-36m-is-recovery-on-",
    "text": "As Tesla, Inc. TSLA staged a modest recovery this week, Cathie Wood’s Ark Invest continued to pile into the stock. On Friday, the firm picked up another chunk of the electric vehicle maker’s shares. What Happened: Ark, through its Ark Innovation ETF ARKK and Ark Next Generation Internet ETF ARKW, bought 24,782 shares of Tesla on Friday, and based on the stock’s closing price of $187.91, the purchase cost the firm $21.57 million. Ark was a buyer of Tesla shares in all five sessions of the week. Here are the details of the purchases: In all, Ark bought 192,172 shares valued at $36.29 million. Why It’s Important: Tesla stock, though ending the week with a gain of 2.54%, has been bouncing around the bottom. It has been trading below the $200 psychological resistance ever since the company reported its third-quarter results on Jan. 24. Investors are wary about the company’s growth in the wake of economic uncertainties and the cutthroat competition. Tesla and CEO Elon Musk haven’t allayed concerns and instead fanned them further by not providing clarity on the timeline for a margin inflection. There is also uncertainty over Musk’s compensation package after the Delaware Chancery Court voided it. The lack of near-term catalysts could keep the stock in the current depressed levels at least until first-quarter deliveries are out by early April. Still, Wood is bullish on Tesla and sees the stock hitting $2,000 by 2027. ARKK, the flagship exchange-traded fund of the Wood-led firm, ended Friday’s session up 1.37% at $46.66, according to Benzinga Pro data. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}