{
    "title": "Supercar craze: Tesla Roadster slated for 2025 release",
    "date": "2/28/2024",
    "url": "https://finance.yahoo.com/video/supercar-craze-tesla-roadster-slated-213419149.html",
    "text": "Tesla (TSLA) announced on Wednesday that it will finally bring the Tesla Roadster to production. Originally unveiled in 2017 and promised as the fastest car ever made, the model never made it to the production line until now, with release slated for 2025. Yahoo Finance Autos Reporter Pras Subramanian joins the Live show to discuss the announcement from Tesla, noting its timing following BYD's (BYDDY) latest supercar announcement. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. JOSH LIPTON: This is the Tesla Roadster. It was unveiled in 2017. And the company promised it would be the fastest car ever made. But it never made it to production until now, it seems, after six years. CEO Elon Musk saying the long delayed electric sports car will begin shipments next year. Pras Subramanian has the details. JULIE HYMAN: I can't I can't help laugh my way through that intro. It's coming now. It's coming now, Pras, really? Is it really coming? I mean, like, that's a little credulous. I don't know. PRAS SUBRAMANIAN: He says it is. But just to rewind a little bit. 2017, right, this is what? Five years ago, we heard-- we saw this thing roll out at an event. And then haven't heard much since until 2022, when Musk said at the Giga Rodeo-- when they opened up the Austin factory-- that it's coming. It's going to come in 2023, right? And they reopened reservations. And we'll talk about that. But basically, now we see Musk tweeting late last night, it is coming. They've basically, production design is complete. They're going to unveil the car later this year, like you said, Josh, and then planning for sales next year. Now, said again, a 0 to 60 time, less than a second. Kind of insane stuff here. But again, we heard this last-- we heard this two years ago. We heard it five years ago. Is it actually going to come out. Deposit holders, some have put down $50,000, no interest, right? That's refundable. I'm sorry, $5,000 refundable. Other people have put down $250,000 for the Foundation series to get that car, so. JULIE HYMAN: Well, I hope they get it eventually, right? I mean, this reminds me of the Cybertruck a little bit as well, which did well. It sort of come out. PRAS SUBRAMANIAN: Yeah. Yeah. JULIE HYMAN: Right, I mean-- PRAS SUBRAMANIAN: Eventually, right, right. JULIE HYMAN: Yeah. It's interesting timing because, of course, BYD came out with its own supercar earlier this week. Is that a coincidence that we're now getting an update on the Roadster? PRAS SUBRAMANIAN: Well, I wrote a piece on it. It's going to come out just in the next few moments. But basically, yes, I kind of allude to the fact that it's interesting that these tweets came out late last night. Only, we talked about BYD's U9 supercar, right? It's going to cost $230,000, around the same price as potentially the Tesla Roadster. Scissor doors, four motors-- all these pretty cool stats. But only a couple of months ago, NIO also said that their EP9 hypercar was going to cost $3 million US. 1,000 horsepower, interchangeable batteries, all this sort of stuff. These-- the Chinese supercar makers are sort of coming on strong here. And it seems like maybe Musk kind of had to cough up more details because he felt the need to because these cars are going to come on the road later this year-- the Chinese cars, so in China, but not necessarily in the US. But still competition nonetheless. JULIE HYMAN: Right, if you're a Chinese buyer, are you going to wait for the Tesla Roadster, or are you going to buy one of these other ones? PRAS SUBRAMANIAN: I want to quickly just say something real quick. Yes, it is a $5,000 deposit, not a $50,000 deposit for-- JULIE HYMAN: Oh, that's a lot lower. But still-- PRAS SUBRAMANIAN: Just wanted to correct. JULIE HYMAN: Nothing. JOSH LIPTON: I mean, it's interesting, Pras, because listen, I think that's a beautiful car. The lines on that car are beautiful to me. But I would say like, 200,000 when you find yourself competing with, like, a Lamborghini and Ferrari, that's a small market. I mean, ultimately, that doesn't move the needle for Tesla or the EV market, right? I mean, what have we talked about so much on the show? What's one way to reignite growth here? It's not the 200,000 car. And again, gorgeous car, but ultimately, you need lower priced EVs, right? PRAS SUBRAMANIAN: Yeah, I think these are just halo cars that bring people in like, they have the Optimus robot in some stores to bring people in. Same with the Cybertruck, it's a lot of the marquee Tesla stores to bring people in. So that's like some of the thing that kind of draws you in. But you're going to buy the Model Y or the Model 3. Maybe the X-- or the S as your actual car. Quickly, I want to re, again, clarify that it's a $5,000 deposit. But then within 10 days, you got to cough-- cough up more 45,000 for a 50,000 full deposit-- JULIE HYMAN: So it is effectively a $50,000 deposit-- PRAS SUBRAMANIAN: --yeah, for a car. JULIE HYMAN: --that people have put down. PRAS SUBRAMANIAN: Yes. And the car when it came-- 2017, it was said to be a $200,000 MSRP and 250k for that Founder's Edition. Sorry, about that. I want to get that clear. JULIE HYMAN: That's OK. We'll see-- I mean, it's not even out yet. So there's a lot of confusion, I guess. PRAS SUBRAMANIAN: Yeah, why do we care, right? It doesn't matter. It's going to change tomorrow, who knows, right? We'll see. JOSH LIPTON: Wait for the tweet. Related Quotes "
}