{
    "title": "Elon Musk moves SpaceX incorporation state to Texas",
    "date": "2/15/2024",
    "url": "https://finance.yahoo.com/video/elon-musk-moves-spacex-incorporation-182344066.html",
    "text": "Elon Musk has officially relocated SpaceX's state of incorporation from Delaware to Texas. Musk has been pushing to move his other companies, like Neuralink and Tesla (TSLA), out of Delaware as well. This comes after Musk's massive $55 billion compensation package from Tesla was struck down by the Delaware Chancery Court. Yahoo Finance Senior Reporter Ines Ferré joins the Live show to break down the latest developments around Musk and what it could mean for his companies moving forward. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino AKIKO FUJITA: Well, Elon Musk continuing his crusade against the state of Delaware, sparked when a judge invalidated his $56 billion pay package. Here with the latest is our very own Ines Ferré. Ines, SpaceX next to make the move. INES FERRÉ: Yeah, that's right. And Akiko, it is official. SpaceX converted its incorporation state from Delaware to Texas. Elon Musk posted on X last night, \"If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible.\" Now, this comes after Delaware's business court struck down Musk's $56 billion Tesla compensation package. Musk has been pushing to move the legal home for his companies out of Delaware. Last week, he moved the domicile for his brain chip implant company Neuralink from Delaware to Nevada. And Musk is pushing to reincorporate Tesla too. But there's no guarantee that will happen for a public company like Tesla. This move for a public company requires a majority shareholder vote, Akiko. AKIKO FUJITA: Meantime, Ines, we've got SpaceX carrying yet another lunar lander, this one from Intuitive Machines. What more do we know about the launch that happened overnight? INES FERRÉ: Yeah, that's right. A moon lander built by aerospace company Intuitive Machines, that was launched from NASA's Kennedy Space Center in Florida. Its mission is to touch down on the lunar surface. The lander is dubbed Odysseus. It was atop a SpaceX Falcon 9 rocket. A live feed of the launch showed the rocket taking off. About 48 minutes later, the lander was released, and the separation was confirmed. Now, the Lander is carrying six-- six NASA payloads of instruments. Those will gather data about the lunar surface, and all of this information will be used for NASA's planned return of astronauts to the moon, which is now slated for 2026. The launch is really significant because a month ago, another private firm launched a lander, which suffered a propulsion system leak. And that had been the third failed attempt at a soft landing on the moon from a private company. So as for Odysseus, it is expected to land on the moon on February 22 near the moon's South Pole. Akiko. AKIKO FUJITA: OK. We'll all be keeping our fingers crossed there. Ines Ferré, thanks so much. INES FERRÉ: Thank you. Related Quotes "
}