{
    "title": "Tesla double crash risk: Elon Musk's company must fix 2.2 million cars due \nto warning messages too small for drivers to ...",
    "date": "2/2/2024",
    "url": "https://www.dailymail.co.uk/yourmoney/article-13037897/Tesla-double-crash-risk-Elon-Musks-company-fix-2-2-million-cars-warning-messages-small-drivers-read-probed-steering-wheel-problem.html",
    "text": "By Daniel Jones, Consumer Editor For Dailymail.Com and Reuters and Associated Press Published:  13:21 GMT, 2 February 2024   |  Updated:  13:21 GMT, 2 February 2024  30 View  comments  Tesla owners faced a double whammy this morning - with news that almost all the cars sold in America are to be recalled AND another 334,000 may need a fix too. The EV giant is recalling 2.2 million- including the S, Y and Cybertruck -  because some warning lights on the instrument panel are too small. Safety regulators say that the brake, park and antilock brake warning lights have a smaller font size than required by federal safety standards. That can make critical safety information hard to read -  increasing the risk of a crash. The recall will be done with an online software update beamed to cars, The National Highway Traffic Safety Administration said. Meanwhile, a separate investigation into steering problems with more than 334,000 Teslas is a step closer to a recall. The NHTSA began looking at that problem last July after receiving  a dozen complaints about loss of steering control in 2023 Model Y and 3 vehicles. Elon Musk's company Tesla is being investigated by safety regulators over a problem with the power steering in 334,000 cars - ahead of them potentially being recalled and fixed Tesla is recalling 2.2 million cars in the US - most of the cars it has sold there - over warning messages being too small to read Now the agency is getting engineers into expand the investigation. In total it now has 115 complaints, and it received another 2,176 after requesting information from the company. WARNING MESSAGES TOO SMALL The recall will be done with an online software update. It covers the 2012 through 2023 Model S, the 2016 through 2023 Model X, the 2017 through 2023 Model 3, the 2019 through 2024 Model Y and the 2024 Cybertruck. Tesla has already started releasing the software update, and owners will be notified by letter starting March 30. NHTSA says it found the problem in a routine safety compliance audit on Jan. 8. Tesla has identified three warranty claims potentially related to the problem, but has no reports of crashes or injuries. STEERING CONTROL PROBLEMS Agency documents say drivers are reporting loss of steering control, often accompanied by messages showing that power assisted steering has been reduced or disabled. Some complained of an inability to turn the steering wheel, while others said it required more effort. In one case a driver told NHTSA that they couldn't complete a right turn and ran into another vehicle. The agency said there have been multiple allegations of Teslas blocking intersections or roadways. Over 50 vehicles had to be towed, according to the consumer complaints. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}