{
    "title": "Musk Gets Blueprint for Moving Tesla With TripAdvisor Opinion",
    "date": "2/20/2024",
    "url": "https://news.bloomberglaw.com/litigation/musk-gets-guidelines-for-moving-tesla-with-tripadvisor-opinion",
    "text": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 By Jennifer Kay Elon Musk now has some guidelines for moving Tesla Inc.‘s incorporation to Texas from Delaware, thanks to a Tuesday decision in a lawsuit finding that TripAdvisor Inc. can reincorporate in Nevada. That’s if he can follow the procedures laid out by Vice Chancellor J. Travis Laster of the Delaware Court of Chancery. TripAdvisor may move its incorporation, a plan challenged by investors who said it benefited company directors—including Greg Maffei, chairman of TripAdvisor’s parent company—at the expense of shareholders. But Laster said the travel review and book site still has to face the investors’ lawsuit, as monetary damages could be warranted. It’s an opinion expected to influence how easily Tesla and corporations can exit Delaware for other states where laws offer more insulation from litigation for officers and directors. Delaware has been the country’s premier venue for corporate litigation, with nearly 70% of Fortune 500 companies calling the state home. Musk vowed to move Tesla to Texas after repeated losses in Chancery Court. “The roadmap for Musk is what you see in this opinion—he can go if he wants but may have to pay an exit tax,” said Brian Quinn, a Boston College law professor focused on corporate law. The TripAdvisor case entered the spotlight last month after the Chancery Court’s chief judge, Kathaleen St. Jude McCormick, voided Musk’s $56 billion Tesla pay package as unfair to shareholders. Musk has cited the TripAdvisor case in his criticism of Delaware courts. The tech leader has threatened to move publicly held Tesla’s incorporation to Texas, and has already started to move the incorporations of his other, privately held companies—SpaceX and Neuralink—out of Delaware. While Laster wouldn’t stop TripAdvisor from leaving Delaware, saying an injunction was “off the table,” he said the investor litigation challenging the company’s planned relocation as rife with self-interest could proceed. Nevada offers laws that better shield company directors—including Greg Maffei, chairman of TripAdvisor’s parent company—from shareholder lawsuits. A “monetary award could be crafted” to compensate the investors who sued, should the court ultimately rule against TripAdvisor down the line, Laster said. Laster also said the litigation rights provided to shareholders by Nevada law “are inferably less than what Delaware provides,” calling into question the fairness of the move. Musk responded to McCormick’s ruling against him by venting on social media, writing: “Never incorporate your company in the state of Delaware.” It’s also the state where Musk surrendered in his fight to back out of his $44 billion offer to buy the social media platform Twitter Inc., which Musk subsequently took private, renamed X, and reincorporated in Nevada. Nevada does things differently than Delaware, but it’s debatable that it’s inherently anti-shareholder. It’s “potentially unsettling” that Laster’s opinion suggested Nevada law could be worse for shareholders, said Jill Fisch, a University of Pennsylvania law professor who teaches about corporate law and litigation. “If you’re a Delaware judge you probably think that, but why wouldn’t it work the other way?” she said. States vary in terms of how much protections they offer to shareholder, and there’s no clear way for shareholders to determine which state is better for them when a corporation or board wants to move, she said. “Characterizing this as potentially self-dealing and conferring a material benefit on the directors, that seems to be the big step that Vice Chancellor Laster is making here,” Fisch said. The decision largely denying TripAdvisor’s motion to dismiss sets some guidelines for Delaware-incorporated companies, such as Tesla, where a controlling stockholder such as Musk wants to leave Delaware for another state offering officers and directors more protection from shareholder lawsuits. “You need a truly disinterested special committee, and you need a disinterested shareholder vote, and you’ve got to commit to the fact that you’re not going to move unless you get both of those things up front,” Fisch said. Musk could still be tripped up in his attempt to move Tesla to Texas, said Carliss Chatman, who teaches corporate law at Southern Methodist University’s Dedman School of Law. In the lawsuit over his Tesla pay package, McCormick found conflicts of interest marred the board’s consideration of the pay deal. Musk has repeatedly urged Tesla’s board to arrange another massive stock award for him, years after he sold a significant chunk of his shares in the company to acquire the social-media company once-known as Twitter. The billionaire has said he needs a large Tesla stake to maintain control of the carmaker and expand further into artificial intelligence. Some experts have questioned whether Musk’s focus on Tesla will be weakened without another super-sized pay package. “If he really wants to move to Texas, it’s fine. He just needs to abstain from voting on some things, which I don’t think he’s going to do,” she said. “He also needs to not pressure people, which he’s probably not going to do.” Laster, known for making groundbreaking rulings that often side against billionaire shareholders, successfully avoided making Delaware into a kind of “Hotel California” where companies can incorporate but never leave, said University of Iowa law professor Robert Miller, who has written about the development of Delaware corporate law. The company can leave Delaware whenever it wants, “but the controller is liable for any harm arising from unfairness,” Miller said. “And Laster even has a smart way of measuring that—the declining value of the company as shown by market prices in an efficient market.” —With assistance from Matthew Bultman. To contact the reporter on this story: Jennifer Kay in Philadelphia at jkay@bloomberglaw.com To contact the editor responsible for this story: Alex Clearfield at aclearfield@bloombergindustry.com AI-powered legal analytics, workflow tools and premium legal & business news. Log in to keep reading or access research tools. "
}