{
    "title": "Analyst reveals new Tesla price target, Mag 7 risk as shares extend slump",
    "date": "3/13/2024",
    "url": "https://www.dcourier.com/news/2024/mar/13/analyst-reveals-new-tesla-price-target-mag-7-risk-/",
    "text": "  Updated at 8:35 AM EDT Tesla  (TSLA)  shares slumped to a 10-month low Wednesday, extending their year-to-date decline past $240 million, after analysts warned that gathering headwinds in the global electric-vehicle market could put its status within the so-called Magnificent 7 tech stocks at risk. Tesla shares have tumbled more than 32% over the past six months and are down more 56% from their all-time peak in November 2021 as the carmaker continues to face increased competition in major markets while pursuing a price-cutting strategy designed to maintain its global EV leadership. CEO Elon Musk's strategy, spelled out to investors last year, has added significant pressure to its profit margins. That thinning occurred even as delivery totals reached an all-time high of 484,507 units over the final quarter of last year and a record 1.81 million for the whole of 2023. Musk also told investors in January that profit-margin widening would be linked to central bank interest rate cuts and he failed to provide firm 2024 revenue guidance. NurPhoto&solGetty Images Tesla posted fourth-quarter net income more than double the year-earlier level, but a good chunk of that was tied to a deferred tax gain of $5.9 billion. Costs linked to artificial-intelligence projects and the delayed Cybertruck launch, meanwhile, ate deeply into its bottom line. Tesla itself warned investors that vehicle-delivery growth rates would be \"notably lower\" than 2023 levels. Weaker-than-expected sales figures from China, where volumes fell to the lowest levels in more than a year last month, are also adding to overall pressures on Tesla's aggressive delivery targets. Wells Fargo analyst Colin Langan sees more pain to come, citing the challenge of fading EV demand set against further price cuts. He lowered his rating on Tesla stock to underweight in a client note published Wednesday. Related: Top analyst revamps Tesla price target, sees potential profit surprise “We see downside risk to volume as price cuts are having a diminishing impact,\" Langan said as he pared his Tesla price target by $75 to $125 a share. \"We see headwinds from disappointing deliveries and more price cuts, which likely drive negative earnings revisions.” “We expect volumes to be flat in 2024 and down in 2025,\" he added. \"In the wake of [price] cuts are lower lease residuals, disgruntled customers and the possible loss of the luxury brand premium.\" More Tesla: Langan also hinted at the likelihood of Tesla losing its status as a member of the so-called Magnificent 7, a group of the biggest tech and tech-adjacent stocks that have captured the bulk of Wall Street's attention. Tesla, he notes, trades at a 58-times multiple to the consensus estimate for 2024 earnings, nearly twice the 31-times for its Magnificent 7 peers. “TSLA’s growth in core markets has moderated with EU and China flattish in and the US down since Q2 [of last year],\" Langan wrote. \"More concerning, the effect of price cuts are moderating with second-half volume up only 3% (half over half) despite pricing that’s down 5% (over the same period).\" Wedbush analyst Dan Ives, however, argues that Tesla stock is \"way overshooting on \"the negative front\" and sees the demand story \"in stabilization mode heading to the rest of 2024. \"In the near-term it's not roses and rainbows with (first-quarter) demand sluggish,\" said Ives, who carries an outperform rating and $315 price target on the stock. \"That said, we believe the risk/reward is extremely compelling at these levels with the AI story and [Full-Self-Driving technology] making major strides at Tesla and in our opinion represents a valuation that could exceed $1 trillion as this next chapter of the Tesla growth story plays out in the field,\" Ives said. Tesla shares were marked 2.65% lower in premarket trading to indicate an opening bell price of $172.80 each, a move that would extend the stock's year-to-date decline to around 30%. Related: Veteran fund manager picks favorite stocks for 2024 Click Below to: Contents of this site are © Copyright 2024 Prescott Newspapers, Inc. and Western News&Info®, Inc. All rights reserved. |  Terms of Service | Privacy Policy "
}