{
    "title": "Germany Tesla | Business | timesdaily.com",
    "date": "3/12/2024",
    "url": "https://www.timesdaily.com/business/germany-tesla/image_4b70d28a-b3dd-5685-9565-89f6c96021fd.html",
    "text": " FILE - A general view of the Tesla Gigafactory for electric cars in Gruenheide near Berlin, Germany, on March 5, 2024. Power has been restored to electric car manufacturer Tesla's factory near Berlin about a week after an outage believed to have been caused by arson, a network operator says. Grid operator E.DIS said in a statement that Tesla was reconnected to the network at 8:45 p.m. Monday, March 11, 2024, after days of repairs. A network operator says power has been restored to electric car manufacturer Tesla’s factory near Berlin after a nearly one-week outage believed to have been caused by arson. Grid operator E.DIS said in a statement that Tesla was reconnected to the network at 8:45 p.m. Monday after days of repairs. There had been expectations that the factory, Tesla’s first in Europe, might remain without power until the end of the week. Production at Tesla’s plant in Gruenheide, just outside the German capital, came to a standstill last Tuesday. Tens of thousands of residents, nearby hospitals, nursing homes and a big logistics center for a German grocery chain also were affected initially. A network operator says power has been restored to electric car manufacturer Tesla’s factory near Berlin after a nearly one-week outage believed to have been caused by arson. Grid operator E.DIS said in a statement that Tesla was reconnected to the network at 8:45 p.m. Monday after days of repairs. There had been expectations that the factory, Tesla’s first in Europe, might remain without power until the end of the week. Production at Tesla’s plant in Gruenheide, just outside the German capital, came to a standstill last Tuesday. Tens of thousands of residents, nearby hospitals, nursing homes and a big logistics center for a German grocery chain also were affected initially.     Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article.    Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Account processing issue - the email address may already exist As it develops, sent straight to your inbox. Would you like to receive our daily news? Sign up today! Receive a daily newsletter containing a list of the day's funerals and obituaries. Receive a weekly newsletter every Thursday about restaurant reviews and health ratings in the TimesDaily area. Shoals marketing email for local businesses. Sign up to receive links to the Saturday and Monday comics and puzzles pages. Help Select Player of the Week and get results Thursday & Saturday. Imported List: Living 50 Plus Shoals - Marketing Imported List: Living 50 Plus Shoals E-Edition  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}