{
    "title": "Xiaomi SU7 Races Into China EV Market: 120,000 Orders For Tesla Model 3 \n'Upgrade'",
    "date": "3/29/2024",
    "url": "https://www.investors.com/news/xiaomi-su7-ev-88898-orders-tesla-model-3-upgrade/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Xiaomi has entered China's electric vehicle market with a blistering start, with the company touting 120,000 firm orders in 36 hours for its SU7 sedan, a Tesla (TSLA) Model 3 rival. Xiaomi, a major Chinese handset maker, launched the much-anticipated sedan on Thursday, promising deep smart-car connectivity, fast acceleration and an aggressive price. The 120,000 orders means the SU7 production capacity for 2024 is sold out. Lei Jun, Xiaomi's founder, chairman and CEO, made it clear that the Tesla Model 3 is in sights. \"Many people ask me who the Xiaomi SU7 is built for. My answer is, isn't it time for Tesla Model 3 users to upgrade?\" Lei said at Thursday's event. The SU7 will start at 215,900 yuan ($29,901) vs. 245,900 yuan ($34,056) for the entry-level Model 3. Lei conceded that Xiaomi will lose money on every car sold. Tesla gave a modest upgrade to the Model 3 late last year, but that didn't provide much of a sales boost. The introduction of the Xiaomi SU7, along with other China EV makers such as Nio (NIO), XPeng (XPEV) and BYD (BYDDF) rolling out cheaper, more-advanced models, poses new challenges for Tesla. Tesla reportedly scaled back Shanghai production in March, which could continue through April. Of course, Xiaomi's entrance poses a challenge to all China EV makers, who already face intense competition. Deep-pocketed Xiaomi, Geely and Huawei, along with low-cost giant BYD, makes it hard for money-losing Nio and XPeng to gain traction and move toward profitability. Xiaomi says it may introduce an SUV later this year. Nio, XPeng and Li Auto (LI) will release March delivery figures on Monday. BYD will provide March and first-quarter sales data on Monday or Tuesday. Tesla is expected to report on Tuesday. Li Auto recently slashed March delivery targets with Nio trimming its goals last week. Analysts have slashed Tesla earnings and delivery targets, with many forecasts pegging Q1 deliveries around Q1 2023's 422,875, down sharply from Q4's record 484,507. Please follow Ed Carson on Threads at @edcarson1971, X/Twitter at @IBD_ECarson and Bluesky at @edcarson.bsky.social for stock market updates and more. YOU MIGHT ALSO LIKE: Why This IBD Tool Simplifies The Search For Top Stocks Want To Get Quick Profits And Avoid Big Losses? Try SwingTrader Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Will Market Rally On 'Good' Inflation? 3 Bullish Pullbacks 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}