{
    "title": "Tesla will build its next Gigafactory in Mexico",
    "date": "3/24/2024",
    "url": "https://sg.news.yahoo.com/tesla-selects-monterrey-mexico-as-the-site-of-its-next-gigafactory-192534657.html",
    "text": "Tesla's Investor Day isn't here quite yet, but we may already know one of the company's biggest announcements. According to Mexican President Andrés Manuel López Obrador, Elon Musk has promised to build the automaker's next gigafactory in northern Mexico — specifically in Monterrey, the capitol of the northern state of Nuevo Leon. It's a deal that's been in the works for some time: Late last year, Musk visited Nuevo Leon to meet with the Governor of the region. Even so, there were some questions about if Tesla could get approval to build in the area — after Monterrey suffered severe water shortages in 2022, President López Obrador said the government would not grant permits for water-hungry factories. After a series of phone calls with Elon Musk, Tesla was granted an exception. “There is one commitment that all the water used in the manufacture of electric automobiles will be recycled water,” López Obrador said of the call, adding that the factory would also represent \"a considerable investment and many, many jobs.\" As for what Tesla plans to build in Monterrey, Mexico? We'll have to wait a day to find out. The Mexican President wasn't clear on exactly what the new factory would be producing, though it's worth noting that Tesla has already announced a massive expansion of its facility in Reno, Nevada, where it's investing $3.6 billion to build a battery factory and mass produce the Telsa Semi truck. López Obrador noted that we can expect to hear more details on Wednesday, March 1st — and hey, that's Tesla Investor day. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era.  Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" Abby Hensel officially tied the knot in 2021, it has been revealed \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  This food habit is linked to a specific type of dementia. My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22.  Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp.  Devastating glide bombs have been a major threat to Ukraine's forces, and they can only be beaten by shooting down planes before they're released. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. There is a growing understanding across the Western allies that Ukraine is losing the ground war against Russia, and by summer could face defeat.  Russia is pounding front lines with artillery, rocket and drone fire — and at over five times the rate the Ukrainian army can reply.  Volodymyr Zelensky’s troops are exhausted — after sustaining in some sectors a heavier concentration of incoming artillery than at the Somme in 1916, or the Normandy Bocage after D-Day in 1944.  A Russian fighter jet crashed into the sea off the Crimean port of Sevastopol on Thursday, the regional governor has said. The post Lian Hup Heng: Underrated atas cafe-style tarts & cake loaves for $3.80, hidden within a hawker centre appeared first on SETHLUI.com. Nordegren has moved on and built a life that focuses on her six kids  Premier League ball boys and girls have been ordered to stop throwing the ball back to players during matches, amid concerns that the “multi-ball” system is giving home teams an unfair advantage. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}