{
    "title": "Tesla scraps Elon Musk's no-advertising mantra as shares plunge nearly 30% \nthis year - THE BHARAT",
    "date": "3/30/2024",
    "url": "https://thebharatexpressnews.com/tesla-scraps-elon-musks-no-advertising-mantra-as-shares-plunge-nearly-30-this-year/",
    "text": " Amid increasing competition and lackluster stock performance, Tesla is brushing off CEO Elon Musk’s previous disdain for marketing and pushing ahead with digital advertising in search of a much-needed sales boost. The company spent an estimated $6.4 million on digital advertising last year Wall Street Journal The company reports this based on data from Vivvix, a subsidiary of the advertising tracking platform MediaRadar.  The company’s marketing budget last year dwarfed the $175,000 Vivvix spent in 2022.  Tesla spent 900 times more on US-targeted digital advertising in the first quarter compared to a year ago, according to a report from market intelligence firm Sensor Tower.  . Tesla’s ad spend focused primarily on YouTube, Sensor Tower reported, but also included campaigns on Facebook, Instagram, Google and Musk’s X platform, according to a review of publicly available data. Many of the ads promote the company’s Model Y vehicle, with a call to buy before prices rise on April 1.  Some advertise Tesla features like autopilot and extra cargo space, while others show families using the touchscreen to play games or stream video.  . Musk and Tesla have often rejected traditional forms of promotion, relying instead on word of mouth, referral programs and the star power of their CEO to attract customers.  Tesla’s CEO has previously said that the money spent on publicity campaigns could be better spent elsewhere. “Tesla does not advertise or pay for recommendations.  Instead, we use that money to make the product great,” he wrote in one after on X, formerly Twitter, in 2019. The story continues Still, the nearly 30% plunge since January in Tesla shares and increased competition from Chinese EV makers has recently led Musk to become more open to advertising.  In response to a question at last year’s annual shareholder meeting in May, Musk said Tesla “would[T]Promote a little and see how it goes.’ The company’s advertising turnaround comes as the first three months of the year draw to a close and analysts prepare for what could be a sub-par quarter for the EV maker.  Several analysts have already lowered their estimates for first-quarter vehicle deliveries (a sales estimate) after Bloomberg reported last week that Tesla was cutting production at its factory in China. On Wednesday, Wedbush Securities cut its estimate to 425,968 from about 475,000, according to a note.  Consistently bullish Wedbush analyst Dan Ives also lowered his price target to $300 from $315, though the firm reiterated his “outperform” rating for the company. A recent internal email to staff revealed that Musk is relying not only on digital advertising but also on aggressive promotion to increase sales of his $12,000 per year “full self-driving” subscription.  In a leaked internal email this week, Musk said Tesla staff should give potential customers a quick trial while they picked up their cars. “I know this will slow down the delivery process, but it is a firm requirement nonetheless,” he wrote in the internal email. This story originally appeared on Fortune.com  Save my name, email, and website in this browser for the next time I comment.   Δ "
}