{
    "title": "Lawyers who got Elon Musk's pay package voided ask for record $6B in fees \n(NASDAQ:TSLA)",
    "date": "3/2/2024",
    "url": "https://seekingalpha.com/news/4074985-lawyers-who-got-elon-musks-pay-package-voided-ask-for-record-6b-in-fees",
    "text": "VCG Three law firms have asked a U.S. court in Delaware to award them with Tesla (NASDAQ:TSLA) stock worth nearly $6B as their fee for successfully getting Elon Musk's $55B pay package nullified. On January 30, Delaware Chancery Court Chief Judge Kathaleen McCormick voided a 2018 performance-based stock option grant worth $55B due to Musk after a shareholder lawsuit claimed that the package was unduly approved. That shareholder lawsuit was filed by former heavy metal drummer Richard Tornetta on behalf of his fellow Tesla (TSLA) investors. The three law firms are New York-based Bernstein, Litowitz, Berger & Grossmann and Friedman Oster & Tejtel and Wilmington, Del.-based Andrews & Springer. \"After extensive motion practice, searching discovery and a full trial on the merits, followed by briefing, oral argument and supplemental briefing, Plaintiff won complete recission of the largest pay package ever issued,\" the firms said in a joint filing in the Delaware Court of Chancery on Friday. The law firms are asking for just over 11% of the shares that would have otherwise gone to Musk as part of his pay package, or about 29.4M shares. Based on Tesla (TSLA) stock's last closing price of $202.64, the fee amounts to $5.96B. If awarded, it would make it the biggest payday for attorneys in a corporate case. \"We recognize that the requested fee is unprecedented in terms of absolute size,\" the law firms said in the filing. Musk weighed in on the development. \"The lawyers who did nothing but damage Tesla (TSLA) want $6 billion. Criminal,\" the billionaire businessman said on X (formerly Twitter). In a separate reply to another user's post, Musk said \"the system is broken. Best to get out of Delaware as soon as possible.\" "
}