{
    "title": "Hertz Stock: The Tesla Pain Continues (NASDAQ:HTZ)",
    "date": "3/19/2024",
    "url": "https://seekingalpha.com/article/4679245-hertz-the-tesla-pain-continues",
    "text": "Sundry Photography  Sundry Photography One of the worst performing stocks in the markets in recent quarters has been Hertz Global Holdings (NASDAQ:HTZ). The rental car company has seen its shares lose more than half of their value over the past year, hitting a new 52-week low on Monday morning after news that its CEO had resigned. Unfortunately for shareholders, there still seems to be some more headwinds in the near term, primarily related to the company's bad bet on electric vehicles. When I covered Hertz back in October, I was worried about a couple of items. First, falling values for used Tesla (TSLA) vehicles would hurt the company's depreciation and resale value situation. Second, interest costs were rising as the fleet was being built out, and profitability was taking a huge hit. Finally, the valuation wasn't great when compared to one of its closest competitor. Since that article, Hertz shares are down about 17%, but the overall US market has soared to new highs, with the S&P 500 surging more than 25%. Earlier this year, Hertz announced that it would be selling a large portion of its electric vehicle fleet, while using some of the proceeds to increase its ICE based offerings. EV repair costs were much higher than initially projected, while the company was hit hard by depreciation costs after Tesla's numerous price cuts hit used vehicle values. As the graphic below shows, used values for Tesla's Model 3 and Y vehicles have continued to drop since my previous article, and are now more than 50% off their peaks from the summer of 2022. Used Tesla Indexes (CarGurus) Used Tesla Indexes (CarGurus) I've been watching the inventory of Tesla vehicles on Hertz's website over the last couple of months. Generally speaking, the low and high prices for both Model 3s and Ys have come down by a few thousand dollars each. This will likely mean another larger than expected depreciation expense for Hertz in the current quarter. Also, the company may not generate as much from sale proceeds as expected in 2024, which could pressure cash flow. Management also wasted lots of money on share buybacks in recent years near $20 a share, which looks rather foolish with shares now at $7. Due to extra deprecation charges taken in Q4, the company lost almost half a billion dollars before factoring in taxes. The net loss was a bit less thanks to an income tax benefit of $145 million. For the full year in 2023, pre-tax profits dropped almost 90% to less than $300 million. This was mainly a function of depreciation charges nearly tripling to over $2 billion from just $700 million in 2022. The only good news here is that due to income tax benefits, the overall net profit was $616 million, but that was still down about 70% from the $2.059 billion seen a year earlier. At the same time, the company's net debt pile rose by roughly $2 billion during this year, resulting in interest expenses more than doubling from $328 million to $793 million. Hertz finished 2023 with $764 million in cash against $15.691 billion in debt. Operating cash flow was nearly $2.5 billion last year, down a couple of percent from 2022. However, the company spent over $9.5 billion on vehicle additions, while only receiving $5.5 billion in vehicle disposition proceeds, resulting in that large net debt increase. A majority of that debt is tied to the company's vehicle portfolio, but with the Fed likely to keep rates rather high for the time being, any additional debts will be rather costly. On the valuation front, the argument for Hertz doesn't look any better. Shares currently go for about 16 times this year's expected earnings and 6.4 times next year's. However, competitor Avis Budget Group (CAR) goes for just about 6.0 times this year's and less than 5.5 times next year's. Avis currently is in a much better place in terms of profitability, which is why I can't justify paying up considerably for Hertz right now. With the EV strategy change likely to take a few more quarters to flow through the company's results, I'm continuing to rate Hertz a sell today. As I showed above, the valuation is just too high, and I need to see how the sales of all these electric vehicles impacts the overall results here. Once I see how the longer term profitability situation looks with a new depreciation base, along with how much debt remains on the balance sheet, I can start to think about potentially upgrading to a hold. I also want to hear about any new vision from the company's new leader, given the abrupt CEO change. In the end, shares of Hertz have hit a new low as the company continues to feel pain from its bad electric vehicle bet. With used Tesla vehicles losing value basically by the day, the rental car company is facing higher depreciation costs and lower residual values. Hertz's profitability picture has taken a huge hit, especially as the debt strapped balance sheet racks up interest expenses. With shares now trading at a significant premium to Avis, I think we'll see further lows until Hertz's strategy change is closer to completion. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Investors are always reminded that before making any investment, you should do your own proper due diligence on any name directly or indirectly mentioned in this article. Investors should also consider seeking advice from a broker or financial adviser before making any investment decisions. Any material in this article should be considered general information, and not relied on as a formal investment recommendation. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}