{
    "title": "EVs Take 92.1% Share In Norway — Tesla Model Y Dominates",
    "date": "3/4/2024",
    "url": "https://cleantechnica.com/2024/03/04/evs-take-92-1-share-in-norway-tesla-model-y-dominates/",
    "text": " February saw plugin EVs take 92.1% share in Norway, up from 90.1% year on year. Following the recent tax changes, BEVs alone were above 90% share for the second consecutive month. Overall auto volume remained well below seasonal norms, at 7,380 units. The Tesla Model Y sold 1,747 units, almost a quarter of the entire market.  February saw combined EVs take 92.1% share in Norway, comprising 90.1% full electrics (BEVs) and 2.0% plugin hybrids (PHEVs). These compare with YoY figures of 90.1% combined in February 2023, 83.1% BEV and 7.0% PHEV. Recall that recent policy changes have disrupted the balance of powertrains, with a pull-forward of non-BEV sales before January 1st and a hangover for them since. This is why PHEV sales have been unusually low for the past two months. They will recover slightly in the months ahead, but it’s important to understand that the new policies are specifically designed to limit the attractiveness of all non-BEVs, to help meet the goal of “100% electric by 2025.” We will have to wait till at least mid-Q2 before a new equilibrium between powertrains emerges. At the moment, regular folks in Norway are feeling an economic squeeze, non-BEVs are taxed even more heavily than previously, and yet … few truly affordable BEVs are offered. (The cheapest BEV, the 39 kWh Nissan LEAF, starts from NOK 232,600 or €20,400, without sales tax.) The inevitable result of these combined factors is declining overall auto sales in Norway. Killing off everything except (relatively expensive) BEVs is one way to get close to the goal of 100% BEVs by 2025, but perhaps not the best way to safeguard working people’s access to mobility. Europe is missing simple, affordable BEVs, which exist in India, in China, in Korea, and other places. Now that battery cell prices have come down to €44/kWh, BEVs don’t have to be more expensive than ICE vehicles. Chinese OEMs offer dozens of BEV models below €20,000 and even several models starting below €5,000. The hot-selling A00 segment (slightly larger than the 1959 BMC Mini and 1957 Fiat 500) has seen exclusively BEV powertrains since 2021. Why? Because warrantied and emissions-compliant ICE vehicles can’t compete at these low prices. These simple BEVs often sell entry versions for under €5,000 (without sales taxes). Why aren’t there affordable BEVs, at least priced from around €15,000 (including taxes), in Europe? A recent JATO report explains that a concerted effort of European legacy OEMs — pursuing short-term profits and deliberately keeping BEV prices elevated — is responsible for this deficit of affordable BEV options in European markets. Can this kind of industry-wide consensus on elevated pricing exist without collusion? And can it exist without politicians spinning up skewed narratives to keep competition out? All of this seems fully in tune with legacy automakers’ dragging their feet on the EV transition since the 1990s. If no more affordable options are offered, we will likely continue to see Norway’s BEV share creep up, but it will come at the expense of the ending of sales of truly affordable vehicles for working people — returning us to the elitist days of car ownership of the early 1900s. Not a good look. Let’s debate this in the comments.  As usual, the Tesla Model Y was the best selling vehicle, with 1,747 units registered, 23.7% of the entire auto market, and roughly equal to the next 7 models combined. The runners up were the Volkswagen ID.Buzz and the Toyota BX4x.  Toyota Group is pushing hard to increase the volume of its 3 siblings, the Toyota BZ4X, Subaru Solterra, and Lexus RZ450E. This was the first month that all three were ranked in the top 20. These were the main movers in the above list. Most of last month’s debutants, the BYD Dolphin, Opel Astra, and SsangYong Korando, have not yet ramped up their volumes to significant levels. The new BMW iX2, which registered a single unit in January, stepped up to a decent 28 units in February, and should rise further from here. One new model appeared in February, the Smart #3, though with just a single unit delivered. Its platform-sharing sibling, the Smart #1, debuted in September, but has only averaged 6 units per month since then. Entering with just a single unit registered, it doesn’t seem that the #3  is set to change this dynamic, but we will have to wait and see. Both of these Smart models share an underlying platform with the new Volvo EX30 (not yet launched in Norway), with similar technical specs and pricing. Let’s turn to the longer view:  Here, the Tesla Model Y remains in the top spot, but other positions are seeing changes. The Toyota BZx4 has kept climbing, now in 2nd, from 3rd in the previous period. The ID.Buzz has also climbed, to 3rd from 6th previously. The Skoda Enyaq, which was 2nd in the prior period (and typically in or near the top 3 for the past two years) has fallen all the way back to 11th, a big drop. Let’s keep an eye on this. Let’s briefly update ourselves on how the fleet evolution is going:  Combined plugin share at the end of December 2023 stood at 31.39%, with BEV share at 24.18%. These compare with 30.71% and 23.60%, respectively, three months earlier. The change in fleet share is slowing down as auto sales reduce. The change from the 12 months from end-2022 to end-2023 was 3.66%. The change over the prior 12 months was 5.59%. This slowdown in fleet transition is a consequence of the economic recession putting a squeeze on people’s finances and reducing auto sales. Beyond the shrinking auto market, Norway’s broader economy remained weak, registering just 0.5% YoY growth in Q4, from negative 1.9% in Q3. Inflation improved slightly to 4.7% in January (latest data), from 4.8% in December. Interest rates remained flat at 4.5% (January, latest). Manufacturing PMI improved to 51.9 points in February, from 51.1 points in January. The OFV points the finger for falling auto sales at the broader economy: “Several interest rate increases, high prices for food, electricity and other goods mean that people have to prioritize strictly. The first two months of the year show that many people still think twice before buying a new car — which is often the biggest investment after housing” (OFV, machine translation). What are your thoughts on Norway’s auto market, and the trends around the transition to EVs? Please join in the discussion below. Max is an anthropologist, social theorist and international political economist, trying to ask questions and encourage critical thinking. He has lived and worked in Europe and Asia, and is currently based in Barcelona. \r\nFind Max's book on social theory, follow Max on twitter @Dr_Maximilian and at MaximilianHolland.com, or contact him via LinkedIn. Dr. Maximilian Holland has 416 posts and counting.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\tSee all posts by Dr. Maximilian Holland "
}