{
    "title": "Tesla cuts production in China, trailing stock in S&P 500 in 2024",
    "date": "3/23/2024",
    "url": "https://www.breakinglatest.news/business/tesla-cuts-production-in-china-trailing-stock-in-sp-500-in-2024/",
    "text": "The dark moment continues Tesla, worst stock in the S&P 500 since the beginning of the year with a decline of 32% ytd. The shares of Elon Musk’s company opened still lower (-2%) on Wall Street, in the wake of rumors about a reduction in production at its Shanghai plant. A decision due to the slowdown in demand for electric cars and growing competition in China. If you want updates on World News enter your email in the box below: By filling out this form I agree to receive information relating to the services on this page in accordance with the privacy policy. According to rumors reported by Bloomberg, Tesla has notified employees at its Shanghai gigafactory of a reduction in production activities for the Model Y and Model 3the two vehicles assembled in China and destined for different markets, including Europe. In particular, the American company would have ordered one decrease in the working week, from the usual six and a half days to five. Production will continue to operate on the basis of two shifts per day of 11.5 hours each. The new organization has been in place since early March, but it is unclear how long it will last. Some of the production lines at the plant, including battery shops, would be subject to longer suspensions, according to an inside source. Tesla has reportedly warned staff and some suppliers to prepare for limited production until April. At the basis of Tesla’s decision there are two fundamental factors: the slowdown in demand for electric cars and the increasingly intense competition in the Chinese car market, the largest in the world. Passenger vehicle sales in China rose 17% in the first two months of the yearwith 37.5% growth for “new energy vehicles” (NEVs), a term that includes full electric, hybrid and fuel cell cars. Tesla, on the other hand, delivered 131,812 cars between January and February, down 6% compared to the first two months of 2023, as emerged from data from China’s Passenger Car Association. In February, the Texan company’s sales fell by as much as 19%, reaching the lowest level since December 2022. Only 53% of deliveries went to the local market, despite discounts implemented by Tesla since the beginning of the year. Musk’s car company finds itself competing with a number of local electric vehicle manufacturers That they churn out increasingly convenient and technology-rich cars. Among these stands BYD, which in the last quarter of 2023 surpassed Tesla in terms of deliveries and which enjoys, among others, the support of a prominent investor such as Warren Buffett. Tesla is present in China with two models, the Model 3 sedan and the Model Y sports car, which underwent an update in the second half of last year. In January, Tesla has lowered its prices price list of the two cars, fueling a price war with competitors. Since the beginning of March, other discounts of up to 8,000 yuan (just over $1,000) have been introduced on the Model 3, as well as financing plans and other concessions. Demand for electric cars has slowed in China, as well as in other major regions, including the United States and Europe. This, above all, after the Beijing government scaled back a decade-long promotion of the sector and removed nationwide subsidies from the end of 2022. According to the Passenger Car Association, the NEV deliveries to dealers will increase by 25% in 2024, reaching 11 million units. While still marking an expansion, the forecast indicates a slowdown compared to 36% in 2023 and 96% in 2022. Since the beginning of the year, Tesla shares have fallen by 32%, clearly the worst performance among the big names on Wall Street. The losses of recent months have caused the automaker to slip into the ranking of the most capitalized companies on Wall Street. With a market cap of approximately $550 billionTesla was also overtaken by JPMorgan ($573 billion), Visa ($598 billion) and Eli Lilly ($783 billion). The opinions of the analysts collected by Bloomberg are divided between 20 buy, 26 hold and 14 sell, with a average target price of 205 dollarswhich implies a potential recovery of 21%. Among the supporters of the stock, Cathie Wood, the CEO of the Ark galaxy funds, stands out, according to which the stock could soar up to 2000 dollars by 2027.     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}