{
    "title": "Direxion Daily TSLA Bull 1.5X Shares (NASDAQ:TSLL) Hits New 12-Month Low at \n$7.52",
    "date": "3/16/2024",
    "url": "https://www.defenseworld.net/2024/03/16/direxion-daily-tsla-bull-1-5x-shares-nasdaqtsll-hits-new-12-month-low-at-7-52.html",
    "text": "Posted by Defense World Staff on Mar 16th, 2024 Direxion Daily TSLA Bull 1.5X Shares (NASDAQ:TSLL – Get Free Report) shares hit a new 52-week low during mid-day trading on Thursday . The company traded as low as $7.52 and last traded at $7.63, with a volume of 7316251 shares. The stock had previously closed at $7.82. The business has a fifty day moving average of $9.91 and a 200-day moving average of $12.94. The company also recently announced a quarterly dividend, which was paid on Friday, December 29th. Investors of record on Friday, December 22nd were paid a $0.1254 dividend. The ex-dividend date of this dividend  was Thursday, December 21st. This represents a $0.50 dividend on an annualized basis and a yield of 6.78%. Several hedge funds have recently added to or reduced their stakes in TSLL. Renaissance Technologies LLC lifted its stake in shares of  Direxion Daily TSLA Bull 1.5X Shares by 134.0% in the 2nd quarter. Renaissance Technologies LLC now owns 234,000 shares of the company’s stock valued at $4,061,000 after acquiring an additional 134,000 shares during the last quarter.  Jane Street Group LLC purchased a new position in shares of  Direxion Daily TSLA Bull 1.5X Shares during the 4th quarter worth approximately $836,000.  Clarity Capital Partners LLC purchased a new stake in shares of  Direxion Daily TSLA Bull 1.5X Shares in the 4th quarter worth approximately $1,058,000.  First City Capital Management Inc. purchased a new stake in shares of  Direxion Daily TSLA Bull 1.5X Shares in the 3rd quarter worth approximately $1,053,000.  Finally, Simplex Trading LLC grew its stake in shares of  Direxion Daily TSLA Bull 1.5X Shares by 122.1% in the 3rd quarter. Simplex Trading LLC now owns 95,631 shares of the company’s stock worth $1,479,000 after buying an additional 52,579 shares during the last quarter. (Get Free Report) Featured Articles\n\nFive stocks we like better than Direxion Daily TSLA Bull 1.5X Shares\n3 Stocks to Consider Buying in October\nWhy Dollar General and Dollar Tree Are Similar Yet Different\nTrading Halts Explained\nJabil Stock Implodes: Market Manufactures Entry for New Money\nThe How and Why of Investing in Gold Stocks\nFlutter Receives Major Upgrades: Investor Interest Skyrockets\n\n\n\n\n\n\n\nReceive News & Ratings for Direxion Daily TSLA Bull 1.5X Shares Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Direxion Daily TSLA Bull 1.5X Shares and related companies with MarketBeat.com's FREE daily email newsletter.  Receive News & Ratings for Direxion Daily TSLA Bull 1.5X Shares Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Direxion Daily TSLA Bull 1.5X Shares and related companies with MarketBeat.com's FREE daily email newsletter. Inari Medical (NASDAQ:NARI) Sets New 1-Year Low at $40.42 Short Interest in Brunello Cucinelli S.p.A. (OTCMKTS:BCUCY) Drops By 37.5% "
}