{
    "title": "“Xiaomi” competes with “Tesla” with a lower-priced electric sports car",
    "date": "3/28/2024",
    "url": "https://www.ruetir.com/2024/03/29/xiaomi-competes-with-tesla-with-a-lower-priced-electric-sports-car/",
    "text": " The car comes with design touches derived from Porsche cars, and at a lower price than the Tesla Model 3, which highlights the fierce competition imposed by new entrants on the already crowded electric car market in China. During a two-hour event, Xiaomi's CEO and founder, Lei Jun, said in a hall crowded with attendees, including the presidents of the two Chinese electric car manufacturers Nio and Xpeng, that the standard model (SU7) will be priced at 215,900 yuan ($29,872.02), while the price of the Pro and Max versions will be 245,900 and 299,900. yuan respectively. Li Jun added: “It is 30,000 (yuan) cheaper than the Tesla Model 3,” noting that the price of the American car starts at 245,900 yuan in China. The launch of the car comes in fulfillment of the ambition of Xiaomi's founder, who announced the company's entry into the field of electric car production in 2021 and pledged to invest $10 billion in car-related businesses as “the last major entrepreneurial project” in his life. The company, which is famous for its smartphones and a wide range of affordable devices, began receiving orders for the SU7 as of 10 p.m. Beijing time (1400 GMT) and said it received 50,000 orders within the first 27 minutes. According to the CEO, the SU7 will be put on sale in 211 outlets in 39 Chinese cities by the end of this year.  Xiaomi did not mention whether it has any plans to sell the car abroad. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  Latest News, World News, Breaking News, Games,Technology, Business, Lifestyle, Fashion, Sports, Food & Technology. © Ruetir 2024. All Rights Reserved. © Ruetir 2024. All Rights Reserved. "
}