{
    "title": "Elon Musk shares amazing video of Cybertruck 'Mars edition'",
    "date": "3/18/2024",
    "url": "https://supercarblondie.com/elon-musk-shares-footage-of-cybertruck-mars-edition/",
    "text": "Published on Mar 18, 2024 at 7:01PM (UTC+4) Last updated on Mar 18, 2024 at 7:01PM (UTC+4) No, Elon Musk is not making a Cybertruck ‘Mars edition’ just yet, but this may be the closest thing yet. Musk recently shared an amazing video on X of a customized Cybertruck that looked like it belonged on Mars. In the video, the custom car can be seen driving through the sandy rough terrain while going at 50 mph. READ MORE! Elon Musk responds after man builds fully functional Cybertruck out of wood for $15,000 The custom car dubbed ‘Cyberrail’ was made by YouTuber, Dave Sparks. Previously, the YouTuber had added snowmobile tracks to the Cybertruck and plowed it through the snow. This time he has done something less crazy but equally amazing. The custom Cybertruck even got the attention of Tesla owner Elon Musk who retweeted the video. Sparks had planned on building a full long travel suspension for the Cybertruck, but couldn’t due to lack of time. However, they did build new control arms and a custom steel frame to prevent the truck from cracking. They also installed full Raptor Fox suspension and beefier steering components to stabilize the vehicle. Since the Cybertruck is a 7500-pound chunk of stainless steel, it is not built for offroading as the truck’s suspension is quite weak. Sparks had to strip the truck’s suspension and then install a new one. All of this was done to protect the truck from the tremendous force when driving it on off-road trails. He had done the same thing for his last project when he installed snow track rails on the truck. Images of the custom truck were also shared by Supercar Ron on X. The truck also has a custom SpaceX decal on the back left side of the car that really makes it look like Cybertruck Mars edition. There’s also the paddle tires and wide-body customization that completes the entire look. Let’s just hope that this doesn’t give Musk any ideas to launch the truck to Mars, just like he did with the Tesla Roadster. Bugatti CEO responds to Elon Musk’s claim Tesla Roadster will do 0 to 60mph in under a second Adin Ross fires bullets at Cybertruck to put Musk’s theory to the test Instagram\nFacebook\nTwitter\nLikedin Copyrights ©2024 SB Media Holding Limited "
}