{
    "title": "Britain should make a bold offer to Elon Musk after his German disaster",
    "date": "3/10/2024",
    "url": "https://www.telegraph.co.uk/business/2024/03/10/britain-should-make-big-bold-offer-elon-musk-tesla/",
    "text": "Now is the time to capitalise on Tesla’s crisis in Berlin In Germany, Tesla has been refused permission to expand its factories if trees have to be chopped down. It has faced arson attacks, and protests from ecological protesters. The huge new Tesla factory outside Berlin, a plant that was meant to spearhead the reindustrialisation of the country, is rapidly turning into a disaster for the company. Surely there is an opportunity here for the UK? With Tesla still needing to ramp up its production in Europe, this is the moment to make a big, bold offer to Musk – because if the next phase of Tesla’s expansion was in the UK it would be a hugely symbolic victory for this country. When Berlin was chosen as the site for Tesla’s first major European plant it was seen as an important moment for a country that prizes auto production over anything else. It is not going to plan. Over the last few weeks, residents of the Grünheide region where the factory is located have voted against plans to expand it, on the grounds that a few trees might have to be cut down. Eco protesters, seemingly unaware that a Tesla is an electric vehicle that is far better for the environment than the petrol models it is replacing, have started a camp outside, and are running constant protests against its presence there. There has even been a suspected arson attack that closed down the lines. “Stopping production of electric vehicles, rather than fossil fuel vehicles, ist extrem dumm,” wrote Musk on X, formerly Twitter, which he also happens to own. To cap it all, according to German press reports, the company hasn’t even received any of the €1bn (£850m) of state funding it was expecting to help with the cost of the plant. The reason? Tesla moves so quickly that the notoriously petty German officials can’t keep up, leaving the funding stuck on hold. It is not, to put it mildly, a happy ship. It is hard to see the hyper-active, combative Musk putting up with the chaos around his Berlin factory for much longer. We already know the company is looking elsewhere for the next stage of Tesla’s expansion. Italian ministers have revealed there have been talks about a possible plant in that country, and there have been high-profile meetings with France’s President Emmanuel Macron, a leader who is never slow to clear out his diary if it might lead to a major new investment. The important point is surely this. The moment has clearly arrived for the UK to make Musk a bold and generous offer. Sure, he is unlikely to shift the existing Berlin factory to the UK, although with a man who spent $44bn (£34bn) on Twitter, and then promptly fired most of the staff, and changed its name, nothing can ever be completely ruled out. Once he is in a bad mood, he doesn’t mind losing a few billion to make a point. Even so, the Berlin plant is clearly not the limit of Tesla’s ambitions in Europe, nor does it seem likely that it will be allowed to expand to meet all the demand for its vehicles. Instead of France or Italy, the UK should be the natural site for the next phase of its expansion. It is not going to happen, however, if the UK does not make an effort. There are three incentives that might tempt Musk to this country. First, and most obviously, financial help. Industrial subsidies are wildly overrated, and very rarely generate anything like the benefits promised. Even so, if the Chancellor can boast in his Budget speech, as Jeremy Hunt did last week, of giving plenty of help for AstraZeneca to build a new £450m vaccine factory in Liverpool, then it surely makes sense to write out a nine figure cheque to Tesla for making the UK its major manufacturing hub in Europe. After all, this is a company that has come from nowhere to make itself one of the biggest auto manufacturers in the world, and which leads the world in electric vehicles. That has to be worth something. Next, we should offer full political backing, and, if necessary, police support. The German government led by Chancellor Olaf Scholz may have wanted Tesla in the country, but it is too weak, and too worried about its Green coalition partners, to stand up to the ecological protestors who are determined to prevent any form of industrial expansion. It can’t even summon up the political will to make sure a few trees get chopped down. In the UK, Tesla should be guaranteed that anyone breaking the law to impede its plans will be dealt with by the police and the courts. Finally, and most radically, Tesla could be offered one of the new investment zones, with the rules relaxed even further. The libertarian Musk doesn’t like labour unions, minimum wages, planning regulations, or corporate governance and social responsibility regulations. Quite understandably, they get on his nerves, and they slow down the rapid pace of expansion that drives all his companies. We could offer to suspend all of that within a special Tesla Zone. Heck, who knows, it might work so well that a few more companies might be tempted to set up factories in the same region. If the UK could persuade Tesla to choose the UK for the next phase of its expansion, it might even encourage a few others to abandon Germany. It is hard to see the big new Intel factory that has been offered billions in subsidies by the government in Berlin going any better. True, Tesla may have some challenges. Electric vehicles are not as popular as they were 12 months ago, and the share price has fallen. And yet, it remains a hugely significant company, and a brilliant manufacturer. If it could be tempted into switching its main European hub from the outskirts of Berlin to Sunderland or Bolton it would be a huge win for this country – and well worth the money it would cost. "
}