{
    "title": "Elon Musk's wealth is down by almost $40 billion this year — and it's only \nMarch",
    "date": "3/7/2024",
    "url": "https://www.businessinsider.nl/elon-musks-wealth-is-down-by-almost-40-billion-this-year-and-its-only-march/",
    "text": "Secties Edities Specials Over Business Insider Copyright © 2024 Business Insider Nederland. Alle rechten voorbehouden. Registratie of gebruik van deze site vindt plaats onder Algemene Voorwaarden en Privacybeleid.\nAlgemene voorwaarden | Privacybeleid | Cookie-overzicht | Adverteren | Vacatures Elon Musk is CEO of Tesla. Foto: Slaven Vlasic/Getty Images Elon Musk's troubles keep piling up — and they're affecting his wealth. The Tesla CEO's net worth has plunged by almost $40 billion this year, according to the Bloomberg Billionaires Index. He's now worth $189 billion, leaving him in third place on the list, after a long stint at the top. Earlier this week Jeff Bezos overtook Musk — but the Amazon founder's spell didn't last long. He's been replaced at the top of the Bloomberg index by French tycoon Bernard Arnault. The LVMH chief is worth $197 billion, $1 billion more than Bezos, after adding $18 billion to his worth this year. The three billionaires frequently trade places as the world's wealthiest individuals and it's not the first time Arnault has been at the top. The decline in Musk's worth is largely due to Tesla's sagging share price, which is down almost 29% in 2024 as investors fret about poor sales in China. Most of Musk's wealth comes from his 21% stake in the EV maker. Weakening consumer demand for EVs and rising competition from local competitors such as BYD have also unnerved some investors. Musk was also denied a $55 billion compensation package after a Delaware court ruled it was unfair. Running X, the social network formerly known as Twitter, is also proving to be a headache for the billionaire. Advertisers have fled since Musk took over in late 2022, making revenue hard to come by despite slashing thousands of staff. Musk also faces legal claims from laid-off Twitter employees and lawsuits from landlords claiming that its offices have fallen behind on rent. Een ervaren reisjournalist raadt aan voor het boeken goed te kijken naar de verschillende arrange Probeer de drijfveren van de werknemer met een vertrekwens te achterhalen en vraag je ook af of e De Hoge Raad beslist waarschijnlijk in augustus of de methode die wordt gebruikt voor box 3 voor Bij het opbouwen van spiermassa gaat het vooral om uitdagende krachtrainingsessies en niet per se De regels rond de hypotheekrenteaftrek spelen niet alleen bij de jaarlijkse belastingaangifte, ma Massachusetts state police say a suspect shot a Boston Dynamics robot dog during a SWAT standoff. I’ve been a flight attendant for 9 years, so there are a few things I think passengers shou The father of a woman who Hamas killed has defended an award-winning image of her. The Associated Former New Jersey Gov. Chris Christie is the latest politician to spurn No Labels. The centrist g My husband and I became empty-nesters last year and booked a big European vacation for ourselves. Wil je groeien met je bedrijf? Nu in 30 seconden een indicatie van je lening. Rabo Zakelijk Financieren. Verrassend snel een passend voorstel. Wil je jouw bedrijf verduurzamen? In 15 minuten weet je wat je kan lenen. Bekijk alle vacatures → Massachusetts state police say a suspect shot a Boston Dynamics robot dog during a SWAT standoff. I’ve been a flight attendant for 9 years, so there are a few things I think passengers shou The father of a woman who Hamas killed has defended an award-winning image of her. The Associated Former New Jersey Gov. Chris Christie is the latest politician to spurn No Labels. The centrist g My husband and I became empty-nesters last year and booked a big European vacation for ourselves. Morgan Owen was married to her ex-husband when she walked into the gym one day and saw Axe. There Copyright © 2024 Business Insider Nederland. Alle rechten voorbehouden. Registratie of gebruik van deze site vindt plaats onder Algemene Voorwaarden en Privacybeleid.\nAlgemene voorwaarden | Privacybeleid | Cookie-overzicht | Adverteren | Vacatures "
}