{
    "title": "Tesla leads California EV market as Model Y registrations surge 52% in 2023",
    "date": "1/29/2024",
    "url": "https://driveteslacanada.ca/news/tesla-leads-california-ev-market-as-model-y-registrations-surge-52-in-2023/",
    "text": "Tesla continues to be a favourite choice among California buyers. The automaker was the best-selling electric vehicle (EV) brand in the state in 2023, accounting for over 60% of all EV sales last year. Tesla’s dominance was led by none other than the Model Y, with 132,636 registrations in 2023, according to new data published by the California New Car Dealers Association (CNCDA) on Monday. This was a massive 52% increase from the previous year, when the Model Y accumulated 87,257 registrations. The Model Y also dominated the segments it is included in that the CNCDA tracks, coming out on top in the Luxury Compact SUV more than 115,000 registrations ahead of the second place Lexus N/X, and more than 74,000 registrations ahead of the Toyota RAV4 in the Top Selling Light Truck category. The next most popular EV was the Model 3, which by itself had some equally impressive stats. In 2023 the Model 3 racked up 82,786 registrations, second only to the Model Y. This was a more modest 4.88% increase from 2022, but still more than the next 8 best-selling EVs combined. The Model 3 also earned the title of best-selling passenger car, ahead of perennial favourites like the Toyota Camry (51,330), Honda Civic (42,564), Honda Accord (40,878), and Toyota Corolla (38,198). On the other hand, sales of Tesla’s flagship Model S and Model X cars declined in 2023 in California. From January to December the Model X had 10,448 registrations, good enough for 7th place in the best-selling EV list, but down 7% compared to last year. Meanwhile, the Model S saw just 4,718 registrations, a 48% decrease from 2022. All of this put together and Tesla was able to increase their California registrations by 24.6% last year, enough to give them a 60.5% share of the EV market in California in 2023. While this is down from the 71% EV market share Tesla held in California in 2022, looking at the larger overall auto market Tesla was able to increase their share from 11.2% to 13%, more than double its market share from just two years ago. On the national scale, Tesla now hold a 4.2% share in the overall auto market, according to CNCDA data.  Tesla CAPEX to Exceed $10 Billion in 2024 New Tesla Model 3s hit existing inventory in Canada Founder and Editor-in-chief of Drive Tesla Canada | Darryn@DriveTeslaCanada.ca Have a Tesla tip? Email tips@driveteslacanada.ca, or DM us on Twitter @DriveTeslaca The first refreshed Tesla Model S was spotted in Queensland, Australia this week for the first time, but many are still curious about when the vehicle will officially arrive down under. Tesla last delivered a […] Last month CEO Elon Musk said Tesla was going to be increasing the price of their Full Self-Driving (FSD) Capability package in North America to $15,000 on September 5, 2022. At the time the FSD […] Ford has issued another round of price adjustments for the F-150 Lightning in the US. The Detroit-based automaker has both increased and lowered prices for various trims of the 2024 model year, with the increases […] Enter your email address to subscribe to Drive Tesla and receive notifications of new articles by email. Email Address Subscribe "
}