{
    "title": "Tesla Q4 Preview: Growth Stalling, Margins Eroding, And Too Expensive \n(NASDAQ:TSLA)",
    "date": "1/16/2024",
    "url": "https://seekingalpha.com/article/4663199-tesla-stock-q4-earnings-preview-growth-stalling-margins-eroding-expensive-downgrade-sell",
    "text": " Win McNamee As usual, I always start with the performance assessment for my prior coverage. My earlier stance on Tesla (NASDAQ:TSLA) was a 'Buy'. And I am disappointed to say I got this one quite wrong. Since publication of my last article, the stock has returned -18.42% (ouch) compared to the S&P 500's +4.04%; a negative alpha of 22.46%: Performance since Hunting Alpha's last article on Tesla (Seeking Alpha) I believe I made two serious errors and one error of misjudgment. The first serious error was that I got carried away by the grand aspirations of Tesla by placing too much emphasis on the mega-growth prospects of the industrial robots business and full self-driving (FSD). It is important to remember that I must act as a realistic investor and not get too carried away by the grand visions of an entrepreneur, great as though he may be. Therefore, whilst it is true that Tesla's investments do have great multiplier potential, it is too far out for the market to appreciate that possibility right now. And according to my investing philosophy, the market is the ultimate truth, especially since I am a minority shareholder who is largely at the mercy of the other market participants to realize a return on my investments. The second serious error was considering valuations by only looking at the historical trading multiples of Tesla. For a fast-growing company, the steady-state valuation band changes often and this is something I failed to take into account when assessing Tesla's valuation, leading to a dangerous conclusion. The last error of misjudgment was also a risk I identified for my thesis, which unfortunately played out: My thesis assumes no further microeconomic-related pricing cuts for Tesla. - Hunting Alpha's bull thesis risk in the last coverage of Tesla This has not played out. And I missed sharing an opportunity to revise my expectations and review my thesis earlier. Going forward, I will be sharing stance updates in a pinned comment for more timely updates in case of key developments. I am now bearish on Tesla as I think it will underperform the S&P 500 (SPY) (SPX). I don't think the upcoming Q4 FY23 earnings release on Jan 24, 2024 will present any meaningful upset to these trends:  Automotive Sales (USD mn) (Company Filings, Author's Analysis) Automotive sales comprise of almost 80% of the overall revenue mix. The last 4 quarters show a tapering off around the $20 billion mark. Automotive Sales YoY (Company Filings, Author's Analysis) YoY growth rates have been decelerating since Q1 FY22 and it was especially sharp in Q3 FY23 at 4.5% YoY. TTM YoY Revenue Growth (Tesla Q3 FY23 Investor Presentation) Tesla showed this comparison of TTM YoY revenue growth rates in their Q3 FY23 investor presentation. What is noteworthy is the divergence between Tesla and the broader auto industry since Q2 FY22; Tesla has been seeing a continued deceleration (of course, some amount of this is reasonable as it started off at a much higher base), whilst the auto industry's revenue growth has been accelerating since then. I do acknowledge that so far, Tesla is still growing much faster than the rest of the auto industry. However, the gap is clearly reducing. I don't see any catalyst for meaningful revenue growth re-acceleration in the near term as Tesla does not have any new product launches soon except for the Cybertruck, which management indicated would still take till 2025 to meaningfully ramp up and become cash-flow positive. CEO Elon Musk did not offer any timeline for the launch timing of the lower-priced cars in the Q3 FY23 earnings call. Contrary to what I expected, Tesla has continued to cut prices across all its models in the US (47% revenue mix) and in 7 out of 9 models in China (22% revenue mix). Here are some illustrations of pricing movements for key models in the US and China: Model Y LR Prices (USD) (Tesla Website, Author's Analysis) Model 3 SR Prices (USD) (Tesla Website, Author's Analysis) Model Y SR Prices (CNY) (Tesla Website, Author's Analysis) Note that Model 3/Model Y make up more than 95% of overall deliveries. These pricing cuts have further weighed down on automotive sales' gross profit margins as they declined to 15.7% in Q3 FY23: Automotive Sales Gross Profit Margin (Company Filings, Author's Analysis) Tesla has been reducing their automotive cost of sales and indicated that there is further scope for reductions here: Automotive Cost of Revenues Per Vehicle Delivered (USD) (Company Filings, Author's Analysis) However, these efforts are not nearly enough to offset the lower sale prices leading to continued declines in unit gross profits: Automotive Gross Profit per vehicle delivered (Company Filings, Author's Analysis) Over the last 6 quarters, automotive gross profits at a unit level have declined by almost 53%, from $17,865 to $8,431. EBIT Margin (Company Filings, Author's Analysis) Overall, this has led to a steep degradation in the EBIT margin profile of the stock. CEO Musk noted that their pricing cut decisions are prompted by rising interest rates and the pressure that place on maintaining affordability of their cars given a high proportion of people buying cars with loans: I just can't emphasize this enough that the vast majority of people buying a car is about the monthly payment. And as interest rates rise, the proportion of that monthly payment that is interest increases naturally. So that's -- if interest rates remain high or if they go even higher, it's that much harder to -- for people to buy the car. They simply can't afford it. - CEO Elon Musk in the Q3 FY23 earnings call Does this mean potential rate cuts in 2024 may lead to price hikes in Tesla's cars? I highly doubt it for 2 key reasons: Now Tesla's margin contraction due to cutting prices in order to offset higher financing costs for car purchases makes sense. However, note that other automotive companies are not seeing a similar decline in their margins profile: Operating Margin Comparisons (Tesla Q3 FY23 Investor Presentation) Tesla's 1-yr fwd PE Among the Magnificent 7 (Capital IQ, Author's Analysis) The Magnificent 7 includes Tesla (TSLA), Amazon (AMZN), Microsoft (MSFT), Apple (AAPL), NVIDIA (NVDA), Alphabet (GOOGL) (GOOG) and Meta (META) Let's acknowledge Tesla's massive growth optionalities in full self-driving (currently still in development), Optimus (currently still in development) and Energy Generation & Storage (currently still small at 6.7% overall revenue mix, 9.1% of overall gross profit mix). So the valuation band may be more comparable to the Magnificent 7 rather than traditional automakers. Even when viewing the valuations from this perspective, Tesla's 62.6x 1-yr fwd PE is still at a hefty 122% premium to the median 28.2x PE of other members in the Magnificent 7. If this is your first time reading a Hunting Alpha article using Technical Analysis, you may want to read this post, which explains how and why I read the charts the way I do, utilizing principles of Flow, Location, and Trap. TSLA/SPX500 Relative Technical Analysis (TradingView, Author's Analysis) From a technical analysis perspective of TSLA relative to the S&P 500 (SPY) (SPX), I note that the last impulse move has been bearish and the ratio prices have reacted off a breakdown retest area. I see there is space for further downside toward the bottom of the potential range. I anticipate immediate further progress downwards or a momentary spike in the form of a second failed retest of the resistance before a resumption down. A move down would correspond with underperformance of Tesla relative to the S&P 500. I believe the higher valuations provide a good deal of margin of safety in the bearish outlook for the stock. Although I deem it to be unlikely, any price hikes in vehicle models, coupled with strong consumer sentiment for spending on durable goods such as cars would be a key risk for my thesis. In fact, data from the University of Michigan Consumer Sentiment surveys reveals that high prices are by far the major reason for poor buying conditions in vehicles; more important than high interest rates: University of Michigan Consumer Sentiment Surveys (University of Michigan) This is another reason why I would be very surprised if management rolls back their pricing cuts policy. Also, considering the lack of new model releases, I don't expect sales growth to accelerate materially in the upcoming Q4 FY23 earnings release. My earlier assessment of Tesla was wrong, particularly due to 2 serious mistakes; (i) getting carried away by narratives of long-term multiplier growth potential without adequate visibility and (ii) not taking into account structural changes in the valuations band in a company that is far from reaching a maturity stage. Now, my revised stance on Tesla is bearish as I note stalling automotive sales (which is still the major revenue driver) without any major product launches or meaningful scaleups on the horizon, the increased risk of continued price cuts leading to structural margin profile deterioration, and a hefty valuation far above the norm for a Magnificent 7 stock. My research suggests that Q4 FY23 is unlikely to lead to any surprises that would break the current trend of weak automotive sales and pricing policies. But of course, I would be waiting for any contrary evidence in the results release next week and will provide an update if necessary. Stance: Sell Strong Buy: Expect the company to outperform the S&P 500 on a total shareholder return basis, with higher-than-usual confidence Buy: Expect the company to outperform the S&P 500 on a total shareholder return basis Neutral/hold: Expect the company to perform in line with the S&P 500 on a total shareholder return basis Sell: Expect the company to underperform the S&P 500 on a total shareholder return basis Strong Sell: Expect the company to underperform the S&P 500 on a total shareholder return basis, with higher-than-usual confidence The typical time horizon for my view is multiple quarters to around a year. It is not set in stone. However, I will share updates on my changes in stance in a pinned comment to this article and may also publish a new article discussing the reasons for the change in view. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}