{
    "title": "Elon Musk's Tesla loses EV crown to rival BYD in Q4",
    "date": "1/2/2024",
    "url": "https://fortune.com/2024/01/02/elon-musk-tesla-q4-production-deliveries-sales-record-byd/",
    "text": "Not even record sales could prevent Elon Musk’s Tesla from losing the crown as the world’s largest manufacturer of electric vehicles. The brand confirmed Wall Street’s expectations on Tuesday that it had been eclipsed by Chinese rival BYD in the final months of 2023 for the first time ever in a quarter. And given the blistering pace of growth at BYD, it doesn’t look like Musk will reclaim the title anytime soon. In a statement, Tesla said it delivered 484,507 cars to customers globally between October and December, a tick better than the company’s own compiled consensus estimates and more than it had ever achieved during a three-month period. “Q4 deliveries could have exceeded 490,000 if a boat with 5-6k vehicles were not turned back from Australia because of a stink bug infestation late in the quarter,” wrote Gary Black, a cofounder of asset manager the Future Fund. Somewhat disappointingly, neither production nor sales figures for the Cybertruck were broken out, suggesting volumes are still thin for the moment following its long-anticipated launch last month. Shares in Tesla trended flat in early trading on Tuesday. Musk sold nearly 1.81 million cars during 2023 for a very respectable gain of 38%. But that could end up being the last calendar year in which Tesla remains ahead of BYD. On Monday, the Shenzhen-based carmaker reported December figures showing it finished the fourth quarter with a record 526,400 EVs sold. With BYD delivering 1.59 million fully electric vehicles in 2023, a 73% gain over the previous one, it could easily eclipse Tesla on a full-year basis this year if it maintains anything near its current pace. There is good reason to believe it will, as the Warren Buffett–backed company just announced around Christmas plans to build its first-ever factory in Europe, a signal that it remains firmly focused on growth. Even if BYD is less profitable and has yet to prove its appeal on a global stage outside of its home market of China, the fact it is now outselling Tesla further punctures Musk’s air of invulnerability. The entrepreneur’s $800 billion megacap carmaker is worth ten times the value of BYD, and maintaining a high double-digit rate of vehicle sales growth is a fundamental pillar in Tesla’s narrative. Musk himself has convinced many of his devoted retail investors that selling 20 million cars annually—10 times the current capability—is a realistic target by the end of this decade. While small shareholders still believe Musk, Wall Street is starting to lose faith. Analysts expect annual Tesla sales this year to increase to 2.17 million, a rate of only 20% and practically tepid when matched against Musk’s own 50% aspirations. This estimate importantly comes despite the $7,500 federal tax credit for certain EV models now being applied at the point of sale since the start of January, which should act as an important catalyst for demand. Musk claimed he had to slash prices on his cars last year because consumers simply didn’t have the spare cash to afford to wait for reimbursement by the U.S. government. Management at Tesla recently admitted it is entering a period of slower growth. Much will hinge on the success of its upcoming $25,000 entry model, which Musk has said is “quite far advanced” in its development. It is difficult to parse what this could mean exactly, but not so much as an official design rendering has been published so far. It would be unprecedented to greenlight a vehicle whose volumes Musk anticipates to reach into the millions annually without testing the public’s reaction first. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}