{
    "title": "Tesla - statistics & facts",
    "date": "1/10/2024",
    "url": "https://www.statista.com/topics/2086/tesla/",
    "text": "Industry Overview Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 100m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: Detailed statistics Tesla's revenue 2008-2023 Detailed statistics Tesla's vehicle sales by quarter YTD Q4 2023 Detailed statistics Tesla's operating margin by quarter 2019-2023 Vehicles & Road Traffic Electric vehicle sales globally by model 2023 Vehicles & Road Traffic Plug-in electric vehicle market share by manufacturer 2023 Passenger Cars Tesla's vehicle production by quarter YTD Q3 2023 Most valuable automotive brands worldwide by brand value 2023 Most valuable brands within the automotive sector worldwide as of 2023, by brand value (in billion U.S. dollars) Plug-in electric light vehicle sales worldwide 2015-2022 Estimated plug-in electric light vehicle sales worldwide from 2015 to 2022 (in million units) Tesla's vehicle production by quarter YTD Q3 2023 Number of Tesla vehicles produced worldwide from 1st quarter 2016 to 3rd quarter 2023 (in units) Tesla's vehicle sales by quarter YTD Q4 2023 Number of Tesla vehicles delivered worldwide from 1st quarter 2016 to 4th quarter 2023 (in 1,000 units) Electric vehicle sales globally by model 2023 Best-selling plug-in electric vehicle models worldwide in 2023 (in 1,000 units) Range of selected electric vehicle models 2022 EV range of selected MY 2022 electric vehicles (in miles) Tesla's revenue 2008-2023 Tesla's revenue from FY 2008 to FY 2023 (in million U.S. dollars) Tesla's net income 2014-2022 Tesla's net income/loss from FY 2014 to FY 2022 (in million U.S. dollars) Tesla - R&D spending 2010-2022 Tesla's research and development expenses from FY 2010 to FY 2022 (in million U.S. dollars) Tesla - SG&A expenditures 2008-2022 Tesla's selling, general and administrative expenses from FY 2008 to FY 2022 (in million U.S. dollars) Tesla's free cash flow by quarter 2019-2023 Tesla's free cash flow from 1st quarter 2019  to 2nd quarter 2023 (in million U.S. dollars) Tesla's operating margin by quarter 2019-2023 Tesla's operating margin from 1st quarter 2019  to 2nd quarter 2023 Tesla's market capitalization 2023 Tesla's market capitalization between March 31, 2020 and 2023 (in billion U.S. dollars) Tesla's revenue by segment 2022 Tesla's revenue between FY 2019 and FY 2022, by segment (in millions U.S. dollars) Tesla's gross margin by segment 2021-2022 Tesla's gross margin from FY 2021 to FY 2022, by key segment Tesla's domestic and international revenue 2018-2022 Tesla's revenue in the United States, China, and other markets from FY 2018 to FY 2022 (in millions U.S. dollars) Tesla: vehicle deliveries by main model and quarter 2023 Tesla vehicles delivered between 1st quarter 2020 and 3rd quarter 2023, by main model (in 1,000 units) Quarterly Tesla supercharger station and connector volume worldwide 2020-2023 Global quarterly volume of available Tesla supercharger stations and connectors between the 4th quarter of 2020 and the 2nd quarter of 2023 Average lifecycle emissions of Tesla Model 3/Y by selected countries and regions 2022 Tesla Model 3/Y average lifecycle emissions for personal use in the United States, Europe, and China in 2022 (in grams of CO₂ equivalent emissions per mile) Volume of raw materials recovered by Tesla for recycling  2021-2022 Total amount of recovered raw materials for recycling by Tesla between 2021 and 2022 by raw material (in metric tons) Tesla's scope 1 emissions in 2021-2022, by sector Scope 1 carbon emissions of Tesla from 2021 to 2022, by sector (in metric tons of CO₂ equivalent) Scope 2 emissions of Tesla by sector 2021-2022 Amount of Scope 2 carbon emissions of Tesla from 2021 to 2022, by sector (in metric tons of CO₂ equivalent) Scope 3 emissions of Tesla by category in 2022 Amount of Scope 3 emissions of Tesla in 2022, by category (in tons of CO₂ equivalent) Waste diverted from disposal by Tesla in global manufacturing by category 2021-2022 Tesla's waste diverted from disposal in global manufacturing from 2021 to 2022, by category (in tons) Waste diverted to disposal by Tesla in global manufacturing by category 2021-2022 Tesla's waste diverted to disposal in global manufacturing from 2021 to 2022, by category (in tons) Tesla's total freshwater withdrawal for manufacturing 2020-2022 Overall amount of freshwater withdrawal for manufacturing by Tesla  from 2020 to 2022 (in million cubic meters) Plug-in electric vehicle sales worldwide by brand 2023 Estimated plug-in electric vehicle sales worldwide in 2023, by brand (in units) Plug-in electric vehicle market share by manufacturer 2023 Global plug-in electric vehicle market share in 2023, by main manufacturer BYD Group: revenue 2010-2022 Revenue of BYD Group from 2010 to 2022 (in billion yuan) BYD Group's total vehicle sales 2019-2022, by type Total vehicle sales volume of BYD Group from FY 2019 to FY 2022, by type Volkswagen Group's sales revenue 2006-2023 Volkswagen Group's sales revenue from FY 2006 to FY 2023 (in billion euros) Volkswagen Group BEV deliveries by brand 2022-2023 Deliveries of battery electric vehicles by the Volkswagen Group between 2022 and 2023, by brand General Motors Company: revenue 2013-2023 General Motors Company's sales and revenue streams between FY 2013 and FY 2023 (in billion U.S. dollars) Chevy Bolt EV sales in the United States - 2017-2022 Number of Chevrolet Bolt electric vehicle sales in the U.S. between 2017 and 2022 (in units) Global revenue of BMW Group 2007-2023 Global revenue of BMW Group from FY 2007 to FY 2023 (in million euros) BMW i series: electric car deliveries 2014-2023 BMW Group's global BMW i series vehicle deliveries from FY 2014 to FY 2023 (in units) Automotive manufacturers' estimated market share in the U.S. 2023 Estimated U.S. market share held by selected automotive manufacturers in 2023 Tesla's U.S. market share - December 2021 Tesla's estimated U.S. market share from January to December 2021 Best-selling battery-electric cars in the United States 2023 Best-selling battery-electric cars in the United States in 2023, based on new registrations (in units) Number of electric vehicle fast charging stations in the U.S. by connector 2023 Number of electric vehicle fast charging stations in the United States as of June 2023, by connector type The most important key figures provide you with a compact summary of the topic of \"Tesla\" and take you straight to the corresponding statistics. Most valuable automotive brands worldwide by brand value 2023 Global brands with the highest brand value gains 2022 Tesla - R&D spending 2010-2022 Tesla - SG&A expenditures 2008-2022 Tesla's revenue by segment 2022 Tesla's domestic and international revenue 2018-2022 Tesla's gross margin by segment 2021-2022 Tesla's energy generation and storage revenue 2015-2023 Plug-in electric light vehicle sales worldwide 2015-2022 Plug-in electric vehicle sales worldwide by brand 2023 Global electric vehicle revenue forecast 2016-2028 Electric vehicles - battery range of select models in U.S. 2023 Mon - Fri, 9am - 6pm (EST) Mon - Fri, 9am - 5pm (SGT) Mon - Fri, 10:00am - 6:00pm (JST) Mon - Fri, 9:30am - 5pm (GMT) Mon - Fri, 9am - 6pm (EST) "
}