{
    "title": "Tesla's AWS Is Its Megapack Business (NASDAQ:TSLA)",
    "date": "1/11/2024",
    "url": "https://seekingalpha.com/article/4662279-tesla-aws-its-megapack-business",
    "text": "MariusLtu/iStock Editorial via Getty Images MariusLtu/iStock Editorial via Getty Images This is the second installment in a three part series that illustrates, in my estimation, that Tesla (NASDAQ:TSLA) is one of the most asymmetric long term-opportunities among megacap stocks. I published the first installment and laid the foundation for this installment for you here: With respect to the Amazon (AMZN) analogies I've made, I believe they are valuable for two reasons principally: I do not believe either of these ideas are immediately clear, so, to summarize very briefly, here's a breakdown of the Tesla conglomerate. And, today, we will review what I believe to be Tesla's most promising and, in the future, possibly largest line of business: This is arguably the most exciting line of business within the Tesla conglomerate for two reasons: With these ideas as our foundation, let's begin our review of Tesla Energy and its flagship and most promising product: Tesla Megapack. Tesla Energy Tesla Energy At the risk of being somewhat redundant, I believe that it should be overemphasized that Tesla Energy is arguably the most important component of the Tesla thesis today outside of the FSD platform's long term success. I see so many bearish comments on Tesla related to its EV delivery targets, which I myself have some doubts about, but when I ask these bears about Tesla's Energy business, they scantly have an idea of what I'm talking about, much less the precise unit economics associated with Tesla Megapack and the degree to which Tesla could scale these unit economics. I will delineate them for you later on. As I've shared in the past, I believe the two hardest problems for humans to solve presently are: Diginomic Diginomic It has often been acknowledged that the most significant impediment to this future has been utility scale energy storage (as well as making solar roofs and home energy generation/storage economically viable. Their current payback period is roughly 10 years, which is a big ask for most folks. It is more economically sensible to simply pay a utility bill presently and not go into $85k worth of debt, even if energy becomes free post that 10-year payback period). Utility-scale energy storage has vexed the industry for the last two decades; however, as of today, Tesla has fielded a commercially viable, profitable, utility-scale energy storage solution in its Megapack product/platform. Without much fanfare, Tesla has advanced the alternative energy industry substantially in bringing this product to life globally. While not perfect, it has seen incredible adoption, and, importantly, it's a very profitable product, as the chart below demonstrates. Further, it does not need to be perfect. It can evolve and become even more perfected over time, but it needs to be commercially viable on a basic level. Early adopters will help to perfect the product over time by providing financial resources via their purchases, just as they have in purchasing Telsa electric vehicles over the last decade or so. Memos By Heller House Memos By Heller House  Regarding energy storage, we deployed 4 gigawatt hours of energy of storage products in Q3. And as this business grows, the energy division is becoming our highest margin business. Energy and service now contribute over $0.5 billion to quarterly [gross] profit. Elon Musk, CEO, Tesla Q3 2023 Earnings Call Before we continue, to give you an idea of what we're discussing here, here are a couple examples: Tesla Megapack on XTesla Megapack on X Tesla Megapack on X Tesla Megapack on X As you can see, Megapack is the utility-scale energy storage system for which the world has been waiting. The product is, in a sense, the missing link in the alternative energy future, and I believe that Tesla Megapack is just getting started (note that this is a belief and not a guarantee, though one I believe strongly because I see the reality that grid demand will expand substantially as EV adoption continues, which I noted elsewhere in this review of Tesla Megapack). Today, Tesla deploys about 4 GWh of storage per quarter at an annualized run rate of 16 GWh; however, the company has repeated consistently that it plans to deploy 1k+ GWh in annual energy storage by 2030.  Martin Viecha: Thank you. And the last investor question is, with near-infinite global demand for energy storage. Elon Musk: Yes. Martin Viecha: Where will Tesla build the next Megapack factories? How many are needed on each continent? Elon Musk: It's a good question. It's not something we -- I think we'll provide an update about that in the future, but it is something we're thinking about very carefully. I really kind of like what is the fastest path to 1,000-gigawatt-hours a year of production. And you'll see announcements come out later this year and next, that answer that question. Elon Musk, CEO, Tesla Q4 2022 Earnings Call Tesla Q3 2023 Investor Presentation Tesla Q3 2023 Investor Presentation Tesla Q3 2023 Investor Presentation Tesla Q3 2023 Investor Presentation After a substantial amount of analysis of the business, I have distilled its unit economics for you below. The math underlying this business is as follows: And this straightforward math is why Mr. Musk has remarked:  It [Tesla Energy Megapack] could be bigger, but it will certainly be of a similar magnitude. Elon Musk on 2019 Earnings Call Notably, Mr. Musk has also remarked that the business could achieve margins of 60%+ in the past (of course, this is conjecture on his part, and it remains to be seen), so it cannot be perfectly discerned at present as to where the upward trajectory of Tesla Energy's gross margins will reach their asymptotic limit. Memos By Heller House Memos By Heller House The business is very simple, and the above-illustrated math represents the basic unit economics of the business. There's really not much more to say about it, though it certainly need be said, as I see so many folks commenting on the valuation of Tesla without fully appreciating the various lines of business and their possible unit economics. Am I preaching Gospel to you today? Of course not, and I think we have all divined that. But, in the interest of providing to you an explanation as to why Tesla would be valued so richly, this basic math gives you greater context. To close this section, for your edification, we can see Tesla Energy's revenues and cost of goods sold below. Tesla Q3 2023 Investor Presentation Tesla Q3 2023 Investor Presentation As we did for electric vehicles and Tesla's FSD platform, let's now perform a valuation exercise for Tesla Energy whereby we determine, via a sum of the parts valuation exercise, what the entire Tesla business could be worth long term and correspondingly what returns we may generate in purchasing it at about $650B in enterprise value, which is where it trades today. To perform this valuation exercise, I will leverage the data I've shared with you thus far with which I will populate my valuation model's assumptions. Assumptions: TTM 12-month revenue [A] $6.24 billion Potential Free Cash Flow Margin [B] (conservative) 15% Average diluted shares outstanding [C] 3.48 billion Free cash flow per share [D = (A * B) / C] $.27 Free cash flow per share growth rate (results in 922 GWh by yr 10) 50% Terminal growth rate 3% Years of elevated growth 10 Total years to stimulate 100 Discount Rate (Our \"Next Best Alternative\") 9.8% L.A. Stevens Valuation ModelL.A. Stevens Valuation Model L.A. Stevens Valuation Model L.A. Stevens Valuation Model As we can see, Tesla Energy could be worth $449.79/share by 2033, which represents an enterprise value of $1.565T. Today, the entire Tesla conglomerate trades at about $234/share and $710B in enterprise value. And, remember, this is just one line of business among: I believe this growth represents the exciting prospect that Tesla Energy, and specifically its Megapack product, may, indeed, be seen as Tesla's AWS over the long run. The unit economics are there. The global demand is there and will continue to grow, especially as demand on the electrical grid increases massively alongside EV adoption (which is often something that bears or skeptics miss in their calculations of how large this business could become). Today, in the same way that AWS generated about $6B in 2015, Tesla Energy could be ready to scale parabolically in the decade ahead. FourWeekMBA FourWeekMBA The central risk to the Megapack thesis revolves around Tesla's ability to execute. For instance, while Cybertruck is an attractive product, it will take a decade for some folks to receive the orders they are placing today. Another risk would be lower cost producers achieving quality and reliability parity with Tesla's Megapack product. Thank you for reading, and have a great day. This article was written by Louis Stevens offers a proprietary approach to equity (stock) investing. Employing his Four Foundational Investment Frameworks, Louis purchases industry-leading businesses that possess mountainous cash hoards, robust free cash flow generation, long runways for growth, and quality company cultures. Here is a snapshot of the performance of the companies selected using these frameworks: https://www.tipranks.com/experts/bloggers/louis-stevens Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSLA, AMZN either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}