{
    "title": "Tesla's market value drops $80 billion in a day. Here's why",
    "date": "1/26/2024",
    "url": "https://www.indiatoday.in/business/story/tesla-market-value-elon-musk-remarks-slow-growth-market-value-loss-ev-sector-news-2493852-2024-01-26",
    "text": "Listen to Story Tesla faced a steep decline of over 12 per cent in its stock value on Thursday, triggered by CEO Elon Musk's cautionary remarks about a slowdown in sales growth this year. Despite previous price reductions impacting profit margins, Musk disclosed that the company anticipates a further drop in growth. This is attributed to a move towards more affordable next-generation electric vehicles, slated for production at its Texas facility in the latter half of 2025. However, the move is expected to increase a surge in deliveries but presents production challenges due to the incorporation of cutting-edge technologies. The market reacted sharply to Musk's statements, with Tesla suffering its most significant intraday percentage loss in over a year, resulting in an astonishing $80 billion reduction in market value on Thursday alone. This loss contributed to an overall market capitalisation decline of approximately $210 billion for the month. \"The Tesla headlines have essentially gone from bad to worse,\" TD Cowen analysts told Reuters, highlighting disappointment over fourth-quarter revenue and profit falling below expectations, as mentioned in the report. The repercussions extended beyond Tesla, affecting shares of other electric vehicle (EV) makers, including Rivian Automotive Inc, Lucid Group, and Fisker, which saw declines ranging from 4.7 per cent to 8.8 per cent. The electric vehicle industry has been grappling with a demand slowdown for over a year, and Tesla's recent price cuts are expected to increasse challenges faced by startups and established automakers like Ford. \"The problem for Tesla is any significant attempt to boost sales from here on will probably need to be achieved at the cost of further falls in operating margin, due to having to compete with BYD in China, as well as increased competition elsewhere,\" Michael Hewson, chief market analyst at CMC Markets told Reuters. Tesla witnessed downgrades from at least nine brokerages, while seven raised their ratings. As of now, the stock holds an average \"hold\" rating, with a median price target of $225, representing a 23 per cent increase from Thursday's closing price of $182.63. Short sellers targeting Tesla have reaped considerable profits, making it the most lucrative U.S. short trade this year, according to data and analytics firm Ortex. Despite this, Tesla's stock trades at almost 60 times its 12-month forward earnings estimates, surpassing the valuation of other prominent stocks like Apple, Microsoft, and Nvidia. Analysts express concerns that Tesla's increasing resemblance to a traditional auto company, coupled with potential weaknesses in sales growth and profit margins, might challenge its current premium valuation. Published By: Sonu VivekPublished On: Jan 26, 2024Must Watch "
}