{
    "title": "Why Tesla Stock Surged 102% in 2023",
    "date": "1/15/2024",
    "url": "https://www.fool.com/investing/2024/01/15/why-tesla-stock-surged-102-in-2023/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Elon Musk's electric vehicle (EV) company had a phenomenal year. Despite volatility, Tesla (TSLA -2.25%) stock doubled investors' money in 2023 as it surged 101.7%, according to data provided by S&P Global Market Intelligence. It wasn't an easy year to begin with, though. Competition was already on the rise when soaring inflation and interest rates began to hit demand. Tesla made a bold move: It slashed prices of its cars multiple times, and steeply, over several months. The move triggered a price war in the industry and hit Tesla's margins, leading many to question CEO Elon Musk's rationale. Musk, however, was willing to forego margins in the short term for higher volumes and insisted that Tesla is committed to delivering over the long term. It was a calculated move, as Tesla exited the year with strong growth in deliveries despite all the hiccups. In between a much-awaited launch of its Cybertruck helped boost investor sentiment in Tesla stock. Expectations from Tesla are already running high for 2024. Tesla's 2023 production was up 35% year over year to around 1.85 million cars, while its deliveries surged 38% to 1.81 million units. Tesla's lower-priced models, Model 3 and Model Y, accounted for 96% of its total deliveries in the year. Other models, including Model S, Model X, Tesla Semi truck, and Cybertruck made up the rest. Tesla met two important targets in 2023: Delivering 1.8 million cars as it projected earlier in the year, and starting production of its Cybertruck at its Texas gigafactory in late 2023. Tesla delivered its first set of the all-electric pickup truck in late November. During Tesla's third-quarter earnings conference call, Musk reiterated that Cybertruck was Tesla's \"best product ever\" and demand was already \"off the charts,\" with reservations crossing 1 million. Musk, however, is not one to mince words, and he reminded investors how hard it is to scale up production. He assured them that while demand is plentiful, building trucks at a price that people can afford is where the real challenge lies. It could, therefore take a year or more before the Cybertruck starts contributing meaningfully to Tesla's cash flows. Once it does, it should be a big boost to Tesla's cash flows which are already growing steadily. As of the end of the third quarter, Tesla generated $8.9 billion in operating cash flow and $2.3 billion in free cash flow. The EV maker ended the quarter with a hefty cash and equivalents balance of $26 billion. Those are commendable figures, as 2023 was a challenging year on several counts for Tesla. The company is also pumping more and more money every quarter into new products and technology, including Cybertruck, artificial intelligence technologies like self-driving Optimus and Dojo, and its energy business. To be sure, the expected end of federal tax incentives under the Inflation Reduction Act in 2024 for EVs like Model 3 may have brought forward car sales in Tesla's fourth quarter, so it remains to be seen whether the company can maintain its sales momentum in the coming months. On the flip side, the Cybertruck will add to Tesla's top line even as demand for cars like Model Y remains strong. Model Y is even expected to be the top-selling car in the world in 2023 with estimated sales of over 1.2 million, according to online publication CleanTechnica. Above all, if the Federal Reserve cuts interest rates as expected in 2024, one of the biggest growth hurdles for EV makers like Tesla could soon be behind them. You should get a better idea about Tesla's sales and growth plans for 2024 on Jan. 24 when it releases its fourth-quarter earnings report. Neha Chamaria has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}