{
    "title": "'You are a liar': Elon Musk slams Mark Cuban over DEI, says 'shame on \nanyone who uses it' — then mockingly ...",
    "date": "1/18/2024",
    "url": "https://finance.yahoo.com/news/liar-elon-musk-slams-mark-130000294.html",
    "text": "In an explosive turn of events on social media, Tesla CEO Elon Musk publicly slammed “Shark Tank” star Mark Cuban over his views on Diversity, Equity, and Inclusion (DEI) in the workforce. The debate was ignited by a post from billionaire hedge fund manager Bill Ackman on X, which lambasted Harvard's DEI policies. Commercial real estate has outperformed the S&P 500 over 25 years. Here's how to diversify your portfolio without the headache of being a landlord Rich young Americans have lost confidence in the stock market — and are betting on these 3 assets instead. Get in now for strong long-term tailwinds Take control of your finances in 2024: 5 money moves to start the new year off strong Musk, echoing Ackman's sentiments, shared the essay and added, “DEI is just another word for racism. Shame on anyone who uses it.” Cuban, who recently sold a majority interest in the Dallas Mavericks but retained operational control of the team, countered Musk's viewpoint with a series of tweets emphasizing the advantages of DEI programs. “Good businesses look where others don't, to find the employees that will put your business in the best possible position to succeed,” Cuban asserted. “By extending our hiring search to include them, we can find people that are more qualified. The loss of DEI-Phobic companies is my gain.” Musk, however, remained skeptical, mockingly asking Cuban, “Cool, so when should we expect to see a short white/Asian women on the Mavs?” Despite his jest, Musk acknowledged that in certain situations, diversity could indeed play a role in the hiring processes of companies. “I do think that if merit for a given job is roughly the same, then the tiebreaker should be diversity (of all kinds),” he replied to Cuban in a separate tweet. The debate between Musk and Cuban escalated on Jan. 8, following a post by X user TheRabbitHole84. The post featured a screenshot of a headline that read, “United Airlines Says It Wants 50% Of Pilots Trained In Next Decade To Be Women Or People Of Color.” Accompanying this headline was a quote attributed to Cuban: “DEI does not mean you don’t hire on merit. Of course you hire based on merit.” Musk responded critically, stating, “The airline industry can’t find enough qualified pilots even without insane DEI requirements!” Cuban came to the defense of United Airlines, suggesting that the targets applied to the aviation academy and not the airline itself. Read more: Retire richer — why people who work with a financial advisor retire with an extra $1.3 million “This is a training school. Once they graduate, it’s a multi year process to have an OPPORTUNITY to pilot for United,” Cuban explained. “BTW, looks like multiple layers of merit based evaluations before they can fly for United…” However, Musk remained dismissive of Cuban’s explanation, bluntly replying, “You are a liar.” This tense exchange highlights the polarized opinions on DEI within the business community. On one side, there are those who, like Musk, view DEI initiatives as potentially counterproductive or even discriminatory, questioning their efficacy and alignment with merit-based principles. On the other side, figures like Cuban argue that DEI is crucial for tapping into a diverse talent pool and can significantly benefit business operations and make a company more competitive. In the Fall 2023 Fortune/Deloitte CEO Survey, the majority of leaders said that DEI is built into their strategic priorities (65%) and that their Board expects regular updates on DEI progress (58%). However, news reports point to roles in the area being cut. This ongoing debate underscores the complexities and challenges in finding an approach to DEI that steers clear of tokenism and performative solidarity and aligns with both ethical values and business objectives. This Pennsylvania trio bought a $100K abandoned school and turned it into a 31-unit apartment building — how to invest in real estate without all the heavy lifting Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2024 The US dollar has lost 87% of its purchasing power since 1971: Learn how to diversify your portfolio by investing in the world’s most popular precious metal This article provides information only and should not be construed as advice. It is provided without warranty of any kind. "
}