{
    "title": "Tesla could be staring down a year of ‘growing pains,’ analyst cautions",
    "date": "1/17/2024",
    "url": "https://www.marketwatch.com/story/tesla-could-be-staring-down-a-year-of-growing-pains-analyst-cautions-4c6c5fde",
    "text": "Tesla Inc. is about to offer investors some hints of what’s to come, and one analyst thinks Wall Street should brace for “growing pains.” Wells Fargo analyst Colin Langan expects about 13% growth in Tesla \n        TSLA,\n        -2.25%\n       deliveries next year, below the company’s 50% long-term target. The year already hasn’t gotten off to a great start for the electric-vehicle company, which has cut prices in China and paused production in Germany. “There are also macroeconomic headwinds around elevated interest rates& flattening EV adoption,” Langan wrote in a Tuesday note to clients. “Additionally, there are signs of moderating growth in all three key regions.” Tesla is expected to share more about the landscape, and its outlook for the year, when it reports earnings next Wednesday afternoon. While Langan expressed caution about automotive earnings in general for the latest quarter, Tesla “screens the most at risk,” in his view. Read: Nio’s stock tanks toward a record-tying loss streak as Tesla price cuts weigh Wall Street will be focused on Tesla’s profit picture as well, and Langan predicts that the effect of price cuts outweighed the impact of higher volumes in that latest quarter. He models a 15.4% gross margin for the period, which he said is below the 17% consensus view on VisibleAlpha. FactSet lists a 16.7% consensus estimate. Langan is interested to see how higher leasing rates in the U.S. will affect profits, “as leases would qualify for IRA 45W credits,” or those related to the Inflation Reduction Act. “Profits on leased vehicles are realized over the lease life, rather than up front like a normal sale,” he added. Don’t miss: Fisker loses its biggest bull as EV maker’s stock breaks the buck Langan cut his price target on Tesla’s stock to $223 from $250, with the new target reflecting his expectations for lower long-term growth. Tesla shares are off 2.5% in afternoon trading Wednesday.  Warren Buffett now owns about 30% of Liberty SiriusXM’s outstanding shares. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}