{
    "title": "Tesla Cybertruck to be added to Boring Company’s Vegas Loop",
    "date": "1/9/2024",
    "url": "https://www.reviewjournal.com/local/traffic/tesla-cybertruck-to-be-added-to-boring-companys-vegas-loop-2978941/",
    "text": "Tesla Cybertrucks will soon be moving passengers through the Boring Company’s Vegas Loop tunnel system. Tesla Cybertrucks will soon be moving passengers through The Boring Company’s Vegas Loop tunnel system. Boring Co. posted pictures of a Cybertruck in the Las Vegas Convention Center Loop to its X account in late December with no context, leaving many to wonder if it would be incorporated to the system. Las Vegas Convention and Visitors Authority President and CEO Steve Hill confirmed Tuesday that conventiongoers will soon be able to hail a ride in a Cybertruck. “They’re going to use that truck in the system,” Hill told the Las Vegas Review-Journal. “It’s fun, but we think it’s got some real application. It’s a really useful vehicle, with the bed of a pickup truck being useful to move things around.” The usefulness Hill alluded to includes the truck being able to tow up to 11,000 pounds, having a 6-foot truck bed with a 2,500-pound payload capacity and 67 cubic feet of lockable storage space. On top of that it would create additional entertainment value to a passenger’s ride through the loop, he noted. Although he didn’t have an exact date to when a Cybertruck would be available for use in the system, Hill thinks that will occur in the near term. “It has to be approved as a new vehicle in the system by the county and that hasn’t happened yet,” Hill said. “But I don’t anticipate that it would be long, since it’s an approved vehicle on the roads. But they have to go through that process to make it available in the system.” The Vegas Loop is operational between three expo halls at the convention center and to one offshoot station at Resorts World. Future plans call for expanding the system throughout the resort corridor and downtown Las Vegas with 68 miles of total tunnels and 93 stations. Contact Mick Akers at makers@reviewjournal.com or 702-387-2920. Follow @mickakers on X. Nevada State Police said a 45-year-old motorcyclist died Tuesday in a crash in the northwest Las Vegas Valley. Two of the larger ongoing road projects affecting traffic around the resort corridor will see another round of road and lane closures in the coming weeks. The crash happened just after midnight, not far from the Rampart casino. The fatal crash occurred between Goodsprings and Interstate 15, according to the Nevada Highway Patrol. With transportation being the biggest issue tied to the inaugural Las Vegas Grand Prix, the Board of Clark County Commissioners is asking Formula 1 to provide their 2024 plan by May 1. The crash occurred at East Charleston Boulevard east of South 10th Street, according to police. The Nevada Highway Patrol is investigating a crash involving a semi-truck and a car that left a woman and two children dead northeast of the Las Vegas Valley. Members of Amalgamated Transit Union Local 1637 voted with 363 members voting yes and 153 voting no to OK a contract with Transdev. A single motorcyclist went off the road for unknown reasons at U.S. 95 and Kyle Canyon Road, the Nevada State Police said. One person was killed and several were injured when a Regional Transportation Commission bus was struck by a sedan in North Las Vegas. Las Vegas News Raiders News Las Vegas Sphere Oakland A's Move Las Vegas Casinos Las Vegas Crime Las Vegas Shows Sports Betting F1 Las Vegas Las Vegas Restaurants Lake Mead Las Vegas Weather Copyright © 2019 Las Vegas Review-Journal, Inc. | Privacy Policy | Terms of Service Powered by WordPress.com VIP "
}