{
    "title": "BYD is a 'Tesla killer'",
    "date": "2/13/2024",
    "url": "https://theweek.com/business/elon-musk-china-tesla-killer-byd-electric-vehicles",
    "text": "SUBSCRIBE & SAVE Less than $3 per week BYD is now the world's biggest seller of electric vehicles They're calling it the \"Tesla killer.\" A Chinese company, BYD, last year overtook Tesla as the world's leading seller of fully electric cars — and is now poised to grow even more, The New York Times said, \"building assembly lines in Brazil, Hungary, Thailand and Uzbekistan\" and expanding exports to Europe. Just a few years ago, BYD was merely a battery manufacturer. Now it's an automotive powerhouse. And that's gotten the attention of Tesla CEO Elon Musk. \"Frankly, I think if there are not trade barriers established,\" he said in January, \"they will pretty much demolish most other companies in the world.\" Musk didn't always see BYD as a threat, CNBC said. \"Have you seen their car?\" he said in 2011. \"I don't think it's particularly attractive, the technology is not very strong.\" BYD launched its first car in 2008 — the same year that Warren Buffet's Berkshire Hathaway made a $230 million investment in the company. Buffet's cash \"gave a boost to BYD's electric car ambitions.\" The company has also received a huge assist from \"the Chinese government's huge support of the country's EV sector.\" BYD received $4.3 billion in state subsidies between 2015 and 2020. Escape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives. From our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox. From our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox. How has BYD become so successful? The cars are cheap, Fortune said. \"No one can match BYD on price. Period,\" said one expert. The company's cars are \"not a common sight\" on American roads. But that's probably just \"a matter of time.\" \"The significance of the rise in the Chinese auto industry as part and parcel of the energy transition is hard to understate,\" Justin Worland said at Time. It's not just Tesla that is challenged. As electric vehicles become even more popular, Chinese companies like BYD will challenge the dominance of Western auto companies. \"We see the Chinese as the main competitor, not GM or Toyota,\" Ford CEO Jim Farley said last year. And it's not just cars. Chinese companies have a head start on American companies in \"a range of clean energy technologies, from solar panels to lithium-ion batteries.\" One undeveloped market for BYD and other Chinese automakers: Europe. \"Transportation bottlenecks have held them back,\" Nikkei Asia said. Established giants like Toyota have giant transport ships that can carry thousands of cars at a time to Europe, but Chinese EV makers have had to secure space on shipping lines. No longer. BYD just launched the BYD Explorer, a ship that can carry up to 5,000 EVs in a single voyage. That's a \"pioneering move\" that should open the continent to massive new sales. But are the cars any good? One expert pronounced BYD's EVs as \"good, rather than great,\" said The Guardian. Good might be good enough, though. In the U.K., analysts expect that \"one in three EVs will originate from China by 2030.\" BYD may face one significant obstacle to its continued growth. The Biden administration is considering tariffs and other restrictions on Chinese \"smart car\" imports \"to address growing US concerns about data security,\" Fortune said. EVs, after all, \"collect vast amounts of information about their drivers and surroundings.\" That's a big concern amid growing tensions between the U.S. and China. But BYD brings another advantage to its competition with Tesla: Home-field advantage in the world's second-most-populous country. \"We often lose sight of the fact that the Chinese economy represents 1.4 billion people,\" Citadel CEO Ken Griffin said at a recent conference. Watching the company overtake Tesla was \"heartbreaking,\" Griffin said. \"We've got a real competitor in China,\" he said. \"And Elon's right, the West has to grapple with the issue.\" Musk's counter-punch? A cheaper car. Tesla plans to begin production on a new lower-cost EV — code-named \"Redwood\" — starting in 2025, Reuters said. The entry-level vehicle is expected to be priced around $25,000, which should allow it to compete with \"inexpensive EVs, such as those made by China's BYD.\" We'll see if that happens, though: \"Tesla has a track record of missing its targets for launches and pricing.\" A free daily email with the biggest news stories of the day – and the best features from TheWeek.com Joel Mathis is a freelance writer who has spent nine years as a syndicated columnist, co-writing the RedBlueAmerica column as the liberal half of a point-counterpoint duo. His work also regularly appears in National Geographic, The Kansas City Star and Heatmap News. His awards include best online commentary at the Online News Association and (twice) at the City and Regional Magazine Association. Today's Newspapers\nA roundup of the headlines from the US front pages By The Week Staff\n\nPublished 29 March 24 Talking Point\nNew versions of the Easter favourite have sparked controversy but sales are soaring By Adrienne Wyper, The Week UK\n\nPublished 29 March 24 Why everyone's talking about\nNike's redesign of the St George's Cross on the collar of the English national team's shirt has caused controversy By The Week UK\n\nPublished 29 March 24 Under the Radar\nBut questions remain as to whether they can overtake battery-powered electric cars By Justin Klawans, The Week US\n\nPublished 12 March 24 Talking Points\nThe Biden administration investigates Chinese electric cars as a potential economic and national security threat By Harold Maass, The Week US\n\nPublished 4 March 24 Talking Point\nBar closures and Gen Z teetotallers threaten 'extinction' for 'messy nights on the town' By Chas Newkey-Burden, The Week UK\n\nPublished 4 March 24 Talking Points\nKey GOP impeachment inquiry witness Alexander Smirnov says Russian intelligence fed him lies By Harold Maass, The Week US\n\nPublished 26 February 24 The Explainer\nAnger over soccer star Lionel Messi's failure to play in an exhibition game has escalated into a diplomatic spat By Harold Maass, The Week US\n\nPublished 20 February 24 Talking Point\nThe country was overtaken by Germany after unexpectedly entering a recession By Justin Klawans, The Week US\n\nPublished 15 February 24 Under the Radar\nAs economists predict a 'soft landing' after recent crises, is the global economy now 'oblivious to the new world disorder'? By Elliott Goat, The Week UK\n\nPublished 15 February 24 Talking Point\nThe central bank could make interest rate cuts during a campaign focused on the economy By Harold Maass, The Week US\n\nPublished 5 February 24 The Week is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}