{
    "title": "How Parag Agrawal and handle tracking Musk's private jet led to Twitter \ntakeover",
    "date": "2/11/2024",
    "url": "https://www.livemint.com/companies/news/how-parag-agrawal-and-a-handle-tracking-elon-musks-private-jet-first-led-tesla-chief-towards-twitter-takeover-11707643257272.html",
    "text": "Former Twitter CEO Parag Agrawal may have set the ball rolling for Elon Musk's eventual takeover in January 2022. Details shared in an upcoming book indicate that the Indian-American software engineer had refused to block a social media handle tracking the Tesla and SpaceX chief's movements two years ago. This in turn led Musk to purchase Twitter stock and eventually the company as a whole. One of his first acts following the takeover was to fire Agrawal. “Musk was already peeved with Agrawal, with whom he’d had a terse text exchange weeks earlier after Agrawal chastised Musk for some of his tweets. Musk had also unsuccessfully petitioned Agrawal to remove a Twitter account that was tracking his private plane; the billionaire started buying Twitter shares shortly after Agrawal denied his request,\" reads an excerpt from Battle for the Bird. The book by Bloomberg’s Kurt Wagner is set to be released on February 20. According to the Simon and Schuster listing page, the book offers an \"expertly reported investigation into Twitter’s messy corporate history—including Elon Musk’s takeover in 2022, its outsized cultural impact, and its significant role in shaping how the world gets its news.\" The SpaceX CEO had reportedly reached out to Agrawal to call for curbs against ElonJet – a handle run by American programmer and student Jack Sweeney. The now banned Twitter account had kept careful record of Musk's carbon footprint and boasted more than 5.3 lakh followers in its heyday. News reports from early 2022 indicate that the billionaire businessman had even offered to pay Sweeney $5,000 to curtail his endeavours. The University of Florida student had countered with a request for $50,000 or an internship in one of Musk's companies. The matter was eventually dropped with Musk ultimately deciding that it did not “feel right\" to pay and close the account. An irate Musk however blocked Sweeney’s personal Twitter account as the interaction gained media exposure. ElonJet was banned nearly a year later after a stalker reportedly followed a car carrying two year old X Æ A-12 under the assumption that Musk was inside. The businessman had taken to his newly acquired social media platform to announce that legal action was being taken “against Sweeney and organizations who supported harm to my family\". It is pertinent to note that Sweeney is once again back in the headlines in February 2024 — this time for angering Taylor Swift. The award winning musician has threatened to take legal action against the student for engaging in “stalking and harassing behavior\" amid his continued tracking of her jet activity. Battle for the Bird contends that Agrawal's refusal prompted Musk to purchase Twitter stock. This in turn brought him into contact with co-founder Jack Dorsey and eventually prompted him to pursue a spot on the company’s board of directors. When this was thwarted, Musk made efforts to purchase Twitter outright with Dorsey's blessings. The $44 million acquisition was eventually completed in October 2022. CEO Parag Agrawal was fired days later with Musk telling biographer Walter Isaacson that the Indian-American techie was not the \"fire-breathing dragon\" Twitter needed. “He's a really nice guy. What Twitter needs is a fire-breathing dragon and Parag is not that,\" he had said after meeting with Agrawal in March 2022. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}