{
    "title": "Elon Musk proposes relocation of Tesla's incorporation to Texas, awaits \nshareholder vote",
    "date": "2/1/2024",
    "url": "https://www.cnbctv18.com/business/companies/elon-musk-proposes-relocation-of-teslas-incorporation-to-texas-awaits-shareholder-vote-18950601.htm",
    "text": "Tesla will hold a shareholder vote to transfer its state of incorporation to Texas from Delaware, CEO Elon Musk said on Thursday, days after a judge invalidated his $56 billion pay package at the electric vehicle (EV) maker. On Tuesday, Delaware judge Kathaleen McCormick called the 2018 share-based pay package, the largest in corporate America, \"an unfathomable sum\" that was unfair to shareholders and found it was negotiated by directors who appeared beholden to Musk. \"Never incorporate your company in the state of Delaware,\" Musk posted on social media X shortly after the ruling and also started a poll asking if Tesla should now incorporate in Texas. More than 87% of the over 1.1 million votes cast were in favor of the shift. \"The public vote is unequivocally in favor of Texas! Tesla will move immediately to hold a shareholder vote to transfer state of incorporation to Texas,\" Musk said in his latest post on X, formerly known as Twitter. Musk has more than a small interest in Texas. He shifted Tesla's corporate headquarters from Palo Alto, California to Austin, Texas in 2021 after criticizing California's regulations and taxes, and also clashing with health officials at the start of the COVID-19 pandemic over reopening a factory in Fremont. One of the EV maker's gigafactories is in Texas, where it is also planning an over $750 million expansion. It is also building a lithium refinery in the state, aiming to produce enough for about 1 million EVs by 2025. Musk's other companies, like SpaceX and The Boring Company, also have operations in Texas. DELAWARE DEALINGS More than 65% of Fortune 500 companies and over half of all U.S. publicly traded companies are incorporated in Delaware, lured by the state's business-friendly legal framework and tax policies, according to Harvard Business Services, a firm offering Delaware business formation services. The pay ruling is not the first time that Musk has suffered a setback in the state. McCormick was the same judge who oversaw Twitter's July 2022 lawsuit against Musk after he tried to back out of his contract to buy the social media platform for $44 billion. The judge rejected his delaying tactics and Musk finally went through with the deal to buy the company that is now known as X. \"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" he said in another post on X after McCormick's ruling on his pay package. Musk has also recently said he would be uncomfortable growing the automaker to be a leader in artificial intelligence (AI) and robotics without having at least 25% voting control of the company, nearly double his current stake. News Live TV Market Popular Categories Trending Now Let's Connect with CNBCTV 18 Network 18 Group : ©TV18 Broadcast Limited. All rights reserved. "
}