{
    "title": "Tesla restarts Berlin Gigafactory production after pause",
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/video/tesla-restarts-berlin-gigafactory-construction-213157489.html",
    "text": "Production at Tesla's (TSLA) Gigafactory in Berlin — dubbed Giga Berlin — will restart on February 12 after halting progress due to Red Sea disruptions. Yahoo Finance Senior Autos Reporter Pras Subramanian outlines the adjustments to Tesla's supply routes in order to get the project back on track, also commenting on the current narrative around CEO Elon Musk's leadership and demands. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. Editor's note: This article was updated to reflect that Tesla restarted production at the Berlin Gigafactory, not construction as was previously written. JULIE HYMAN: Tesla is set to resume operations at its Berlin factory after production was halted due to ongoing trade disruptions in the Red Sea. Yahoo Finance's Pras Subramanian has more. So what's changed here? PRAS SUBRAMANIAN: So it seems like operations are back to normal there in Giga Berlin. A German publication spoke to a plant manager there. And he said, quote, \"The supply chains are intact again. Tesla has the necessary security.\" That \"all necessary production parts are available in sufficient quantities to be able to fully restart.\" So at the end of January or so, they had to shut down production of the Model Y because they didn't have the right parts. They couldn't get through that Red Sea Suez canal area because of the-- the Houthi military strike. So it seems like they've gotten the-- the parts back. They probably have to go around the Cape of Good Hope and other kind of extreme ways to get these parts. But they have enough in sufficient quantity to build these parts. So like I said, it was down since the end of January. The plant was making at peak around 6,000 units a week of Model Y cars. So they'd be lost anything from 10 to 20,000 units for that-- that run, which isn't much considering the fact that Tesla made 1.8 million cars next year. But nonetheless, good news for a company that has seen its stock really get hammered recently for other various pieces of bad news. JOSH LIPTON: Yeah. I meant to ask you about that. Because Dan Ives over at Wedbush, Pras, he put out a note today saying-- and obviously Dan Ives, you know, a big Tesla bull, outperform on the stock. But he was saying, you know-- and he's covered the name for a long time. He just said the Tesla narrative, the Tesla story-- he said in his opinion it's like the most negative he has now seen in years. PRAS SUBRAMANIAN: Yeah. And he had, I think, it was a call for three things need to change. JOSH LIPTON: The board wants to-- yeah. PRAS SUBRAMANIAN: Yeah. a board-- the board-- the board should do right to him. Like, a authorized move to taxes, new comp package, a couple of other things to get the narrative back and to get-- get kind of the investors back on board I think. I mean, a big part of that is-- and he's calling for Musk to get that 25% back in shares. I mean, I don't know if that's going to be the reason that's going to make the stock go up because of the fact that Musk-- Musk has more shares. JOSH LIPTON: But wasn't that-- wasn't that though-- was that, Pras, kind of a reason though we saw things get negative? I mean, yes it was the print and the call and the worries about the EV market. But how much was that? Because Musk then said, listen, you give me 25%, or I pick up my marbles and I go someplace else, my AI, robotics products, I'll go someplace else. I mean, that was part of it, right? That got people nervous. PRAS SUBRAMANIAN: Right. The possibility of maybe not him leaving but taking that piece out and putting it and making it a private kind of-- which he has various private companies outside of Tesla. So the fear was that leaving that AI stuff, the dojo stuff all going. They want to keep that in the company. JOSH LIPTON: Yeah. All right. We'll keep following it. I think we can keep talking about it. PRAS SUBRAMANIAN: Yeah, yeah. JOSH LIPTON: Thank you, Pras. I appreciate it. Related Quotes "
}