{
    "title": "Elon Musk's problems keep piling up as Tesla's value slides by $188B",
    "date": "2/24/2024",
    "url": "https://www.businessinsider.com/elon-musk-tesla-stock-spacex-x-twitter-starlink-russia-ukraine-2024-2",
    "text": "       It's not been the greatest start to the year for Elon Musk. The world's richest person has faced problems at Tesla, SpaceX and X, ranging from a tanking Tesla valuation to an X advertiser exodus. Here's a look at some of the hot potatoes Musk's been dealing with. After a stellar 2023, Tesla shares are down almost 23% since the start of the year as investors fret about China's fragile economy and a potential slowdown in global EV sales. \"I think the market is trying to price in growth rates for next year and might be assuming that slowing EV sales will translate to slowing Tesla sales,\" Seth Goldstein, an equity strategist for Morningstar, said last month. \"Because Tesla is such a high-growth stock, even small revisions downward can have a large impact on its valuation.\" Tesla also lost its crown as the world's biggest EV maker to China's BYD. Shares in BYD have also tumbled by about 12% this year, to be fair. Tesla's stock slide has erased about $188 billion from its valuation this year, according to Business Insider's calculations. The stock closed at just under $192, leaving it worth just over $600 billion at the close of trading Friday. Roth MKM analyst Craig Irwin has deemed Tesla \"egregiously overvalued\" and put a $85 target price on its shares. It's worth noting that the stock is about where it was this time last year. And even though Tesla's value has more than halved since its peak the shares are still up almost 900% over the past five years. Nevertheless the 2024 wipeout has put Tesla's place in the \"Magnificent Seven\" group of high-flying Big Tech stocks at risk. It's now worth considerably less than Warren Buffett's Berkshire Hathaway and pharmaceutical giant Eli Lilly as well as Microsoft, Apple, Nvidia, Alphabet, Amazon, and Meta. Musk's own wealth is closely tied to his 21% stake in Tesla — and his personal fortune has dropped about $21 billion this year as a result of the EV maker's stock-market struggles, per the Bloomberg Billionaires Index. Before you start feeling too sorry for Musk, though, he's still worth $208 billion. Related stories Shareholders have also had to contend with a Wall Street Journal report last month that said that some executives and board members were concerned about Musk's use of substances including LSD, cocaine, and ketamine. He's denied those claims. To add insult to injury, a Delaware judge also ruled against Musk's $55 billion Tesla pay package last month. Musk doesn't get a salary for his work as Tesla's CEO. Instead, his pay is tied to the company's growth. The ruling in Delaware could threaten his title as the world's richest person, given that most of his wealth is tied to his equity in Tesla. Since the ruling, Musk has slammed Delaware as a place to do business and pledged to call a shareholder vote to transfer the EV maker's incorporation to Texas. And one of his other companies, SpaceX, has reportedly filed to relocate its business incorporation to the Lone Star state. Musk has also had to contend with issues of his own making at X, the social media company formerly known as Twitter that's seemingly been in a neverending state of crisis since he took control in October 2022. Advertisers have started to pull away from the platform in response to Musk doubling down on comments widely perceived as antisemitic and then telling big-name sponsors to get lost (in a slightly more blunt fashion) in November. Ad spending dropped 54% to $1.89 billion in 2023, according to data from Insider Intelligence, leaving X struggling to sell slots to promote trending topics during the Super Bowl. The advertisers left on X are sometimes for AI \"undressing\" apps and dubious crypto services, BI previously reported. In what seems like an effort to drum up advertiser interest, Musk this week sent this an X Ads post to his 173 million followers. Snag more customers with X Ads! @SnaggedDomains captured their target audience by experimenting with their X Ads campaigns, increasing traffic by 534% and form submissions by 1245%. Get expert help with X Ads and book a meeting today (US only): https://t.co/rkbH7mKNw2 pic.twitter.com/Lky2bRPhQl Asset manager Fidelity has repeatedly marked down the value of its stake in X since Musk took it over and now thinks the company is worth 71% less than the $44 billion he bought it for, per Axios. However, it did raise the valuation of its X holding by 11% last month, Axios reported. Lastly, Musk's SpaceX has been caught up in a row about Russia's claimed use of its Starlink satellite internet terminals. Ukraine has repeatedly claimed that Russian troops are using Starlink in their territory. Musk previously denied the accusations, but Kyiv said this week it was working with SpaceX to disable Russia's access. SpaceX also had to delay a launch on Tuesday, again delaying its moon-landing efforts. On Thursday, Houston firm Intuitive Machines beat it to the punch when its uncrewed Odysseus lander successfully landed on the lunar surface, becoming the first commercial spacecraft to do so. Read next Jump to "
}