{
    "title": "FSD Beta v12.2.1 is coming pre-installed on new Tesla vehicles with Full \nSelf-Driving transfers",
    "date": "2/22/2024",
    "url": "https://www.teslaoracle.com/2024/02/22/fsd-beta-v12-2-1-is-coming-pre-installed-on-new-tesla-vehicles-with-full-self-driving-transfers/",
    "text": "Tesla offers Cybertruck vinyl wraps in 11 different colors Tesla promotes Model Y on US roads and in YouTube ads, price to increase on April 1st DJ Steve Aoki is amazed by his Tesla Cybertruck Foundation Series Cyberbeast Tesla promotes Model Y on US roads and in YouTube ads, price to increase on April 1st Tesla introduces a two-seat Model Y in France as a commercial utility vehicle Tesla to fix auto wiper issues with an OTA software update soon Tesla Model 3 Ludicrous air suspension, track mode, and more info leaked in a new video Model 3 Highland “Ludicrous” variant found in the Tesla car configurator code, performance specs leaked Ludicrous Tesla Model 3 Highland spotted with design changes in Europe Tesla to fix auto wiper issues with an OTA software update soon Stealth Gray Tesla Model X spotted next to a Midnight Silver Metallic Model 3 for the first time Watch the Unplugged Tesla Model S Plaid handle the Laguna Seca Corkscrew turn like it’s nothing, sets a new record Tesla Model Y, Model 3, and Model S are now eligible for the $2,500 Texas EV grant (TERP) Flight 4 Starship goes through 2nd static fire test, OLM gets repairs at Starbase, more Watch Starship Flight 3 (IFT-3) live stream recording and live updates from the SpaceX Starbase launch site Starship Flight 3 (IFT-3) date falls on SpaceX’s 22nd foundation anniversary, FAA approves the launch Starship Flight 3 NET launch date set to March 14 with a new flight and splashdown trajectory Tesla Robot updates: Elon Musk shares new video of Optimus walk, new 4K photo, predicts 2040 market scope Tesla Optimus humanoid robot will be able to thread a needle in a year, says Elon Musk Tesla shares Optimus robot’s AI progress, Elon Musk pledges to make it safer with convenient switch-off mechanisms Tesla joins World AI Conference in Shanghai with its Autopilot cars and Optimus robot, Chinese car companies are far behind Tesla in AI, says... How Do Autonomous Vehicles Handle Fixed Road Obstructions? New Tesla customers to get FSD Beta v12.3.1 test drives, capable cars to get a one-month free trial in the US, Elon Musk Chuck Cook tests Tesla FSD Beta v12.3 at challenging unprotected left turns (video) Tesla FSD v12.3 gets good first impressions from the beta testers (videos) New Tesla customers to get FSD Beta v12.3.1 test drives, capable cars to get a one-month free trial in the US, Elon Musk Tesla Roadster to get radical design changes, an even better 0-60 time, and shipped next year — Elon Musk Vandals fail to break the Cybertruck glass in California — Elon Musk says it’s the finest in apocalypse defense technology Tesla Model 3 involved in a terrible crash never had Full Self-Driving installed on it — confirms Elon Musk - Tesla (TSLA) started rolling out its most awaited FSD Beta release version 12 (12.2.1) earlier this week. As we reported yesterday, FSD v12.2.1 has improved in many areas and levels compared to the previous version 11. Besides the significant advancement in self-driving tech with the public rollout of FSD Beta v12, Tesla has also made the transition of the software package from old to new vehicles effortless. A Tesla owner shared the story of trading in his 2017 Model S for a new 2024 Tesla Model Y. He had bought the Full Self-Driving package with his Model S 7 years ago. Interestingly, with the Supercharging credits and FSD package, Tesla also pushed the latest FSD Beta v12.2.1 to his new Model Y. The owner shared this information in the FSD Beta Testers group on Facebook. As soon as he returned home, he found out that his new Model Y had the FSD Beta v12.2.1 (firmware version 2023.44.30.20) already installed. Tesla even upgraded his car’s firmware version to the latest version 2023.44.300. Tesla is currently offering free Supercharging credits and FSD Capability package transfers for trade-in vehicles. This offer is valid for new vehicles bought/traded between 3rd February and 31st March 2024. Tesla’s official website states: Customers who take delivery of a new Tesla vehicle between February 3, 2024 and March 31, 2024 may qualify for transferring Full Self-Driving (FSD) capability from their current vehicle to their new vehicle. If you transfer Full Self-Driving capability from your current vehicle to your new vehicle, your current vehicle will only have access to basic Autopilot features. If you would like to have Full Self-Driving capability features on both your current vehicle and your new vehicle, you can simply purchase Full Self-Driving capability for your new vehicle without participating in this offer. Contrary to expectations, Tesla has rolled out the FSD Beta v12.2.1 to a select number of customers till now. According to TeslaFi.com, there are currently only 62 vehicles have the FSD Beta v12.2.1 update installed on them out of 19,466 total data-contributing vehicles. It’s a slightly wider release till now, not a full-fledged wide release. Tesla might release FSD Beta v12 to a larger number of Tesla vehicles after evaluating data from the first limited group. Stay tuned for constant Tesla updates, follow us on: Google News | Flipboard | RSS (Feedly). Save my name, email, and website in this browser for the next time I comment.  The best Tesla, SpaceX, and Elon Musk ventures news on the web. Disclaimer: We are not officially affiliated with Tesla, Inc. in any way or form. © Copyright - Tesla Oracle. All rights reserved. Privacy Policy | Contact "
}