{
    "title": "Elon Musk Opens Up On When Tesla Will Make A Video Game: 'I've Wanted To Do \nThat For A Long Time'",
    "date": "2/18/2024",
    "url": "https://www.tradingview.com/news/benzinga:b41250d29094b:0-elon-musk-opens-up-on-when-tesla-will-make-a-video-game-i-ve-wanted-to-do-that-for-a-long-time/",
    "text": "Tesla Inc. TSLA CEO Elon Musk has expressed his intention to make a video game for fans worldwide but after the company's Full Self-Driving capabilities become safer than \"even supervised FSD.\" What Happened: During the weekend, the tech billionaire shared a post showcasing examples of \"Tesla generative video from last year.\" Tesla generative video from last year pic.twitter.com/s5ZodFigYe In response to his post, an X, formerly Twitter, user said that the automotive and clean energy company should \"make a video game.\" \"You get points for solving engineering problems and you can earn badges,\" the user suggested. See Also: Putin Pal? Elon Musk Fires Back At Critics Accusing Him Of Supporting Russia Musk quickly responded to this request saying, \"I've wanted to do that for a long time.\" He said that while Tesla's real-world simulation and video generation capabilities are unparalleled, the development of a game must wait until they have deployed unsupervised FSD technology that surpasses even supervised FSD in terms of safety. I've wanted to do that for a long time 🙂 Our real-world simulation and video generation is the best in the world, but unfortunately making a game can only come after we release unsupervised FSD that is far safer than even supervised FSD. Last year in November, the Tesla CEO confirmed that the company's FSD version 12 has started rolling out to the employees. The tech mogul has time and again reiterated that Version 12 will operate without the need for driver oversight, saying,  \"Over time, Version 12 (end-to-end neural nets) will far exceed human safety even when unsupervised.\" Why It's Important: In 2020, Musk's Tesla introduced \"Passenger Play\" to some of its vehicles. The feature essentially allowed users to play video games on the infotainment screen while the car was in motion. The following year, the National Highway Traffic Safety Administration or NHTSA, commenced an investigation to evaluate the functionality of this feature. In 2023, the NHTSA closed the investigation saying, \"the removal of Passenger Play from the subject vehicles resolved ongoing concerns.\" It also noted that the agency will take action if a safety-related defect exists. Tesla also added Steam, a leading digital video game distribution service owned by Valve, into its in-car gaming system in 2022. This ability is different from \"Passenger Play\" considering it only allows users to play the game when the vehicles are stationary. For users to use Steam, they need to download the games from the library using WiFi and save them locally in the Tesla model S and X's internal or external drive. Over the years, Musk has gained recognition for his passion for video games, a subject he often speaks about on his social media platform. At the age of 12, the billionaire sold a video game company he had founded for $500, which likely contributed to his profound affinity for video games. Musk has previously praised games like Polytopia, Elden Ring and Diablo IV. In fact, for Elden Ring he earlier said that the game “in its entirety, is the most beautiful art I have ever seen.” Image via Shutterstock Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Elon Musk Targets Mark Zuckerberg Again: ‘Election Integrity At Meta Is Just Their Word For Censorship’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}