{
    "title": "Tesla Has Problems. Could QuantumScape Be a Good Choice for Growth \nInvestors?",
    "date": "2/16/2024",
    "url": "https://www.fool.com/investing/2024/02/16/tesla-has-problems-could-quantumscape-be-a-good-ch/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Renewable energy is one of the cornerstones of sustainable investing. It can be used to unlock power efficiencies in property and transportation. Many car manufacturers have spent the last few years exploring alternatives to traditional combustion-engine vehicles. However, perhaps no other company is more recognized in the electric vehicle (EV) movement than Tesla. Since its initial public offering (IPO) over a decade ago, Tesla stock has returned nearly 12,000% to investors. While this makes it one of the best-performing stocks in history, its current operating picture looks murky. Last month, the company reported earnings for the fourth-quarter and full-year 2023. An uninspiring report, coupled with a hard-to-follow earnings call, led Dan Ives of Wedbush securities to declare the situation at Tesla as a \"train wreck.\" The stock is down over 20% so far in 2024, so growth investors interested in green energy may be looking elsewhere. QuantumScape (QS 1.12%), which is developing a solid-state lithium-metal battery, could represent an alternative to Tesla. However, investors should be careful before ditching a pioneer in EVs for a new kid on the block. Let's understand why. QuantumScape boasts an impressive roster of investors. Venture-capital firm (VC) Kleiner Perkins is one of the major backers. QuantumScape has also attracted the backing of German car manufacturer Volkswagen. The company has been around for over a decade but went public fairly recently -- back in 2020. QuantumScape came to the public markets through a special purpose acquisition company (SPAC), a process that briefly became popularized a few years ago. Image Source: Getty Images Instead of a traditional motor, EVs typically rely on lithium-ion batteries. However, QuantumScape is developing a new spin on this technology. Some of the recurring complaints surrounding EVs is long charge times and concerns around range. According to QuantumScape, solid-state metal batteries can help reduce charge times and upgrade energy retention due to improvements in energy density. On the surface, it might look like QuantumScape is on the verge of a major breakthrough discovery. But before investors become enamored by the potential, there are some important details to uncover. Although QuantumScape has achieved some notable milestones with its partners, the company hasn't generated any revenue. In other words, QuantumScape is still very much in research and development (R&D) mode and has no sales to back up these significant investments. While this isn't necessarily a bad thing, the company's valuation is where reality starts to drift. As of the time of this writing, QuantumScape carried a market cap of $3.8 billion. That's pretty hard to justify for a business that's consistently burning money and not yet generating sales. Moreover, while solid-state batteries represent an interesting alternative to traditional lithium-ion batteries, QuantumScape is far from the only developer of the technology. Both BMW and Ford have partnered with start-up Solid Power, and Toyota has also revealed plans to integrate solid-state batteries into its line of EVs. QuantumScape's technology could very well be disruptive at some point in the future. But for now, I see the company as no more than a long-shot bet on the EV market, in general. The company is going to continue investing heavily for the foreseeable future, and investors don't have a concrete timeline for when or if the operation will scale and commercialize. Meanwhile, competitors could continue garnering support from other car manufacturers, making QuantumScape's ability to differentiate itself all the more challenging. For all QuantumScape's current problems, you may be better suited holding onto Tesla stock or using dollar-cost averaging to scoop up Tesla shares during this sell-off -- as long as it fits your risk profile. To me, QuantumScape represents something else entirely, different, and investors should act with caution before pouring into the stock. Adam Spatacco has positions in Tesla. The Motley Fool has positions in and recommends Tesla and Volkswagen Ag. The Motley Fool recommends Bayerische Motoren Werke Aktiengesellschaft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}