{
    "title": "Tesla owner Elon Musk becomes super hero for Black-owned California bakery \n— heres how",
    "date": "2/27/2024",
    "url": "https://www.thenews.com.pk/latest/1162143-tesla-owner-elon-musk-becomes-super-hero-for-black-owned-california-bakery-heres-how",
    "text": "Elon Musk pledged to “make things right” as the California bakery that had claimed Tesla had neglected to pay for an order worth thousands of dollars said that the unpaid balance had been settled, following media coverage of the event. Five days ago, Voahangy Rasetarinera, the owner of Giving Pies, a Black-owned bakery in San Jose, central California, posted on the cafe's Instagram account that Musk's business Tesla had cancelled an order for 4,000 mini pies, according to The Guardian. In an email to The Guardian on Monday, Rasetarinera confirmed: “Tesla just paid the $2k that I was out of.” This came after Musk responded to the story on X, formerly Twitter, stating: “Just hearing about this. Will make things good with the bakery.” According to KTVU, the event happened after Tesla placed a last-minute order for 2,000 pies at Rasetarinera's bakery on Valentine's Day, costing the little business $6,000. \"Tesla doubled the order to 4,000 pies before ultimately canceling the order without paying,\" Rasetarinera said. In her Instagram post, Rasetarinera said to fulfill the order she had to turn down other Black History Month catering inquiries, purchase additional supplies and prepare her staff for a “demanding production schedule” – for which she was not compensated. “To me, it was clear that Tesla’s corporate culture prioritised convenience over accountability, disregarding the livelihoods of small business owners like myself,” she said. “This experience serves as a stark reminder of the vulnerability faced by small businesses when dealing with larger corporations. Despite our best efforts to uphold our commitments and provide quality service, we are often left at the mercy of decisions made in corporate boardrooms.” Dentist chair selfie exposes drug trafficking network, culprits sentenced Donald Trump's daughter is focusing on her fun life than politics Former president's help comes as there’s “grave concern” that Republican nominee could win Trump is \"insane\" and a \"sociopath\" Saudi education ministry's academic calendar shows that classes will resume from April 15 Attacker still at large following Beckenham train stabbing in London as victim fights for life at hospital Copyright © 2024. The News International, All Rights Reserved | Contact Us | Authors "
}