{
    "title": "Tesla Cybertruck turns into a tank with massive snow tracks",
    "date": "2/23/2024",
    "url": "https://electrek.co/2024/02/23/tesla-cybertruck-turns-into-tank-massive-snow-tracks/",
    "text": "Tesla Cybertruck is often described as a tank, but it now literally comes a lot closer to one with these massive snow tracks. When Elon Musk first talked about the Cybertruck, he described it as an “armored personnel carrier from the future” and a “tank inspired by Blade Runner”. The stainless steel exterior does invoke a tank or armored vehicle. The only thing missing is tracks instead of wheels. A bunch of mechanics fixed that. Dave Sparks, better known as Heavy D Sparks, has unveiled a Cybertruck with massive snow tracks: I was trying to hold off on posting any videos of the CyberTrax until we had the full YouTube video ready to go but I’m impatient and really just wanna share it with you right now, so here ya go….enjoy 😎Huge thanks to the folks at @teslamotors for being so cool and supportive… pic.twitter.com/Bkw9AbShgm The fact that the large snow tracks virtually have the same shape of the Cybertruck gives the vehicle an interesting look: Sparks hasn’t posted the full video, so there’s a lot we don’t know about the Cybertruck with snow tracks yet. Tesla has reportedly helped Sparks with the project. He said: Huge thanks to the folks at Tesla for being so cool and supportive of this project. They have helped us with many tech questions and other random stuff that has really boosted my overall opinion of the company. If he didn't replace the suspension, it's not going to last long extended out like that with all that extra torque People who work on the project have already confirmed that they broke the suspension while testing. It’s not incredibly surprising, considering snow tracks put a completely different kind of pressure on a truck’s suspension. I am particularly interested in the energy consumption of this thing. I know it’s for fun and certainly not for efficiency, but it’s still interesting. If you thought that the Cybertruck towing test results were bad, wait until you see the power consumption of this thing. I would be pleasantly surprised if it can cover more than 50 miles with these tracks. But I have to admit, it does look cool. FTC: We use income earning auto affiliate links. More. Subscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast. Tesla is a transportation and energy company. It… Telsa Cybertruck will be released in 2021 with a… Fred is the Editor in Chief and Main Writer at Electrek. You can send tips on Twitter (DMs open) or via email: fred@9to5mac.com Through Zalkon.com, you can check out Fred’s portfolio and get monthly green stock investment ideas. Get interesting investment ideas by Fred Lambert ChargePoint Home WiFi Enabled Electric Vehicle (EV) Charger "
}