{
    "title": "Tesla & Supercharged Electric Vehicle ETFs in Focus",
    "date": "3/27/2024",
    "url": "https://sg.news.yahoo.com/tesla-supercharged-electric-vehicle-etfs-184506109.html",
    "text": "Tesla’s TSLA stock surged about 33% last week after the company posted strong results and is now up more than 50% this month. CEO Elon Musk was optimistic about the outlook and said the company could produce 2 million cars this year. Earlier this month, the EV giant slashed prices on some of its models and Ford Motor F announced price cuts on its electric Mustang Mach-E yesterday, stepping up price wars in the EV market. Tesla controls about 65% of the US EV market and remains years ahead of competitors, with vastly higher profit margins. EV start-ups like Rivian Automotive RIVN and Lucid Group LCID may not report profits any time soon. Lucid had soared last week on unconfirmed rumors that the company could be acquired by Saudi Arabia Public Investment Fund. Annual EV sales are expected to increase from around 10 million in 2022 to more than 20 million by 2025 and over 60 million by 2035, per Rho Motion. The Inflation Reduction Act and the Infrastructure Investment and Jobs Act aim to boost EV development and adoption through billions of dollars in funding. To learn about the Global X Autonomous & Electric Vehicles ETF DRIV, the iShares Self-Driving EV and Tech ETF IDRV and the KraneShares Electric Vehicles and Future Mobility Index ETF KARS, please watch the short video above. In addition to popular EV stocks, NVIDIA NVDA, Apple AAPL and Microsoft MSFT are among the top holdings in these ETFs. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Ford Motor Company (F) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report NVIDIA Corporation (NVDA) : Free Stock Analysis Report Global X Autonomous & Electric Vehicles ETF (DRIV): ETF Research Reports Tesla, Inc. (TSLA) : Free Stock Analysis Report KraneShares Electric Vehicles and Future Mobility Index ETF (KARS): ETF Research Reports iShares Self-Driving EV and Tech ETF (IDRV): ETF Research Reports Lucid Group, Inc. (LCID) : Free Stock Analysis Report Rivian Automotive, Inc. (RIVN) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" Abby Hensel officially tied the knot in 2021, it has been revealed \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  This food habit is linked to a specific type of dementia. My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. 2024 Subaru Crosstrek Review, Pricing, and Specs Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp.  Devastating glide bombs have been a major threat to Ukraine's forces, and they can only be beaten by shooting down planes before they're released. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. There is a growing understanding across the Western allies that Ukraine is losing the ground war against Russia, and by summer could face defeat.  Russia is pounding front lines with artillery, rocket and drone fire — and at over five times the rate the Ukrainian army can reply.  Volodymyr Zelensky’s troops are exhausted — after sustaining in some sectors a heavier concentration of incoming artillery than at the Somme in 1916, or the Normandy Bocage after D-Day in 1944.  A Russian fighter jet crashed into the sea off the Crimean port of Sevastopol on Thursday, the regional governor has said. The post Lian Hup Heng: Underrated atas cafe-style tarts & cake loaves for $3.80, hidden within a hawker centre appeared first on SETHLUI.com. Nordegren has moved on and built a life that focuses on her six kids  Premier League ball boys and girls have been ordered to stop throwing the ball back to players during matches, amid concerns that the “multi-ball” system is giving home teams an unfair advantage. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}