{
    "title": "No special treatment for Tesla or any other company: Goyal",
    "date": "3/10/2024",
    "url": "https://www.newsbytesapp.com/news/auto/india-is-open-to-all-global-ev-makers-says-government/story",
    "text": "Hi, Logout India's Commerce and Industry Minister, Piyush Goyal said that the nation will welcome all global electric vehicle manufacturers to establish operations in India. \n \nHowever, he also declared that the country will not develop policies specifically to favor the US-based EV giant Tesla. \n \nThis announcement comes after the automaker requested tariff concessions as a prerequisite for building a plant in the country. \n \nGoyal emphasized that India is working on initiatives and engaging with potential investors to create a vibrant EV ecosystem. Tesla requested an initial tariff concession to offset 70% of customs duty for cars priced below $40,000 (about Rs. 33 lakh). \n \nHowever, Goyal stated that the government will not create policies to suit any one company but will instead develop policies that encourage all EV manufacturers to set up shop in India. \n \nHe added, \"Everybody is free to make their demands. But that does not mean that the government will necessarily take a decision (based on) what you demand.\" To attract EV companies, the Indian government has introduced production-linked incentive (PLI) schemes for advanced chemistry cell manufacturing and component making. \n \nThe schemes include an outlay of Rs. 18,100 crore for advanced chemistry cell battery storage and Rs. 26,058 crore for the auto, auto components, and drone industries. \n \nThese incentives aim to encourage investment in the EV sector and promote local production. India's EV market is expected to grow to one crore units in annual sales by 2030, creating five crore direct and indirect jobs. \n \nIndustry estimates show that total EV sales in India stood at around 10 lakh units in 2022. \n \nTata Motors leads the passenger EV market in India with a market share of over 70%. \n \nMahindra is offering some competition to Tata while in the premium segment, there are players like BYD, Kia, Hyundai, BMW and others. "
}