{
    "title": "Tesla Bull Wants Musk's Company To Think About How Apple Convinced Dumb \nPhone Users To Switch To iPhones ...",
    "date": "3/3/2024",
    "url": "https://www.tradingview.com/news/benzinga:8da726bce094b:0-tesla-bull-wants-musk-s-company-to-think-about-how-apple-convinced-dumb-phone-users-to-switch-to-iphones-amid-ev-slowdown-effective-communication/",
    "text": "Electric vehicle adoption has slowed, impacting the top lines of companies. On Saturday, Tesla, Inc. TSLA bull Gary Black shared insights on the strategy to tackle this challenge. What Happened: Black emphasized the responsibility of EV industry leaders like Tesla to spearhead efforts as the industry transitions from early adopters to rational pragmatists. “We've moved from Stage 1, where early adopters buy EVs, to Stage 2, where rational pragmatists need convincing through facts, figures, and analysis,” he said. Black’s remarks were prompted by a Globe and Mail opinion piece discussing the fading “EV hype.” The Future Fund, managed by Black, holds Tesla as its fourth-largest position with a 5.07% weighting in its actively managed Future Funds Active ETF FFND. Contrary to popular belief, Black suggested that it’s not the high monthly interest payments dampening demand. Despite the Federal funds rate standing at a 22-year high of 5.25%-5.50%, EV manufacturers’ management, including Tesla’s Elon Musk, have cited higher interest rates as detrimental to demand. Black disagreed, emphasizing the necessity for “more effective communication.” “Think about how $AAPL convinced users of Blackberry, Motorola and Nokia dumb phones to switch to smart iPhones,” he said. EV industry leaders like $TSLA need to drive this narrative. We've gone from Stage 1 early adopters buying EVs to Stage 2 rational pragmatists who need to be convinced through facts, figures, and analysis why they should go EV. It's not about high monthly interest payments.... https://t.co/3luvbcgkzV See Also: Everything You Need To Know About Tesla Stock Apple’s introduction of the iPhone in 2007 revolutionized the mobile industry, driving competitors out of business through “creative destruction.” By positioning the iPhone as a three-in-one product and emphasizing design appeal, software, and touchscreen technology, Apple enticed customers away from competitors resistant to innovation. Why It’s Important: Tesla fell short of both top and bottom-line expectations for the last two straight quarters. The company is expected to report lackluster first-quarter deliveries next month, driven by weakness across geographies. Tesla’s price-cutting strategy failed to yield significant results, impacting margins and profits. Musk previously hinted at selling Tesla EVs at zero profits, offsetting losses with high-margin full-self-driving (FSD) software. Despite skepticism about FSD’s safety, many view it as a long-term opportunity. Black advocates for advertising to enhance Tesla’s prospects, criticizing price cuts as a short-term solution. He believes Tesla should lead in advertising the benefits of EV ownership and address customer concerns like range anxiety. Price Action: Tesla ended Friday’s session up 0.38% at $202.64, according to Benzinga Pro data. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Tesla’s Quarterly Deliveries At Risk? ‘There Are Massive Challenges With Q1 Sales,’ Says A Numbers Tracker Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}