{
    "title": "Tesla stock hits 2-year low after Musk sells $4 billion worth of shares",
    "date": "3/26/2024",
    "url": "https://ca.movies.yahoo.com/movies/tesla-stock-hits-2-low-183514753.html",
    "text": "By Hyunjoo Jin SAN FRANCISCO (Reuters) -Tesla Inc shares slid to their lowest level in nearly two years on Wednesday after Chief Executive Elon Musk disclosed he sold another $3.95 billion worth of shares in the electric-vehicle maker. Shares ended down 7.2% at $177.59, the lowest level since Nov. 23, 2020. Musk's latest share sale fueled jitters about the fallout of his $44 billion Twitter buy on the world's most valuable automaker, analysts said. The acquisition sparked investor concerns, including whether he would be distracted from running Tesla or divert resources to the social media company. Some investors also feared the possible impact on Tesla's sales and brand, as well as potential pressure on Tesla from countries trying to control online speech. \"He might have needed the money to really finalize the Twitter deal but restructuring the company and righting the ship is going to prove to be more costly than he probably expected,\" OANDA senior market analyst Ed Moya said. \"I think investors are concerned that this might not be the end of his stock sales,\" he added. Tesla shares have fallen nearly 60% since touching a record high on Nov. 4 of last year. Four days after that, Musk started unloading his shares. The latest sale brings the total amount of Tesla stock sold by Musk since last November to about $36 billion - despite his having said earlier that he would sell no more of his shares. Musk \"yet again loses more credibility with investors and his loyalists in a boy who cried wolf moment,\" Wedbush Securities analyst Dan Ives said. Musk, said Ives, needs to end \"Twitter overhang on the Tesla story with his focus back on the golden child Tesla which needs his time more than ever given the soft macro, production/delivery issues in China, and EV competition increasing from all corners of the globe.\" Musk said last month he thinks a recession will last until the spring of 2024 and that \"a recession of sorts\" in China and Europe was weighing on demand for its electric cars. Musk unloaded 19.5 million shares between Friday and Tuesday, according to filings published by the U.S. Securities and Exchange Commission late on Tuesday. Analysts had expected Musk to sell more Tesla shares to finance the $44 billion Twitter deal, but it was not clear whether the sales were related to the Twitter acquisition. Musk last month closed the deal with $13 billion in loans from banks and a $33.5 billion equity commitment, which included $7.1 billion from investors, including Oracle Corp co-founder Larry Ellison and Saudi Prince Alwaleed bin Talal. It is not clear whether all of the equity investors lived up to their equity commitment. Tesla did not respond to a request for comment on the purpose of the share sale. Twitter faces interest payments totaling close to $1.2 billion in the next 12 months on the debt that Musk piled on it. Musk said that Twitter has suffered a \"massive\" revenue drop since he took over, blaming civil rights activists pressuring advertisers. Major advertisers like General Motors have pulled their ads off Twitter following concern that Musk could loosen content moderation rules on the service. The new Twitter owner told advertisers on Wednesday that paid Blue subscription accounts would become more important and prominent. (Reporting by Hyunjoo Jin in San FranciscoEditing by Chris Reese, Matthew Lewis and Aurora Ellis) The middle class has long been considered the backbone of the American economy. But the American middle class is shrinking. The percentage of adults living in middle-income households in the United States fell by more than 10 percentage points over … Continue reading → The post What It Takes to Be Middle Class in America's Largest Cities – 2023 Study appeared first on SmartAsset Blog. Money can't buy you happiness, but what about working with a financial advisor?  Hollie AdamsAccording to London’s Metropolitan Police and social media footage, a pedicab burst into flames directly in front of Buckingham Palace on Saturday, leaving behind only charred, melted remains. Explosion and fire outside Buck Palace! pic.twitter.com/nUWojD8Ji8— Michael Wright (@Michael_HiFi) March 30, 2024 In video of the incident on X, captioned “Explosion and fire outside Buck Palace,” the pedicab can be heard cracking and popping as it burns, emitting billowing clouds of black smok “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by … The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences.  Follow all the action from Stamford Bridge I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. The Blues sit 11th in the Premier League table heading into the match Play this game for 1 minute and see why everyone is addicted. SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x … Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story. Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action. Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset.  ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset. St Michael and All Angels Church in Tirley was \"marooned\" by water in January.  The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics. April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off "
}