{
    "title": "Tesla (NASDAQ:TSLA) Shares Down 1.9% Following Analyst Downgrade",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsla-percent-decline-2024-03-19/",
    "text": "Tesla, Inc. (NASDAQ:TSLA - Get Free Report)'s stock price dropped 1.9% on Tuesday after The Goldman Sachs Group lowered their price target on the stock from $220.00 to $190.00. The Goldman Sachs Group currently has a neutral rating on the stock. Tesla traded as low as $167.42 and last traded at $170.43. Approximately 37,602,368 shares traded hands during trading, a decline of 64% from the average daily volume of 104,466,219 shares. The stock had previously closed at $173.80. Other equities analysts have also issued research reports about the company. Robert W. Baird reissued an \"outperform\" rating and issued a $300.00 target price on shares of Tesla in a research report on Thursday, January 25th. Piper Sandler cut their price target on Tesla from $295.00 to $225.00 and set an \"overweight\" rating for the company in a research note on Monday, February 5th. JPMorgan Chase & Co. cut their price target on Tesla from $135.00 to $130.00 and set an \"underweight\" rating for the company in a research note on Friday, January 26th. Wells Fargo & Company downgraded Tesla from an \"equal weight\" rating to an \"underweight\" rating and cut their price target for the company from $200.00 to $125.00 in a research note on Wednesday, March 13th. Finally, Wedbush restated an \"outperform\" rating and set a $315.00 price target on shares of Tesla in a research note on Wednesday, January 31st. Ten analysts have rated the stock with a sell rating, fourteen have assigned a hold rating and nine have given a buy rating to the stock. According to data from MarketBeat.com, the stock presently has a consensus rating of \"Hold\" and an average target price of $211.93. Get Our Latest Research Report on Tesla In other news, Director Robyn M. Denholm sold 93,705 shares of the company's stock in a transaction that occurred on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total transaction of $16,439,605.20. Following the sale, the director now directly owns 15,000 shares of the company's stock, valued at approximately $2,631,600. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. In related news, Director Robyn M. Denholm sold 93,705 shares of the stock in a transaction on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total transaction of $16,439,605.20. Following the sale, the director now owns 15,000 shares in the company, valued at approximately $2,631,600. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this link. Also, Director Robyn M. Denholm sold 93,706 shares of the stock in a transaction on Wednesday, February 21st. The shares were sold at an average price of $194.73, for a total value of $18,247,369.38. Following the sale, the director now owns 15,000 shares in the company, valued at approximately $2,920,950. The disclosure for this sale can be found here. Insiders sold 198,598 shares of company stock worth $36,952,434 in the last three months. 20.90% of the stock is owned by company insiders. Several hedge funds have recently bought and sold shares of the business. Contravisory Investment Management Inc. bought a new position in shares of Tesla during the 3rd quarter worth $25,000. Wyrmwood Management LLC bought a new stake in Tesla during the fourth quarter valued at about $25,000. Lam Group Inc. bought a new stake in Tesla during the fourth quarter valued at about $25,000. Alpha Paradigm Partners LLC bought a new stake in Tesla during the third quarter valued at about $27,000. Finally, Halpern Financial Inc. boosted its position in Tesla by 1,111.1% during the third quarter. Halpern Financial Inc. now owns 109 shares of the electric vehicle producer's stock valued at $27,000 after purchasing an additional 100 shares in the last quarter. Institutional investors own 41.87% of the company's stock. The business has a 50-day moving average of $193.48 and a two-hundred day moving average of $225.06. The company has a market cap of $545.62 billion, a P/E ratio of 39.75, a P/E/G ratio of 3.68 and a beta of 2.41. The company has a debt-to-equity ratio of 0.05, a current ratio of 1.73 and a quick ratio of 1.25. Tesla (NASDAQ:TSLA - Get Free Report) last released its quarterly earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 EPS for the quarter, missing analysts' consensus estimates of $0.74 by ($0.03). Tesla had a net margin of 15.50% and a return on equity of 16.62%. The business had revenue of $25.17 billion during the quarter, compared to analysts' expectations of $25.64 billion. During the same quarter last year, the business posted $1.07 earnings per share. The company's quarterly revenue was up 3.5% compared to the same quarter last year. On average, sell-side analysts predict that Tesla, Inc. will post 2.45 EPS for the current fiscal year. Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.Featured StoriesFive stocks we like better than TeslaMost active stocks: Dollar volume vs share volumeGrowing Twice as Fast as Tesla, XPeng is a BuyHow to Invest in Blue Chip Stocks4 Stocks Building Long-Term Value for Shareholders Which Wall Street Analysts are the Most Accurate?FedEx Stock Has Analysts Upgrading in Bulk, a Sudden Discount Before you consider Tesla, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list. While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Which stocks are likely to thrive in today's challenging market? Click the link below and we'll send you MarketBeat's list of ten stocks that will drive in any economic environment. If the last year of price cuts and sluggish sales weren’t enough to tip off the market to the fact the EV bubble has burst, Tesla’s NASDAQ: TSLA Q4 results and outlook for 2024 should do it. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}