{
    "title": "Tesla is going to Nevada",
    "date": "3/5/2024",
    "url": "https://www.cnn.com/2014/09/03/news/tesla-nevada-gigafactory/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Tesla Motors might soon announce that Nevada is the site for its massive Gigafactory, after months of jockeying with a number of states. Representatives from Tesla\n            \n                (TSLA), Nevada Governor Brian Sandoval and various legislators will hold a press conference in Carson City, Nevada for a “major economic development announcement” Thursday at 4 p.m. Pacific time. Dow Jones originally reported that the press conference was to announce that Tesla’s Gigafactory would be built in Nevada, citing an unnamed source. Related: Tesla’s future rides on massive battery plant Tesla spokespeople would only confirm that the company’s representatives would attend the press conference, but declined to elaborate further. Representatives from the Nevada governor’s office did not return requests for comment. Parts of whatever deal has been put together might require legislative approval. David Byerman, Nevada’s Secretary of the Senate said the senate staff is on alert in case a deal requires an emergency session for a legislative okay. The state legislature isn’t set to meet until February. “The senate staff is prepared to go into a special session if the governor requests it,” he said. Related: Four cheap Tesla alternatives for electric car buyers Tesla founder and CEO Elon Musk said in July that the company had already broken ground for a potential $4 billion to $5 billion factory in Nevada while keeping its options open for a factory in Texas, New Mexico, Arizona and California . The company wants to build a huge factory in order to make enough lithium-ion batteries to produce a more affordable car called the Model 3. Tesla hopes it will cost between $30,000 to $40,000. The flagship Model S costs nearly $70,000 and Tesla’s upcoming crossover, the Model X, will cost about that much. Panasonic\n            \n                (PCRFF) will partner with Tesla on the Gigafactory. Related: Consumer Reports called the Model S the best car ever, with caveats Tesla’s stock was flat in after-hours trading after falling 1% during the day. Carson City Mayor Bob Crowell said he had been summoned for the press conference as well and wasn’t told why, but he was excited that factory might be coming to his corner of the state. “It’s a big deal for Carson City and it’s a big deal for Northern Nevada,” he said. “It’s a big deal for Nevada, period.” Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}