{
    "title": null,
    "date": "3/9/2024",
    "url": "https://www.livemint.com/companies/people/elon-musks-wealth-plunges-by-40-billion-in-2024-as-tesla-shares-crash-30-ytd-on-poor-sales-11709991313552.html",
    "text": "Elon Musk has lost the position of the world's richest person as the Tesla chief's net worth has tanked by almost $40 billion so far this year, according to Bloomberg Billionaire's Index. Musk has lost the title to Amazon.com founder Jeff Bezos who is now the world's second richest, while Louis Vuitton's Bernard Arnault is currently at the top with a net worth of $201 billion. The decline in Musk's wealth is due to Tesla's declining share price, which is down by 29 per cent this year so far and is down 50 per cent from its 2021 peak. A majority of Musk's wealth comes from his 21 per cent stake in Tesla. The electric vehicle (EV) major reported disappointing sales in Shanghai, China earlier this week and its factory near Berlin halted production after it was hit by an act of sabotage, which has impacted its share prices. The recent setbacks for Musk also include a court order striking down his $55 billion pay package at Tesla. Also Read: Elon Musk's X set to take on YouTube with upcoming TV App, long-form videos Meanwhile, Musk announced that long-form videos will soon be available on smart televisions, after Fortune magazine reported that social network X planned to launch next week a TV app for Amazon and Samsung users. The platform rolled out an early version of video and audio calling for some users last October, after Musk had said he planned to turn it into a super app offering services from messaging to peer-to-peer payments. \"Coming soon,\" Musk said in a brief response on X to a user's posting that the platform's long-form videos could be watched directly on smart TVs. In the push to become a \"video-first platform\", X has been forging partnerships with the former Fox commentator Tucker Carlson and former CNN anchor Don Lemon. The platform, which has struggled to retain advertisers amid controversies ever since Musk bought it in 2022, said last month it would enable advertisers to run video ads next to certain content creators. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}