{
    "title": "Where Is Tesla Stock Actually Headed?",
    "date": "3/24/2024",
    "url": "https://cleantechnica.com/2024/03/24/where-is-tesla-stock-actually-headed/",
    "text": " This is a very tricky and emotional topic. The biggest stock story of the past decade was surely the Tesla (NASDAQ:TSLA) story. It was a matter of dreamers vs. skeptics, with both sides putting in billions of dollars for long periods of time. The dreamers won. The huge shift was in the second half of 2018 when Tesla finally got production of the Model 3 ramped up and turned a profit. I remember one day in the fall of 2018 when a major TSLA short seller wrote a letter explaining that he was completely flipping and going long on TSLA — the letter read like a CleanTechnica article and included four of my own EV sales charts (I was never compensated for their use). The market cap of Tesla grew by more than $1 billion in one day. Many people didn’t believe in Tesla ever making a profit. Once it did, many people didn’t believe its sales would keep growing and profits would keep flowing — the backlog of demand from interested buyers was being satisfied and then sales would collapse. Dreamers, on the other hand, argued that the Tesla Model 3 was so superior that word of mouth would sell the vehicle. Dreamers were right and sales popped for the next few years.  As we all know, in terms of 2023 sales, the Tesla Model Y rose to #1 in the world among all car models. Tesla’s annual sales neared 2 million in 2023. All of that is ridiculously impressive, but stocks are about the future, and that’s the past. There have been a number of concerns bubbling up about Tesla in recent quarters, and there have been a number of different takes about the future of Tesla published in recent days that triggered this article. Also of note, Tesla has been the worst performing stock in the S&P 500 in 2024. “Having been touted as a member of the so-called Magnificent Seven, a handful of stocks responsible for leading the S&P 500 to record highs, the carmaker is now clearly an outlier in the worst way. Despite being the worst performer this year, and the only one forecast to see earnings shrink over the next 12 months, it is the most expensive of the bunch by far.” Here’s a chart Bloomberg created on that topic:  And here’s one on how Tesla compares to other automakers in terms of both its operating margin and its P/E multiple:  Even today, after such a large stock drop, it’s hard to see how TSLA is a good stock to buy. Its P/E multiple is far higher than other automakers’, even the ones that have a better operating margin. Also, automakers all seem to fall within a certain range with regard to P/E multiple, and TSLA isn’t anywhere close to that normal range. Compared to other tech companies, TSLA earnings per share is below the Magnificent 6, yet its P/E multiple is again far above the others’. There are basically three core ways you can make the case for Tesla as a good stock purchase these days: 1) Assume sales are going to grow at a strong rate for years to come, without trimming margins down to a minimal amount — in other words, assume strong growth in profits. 2) Assume that FSD will turn into robotaxi-capable FSD and will make Tesla a fortune. 3) Assume that Tesla’s AI work or other innovations will lead to other commercially successful endeavors and make Tesla a fortune. Naturally, there are people on both sides of each of those assumptions, but betting on Tesla relies on at least one of those coming true. Let’s take a moment to see what’s being said about the company these days and how that relates to the above. From a recent Fortune article: “Tesla Inc. is no longer a red-hot growth stock. CEO Elon Musk has said as much. “But even by that new standard — with growth forecasts on Wall Street sinking rapidly — the grim sales prediction from a key Tesla analyst on Wednesday was still shocking. There’ll be zero growth in sales volumes for the electric-vehicle maker this year, Wells Fargo’s Colin Langan said. And in 2025, it’ll be worse yet: volumes will drop.” Indeed — there’s no real argument that Tesla is not expected to grow a lot in 2024, as Elon Musk has basically said as much, but there’s also a possibility that Tesla’s sales volumes drop. That’s not widely expected, especially since Cybertruck production and sales are expected to ramp up by the end of 2024 going into 2025, but it’s a definite possibility. The Tesla Model Y was the best selling model in the world last year — will it hold that level year after year? It’s anyone’s guess. Returning to that Fortune article: “Tesla’s ability to grow at the furious pace that its expensive valuation promises is no longer a guarantee. The company still trades at a multiple that is significantly higher than other mega-cap high-flyers, yet the pace of expansion in its revenue and profit have slowed markedly since last year.” As Langan summarized it, Tesla is a “growth company with no growth.” Yes, there has been moderate growth in sales volume, but that has been driven by price cuts. “He highlighted that sales volumes rose only 3% in the second half of 2023 from the first half, while prices fell 5%. […] The troubles for Tesla and EVs more broadly started emerging in mid-October, when Musk’s company first warned about a slowdown in demand. But sentiment worsened further in early January after Tesla said its growth will be ‘notably lower’ this year. Other automakers, EV suppliers and even rental-car companies joined in with similarly cautious comments. […] Despite the decline, the stock still trades at around 55 times its forward earnings, compared to the average of about 31 for the Bloomberg Magnificent 7 Price Return Index. ” Ironically, one portfolio manager at Aptus Capital Advisors also noted a shift away from ESG and toward AI. Elon Musk has trashed ESG policies in the past year, even as Tesla has been the top company people think about when they think of environmentally focused or climate focused companies to invest in. Tesla FSD had not improved much for the past couple of years. There’s a new version — 12.3 — which I just got on my Tesla Model 3. Many are saying it’s much better than previous versions, even people who have been similarly unimpressed with those previous versions as I have been, so I’m hopeful about it. That said, I’ve also heard it still has its issues. It doesn’t seem like it’s close to robotaxi ready. But as usual, I am waiting to make any strong judgements on it until I experience it for a while myself. Though, up till now, there have been so many overpromises and missed timelines, and there are such concerns regarding the hardware, that it’s hard to even hope for Tesla robotaxis in this decade. But we’ll see…. Naturally, Elon Musk’s long and shocking dive into side topics, other ventures (most notably, X), US and global politics, and right-wing conspiracy theories has unsettled many investors, Tesla owners, and potential new buyers. Many presume that this has affected Tesla sales and the Tesla stock price. At the same time, few would claim that Tesla would have gotten to the heights it has reached without Elon Musk. He has been a core leader at the company and made many of the decisions that got Tesla to financial profitability and industry-shaking size and relevance. However, a longtime Tesla bull, Ross Gerber, has argued that Tesla stock could rise to new heights if Elon Musk either changed his behavior (highly unlikely at this point) or was replaced by a new and less controversial CEO. “This could turn around very quickly if either Tesla gets a real CEO who’s actually going to help the company, or Elon changes his tune and actually comes back to working at Tesla and promoting the brand in a positive way,” Gerber said. I don’t think the latter is actually the case, and I’m going to return to those three matters at the top to explain why. For a new CEO to get the stock booming again, they would need to convince people that sales will grow at a strong pace again (e.g., 50% a year), that Tesla FSD will be robotaxi ready soon, or that Tesla will lead the way on AI or other big matters. Frankly, I think so many people believe in Elon Musk with regard to the latter options that this faith alone is what’s holding Tesla stock up a lot still. I don’t think many people who are bullish on Tesla right now because of Elon Musk are going to be happy and stay invested if he goes away. Even if it’s a great CEO for AI, will investors (on the whole) be comfortable with the switch and as bullish as they are with Elon Musk running the show? I’m skeptical. With regards to getting Tesla back to 50% growth, well, that’s a tall order, and I again don’t think anyone new would convince investors that everything would turn around. Surely some investors would become more bullish, but many would become more bearish. Kevin Paffrath, also known as Meet Kevin, used to be a very vocal Tesla bull. He has echoed the sentiments of Ross Gerber with regard to Elon Musk’s distractions and recently went short on Tesla rather than long, but he’s not indicating a hope for a turnaround with or without Musk. “I think, it’s unfortunate the situation Tesla is in and I don’t think all of the bad is priced in yet so unfortunately I think it’s going to get a lot worse before it gets better,” said Paffrath. Frankly, I have a hard time seeing Tesla as a growth stock anytime soon. And we have yet to see anything noteworthy about the $25,000 car that is supposed to be around the corner. Tesla Full Self Driving is far too behind its original timeline and expectations, and I’m far too skeptical about the approach, to think that it will revive the stock. As for AI, well, we have to see where Optimus goes, but there’s an itching feeling that this could be FSD all over again. Or it could be huge. But I think the stock market at this point is going to need to see solid proof of progress and likely commercial success with this or any other matter before TSLA goes booming again. We shall see. What are your thoughts? Zach is tryin' to help society help itself one word at a time. He spends most of his time here on CleanTechnica as its director, chief editor, and CEO. Zach is recognized globally as an electric vehicle, solar energy, and energy storage expert. He has presented about cleantech at conferences in India, the UAE, Ukraine, Poland, Germany, the Netherlands, the USA, Canada, and Curaçao.\r\n\r\nZach has long-term investments in Tesla [TSLA], NIO [NIO], Xpeng [XPEV], Ford [F], ChargePoint [CHPT], Amazon [AMZN], Piedmont Lithium [PLL], Lithium Americas [LAC], Albemarle Corporation [ALB], Nouveau Monde Graphite [NMGRF], Talon Metals [TLOFF], Arclight Clean Transition Corp [ACTC], and Starbucks [SBUX]. But he does not offer (explicitly or implicitly) investment advice of any sort. Zachary Shahan has 7324 posts and counting.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\tSee all posts by Zachary Shahan "
}