{
    "title": "'Tesla…Best House On A Bad Block': Analyst Sees Multiple Catalysts For Elon \nMusk's EV Giant Despite Stock Slump",
    "date": "3/16/2024",
    "url": "https://markets.businessinsider.com/news/stocks/tesla%E2%80%A6best-house-on-a-bad-block-analyst-sees-multiple-catalysts-for-elon-musk-s-ev-giant-despite-stock-slump-1033169797",
    "text": "CFRA Research analyst and Tesla Inc (NASDAQ:TSLA) bull Garrett Nelson believes that the current fall in the EV giant’s stock is not surprising given shares more than doubled last year. What Happened: Despite Tesla shares falling about 34% year-to-date, the analyst is optimistic about Tesla and maintains a ‘buy’ rating on the stock. Tesla, Nelson said in an interview with Fox Business on Thursday, has a great balance sheet, is in the process of ramping up Cybertruck production, is expected to unveil their mass-market electric vehicle later this year, and has a new factory coming up in Mexico. “Tesla is a lot different than the company it was three or four years ago,” Nelson said. “There are plenty of catalysts.” While several legacy automakers are pulling back on their EV targets, smaller EV manufacturers such as Fisker are facing a lot of distress, the analyst noted. This, he added, gives Tesla the chance to really grow its market share in the coming years. “We kind of view Tesla as the best house on a bad block in the Western market, you know, looking at North America and Europe, but there is certainly a ton of competition coming from China,” the analyst said.  Analyst Rating: Nelson holds a “buy” rating on Tesla with a price target of $275. The analyst believes the EV giant will become the world’s largest auto manufacturer by the end of this decade, surpassing Japanese automaker Toyota Motor. Price Action: Tesla shares closed 0.66% higher on Friday at $163.57, according to Benzinga Pro. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Morgan Stanley Analyst Increasingly Bullish On Elon Musk's Tesla Optimus Venture As Jeff Bezos, Nvidia, Microsoft Pour $675M In FigureAI Tesla illustration via Shutterstock Indices Commodities Currencies Stocks "
}