{
    "title": "Drivers aren't taking up electric vehicles because they are 'scared of \nchange', boss of 'Europe's Tesla' claim",
    "date": "3/2/2024",
    "url": "https://www.thisismoney.co.uk/money/cars/article-13149409/drivers-electric-vehicles-scared-change-tesla-boss-claims.html",
    "text": "By Sam Lawley Updated:  19:22 GMT, 2 March 2024  517 View  comments  Drivers are shunning electric vehicles (EVs) because they are 'scared of change', according to the boss of European car company Polestar. Thomas Ingenlath, who has been chief executive of the manufacturer since it became a standalone brand in 2017, also urged manufacturers to avoid the 'trap' of reducing their EV output after figures showed electric sales are slowing down. Volvo, who purchased Polestar when it was a racing team taking part in the Scandinavian Touring Car Championship, recently withdraw its support for Mr Ingenlath's company. The brand, often referred to as the 'Tesla of Europe', has since secured an emergency $1billion (£750million) backing from a consortium of 12 banks - which reportedly still leaves the business $350million short of breaking even. The company has been making heavy losses over the past few years, including $1billion and $1.3billion respectively in 2021 and 2022, despite receiving public support from high-profile names, including Leonardo DiCaprio. Drivers are shunning electric vehicles (EVs) because they are 'scared of change', according to the boss of European car company Polestar Thomas Ingenlath (pictured) The brand, often referred to as the 'Tesla of Europe', has since secured an emergency $1billion (£750million) backing from a consortium of 12 banks - which reportedly still leaves the company $350million short of breaking even (pictured: Polestar 2 EV)  'There's an incredible threat and danger if you don't embrace future innovation and believe in that technology – the electric drivetrains, the innovation in battery, the innovation in modern electronics and software,' Mr Ingenlath told The Telegraph.  'If you don't participate in that and think you can wait, and customers are ready for it, it's an incredible trap.' The electric car chief's remarks come amidst dwindling demand for EVs. On Thursday, MailOnline revealed that car makers from Mercedes-Benz to Ford were delaying or scrapping further EVs. Earlier in the week Apple cancelled work on its electric car project dubbed Titan and Aston Martin delayed the launch of its first battery electric vehicle (BEV) until 2026. Mercedes-Benz delayed its electrification goal last week, while Ford has said it is rethinking its EV strategies and Volkswagen delayed launching a forthcoming EV. And in recent months, Audi and General Motors have also reviewed their EV rollouts. Purchases of new electric cars by private buyers fell 25 per cent in a year in January, latest figures from the Society of Motor Manufacturers and Traders (SMMT) revealed. And forecasts showed BEVs will take a market share of 21 per cent this year – down from an estimate of 22 per cent in October and the 23 per cent expected a year ago. Polestar's electric cars are available for between £45,000 and £80,000, making them more expensive than Tesla's vehicles - the US manufacturer's Model 3 sedan (pictured) starts at £40,000 Aston Martin pushed back the release of the battery-powered vehicle from 2025 to 2026. It is still planning to deliver its first plug-in hybrid supercar, the Valhalla (pictured), later this year High interest rates are among the reasons behind a slowdown in demand for usually pricier EVs - which can be as much as £10,000 more expensive than their petrol or diesel equivalents - prompting the industry to cut jobs and reduce production.  The SMMT has called for greater investment in public electric car infrastructure, saying a lack of charging points 'remains the biggest barrier to faster rollout'. Over the last few weeks, shares of traditional car makers have outpaced their electric counterparts, as investors respond to company decisions to prioritise higher-margin, gas-powered models instead of pure battery vehicles. The slowdown in EV demand suggests the transition away from traditional internal combustion engine vehicles will take longer than expected. But German-born Mr Ingenlath added that the lack of manufacturers entering the electric market represented a big opportunity for Polestar. He said: 'It's an incredible opportunity for Polestar that, in that sector of premium performance cars, there is indeed not that much competition coming.' Mercedes-Benz showcases its E400e 4Matic model in Munich in September 2023. Last Thursday, the German car manufacturer delayed its electrification goal by five years Audi said in December that it was reviewing its EV rollout so it does not 'overwhelm the team and the dealerships'. The Q6 e-tron (pictured) has been delayed due to software issues In 2022, the 'Tesla of Europe' was listed on the New York Exchange with a value of around £11.5billion - but the company has since lost 60 per cent of its value having failed to hit its production targets. Polestar had to reduce its annual delivery promise from 155,000 to 60,000 last year. The company's electric cars are available for between £45,000 and £80,000, making them more expensive than Tesla's vehicles - the US manufacturer's Model 3 sedan and Model Y SUV start at about £40,000 and £45,000 respectively. Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence. MORE HEADLINES This is Money is part of the Daily Mail, Mail on Sunday & Metro media group "
}