{
    "title": "Elon Musk loses world's richest person title to Jeff Bezos",
    "date": "3/4/2024",
    "url": "https://www.deccanherald.com/world/elon-musk-loses-worlds-richest-person-title-to-jeff-bezos-2922238",
    "text": "Follow Us By Tom Maloney and Annie Massa For the first time in more than nine months, Elon Musk is no longer the world’s richest person. Musk lost his position atop the Bloomberg Billionaires Index to Jeff Bezos after shares in Tesla Inc. tumbled 7.2 per cent on Monday. Musk now has a net worth of $197.7 billion; Bezos’ fortune is $200.3 billion. It’s the first time that Bezos, 60, the founder of Amazon.com Inc., has topped Bloomberg’s ranking of the richest people since 2021. The wealth gap between Musk, 52, and Bezos, which at one point was as wide as $142 billion, has been shrinking as Amazon and Tesla shares move in opposite directions. While both are among the so-called Magnificent Seven stocks that have propelled US equity markets, Amazon shares have more than doubled since late 2022 and are within striking distance of a record high. Tesla is down about 50 per cent from its 2021 peak. Tesla shares fell on Monday after preliminary data showed shipments from its factory in Shanghai slumped to the lowest in more than a year. Amazon, meanwhile, is coming off its best online sales growth since early in the pandemic. Pay Package Musk’s wealth could take a further hit after a Delaware judge struck down his $55 billion pay package at Tesla, where he’s chief executive. The decision took the side of an investor who’d challenged Musk’s compensation plan, which had been the largest in history. Options that were included in the voided plan are one of Musk’s largest assets, alongside his stakes in Tesla and SpaceX. The Bloomberg index continues to include them in its calculations of his wealth. The vast majority of Bezos’s fortune comes from his 9 per cent stake in Amazon. He’s the online retailer’s largest shareholder, even after unloading 50 million shares worth about $8.5 billion last month. For Bezos, being atop the wealth rankings is a familiar perch. He first overtook Microsoft Inc. co-founder Bill Gates as the world’s richest person in 2017. But a massive rally in Tesla shares left Bezos jockeying with Musk for much of 2021 for the top spot. Late that year he fell way behind, and didn’t regain the No. 1 position until now. Bernard Arnault, 74, the chairman of LVMH Moet Hennessy Louis Vuitton, the world’s largest luxury-goods maker, also ranks among the world’s wealthiest with a net worth of $197.5 billion. #Elections2024 "
}