{
    "title": "Tesla just flashed a sell signal that could spark a 14% decline amid more \nvehicle price cuts",
    "date": "3/23/2024",
    "url": "https://ca.movies.yahoo.com/movies/tesla-just-flashed-sell-signal-005426079.html",
    "text": "Tesla stock just flashed a sell signal that could spark 14% downside, according to Fairlead Strategies' Katie Stockton. \"Tesla is the first of the megacaps to challenge support, with a pending breakdown below its 50-day moving average,\" Stockton said. The technical sell signal comes amid more price cuts for Tesla's Model 3, X, and S vehicles. Tesla stock is on shaky ground after it generated a technical sell signal, according to Fairlead Strategies' founder Katie Stockton. The electric vehicle maker has seen a rapid rise in 2023, soaring as much as 77% in the first few weeks of the year, but now it's giving back some of those gains. According to Stockton, the decline could continue to $160 per share, representing potential downside of 14% from current levels of $185. \"Tesla is the first of the megacaps to challenge support, with a pending breakdown below its 50-day moving average. This is a bearish short-term development, noting the daily MACD is pinched likely to flash a 'sell' signal today, and with next support near $160,\" Stockton said in a Thursday note. The moving-average-convergence-divergence indicator, or MACD, is a trend-following momentum indicator that technical analysts use to show the relationship between two moving averages of a security's price. A signal line is plotted, which can function as a buy and sell signal. Stockton uses MACD to capture momentum and trend across multiple timeframes. The indicator is useful because it's very black and white, generating either a buy, or a sell. The potential decline in Tesla stock comes amid more price cuts from the company, which analysts warned about after its first-quarter delivery update showed a jump in inventory. \"Incremental price cuts likely needed amid inventory build, especially as production at Austin and Berlin ramps [higher],\" Barclay's said earlier this week. Tesla moved ahead with its second price cut of the year in the US on Thursday, dropping its Model 3 and Model Y prices by at least $1,000, while it lowered the price on its Model X and Model S vehicles by about $5,000, according to its website. These price cuts should weaken Tesla's profit margins, which, aside from delivery figures, is what Wall Street is laser focused on. \"The big question will be margins as cutting prices will have an impact on this front although we believe auto gross margins north of 20% remains the key threshold over the coming quarters,\" Wedbush analyst Dan Ives said in a recent note. Investors will gain more insight into Tesla's first quarter results when the report earnings and guidance after the market close on April 19. And Tesla will need to wow investors if it wants to hold onto its year-to-date gains of 50%. Correction: An earlier version of this article incorrectly said that the Model Y's price was cut by about $5,000. It was instead a price cut of about $1,000. The article was updated to reflect this change. Read the original article on Business Insider The middle class has long been considered the backbone of the American economy. But the American middle class is shrinking. The percentage of adults living in middle-income households in the United States fell by more than 10 percentage points over … Continue reading → The post What It Takes to Be Middle Class in America's Largest Cities – 2023 Study appeared first on SmartAsset Blog. Money can't buy you happiness, but what about working with a financial advisor?  Hollie AdamsAccording to London’s Metropolitan Police and social media footage, a pedicab burst into flames directly in front of Buckingham Palace on Saturday, leaving behind only charred, melted remains. Explosion and fire outside Buck Palace! pic.twitter.com/nUWojD8Ji8— Michael Wright (@Michael_HiFi) March 30, 2024 In video of the incident on X, captioned “Explosion and fire outside Buck Palace,” the pedicab can be heard cracking and popping as it burns, emitting billowing clouds of black smok “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by … The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences.  Follow all the action from Stamford Bridge I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. The Blues sit 11th in the Premier League table heading into the match  SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x … In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag  The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story. Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action. Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset.  ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset. St Michael and All Angels Church in Tirley was \"marooned\" by water in January.  The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics. April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off "
}