{
    "title": "Watching PPI, retail sales data, NVIDIA conference, Tesla share price",
    "date": "3/14/2024",
    "url": "https://www.ig.com/en/news-and-trade-ideas/beat-the-street--ppi--retail-sales--tesla--nvidia-240314",
    "text": "We want to clarify that IG International does not have an official Line account at this time. We have not established any official presence on Line messaging platform. Therefore, any accounts claiming to represent IG International on Line are unauthorized and should be considered as fake. CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. \n CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. View more search results A hotter-than-expected producer price reading has dented hopes of the Fed cutting interest rates in the coming months. US consumer spending is cooling, data showed. Tesla slips after UBS cut the EV maker’s price target. Investors eye NVIDIA's AI chip sneak preview in the coming week. (AI Video Summary) In today's edition of \"Beat the street,\" hosted by Angeline Ong, she shares important information for traders before the Wall Street market opens. She says that the volatility index remains steady, but the Producer Price Index (PPI) data shows a slight increase, which traders are closely watching. They believe there may be interest rate cuts in the near future, and this could have an impact on stocks, especially those in the tech industry. IG analyst, Shaun Murison, talks about the Nasdaq 100 forming a triangle pattern, indicating that the overall upward trend will continue. He predicts that there might be a breakout to reach a target of 19,000. However, if the pattern breaks downward, traders will wait for weakness before making any new investments. NVIDIA, a prominent tech company, is in the spotlight due to its upcoming developer conference. People are eagerly anticipating the unveiling of new products and flagship items. NVIDIA's stock has seen significant growth and is on its way to becoming the second most valuable company on Wall Street, surpassing even Apple. In other news, former Treasury Secretary Mnuchin is planning to form an investor group to purchase TikTok. This is because the US House of Representatives passed a bill requiring TikTok's Chinese owner to sell its US assets or face a possible ban. Tesla's is also facing some challenges as UBS has lowered its price target and delivery forecast for the first quarter due to slow demand and competition in China. As a result, Tesla's stock price has been declining since July 2023. On a positive note, Robinhood, a popular trading platform, has reported strong growth in assets under custody for February. This is the second month in a row that assets have exceeded $100 billion, leading to an increase in their market shares. Additionally, oil prices are on the rise after the International Energy Agency revised its demand growth forecasts and reduced projections for non-OPEC supply. Overall, the market is expected to rebound, with minimal changes following the release of the PPI and retail sales data. This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. Go long or short on thousands of international stocks. See more forex live prices See more shares live prices See more indices live prices Prices above are subject to our  website terms and agreements. All share prices are delayed by at least 20 minutes. Prices are indicative only. See more forex live prices See more shares live prices See more indices live prices Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Share CFDs Forex Indices Commodities Other markets Web platform Trading apps MetaTrader 4 ProRealTime Compare features Demo News and trade ideas Trading strategy  Charges and margins Premium services Refer a friend Marketing partnerships Corporate accounts New clients: +44 (20) 7633 5430 or email sales.en@ig.com Clients: Help & Support  IG | Terms and agreements | Privacy | How to fund | Vulnerability | Cookies | About IG Follow us online: ^IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG Group established in London in 1974, and is a constituent of the FTSE 250 index. The risks of loss from investing in CFDs can be substantial and the value of your investments may fluctuate. 70% of retail client accounts lose money when trading CFDs, with this investment provider. CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. You should consider whether you understand how this product works, and whether you can afford to take the high risk of losing your money. CFD Accounts provided by IG International Limited. IG International Limited is licensed to conduct investment business and digital asset business by the Bermuda Monetary Authority. IG provides an execution-only service. The information in this site does not contain (and should not be construed as containing) investment advice or an investment recommendation, or an offer of or solicitation for transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. The information on this site is not directed at residents of the United States and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG International Limited receives services from other members of the IG Group including IG Markets Limited. Careers | IG Group "
}