{
    "title": "India slashes EV import taxes, boosting Tesla's market entry plans",
    "date": "3/15/2024",
    "url": "https://www.newsbytesapp.com/news/auto/indian-government-approves-new-ev-policy-with-lower-import-tax/story",
    "text": "Hi, Logout In a significant policy shift, the Indian government has decided to reduce import taxes on electric vehicles (EVs). \n \nThis is only for companies willing to invest a minimum of $500 million and establish a local manufacturing facility in three years. \n \nThis move could potentially accelerate Tesla's plans to penetrate the South Asian market. \n \nThe new policy stipulates that at least 25% of components should be domestically sourced, as per the government press release issued today. Companies that meet the investment and manufacturing criteria will be eligible to import 8,000 EVs annually at a reduced import duty of 15% on cars priced at $35,000 (roughly Rs. 29 lakh) and above. \n \nThis is a significant reduction from the current tax rate of 70% to 100% levied on imported cars, based on their value. \n \nThe change could potentially pave the way for Tesla's entry into India, as the company has been in discussions with the government for years. The new policy aligns with India's objective to boost EV adoption and reduce its reliance on oil imports. \n \nThe country has set an ambitious target of achieving 30% EV sales by 2030. \n \nAccording to the Ministry of Heavy Industries, this initiative will provide customers with access to the latest technology, strengthen the EV ecosystem, reduce crude oil imports, and lower the trade deficit. \n \nIt will also have a positive impact on people's health as well as the environment. The new policy requires a minimum investment of approximately $500 million, with no maximum limit. \n \nCompanies must establish manufacturing facilities within three years and achieve a localization level of 25% by the third year and 50% by the fifth year. \n \nA customs duty of 15% will be applicable on vehicles priced at $35,000 and above for five years, provided manufacturing facilities are set up within three years. \n \nThe policy also allows for a carryover of unused annual import limits. The policy mandates that the investment commitment made by companies, must be backed by a bank guarantee in place of the customs duty forgone. \n \nIn case a company fails to meet the Domestic Value Addition (DVA) and minimum investment criteria outlined in the scheme guidelines, the bank guarantee will be invoked. \n \nThis measure ensures that companies adhere to their commitments under this new EV policy. "
}