{
    "title": "Musk has given Tesla an ultimatum as he seeks to grab more power",
    "date": "1/17/2024",
    "url": "https://www.businessinsider.com/elon-musk-tesla-board-ultimatum-2024-1",
    "text": "       Elon Musk has issued an ultimatum to Tesla's board: Hand over control of 25% of the votes, or he'll put the brakes on AI development. In a post on X, the billionaire said he would feel \"uncomfortable\" expanding the EV company's AI and robotics capabilities without controlling a quarter of the voting bloc. Musk added that the voting power would make him \"influential\" but ultimately overridable regarding major decisions. The blunt and unexpected post threw investors into a frenzy, with Dan Ives, a managing director covering technology at Wedbush Securities, saying Musk's comment sparked a \"firestorm.\" Part car company, part tech firm, Tesla is recognized as a disruptive leader within the automobile industry. Musk has consistently touted the company's tech as the \"best real-world AI.\" This makes the threat of moving AI development out of Tesla potentially disastrous for the company's future growth. \"The Street views Tesla correctly (in our view) as a disruptive tech leader and if Musk ultimately went down the path to create his own company (separate from Tesla for his next generation AI projects this would clearly be a big negative for the Tesla story,\" Ives wrote in a note. Related stories But Musk is already working on AI projects outside Tesla through his new company, xAI. His AI startup-slash-bid to mitigate \"woke\" AI has already launched a product, called \"Grok,\" to compete with Google's Bard and OpenAI's ChatGPT. Despite cofounding OpenAI, Musk was largely left out of the early generative-AI boom, and many see the new company as an attempt to get a seat at the table. The billionaire's Tesla ultimatum may be rooted in his fears about the existential risks of advanced AI and his desire to control development. Musk has long said the risks AI poses are comparable to nuclear weapons. Nonetheless, putting Tesla's future at risk has major consequences for Musk because most of the billionaire's $206 billion fortune is tied to the EV company. The billionaire has a stake in Tesla of about 13%, company filings show. But this could be bumped up to 20.6% if a Delaware court approves his 2018 compensation plan. Musk claims the board has delayed updating his compensation package until the case is decided. If the plan is rejected, it could be complicated for the board to give Musk what he wants. Still, if he digs in his heels, the billionaire is likelier to get what he wants. As Ives notes: \"Musk is Tesla and Tesla is Musk.\" \"At the end of the day, we believe the Board and Musk will be able to resolve this issue over the next 3-6 months,\" he added. Read next Jump to "
}