{
    "title": "Tesla's Future Rests On 3 Pillars: Model 2, FSD 12 And 4680 Batteries \n(NASDAQ:TSLA)",
    "date": "1/30/2024",
    "url": "https://seekingalpha.com/article/4666132-teslas-future-rests-on-three-pillars-model-2-fsd-12-and-4680-batteries",
    "text": "Early photo of Tesla Gigafactory Austin or known as GigaTexas aerial view shows construction progress and the 4680 battery factory, now operating and under expansion. RoschetzkyIstockPhoto Early photo of Tesla Gigafactory Austin or known as GigaTexas aerial view shows construction progress and the 4680 battery factory, now operating and under expansion. RoschetzkyIstockPhoto No stock polarizes - or captivates - investors more than Tesla, Inc. (NASDAQ:TSLA). The believers always find a rationale to buy shares, skeptics the reverse. Among the top stocks in the world by market capitalization, Tesla has been shedding value for a month, a selloff precipitated by a fourth quarter earnings miss followed by a forecast of slower growth in 2024 that disappointed analysts. Believers spot a buying opportunity. Skeptics fret it's the beginning of the end. Both thoughts may be at least a bit misguided. In the fourth quarter earnings call from last Thursday, Jan. 24, CEO Elon Musk referred to the company as being \"between\" two growth waves. \"We're focused on making sure that our next growth wave, driven by next-gen vehicle, energy storage, full self-driving, other projects, is executed as well as possible,\" Musk said on the call. Tesla's next-gen vehicle, slated to be built in the automaker's Austin gigafactory, will be called the Model 2 with a starting price of around $25,000, making it one of the most affordable battery electric vehicles (BEVs) on the market. Whether it actually costs as little as $25,000 remains to be seen, Musk and Tesla often promising more than they deliver. The Model 2 project, slated to begin production in the second half of next year, is important more because of its manufacturing process than its impact on the BEV market. So-called gigacasting technology aspires to replace the conventional welding of metal parts into a unibody - used by virtually all assembly plants - with a new and innovative aluminum casting process that yields fewer and larger components that then are joined to create the body. The potential cost savings are said to be significant. Model 2's relatively modest price assumes that gigacasting will work at scale and result in massive economies as promised. Musk knows this won't be simple or easy. \"That will be a challenging production ramp. Like, as I can emphasize we'll be sleeping on the line practically. In fact, not practically. We will be,\" Musk said in the earnings call. Musk has already conceded that automating assembly lines and reducing costly human labor is far more difficult than he once imagined. Yet if Tesla succeeds with gigacasting, every other automaker will feel the financial pressure to match. Though Tesla is known as a top global producer of BEVs, the automaker's technological prowess in software is underappreciated outside the auto industry, where rivals are racing to catch up. Tesla is a pioneer of centralized vehicle computing, a key facilitator of over-the-air (OTA) software updates - all of which amount to the \"software-defined car,\" the industry's latest buzzphrase. In the not-too-distant future, automakers will increasingly offer certain vehicle features by subscription, which can be added or deleted OTA, thereby creating additional revenue opportunities beyond the original sale or lease. Tesla's latest self-driving software, FSD12, could be enabled via OTA. At the moment, the current FSD11 self-driving package costs up to $15,000. FSD12 is undergoing beta testing by Tesla employees and a select small group of customers. Early reviews are positive, though not without some complaints. The rollout of FSD12 is significant in that Tesla has switched from a system of human-written computer code as the basis of self-driving to an artificial intelligence or machine-learning system. Using millions of visual images drawn from real-life driving in Tesla vehicles, the automaker's Dojo supercomputer trains FSD12. Musk has envisioned a world filled with autonomous Tesla vehicles - lacking steering wheels and other controls - earning money for their owners as robotaxis. That day isn't yet nigh - though Tesla's latest switch to AI may prove to be another step in that direction as well as a reason for certain motorists enamored of self-driving to buy a vehicle with FSD12. A Goldman Sachs analyst already estimates that FSD could be worth a few billion annually in revenue and possibly much more in the years ahead. The third critical pillar on which Tesla's financial performance rests is its 4680 lithium-ion battery, which replaces its previous battery, was first revealed in September 2020 and has been rolling out since. The number refers to the 46 mm by 80 mm cylindrical size, which is becoming an industry standard and is used by other manufacturers, such as China's BYD. The new design is integral to Tesla's Cybertruck powertrain. On the Q4 earnings call, Musk called the Cybertruck \"our best product ever\" and a \"head turner.\" Tesla Cybertruck, now in production (Tesla) Tesla Cybertruck, now in production (Tesla) According to the Chinese battery company, Evlithium, Tesla's 4680 has higher power density, higher energy density, better thermal performance and lower cost than the cells it replaces. According to Evlithium: \"A Tesla Model 3 with a 75-kilowatt-hour battery pack using traditional cells has a range of about 350 miles (560 kilometers) and a weight of about 4,000 pounds (1,800 kilograms). A Tesla Model 3 with a 75-kilowatt-hour battery pack using 4680 cells could have a range of about 406 miles (653 kilometers) and a weight of about 3,600 pounds (1,630 kilograms). Additionally, the company says, the batteries would be significantly cheaper. One of the biggest difficulties with advanced batteries is the manufacturing process. Very small imperfections can result in overheating, power degradation and unsuitability for vehicle use. In the latest earnings call, Tesla executives said the ramp-up phase of battery production - critical to meet demand for Cybertruck - is going well. Not surprisingly, Seeking Alpha assigns TSLA stock an F grade for valuation, the share price far beyond what would be indicated by nearly any metric, especially its price in relation to profitability. Yet there the company stands, with a market capitalization of $607 billion, plenty of cash and very little debt. There's a reason why the word \"unicorn\" is used to describe such enterprises. The substantial cohort of Tesla/Musk enthusiasts appears as robust and lively as ever. They can be grouchy as well - but not usually because some quarterly financial target or other is missed. Potential investors should keep their eyes on Model 2, Cybertruck, FSD and batteries. These are the stories that have the potential to drive consumers to purchase Tesla models. Don't expect the stock performance to display a conventional relationship with financial performance; it never has and there's little reason to expect one now. For the moment, I own TSLA and join the consensus of analysts who rate the company a Hold at its current price. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSLA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}