{
    "title": "Should Tesla’s Footprint Expand So The Company Can Grow?",
    "date": "1/2/2024",
    "url": "https://cleantechnica.com/2024/01/02/should-teslas-footprint-expand-so-the-company-can-grow/",
    "text": " Cathie Wood’s Ark Invest team focused quite a bit on the Tesla brand in late 2023. One of their newsletters admonished GM and Ford, arguing that slowing the path toward EVs is a mistake — one that will only help Tesla and Elon Musk if these and other legacy automakers don’t plunge into electrification full force and quickly. But that’s not all that Wood and her team have forecast about Tesla’s footprint: they posed another prediction that could increase the company’s stock value exponentially by the end of the decade. Chip in a few dollars a month to help support independent cleantech coverage that helps to accelerate the cleantech revolution! What does that mean for Tesla? The investment management firm’s vision for Tesla gives us a lot to mull over. What’s already brewing within Tesla’s footprint? What else could boost its financial allure and send it out blazing again ahead of competitors, like its EVs did? Maybe it’s the Supercharger network evolution, with NACS pushing the company to new financial levels? Is it the Megapack, which is already cost competitive with conventional energy sources? Perhaps it’s energy storage growth, more generally? Nope. Not even close. To deconstruct Ark Invest’s forecasts, it makes sense to start with Tesla’s successes in transportation electrification. We know that Tesla operates 6 gigafactories located in California, Texas, Nevada, New York, Berlin, and Shanghai. Another planned gigafactory in Mexico is stalled until interest rates drop enough to make construction feasible. Musk mentioned in 2022 that Tesla could produce up to 20 million electric cars per year by 2030, with each gigafactory producing between one and a half and two million units per year. As early as 2006, Tesla claimed that most cars in the future would be electric. Since then, the rise of electric cars has been “staggering,” according to Bloomberg. Tesla evolved from being the car of the “uber rich” to one that everyday drivers could own. Then other major automakers followed suit, which drove down EV prices and expanded available options. Now Tesla faces real competition from legacy automakers and fresh faces entering the EV space. Ark Invest CEO Cathie Wood has long been bullish on Elon Musk and Tesla. After all, Ark Invest projects that EVs should account for ~90% share of the market by 2027. “We expected a lot of traditional auto manufacturers to see the writing on the wall and rush as quickly as they could into scaling big-time into electric vehicles,” she told Bloomberg Surveillance this week. But that’s not what played out. Instead, General Motors and Ford revealed that they will slow their EV investment trajectories, so that billions of dollars will be filtered out over a longer period of time. Shareholders were panicking about short term price drops, even though it seemed obvious that legacy automakers would have to experience financial restructuring to rebuild and retool so their catalogs could be filled with EVs. Wood has determined that such losses are necessary and to be expected. “Both GM and Ford have said, ‘We’re stepping back. We’re not going to do this until it’s profitable.’ The problem with that is in order to be profitable, they need to scale. That’s how this works. These are learning curves that they are writing down, and those are expressed in cost declines… The fact that they’re pulling back means there’s more share for Tesla and others who choose to go for it.” So the Detroit Three and others really can’t compete with Tesla right now, as EVs account for 84% of Tesla’s revenue. It hurt competitors that Tesla slashed the prices of its EVs by an average of 20% between August 2022 and August 2023; Tesla’s sharp and unexpected price drops to offset 2023 inflation affected other electric cars on the market, so a lot of used EVs were sitting on the lot for longer than normal. Our CleanTechnica editor-in-chief, Zachary Shahan, says the used electric car market in the US now is, “even broadly speaking, at the whim of Tesla’s supply-vs-demand trends.” Plus The Motley Fool points to Tesla’s economies of scale — “its gross profit margin is higher than that of any other car maker in the industry, which affords the company pricing power to help fend off competitive threats.” Tesla’s EV sales far exceed any other automaker. Musk has voiced optimism that Tesla EV deliveries can grow 50% annually for several more years. Tesla’s projections were to produce 1.8 million EVs in 2023. Starting with 2024, Tesla plans to increase its sales up to 50% through demand for its vehicles, which means the company expects to possess the capacity to build them. Ark Investment Management’s financial models describe Tesla’s primary source of upcoming financial success, and, guess what? EVs aren’t going to be pulling the Tesla weight by 2027, says Ark. Instead, AI will become the prominent profitability measure for Tesla. If you’ve been thinking along the lines of what the Ark Investment folks are thinking, then you’re prescient in a way most of us are not. The Ark team concludes that in 2027 Tesla will generate $1 trillion in annual revenue, with 44% coming from the robotaxi business. In fact, Cathie Wood continues to voice strong sentiment that Tesla stock is the biggest artificial intelligence (AI) opportunity in the world. Tesla’s prospective robotaxi business line is a key driver, the Ark team says, contributing 67% of expected enterprise value and 64% of expected EBITDA in 2027. That adds up to $354 billion in earnings before interest, tax, depreciation, and amortization (EBITDA), of which 64% will come from robotaxis and a further 3% from human-driven ride-hailing within Tesla’s network. Tesla’s revenue is on track to come in at $97 billion in 2023, so it would have to grow by 80% per year between now and 2027 to meet Ark’s $1 trillion forecast by 2027. Across their simulation set, the EV sector for Tesla accounts for 47% of revenues in 2027 “at substantially lower margins than robotaxi revenue.” Assuming Ark is correct, that means a majority of Tesla’s profitable assets will emerge from sectors that are not yet fully functioning in 2024. Tesla’s footprint would look entirely different if driven by robotaxis. We’ve known for a while that Tesla believes it can develop industry-leading autonomous self-driving vehicle software. But robotaxis? Really? Is this really going to be the area of focus for the company moving forward? Tesla’s 2023 Annual Report slide deck info reminded us that its Full Self Driving (FSD) Beta has grown to nearly 200 million miles driven since its inception. That number of miles of training shouldn’t come as a full surprise, as Tesla has been developing its full FSD software for over 10 years. Ark Invest estimates Tesla has 2.7 million customer cars on the road testing FSD, which is 10 times more than its nearest competitor. Analysts at the The Motley Fool, while not convinced that the robotaxi gig is the key to long term Tesla success, admit, “Nevertheless, if and when Ark’s predictions come true, Tesla could amass a valuation of over $6 trillion! That implies a 770% upside in its stock from where it trades today.” Carolyn Fortuna, PhD, is a writer, researcher, and educator with a lifelong dedication to ecojustice. Carolyn has won awards from the Anti-Defamation League, The International Literacy Association, and The Leavey Foundation. Carolyn is a small-time investor in Tesla and an owner of a 2022 Tesla Model Y as well as a 2017 Chevy Bolt. Please follow Carolyn on Substack: https://carolynfortuna.substack.com/. Carolyn Fortuna has 1270 posts and counting.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\tSee all posts by Carolyn Fortuna "
}