{
    "title": "Tesla's Bloodbath No Deterrent For Cathie Wood, Ark Mops Up $32.5M Worth Of \nShares, What Lies Ahead For T",
    "date": "1/25/2024",
    "url": "https://www.benzinga.com/markets/equities/24/01/36795078/teslas-bloodbath-no-deterrent-for-cathie-wood-ark-mops-up-32-5-worth-of-shares-what-lies-ahead-f",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla, Inc. TSLA shares tumbled over 12% on Thursday after the company reported fourth-quarter earnings and revenue that trailed expectations and warned of a significant decline in volume growth in 2024. Notwithstanding the downward spiral in the stock, one bullish investor doubled down on her Tesla bet. What Happened: Cathie Wood-led Ark Invest on Thursday accumulated Tesla shares through two of its actively-managed exchange-traded funds, namely Ark Innovation ETF ARKK and Ark Next Generation Internet ETF ARKW. ARKK, the flagship ETF of Ark, added 148,246 Tesla shares and ARKW boosted its Tesla holdings by 29,624. Together, Ark bought 177,870 shares of Tesla Thursday, valued at $32.48 million. Tesla closed Thursday’s session down 12.13% at $182.63, according to Benzinga Pro data. The slump led to an erosion of $80.4 billion in market capitalization in a single day. The electric-vehicle giant’s stock makes up roughly 7.77% of the portfolio weighting of ARKK and they are the second-biggest holding of the ETF.  In ARKW, Tesla accounts for 5.10% of the weighting and is the sixth biggest holding. At the end of 2023, Ark’s stake in Tesla was at 3,802,519, valued at $944.85 million. See Also: Everything You Need To Know About Tesla Stock Why It’s Important: Thursday’s Tesla buy is in line with Ark’s practice of piling into its major portfolio stocks in the wake of any potential weakness. Wood is bullish on Tesla and is a big believer in its self-driving technology that is core to the robotaxi services that the Elon Musk-led company is expected to launch in the future. Ark has a $2000 price target for Tesla by 2027, with about 67% of the enterprise value attributable to the robotaxi service. With limited catalysts on the horizon and the prospect of the EV market remaining in a contraction mode, Tesla stock is on track to see extended weakness. Future Fund’s Gary Black said in a post on X that he sees Tesla stock rebounding on Friday if the company does not announce further price cuts in the U.S. Thursday night. Friday’s move largely hinges on how a key economic data scheduled for the day pans out. The Bureau of Economic Analysis is scheduled to release its personal income and spending report at 8:30 a.m. ET Friday. Data from the report, namely the annual rate of the core price consumption expenditure, is the Fed’s favorite inflation gauge. If the number comes in line or below the consensus estimate of 3%, it is likely that investors swoop up stocks ahead of the Jan. 31 Fed rate decision. In the long run, incremental updates about the next-gen sub-$30,000 EV could give a lift, provided the company refrains from configurator price cuts. A revival also hinges on how the economic conditions pan out, a recovery in EV demand and the competitive dynamics in the industry. Photo courtesy Benzinga YouTube and Unsplash Read Next: Tesla Bull Rues ‘Train Wreck’ Earnings Call, Slashes Price Target By 10%: ‘Dead Wrong Expecting Musk And Team To Step Up Like Adults In The Room’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}