{
    "title": "Three cheers for the Delaware judge who stood up to Elon Musk",
    "date": "1/31/2024",
    "url": "https://www.theguardian.com/business/nils-pratley-on-finance/2024/jan/31/three-cheers-for-the-delaware-judge-who-stood-up-to-elon-musk",
    "text": "At last: a judgment that injects a dose of sanity into the process of handing out executive rewards  “Was the world’s richest man overpaid?” begins Kathaleen McCormick in her ruling from the Delaware court of chancery. You bet. An incentive package worth up to $55.8bn for Elon Musk at Tesla in 2018 was over the top, unnecessary to secure the great man’s services and thus “unfair” to other shareholders because of the dilutive effect on their holdings. Read the 200-page judgment and it’s hard to disagree with any step in her argument. Musk and his fanclub are enraged, naturally. “I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,” said Tesla’s chief executive. And it’s true that shareholders approved the scheme by a 73% majority back in 2018. Some said on Musk’s X that they’d happily do so again today because he hit his performance-related targets and Tesla’s value improved by a turbo-charged $600bn. (Back in 2018, remember, the electric vehicle company was worth $50bn-ish and there was a lively debate in the investment world about whether it would soon run out of money.) Yet the objection that shareholders signed off the whole thing misses the nuances, and careful stages, in McCormick’s ruling. Step one was to show that Musk’s 22% stake in Tesla gave him controlling status, meaning enormous influence. That wasn’t hard to show: Musk was chairman and “superstar CEO” and “enjoyed thick ties with directors tasked with negotiating on behalf of Tesla”. Step two was to ask, given the controlling status, whether the incentive package was fair. Delaware courts can shift the burden of proof when a transaction is approved by a “fully informed” vote of other shareholders, but that’s where Tesla and the defendants started to fall down. The company’s proposal “inaccurately described key directors as independent and misleadingly omitted details about the process”. The judge is surely spot-on about the lack of independence. Ira Ehrenpreis, the lead director negotiating for Tesla, had a 15-year business relationship with Musk. Another member of the working group, Antonio Gracias, had a 20-year one and regularly went on holiday with Musk’s family. A third member was the company’s general counsel, Todd Maron, who was Musk’s former divorce lawyer and “whose admiration for Musk moved him to tears during his deposition”. That set-up just looks too cosy. It was also a reason why McCormick concluded that the process behind the award was “deeply flawed”. In essence, Musk proposed the size and structure of his potential rewards and the compensation committee achieved concessions that weren’t true concessions in the judge’s view. Thus the argument moved on to the fairness of the award in terms of price. The board members argued that they wanted to set Tesla up for transformational growth and that Musk’s continued leadership was essential. McCormick knocked down the “high level” appeal of that argument with a series of commonsense points. First, given Musk’s one-fifth stake, he already had “every incentive” to attempt transformation because a $50bn increase in Tesla’s market value would be worth $10bn to him. Second, he had no plan to leave. Third, the incentive scheme didn’t even require him to devote a set amount of time to Tesla. “Swept up by the rhetoric of ‘all upside’, or perhaps starry eyed by Musk’s superstar appeal, the board never asked the $55.8bn question: was the plan even necessary for Tesla to retain Musk and achieve its goals?” asked the judge. Yes, that’s the nub of it. In being so lavish, the directors short-changed ordinary shareholders. The court order says the share options must be voided. Tesla may appeal or produce a new proposal (with correct disclosures on independence, one hopes). In the meantime, though, applaud a judgment that injects a dose of sanity into the process of awarding executive rewards at quoted companies – a process that has become so inflationary, in part, because independent directors have taken timidity to new depths. Sign up to Business Today Get set for the working day – we'll point you to all the business news and analysis you need every morning after newsletter promotion “When seeking directors, CEOs don’t look for pit bulls. It’s the cocker spaniel that gets taken home,” another rich man, Warren Buffett, said a few years ago. Absolutely right. The job of independent director is meant to be about representing the interests of all shareholders. If you can’t act independently, you should not be there. Do not behave like members of a cult, which is roughly what happened at Tesla. Come on – $55.8bn was always absurd. "
}