{
    "title": "Tesla warns Wall Street it may grow more slowly this year",
    "date": "1/24/2024",
    "url": "https://www.marketwatch.com/story/tesla-warns-wall-street-it-could-sell-fewer-vehicles-this-year-db9d0d82",
    "text": "Tesla Inc. entered its earnings day under a cloud, and some of what investors had feared played out on Wednesday as the EV maker warned it may grow more slowly this year to focus on its next-generation vehicle. Its 2024 vehicle volume-growth rate “may be notably lower than the growth rate achieved in 2023, as our teams work on the launch of the next-generation vehicle at Gigafactory Texas,” the EV maker said in a letter to shareholders accompanying fourth-quarter results after the bell Wednesday. The company is in between “two major growth waves.” Shares \n        TSLA,\n        -2.25%\n       fell 8% in premarket trade on Thursday, having dropped 16% to start the year. On a call with analysts following results, Chief Executive Elon Musk echoed that in-between time, adding that Tesla will make sure the next wave “is executed as well as possible.” The company is “very far along” on the next-generation vehicle and currently planning to start its production in the second half of 2025, Musk said, adding that after a production start in Texas, a future factory in Mexico likely would be the newest EV’s second production location. Tesla will identify other locations outside of North America at the end of the year, he said. In the fourth quarter, Tesla earned $7.9 billion, or $2.27 a share, compared with $3.7 billion, or $1.07 a share, in the year-ago period. Adjusted for one-time items, the EV maker earned 71 cents a share. Sales rose 3% to $25.17 billion, from $24.32 billion a year ago, as rising vehicle sales and growth in other parts of the business were offset by a reduced average vehicle selling price and lower revenue recognition from “Full Self Driving,” Tesla’s suite of advanced driver-assistance systems for urban driving. Analysts polled by FactSet expected the EV maker to report adjusted earnings of 73 cents a share on sales of $25.6 billion. The miss led to the stock dropping more than 5% in after-hours trading. Tesla’s GAAP gross margins dropped to 17.6% from 23.8% in the fourth quarter of 2022. The volume outlook for the year was “inconclusive,” said Barclays analyst Dan Levy. “Overall, with significantly negative expectations into the print, the result is arguably not as bad as feared, albeit with a number of questions to be addressed,” he said in a note Wednesday. A “big positive” was that Tesla confirmed its next-generation EV, CFRA analyst Garrett Nelson said. “The guidance was not all that surprising, as we think sales growth for the Model Y will slow after an extremely strong year and it is being cautious with managing expectations regarding the Cybertruck ramp-up,” he said. For Karl Brauer, an analyst at iSeeCars.com, the problems go beyond Wednesday’s print. “We are watching a company, and an industry, transition from high growth and high aspirations to modest, predictable growth with increasing competition and reduced opportunity for each participant,” Brauer said. “Tesla’s latest numbers reflect both its shrinking market dominance and the challenges it faces in appealing to mainstream consumers,” he said. In the letter to shareholders, Tesla reiterated that it expects that the Cybertruck ramp will be “longer than other models given its manufacturing complexity.” The next-generation vehicle, of which little concrete is known, has been dubbed the Model 2. A question about whether the new EV would be launched by 2025 has been the top query on Tesla’s investor-relations site. “We are focused on bringing the next-generation platform to market as quickly as we can, with the plan to start production at Gigafactory Texas. This platform will revolutionize how vehicles are manufactured,” the company said in the letter. Investors first got official word of a next-generation vehicle last March as Tesla and Chief Executive Elon Musk held an investor day to tout their “Master Plan 3.” See also: Apple said to be scaling down self-driving Apple car features Tesla’s stock has gotten off to a rough start of the year, falling more than 16% this month, versus gains of 2% for the S&P 500 index \n        SPX.\n       Its shares are up more than 44% in the past 12 months, however, outpacing the S&P 500’s gains of around 21%. Check out On Watch by MarketWatch, a weekly podcast about the financial news we’re all watching — and how that’s affecting the economy and your wallet. MarketWatch’s Jeremy Owens trains his eye on what’s driving markets and offers insights that will help you make more informed money decisions. Subscribe on Spotify and Apple. In 2021, Glen Taylor agreed to sell the Minnesota franchise for $1.5 billion. The team is now likely worth at least $2.5 billion. Claudia Assis is a San Francisco-based reporter for MarketWatch. Follow her on Twitter @ClaudiaAssisMW. Visit a quote page and your recently viewed tickers will be displayed here. "
}