{
    "title": "Tesla building service center in Naples area",
    "date": "2/9/2024",
    "url": "https://www.gulfshorebusiness.com/tim-aten-knows-tesla-building-service-center-in-naples-area/",
    "text": "... ... ... Tesla Inc. has sparked some electrifying local news with its recent acquisition of East Naples industrial property to build a service center for its electric vehicles. The premium electric car company closed Jan. 31 on a $7 million deal to create a nearly 45,000-square-foot service and sales center on more than 4.5 acres on Radio Road. This service center project is especially notable because it will be the first one that Tesla is developing itself rather than using a third-party developer, said Bobby Keim, Tesla’s development manager. Tesla’s proposed regional service and sales center is targeted for completion in the second quarter of 2025, Keim said. Most of the new center at 4555 Radio Road—about a quarter mile west of the Wawa at Livingston Road—will consist of more than 35,000-square-foot indoor service area with 20 or more bays, conceptual plans show. The center will include a sales area of 2,671 square feet—a showroom large enough to display two or three electric vehicles—3,890 square feet of adjacent office space and the structure’s roof will be used as outdoor storage for vehicle inventory. An access ramp to the rooftop parking will be at the building’s rear, where a line of charging stations also will be located, development plans show. The project is in its demolition phase. Site work was expected to start this week and is targeted for completion by the end of November, county documents show. Tesla owns and operates all of its sales and service locations, so the EV company doesn’t have dealers or franchises. Key aspects will distinguish the new center from traditional automobile dealers. The site will not have vehicle inventory for sale and direct vehicle sales will not occur there, documents show. Only two or three employees of the anticipated 35 to 45 full-time workers will be sales personnel. Consistent with the Tesla business model, a curated selection of its vehicles will be on display. All sales will be exclusively conducted online through Tesla’s website, emphasizing a digital-first approach. Customers may arrange for a test drive of a demonstration vehicle, but no vehicles will be available on site for immediate sale and delivery. Only previously purchased vehicles waiting for delivery and vehicles being serviced will be stored on site. The distribution aspect of the facility will serve as the regional delivery port for vehicles sold. Previously ordered vehicles will be delivered to the site, inspected and cleaned before being picked up by customers. The sales area will also feature sales and installation of solar roof systems and home power systems. These items can be purchased at the facility or online and scheduled for home installation. The company’s research shows that the Naples area clearly demands a Tesla service center, Keim said. “We track data. We track current users in the market, growth in every market. We track this all across North America,” he said. “So, there’s a high need for a service location in Naples.” Tesla has 14 service centers in Florida with its nearest one to Naples near Colonial Boulevard and Interstate 75 in Fort Myers. The electric car company has operated a showroom at Waterside Shops in North Naples since December 2016. The future Tesla site in East Naples has had industrial uses for decades. Until recently, it was the Southwest Florida location for Texas-based CMR Construction & Roofing, one of the 10th-largest roofing companies in the nation. Its main building on Radio Road was a nondescript, 8,160-square-foot metal structure built in 1979. CMR recently downsized and relocated within that industrial area. Demolition plans show that the main metal building on CMR’s former site and seven smaller structures will be removed with adjacent pavement and concrete. A nearly 4-acre site will be cleared and prepped for a new ground-up building. Construction Journal estimates the value of the project at $12 million. The new project proposes to build on Radio Road a right in/out access and a full access via a shared-use accessway with a right in/out and left-in access. The new center will not have a significant impact on the surrounding road network, which has a surplus of capacity and can accommodate the traffic that will be associated with the business, according to a traffic impact statement by Naples-based JMB Transportation Engineering Inc. Not only does Tesla’s strategic acquisition here mark the company’s inaugural venture in self-developed projects in the United States, but it’s a milestone local sale, said Philip Josberger, operations manager of Naples-based Kova Commercial Group, which helped facilitate the real estate transaction. Felipe Arcila, senior adviser of Kova; and David J. Stevens, a principal of Investment Properties Corp. of Naples, represented the seller, 4555 Radio Rd LLC. Tom Godino Jr., a partner of Atlantic Retail, represented the buyer, Tesla Inc. Arcila’s involvement with the site began in September 2020 with the sale of the property to CMR for $4,650,000. He collaborated with local civil engineering firm GradyMinor in the Collier County planning and application process that began in early 2023, Josberger said. “This project has taken years and would not have come to this point without the dedication of Felipe,” he said. Tesla’s detailed plans a few years ago to locate a service center in North Naples didn’t materialize. In mid-2021, a Tesla sales and service center was proposed at the former Toys R Us store on the northwest corner of Airport-Pulling and Pine Ridge roads. At that time, development plans filed with Collier County’s Growth Management showed a state-of-the-art Tesla Service Plus concept filling the 30,585-square-foot space that the toy retailer vacated in 2018. The space remains vacant. The “Tim Aten Knows” weekly column answers local questions from readers. Email Tim at tim.aten@naplespress.com. The commissioners, made up of City Council members, agreed March 27 that pedestrian crossovers and parking structures should be categorized... Amer Asmar, owner of the hotel at 300 W. Retta Esplanade in the downtown area, was ordered in January to... A 158,146-square-foot commercial building with fueling stations and 850 parking spaces is planned on more than 32 acres on the... Nancy and Chet Niesel bought Shalimar in 2005. Collier County Land Trust and Housing, Education, Lending Programs rolled out The Housing Alliance on March 28, a clearinghouse that... LaRue Planning began working on reestablishing the revitalization plan for east Fort Myers through public meetings in August 2022. Copyright ©2023 Gulfshore Business Copyright ©2022 Gulfshore Business "
}