{
    "title": "Nvidia dethrones Tesla as Wall Street's most traded stock",
    "date": "2/20/2024",
    "url": "https://www.moneycontrol.com/news/automobile/nvidia-dethrones-tesla-as-wall-streets-most-traded-stock-12315451.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Chipmaker Nvidia is replacing Tesla as Wall Street's most traded stock, adding to its prominence after becoming the third-most valuable U.S. company and showing more evidence of how central AI-related bets have become to investors. Nvidia's outsized representation in day-to-day stock trading could leave investors more vulnerable should the chipmaker's revenue growth fail to meet investors' high expectations and puncture a Wall Street rally that has been fueled by euphoria about artificial intelligence. The Santa Clara, California chipmaker's quarterly report on Wednesday will be one of Wall Street's most watched events of the week. Some strategists believe anything short of a blowout report could reverse a rally that has sent Nvidia's stock soaring 47% in 2024. About $30 billion worth of Nvidia shares changed hands daily on average over the past 30 sessions, pulling ahead of Elon Musk's electric car maker, which averaged $22 billion per day over the same period. Tesla since 2020 had dominated daily U.S. stock trading, according to LSEG data, with turnover — a stock's share price multiplied by the number of shares exchanged — peaking above $35 billion several times in recent years. On Friday, combined trading in Nvidia and Super Micro Computer, another company benefiting from the boom in AI, accounted for over 40% of all turnover of the 10 most traded U.S. stocks, including Tesla, Meta Platforms, Apple, Amazon and Microsoft. \"There's an argument here that this is the dawn of a new era of trading, like the dawn of the internet, with Nvidia in the pole position,\" said Dennis Dick, a trader at Triple D Trading in Ontario, Canada. But Dick also warned that sky-high turnover in AI-related stocks suggests retail investors and algorithmic traders are driving share prices higher based on momentum rather than fundamentals, such as expectations of future revenue growth. Super Micro, which sells AI-related server components to Nvidia, has seen its value more than triple to $45 billion so far in 2024. It tumbled 20% from record highs on Friday after Wells Fargo started covering the stock with an equal weight rating, saying its valuation already discounts \"solid upside\". Nvidia controls about 80% of the high-end AI chip market, and last week its market capitalization eclipsed, separately, Amazon's and Alphabet's to make it Wall Street's third-most valuable company, behind Microsoft and Apple. Nvidia's stock market value has surged to $1.8 trillion from $540 billion a year ago. Meanwhile, Tesla's stock has tumbled 20% so far in 2024 as it struggles with tepid demand for its electric cars and growing competition. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}