{
    "title": "Ford EV Owners Can Order a Free Adapter for Tesla Superchargers",
    "date": "2/29/2024",
    "url": "https://ca.finance.yahoo.com/news/ford-ev-owners-receive-free-174300097.html",
    "text": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\" The Ford F-150 Lightning and Mustang Mach-E will be able to access Tesla's Supercharger network in Canada and the U.S. as an adapter is now available to order. Current owners and lessees can reserve the complimentary NACS adapter until June 30, 2024. After that, future owners will pay $230. Countless automakers have agreed to adopt Tesla's NACS charge port, and most have pledged to offer adapters for existing CCS-type plugs. UPDATE 2/29/24: Ford today has opened orders for a NACS adapter that will allow people who own or lease an F-150 Lightning or Mustang Mach-E to access Tesla's Supercharger network in Canada and the United States. The adapter is free of charge for those who are enrolled in Ford's BlueOval Charge Network and order one by June 30, 2024. After that point, customers will have to pay $230 for the adapter, which uses Tesla's proprietary NACS outlet. Ford is just one of the many automakers that plan to start building new EVs that feature Tesla's proprietary charge port, which is known as the North American Charging Standard—or NACS, for short. Like most other companies, Ford plans to make the switch starting sometime in 2025, and it has pledged to offer an adapter for some existing electric models with a CCS-style plug. While Ford isn't alone in promising an adapter, the company looks to be one of the first to deliver one to customers. Ford CEO Jim Farley today posted on his social media accounts that customers will soon be able to reserve a complimentary fast-charger adapter. That will give Ford F-150 Lightning and Mustang Mach-E owners who live in Canada and the U.S. access to Tesla's vast Supercharger network. When we announced @Ford EVs would get access to @Tesla Superchargers, I said we'd send customers a Fast Charging Adapter. I'm pleased to confirm that eligible #MustangMachE & #F150Lightning owners in the U.S. + Canada can reserve a complimentary adapter starting soon. This is… pic.twitter.com/QbGjEmsA3Y — Jim Farley (@jimfarley98) January 31, 2024 The timing aligns with Ford's original promise to offer the adapters in spring of 2024. Farley later followed up on his original post by explaining that all current Lightning and Mach-E owners are eligible to receive an adapter and that reservations will be validated by their vehicle identification number. Of course, only one adapter will be provided for each VIN. Ford will also cover the cost of shipping. Car and Driver also reached out to Ford directly to ask whether the adapters will be standard or optional when customers buy a new electric F-150 or Mustang SUV. The response we got was that more information about that will be revealed at a later date. You Might Also Like Car and Driver’s 10 Best Cars through the Decades How to Buy or Lease a New Car Lightning Lap Legends: Chevrolet Camaro vs. Ford Mustang! Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. Trade 24 hours a day on the world's most popular platform. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia.  \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o  They soft-launched their relationship at the supermodel's cookbook event in Miami. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  The president mocked his campaign rival for doing the one thing he claimed he wouldn’t have time for. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" "
}