{
    "title": "This high school junior bought 3 stocks when she was 14 years old, then \npurchased a Tesla",
    "date": "2/26/2024",
    "url": "https://www.foxbusiness.com/money/this-high-school-junior-bought-3-stocks-when-14-years-old-then-purchased-tesla",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy High school junior Sophia Castiblanco explains how she started investing at age 14 and gives advice to other young entrepreneurs. As investment accounts for teens surge in popularity, one high school junior says she started investing at the age of 14 years old and was so successful, she bought her own Tesla. \"I first… started making an income when I was 14, and it was because of social media,\" Sophia Castiblanco said on FOX Business’ \"The Big Money Show\" Friday. \"I've always kind of had a business mindset of wanting to make money, and I'm very okay with taking risk,\" she continued. THIS IS THE BEST TIME TO GIVE MONEY TO YOUR KIDS, ACCORDING TO ‘DIE WITH ZERO’ AUTHOR BILL PERKINS Noticing that she was money-savvy, Castiblanco said her parents played a role as she embarked on an investing journey. \"They knew the impact they would have in my future,\" she said. When it comes to her strategy and her \"biggest\" approach to managing risk, the young investor suggested investing in index funds. 'The Wolf of Investing' author Jordan Belfort on New York's alleged politicization, the push for financial literacy in schools and importance of a college degree. \"That kind of helps to diversify the risk of investing more than kind of if I were to just invest in individual stocks,\" she explained. She also explained that there are highs and lows to managing investments and one has to \"be okay with stocks losing value.\" \"I think that it takes patience and perseverance to just know that you are taking a risk, but that it's worth it,\" she said. One of the first stocks she invested in was Tesla, along with Apple and Amazon. \"Ever since I was really little, I've always loved Tesla.\" Castiblanco explained, \"I think that they make such incredible quality cars.\" As a result of her investment choices, she was able to purchase and enjoy her own Tesla. When it comes to the right age to invest, Castiblanco believes \"there's no minimum age to start.\" \"I think it's important to realize that even if you just invest like $20 a month, or I mean a super small amount, you can still grow that over time.\" GET FOX BUSINESS ON THE GO BY CLICKING HERE Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}