{
    "title": "Tesla stock slides lower: 3 reasons why shares are tanking",
    "date": "2/6/2024",
    "url": "https://ca.finance.yahoo.com/video/tesla-stock-slides-lower-3-150128284.html",
    "text": "Shares of Tesla (TSLA) continue to drop as the EV maker struggles with overall performance, issues with leadership culture, and rising profitability concerns from Wall Street. Yahoo Finance Executive Editor Brian Sozzi joins the Live show to deep dive into the key issues and narratives pushing Tesla stock lower. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino SEANA SMITH: 10 first stocks to watch, and it's Tesla among the top trenders on \"Yahoo Finance.\" Once again, this morning, shares are sliding in pre-market trading, off just about 3.5% year to date. It's been ugly for the stock, with shares off about 27%. Soz, you got to look for us here on what we could see-- excuse me, pre-market trading off just about 1.7%, lost over 3% yesterday. It's going to turn it around? BRIAN SOZZI: I was looking for a really bad pun like Tesla's stock downshifts to neutral. But you don't really shift in a Tesla, right? It's just an electric vehicle. Nonetheless, here are three reasons why Tesla stock is still tanking. Let me fire these off here really. Performance for Tesla has just not been good. You look at that last earnings report, earnings have been softer than expected for six straight quarters. So the Street is getting concerned about the company's performance. Number two, Wall Street profit estimates on Tesla are actually starting to fall. If you go over to \"Yahoo Finance,\" you click on the Analysis section on the left rail, you can see some of the earnings trends for Tesla over in recent days. Over the past 30 days, 2024 EPS estimates for Tesla have fallen for this year by about $0.72. Now keep in mind, Tesla shares are still valued about 56 times forward earnings. Not a good scenario when you see earnings estimates declining and your price is still priced for perfection or a growth stock. And then lastly, I have questions about Elon Musk here, the human being. The \"Wall Street Journal\" dropped its second story over the weekend, digging into his potential or reported drug use. Who else is running in his sphere? And I think this has begun to weigh on sentiment around Tesla. So you have all that. And then, really a nifty chart, I think, is also relevant to the Tesla story here as well. It comes from the folks over at Car Gurus. And you can see the continued downtrend in used Tesla prices for various reasons, whether it is quality concerns or people just don't want these things. They have range anxiety. Whatever it is, prices for Tesla continue to fall, which I would argue is putting pressure to even-- for Tesla to continue to lower prices on its newer vehicles, which puts pressure on profits and potentially sets it up for a seventh straight disappointing quarter when it reports three months from now. BRAD SMITH: Well, the other issue, too, is that you have the issue of so many of the rental car companies that are now putting some of their EVs back into the market too. So that hits on the Tesla selling proposition for a brand new one that somebody can say, all right, just for me to test out this EV landscape right now, why don't I just get into a used one for a fraction of the cost? BRIAN SOZZI: You can pick them on those Toyota hybrids. I know you're big-- you're a big fan. I really got a lot of pushback on my Toyota boring call, but-- BRAD SMITH: I'm just saying they got the Lexus division. SEANA SMITH: Well, you work from the market. I didn't think it was that much cooler than what Toyota was offering. BRIAN SOZZI: Sorry, Taylor. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Seven reportedly cost $20 million ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup. A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o They soft-launched their relationship at the supermodel's cookbook event in Miami. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company. The president mocked his campaign rival for doing the one thing he claimed he wouldn’t have time for. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" "
}