{
    "title": "Tesla Bull Admits He's 'Been Wrong' On EV Giant For 3 Years, Calls This His \n'Greatest Research Mistake' -",
    "date": "2/22/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37253910/tesla-bull-admits-hes-been-wrong-on-ev-giant-for-3-years-calls-this-his-greatest-re",
    "text": "A Tesla Inc.  TSLA bull on Wednesday took stock of his investment thesis for the electric vehicle giant’s stock as it remains stuck in a lackluster trading range. What Happened: “I’ve been wrong on $TSLA for three years now,” said Future Fund’s Gary Black, adding that the stock has been his “worst-performing long” during the period when Tesla fell 19% compared to a 32% gain for the Nasdaq 100 Index. Future Fund has Tesla as the third-highest holding of its Future Fund Active ETF FFND. Black conceded that he was wrong about volume trajectory. Tesla’s volume growth has slowed despite its massive price cuts and electric-vehicle credits, he said. The company estimated 15% year-over-year volume growth for 2024, down from the 38% growth seen in 2023, he noted. “Where I've been massively wrong is not anticipating that TSLA would start a price war, which has caused TSLA 2024 and 2025 earnings power to collapse (-45% over past 12 months),” the Tesla investor said. “This has been my greatest research mistake,” Black said. The rumored $25,000 Model 2, which he believed could satisfy the affordability issue, has been pushed back to late 2025 at least, he said. “So price cuts to drive volumes were in hindsight inevitable,” he said. See Also: Everything You Need To Know About Tesla Stock Spot On FSD Prediction: But Black credited himself for being right on the full-self driving software. “That it would not get to L4 for many years after Elon predicted FSD would drive itself and so I always assumed zero value for Robotaxi in my valuation,” he said. Despite FSD improving significantly as a driver-assist tool, its take rates languished in the low teens, the fund manager said. The technology, the analyst said, currently added 14 cents per share to the estimated earnings per share for 2024. Still Bullish: Black said he still thinks he will be vindicated on his Tesla price target of $290. He premised his optimism on his expectations that the other EV makers would either give up or cut back on their EV investments. He, however, cautioned against further price cuts. “Further TSLA price cuts would crush my investment thesis that auto gross margins bottomed at 16.3% in 3Q and are now headed upward as TSLA mgmt learns that they got little from last year's price cuts.” “When I make a bad trade as I have with $TSLA, I have only myself to blame. The shorts have done little to cause $TSLA price to decline; the damage to the stock has been largely self-inflicted which I should have foreseen.” To get to his $290 price target, the Tesla management should learn to use marketing tools other than price, Black said. Despite the current fundamental problems, the fund manager remains firmly bullish on the stock. “But I am optimistic and remain a $TSLA bull,” he said. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Walmart’s Solid Quarter Proves Tesla ‘Uberbulls’ Wrong? Fund Manager Explains Why High-Interest Rates, Dissatisfied Customers Aren’t Hurting EV Maker Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}