{
    "title": "Why Does Elon Musk Want to Move Tesla’s Incorporation From Delaware?",
    "date": "2/15/2024",
    "url": "https://www.findlaw.com/legalblogs/law-and-life/why-does-elon-musk-want-to-move-teslas-incorporation-from-delaware/",
    "text": "Find a Lawyer Legal Forms & Services Legal Forms & Services Estate Planning Business Formation View All Legal Forms Already have an account? Sign in to My Account Learn About the Law Learn About the Law Explore Legal Topics View All Legal Topics Search Laws by State View All Laws by State Search Case Law View All Case Law Search U.S. Codes View All State and Federal Codes Explore Legal Topics Search Laws by State Search Case Law Search U.S. Codes View All Legal Topics View All Laws by State View All Case Law View All State and Federal Codes Legal Professionals Blogs Find a Lawyer  Elon Musk, billionaire and CEO of Tesla and SpaceX, is mad at Delaware. Tesla, like many other Fortune 500 companies, is incorporated in Delaware. When shareholders brought a lawsuit against Musk’s $56 billion pay package from Telsa, they had to bring it to Delaware’s Chancery Court. The court rejected Musk’s compensation plan. Chancellor Kathaleen McCormick ruled that the Tesla pay package was a result of the directors being influenced by his star power and personal ties rather than a necessary corporate plan to achieve its goals. Tesla’s board has eight members, including Musk. Musk also has a personal relationship with other members of the board, like Musk’s brother, Kimball, and Rupert Murdock’s son, James. To give some perspective, Musk’s compensation package of over $56 billion is not in line with comparable CEOs of car or tech companies. Most CEOs receive some salary, but the primary compensation is through stock awards. The Associated Press reported that in 2022, the total compensation for the CEO of GM, Mary Barra, was $29 million, and Jim Farley, CEO of Ford, received $22 million that year. Tim Cook, CEO of Apple, received $63.2 million in 2023. As a result of the January 31, 2024 ruling, Musk lost his top spot on the Forbes Top 10 Richest People in the World. Musk immediately took to social media platform X posting “Never incorporate your company in the state of Delaware.” Later, he posted that the company would “move immediately to hold a shareholder vote” on whether to reincorporate Tesla in favor of Texas. Now Musk is accusing Delaware of locking its doors, preventing companies from leaving Delaware. Musk is known for moving to more favorable states. He moved the carmaker’s headquarters from California to Texas to get away from high labor costs and stringent regulations. It also doesn’t hurt that now Musk moved to Austin, he does not have to pay state income tax. Tesla investors may not want to move out of Delaware. Unlike some states, Delaware does not tax corporate income earned outside of the state and has a set body of laws for corporate governance, ones that are generally considered business-friendly. Delaware is unique in that it has a Court of Chancery with special jurisdiction to hear corporate matters. The judges have experience in complex corporate lawsuits so that companies can have issues resolved in a timely manner. And because there are no juries, the outcomes of legal disputes are more predictable. While most companies favor Delaware as the best place to incorporate, some do not like this jurisdiction. In recent cases, Delaware has held that shareholders can hold corporate officers accountable for their actions. Corporations fear that Delaware may be “too friendly to shareholders.” Recently, the head of TripAdvisor’s parent company, Gregory Maffei, sought to move TripAdvisor’s corporate home from Delaware to Nevada in an effort to shield directors from shareholder lawsuits for breach of fiduciary duties. Nevada codified a business judgment rule that presumes officers and directors act in good faith and should only be liable when their misconduct is intentional, fraudulent, or in known violation of the law. Shareholders are trying to block TripAdvisor’s reincorporation in Nevada, claiming the move will help Maffei escape potential liability for self-dealing. No. It is ultimately up to the shareholders to decide on reincorporation. In fact, Delaware passed a law in 2022 allowing companies to leave Delaware with the approval of a majority of shareholders. Previously, actions to move out of Delaware required a unanimous vote. It is too early to know if Tesla’s shareholders will want to move its state of incorporation to Texas. While Musk may be the largest shareholder, Nasdaq reported that in 2023, Musk held close to 13% of Tesla’s stock, he may not be able to sway the vote.    Meeting with a lawyer can help you understand your options and how to best protect your rights. Visit our attorney directory to find a lawyer near you who can help.  Get FindLaw email updates in your inbox. Learn more\n                about FindLaw’s newsletters, including our terms of use and privacy policy. This site is protected by\n                reCAPTCHA and the Google Privacy Policy and\n                Terms of Service apply. Thank you for subscribing! At FindLaw.com, we pride ourselves on being the number one source of free legal information and resources on the web. Contact us. Sign up for our consumer newsletter. Thank you for subscribing!  FindLaw.com Free, trusted legal information for consumers and legal professionals SuperLawyers.com Directory of U.S. attorneys with the exclusive Super Lawyers rating Abogado.com The #1 Spanish-language legal website for consumers LawInfo.com Nationwide attorney directory and legal consumer resources Copyright © 2024, Thomson Reuters. All rights reserved. "
}