{
    "title": "Tesla Cybertruck Owners Report Rusting Issues After Rain Exposure: Report - \nTesla (NASDAQ:TSLA)",
    "date": "2/14/2024",
    "url": "https://www.benzinga.com/news/24/02/37148315/tesla-cybertruck-owners-report-rusting-issues-after-rain-exposure-report",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Some Tesla Inc TSLA Cybertruck owners have reported rusting issues after their vehicles were exposed to rain. What Happened: Several Cybertruck owners have voiced complaints about rusting issues on the stainless-steel bodies of their vehicles, which reportedly occurred after exposure to rain, reported Business Insider on Monday. One of the owners, who goes by the username “Raxar” on the Cybertruck Owners forum, shared their experience of being warned by a Tesla advisor about potential rusting due to rain. The user wrote: \"The advisor specifically mentioned the Cybertrucks develop orange rust marks in the rain and that required the vehicle to be buffed out. I know I heard the story of never take out your Delorean in the rain but I just never read anything about rust and Cybertrucks.\" Another owner, “Vertigo3pc,” also noted the formation of corrosion on their Cybertruck’s metal and has taken the vehicle to a Tesla service center for inspection. Tesla did not immediately respond to Benzinga's request for comment. See Also: Cybertruck Owners, Take Note: Stainless Steel Exteriors May Change Color Over Time — Tesla Advises These Quick Fixes The rusting issue is particularly concerning given that Tesla CEO Elon Musk had previously touted the Cybertruck’s stainless steel body as “literally bulletproof.” Musk had even suggested the possibility of offering a tungsten carbide coating to protect the truck from corrosion. Why It Matters: The rusting problem adds to the list of concerns regarding the Cybertruck’s stainless steel body. In January, it was reported that the Cybertruck’s exterior could change color and reflective properties as the stainless steel matures, according to the vehicle’s owner’s manual. The recent rusting complaints further highlight the potential drawbacks of the Cybertruck’s unique material. The Cybertruck’s rusting issues come at a time when the vehicle is gaining significant attention. Tesla recently showcased the Cybertruck at the Chicago Auto Show for public viewing, marking its debut at a major auto show. The vehicle is also expected to strengthen Tesla’s reputation for producing vehicles with significant American-made content. Despite these concerns, Tesla has been making efforts to improve the Cybertruck. In January, Musk announced that the company is working on certain improvements to the Cybertruck, which will further lower its turning radius. Read Next: ‘Elon Musk Would Probably Disagree,’ But Expert Says ‘Investors Don’t See Tesla As An AI Play Like Most Of The Other Magnificent Seven Stocks’ Tesla Cybertruck. Photo courtesy: Tesla Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}