{
    "title": "Tesla employees claim they've been told to expect pay raises as UAW \norganizes company's plants: 'They still fall far short'",
    "date": "2/18/2024",
    "url": "https://www.thecooldown.com/green-business/tesla-pay-raises-factory-workers-uaw/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. Tesla sits firmly in the union's sights after contentious disputes with workers abroad. Photo Credit: iStock Electric vehicle maker Tesla has promised pay raises for factory workers, reported the Independent. As America's leading EV maker aims to attract and retain top talent, the United Auto Workers union is simultaneously ramping up efforts to organize Tesla's United States plants. While details remain unclear, Tesla employees report that 2024 will deliver a \"market adjustment\" to compensation. This comes on the heels of near-across-the-board pay increases at non-union auto plants after UAW contracts were renewed. The potential Tesla pay bump promises a win-win for workers and the environment. Employees can spend their raises however they choose, while each new Tesla vehicle means less planet-warming pollution poisoning our air. Because EVs are cleaner than their non-electric counterparts and often cheaper to own over time, sales benefit everyone who breathes air — that's 100% of humans. The pay raises also arrive amid a broader labor landscape shift. As UAW president Shawn Fain said, compensation at non-union automakers falls short of union plants. The UAW now looks to organize over a dozen non-union U.S. auto plants, eyeing household names from Volvo to BMW. Tesla sits firmly in the union's sights after contentious disputes with workers abroad. For example, over 30% of Alabama Mercedes workers are already backing organizing. Critics argue that Elon Musk's anti-union posture contradicts Tesla's mission to accelerate sustainable energy. As companies like Tesla continue to address worker needs, Americans considering an EV can rest easier knowing skilled, well-compensated laborers assemble their cars. The key players ensure this EV trend stays mutually beneficial. Workers get the wages they work toward. Companies retain and reward skilled employees. Consumers access affordable, planet-friendly vehicles. And the environment we all share keeps running cleaner when more drivers go electric. According to Fain, recent raises at non-union automakers were likely given in an effort to thwart union organizing efforts. \"As great as these raises are, they still fall far short of what the companies can afford and what autoworkers are worth,\" Fain said in a statement. Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}