{
    "title": "Ford EV “skunkworks” team is led by a Tesla alumni",
    "date": "2/7/2024",
    "url": "https://www.teslarati.com/ford-ev-skunkworks-team-led-by-tesla-alumni/",
    "text": "Ford CEO Jim Farley noted during the automaker’s Q4 2023 earnings call that the company has a dedicated “skunkworks” team that has been developing a new electric vehicle platform focused on cost reduction. Recent reports have now indicated that Ford’s skunkworks team is being led by an alumni from Tesla, Alan Clarke. Clarke’s position in Ford’s EV skunkworks team was initially mentioned in a TechCrunch report. A look at Clarke’s LinkedIn page seems to confirm his role in the veteran automaker, as he is currently listed as an Executive Director Advanced EV Development at Ford. Clarke’s LinkedIn page indicates that he had worked at Tesla for over 12 years, starting as a Senior Design Engineer in September 2009 and departing the automaker in January 2022 as a Director of New Programs Engineering. Considering his long tenure at the Elon Musk-led electric vehicle maker, Clarke definitely seems to be a good fit to lead Ford’s EV skunkworks team. Apart from Clarke’s tenure at Tesla, TechCrunch‘s report also noted that Ford’s skunkworks team includes engineers from Auto Motive Power (AMP), which was acquired by the veteran automaker in November 2023. Interestingly enough, AMP founder Anil Paryani is also an alumnus of Tesla. Paryani’s LinkedIn page indicates that he worked for Tesla as a Senior Engineer for over five years, from September 2007 to March 2013. The role of Ford’s EV skunkworks team is expected to be substantial in the coming years. As noted by Farley during Ford’s Q4 2023 earnings call, the company’s Gen 2 electric vehicles would be designed to reach profitability in the first 12 months of their launch. This should help make Ford’s electric vehicle business more profitable, and thus, more sustainable. “We made a bet in silence two years ago. We developed a super-talented skunkworks team to create a low-cost EV platform. It was a small group, small team, some of the best EV engineers in the world, and it was separate from the Ford mothership. It was a startup. And they’ve developed a flexible platform that will not only deploy to several types of vehicles but will be a large installed base for software and services that we’re now seeing at Pro,” Farley said. Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}