{
    "title": "Tesla, Rivian shares slide amid worries of broad EV slowdown",
    "date": "2/12/2024",
    "url": "https://finance.yahoo.com/video/tesla-rivian-shares-slide-amid-203845489.html",
    "text": "EV stocks Tesla (TSLA) and Rivian (RIVN) slide lower as automakers experience slowing EV demand, affordability being just one barrier of entry for most consumers. Barclays analysts have downgraded Rivian shares to Equal Weight. Yahoo Finance Live gauges how big of a factor vehicle pricing is playing into forecasts of a potential EV winter. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. - All right. Finally, here let's check out Wall Street's mood. Souring on EV makers as pressure builds amid broader EV slowdown. Shares of Rivian, Tesla sliding. Barclays points to demand softness implying a pricing risk for Rivian. So this was an interesting note, Julia, on Rivian. So the team at Barclays, it's certainly worth pointing out, they cut Rivian to equal weight, so equivalent of a hole there. And analysts were interesting because they said actually, they told their clients, the company's vehicles are great. It's the word, they used. They like them, but what they see is just demand softness being an issue. Implies risk, the analyst told his clients are pricing, slower volume growth, and longer path to break even. His price target, 16. - And there are also continued reports about Tesla cutting prices of its vehicle, of its Model Y, rear wheel drive, but at the same time prices could go up by $1,000 or more on March 1. But that headline about the cutting, I mean, as we've talked about with multiple analysts, from a fundamental perspective, one of the near to moderate term concerns is the margins at Tesla. And so if it's going to keep cutting prices, that's not great news for the margins. So it's a combination of speculation around the name and some fundamental concerns that have been hitting the stock. - Yeah. I mean, listen, Musk has been clear, he's willing to cut prices and he wants to play the volume game. Because you're trying to just spur demand in a market where EV sales we have, we've been talking about, are just slowing, they're not where they were. And then the interesting question is, how do you try to re-accelerate growth. First of all, can you even get back to the growth that you once had, and if you do, what is the challenge there? Is it really just a pricing issue. - Well, and he would say, of course, that part of the investable case for Tesla is AI and full self-driving, and on that latter point just briefly, in some markets, and on some distribution channels like YouTube, during the Super Bowl, there was someone who has been a very vocal critic of Tesla, Dan O'Dowd, whose organization ran ads questioning the safety of full self driving. Whether that's any, playing into at all what's going on with the stock today, who knows? But that's just something else, again, that's on more of the speculative. - Yeah, it got attention and headlines, for sure. - Yeah, definitely. Related Quotes "
}