{
    "title": "Elon Musk promises to 'make things good' with California bakery after Tesla \ncancels $16K pie order at last minute",
    "date": "2/24/2024",
    "url": "https://nypost.com/2024/02/24/business/elon-musk-to-make-things-good-with-california-bakery-the-giving-pies-after-tesla-cancels-16k-pie-order-at-last-minute/",
    "text": "Thanks for contacting us. We've received your submission. Elon Musk vowed to do right by the San Jose bakery that claimed it was left thousands of dollars in the hole after Tesla canceled a pie order worth $16,000 at the last minute. “Just hearing about this. Will make things good with the bakery,” Musk posted on his platform X Friday afternoon. “People should always be able to count on Tesla trying its best.” The Giving Pies owner Voahangy Rasetarinera, whose bakery is a favorite spot in Silicon Valley, said Tesla placed an order for 2,000 mini-pies on Valentine’s Day for an event commemorating Black History Month. She sent Tesla a quote for the massive order, which the company rep approved, and started working on the order, revealing she also declined at least three other catering jobs to fulfill the order. Tesla’s vendor, City Flavor, did not send payment, prompting Rasetarinera to send a follow-up text to the company the next day. Upon requesting payment, she was given an apology and told the vendor was “kind of new.” She was then asked if her bakery could “double to order” to 4,000 mini-pies to which Rasetarinera agreed. However, the business owner claimed the company abruptly canceled the order through text just as the pies were set to be sent out. When she asked why the order was canceled, she was told the decision came from upper management. The last-minute cancellation left Rasetarinera’s business at a loss of around $16,000. “This abrupt reversal left me reeling, realizing the extent of the impact on my small business,” Rasetarinera wrote on her bakery’s Facebook page. “I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry.”When she inquired with Tesla about the cancellation, she was told the decision came from upper management. While The Giving Pies may have been cheated by the electric car company, residents in the community showed up in droves Friday to support the small business. “It’s hard for these non-chain type places to survive. So I thought, I would come over and support. Pies look great,” Eric, a local resident, told NBC Bay Area while waiting in a long line to get the last pies for the day made for Tesla. “I thought it was terrible. Here, they do a nice business with a great product, and they give some of it away to help people,” David, a San Jose resident, said, sharing that he went to the bakery twice Friday to show his support. “Tesla comes and orders 4,000 pies and squashes the order. It’s disgusting.” Rasetarinera was taken aback by the turnout and told the outlet that her business had tripled since the incident. “I feel super grateful and super supported,” she said, sharing that her shop has also been receiving orders worldwide. “People placing orders like ‘I live in Canada, I just want to support you.’ They place an order and say ‘Just give it to anybody.’” It’s unclear what the CEO’s plans are for making things good with the bakery. Rasetarinera, however, told the outlet Friday evening that she has not heard anything from Musk. Advertisement "
}