{
    "title": "Senator Warren urges SEC to investigate Tesla over board independence",
    "date": "3/24/2024",
    "url": "https://www.foxbusiness.com/politics/senator-warren-urges-sec-investigate-tesla-over-board-independence",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy CFRA Vice President and senior equity analyst Garrett Nelson explains why hes buying Tesla stock after it dropped 31% since the start of 2024 on Varney & Co. Senator Elizabeth Warren, D-Mass., sent a letter to the Securities and Exchange Commission (SEC) last week urging the financial regulator to investigate Tesla's board of directors for conflicts of interest with CEO Elon Musk. Warren's letter comes as a follow-up to a July 2023 letter she sent to the SEC calling for Elon Musk and the board to be investigated due to what she said was the board's \"failure to address possible misappropriation of Tesla resources and conflicts of interest arising from Mr. Musk's dual role at Tesla and X – renamed from Twitter.\" \"New evidence has emerged in recent months that deepen my concerns that Tesla's Board lacks independence from Mr. Musk, who uses his control over the Board for his personal benefits, rather than in the best interest of Tesla's shareholders,\" Warren wrote. \"This is important information for SEC's consideration.\" She went on to say that Musk has \"exerted a high degree of control over the Tesla Board\" and noted the Delaware Court of Chancery ruling that the board had breached its fiduciary duties by approving Musk's $56 billion compensation plan at Tesla. ELON MUSK'S $56 BILLION PAY PACKAGE VOIDED BY JUDGE Senator Elizabeth Warren sent a letter to the SEC calling for an investigation of Tesla CEO Elon Musk and his relationship to the Tesla board of directors. (Photo by Chip Somodevilla/Getty Images / Getty Images) The court's ruling voided the pay package after finding that Musk \"enjoyed thick ties with the directors tasked with negotiating on behalf of Tesla, and dominated the process that led to board approval of his compensation plan\" and that \"Musk controlled Tesla\" through his relationships with board members, some of which dated back over 15 years. \"A clear, years-long pattern has emerged where the Board has failed to adequately address conduct by Mr. Musk that may harm Tesla shareholders,\" Warren wrote. The senator went on to note that the Tesla board took no action when Musk publicly said he would be uncomfortable growing the EV-maker as a leader in artificial intelligence (AI) and may divert AI product development away from Tesla unless he had about 25% voting control at the company. ELON'S EXODUS: TRACKING MUSK'S BUSINESS INCORPORATION STATE CHANGES Tesla CEO Elon Musk's $56 billion pay package was voided by a judge. (Photo by Michael M. Santiago/Getty Images / Getty Images) She also noted that Tesla board members have financial interests in Musk's privately-held companies like X, formerly Twitter, and AI startup xAI – a situation she said raises \"further concerns\" about the board's independence in cases when \"Musk positions the interests of Tesla against that of his own companies\" as he did in the post about Tesla and AI development. \"The Board has a legal obligation to address and disclose business risks, such as financial conflicts of interest or other risks to the Board's ability to remain independent. Despite the growing concerns by Mr. Musk's conflicting roles at Tesla and his private companies, the Board appears to have taken no action to address these risks or protect its shareholders,\" she wrote. \"By all appearances, it seems that the Board continues to operate as if Mr. Musk is the 'Technoking' who can do no wrong.\" LAWYERS WHO VOIDED ELON MUSK'S 'EXCESSIVE' TESLA PAY PACKAGE WANT $6 BILLION FEE Tesla's board is facing scrutiny over members' ties to CEO Elon Musk. ((Photo by Smith Collection/Gado/Getty Images) / Getty Images) Tesla did not immediately respond to a request for comment. Elon Musk responded to news of Warren's letter in a post on X, formerly Twitter, in which he noted that one of the senator's advisors is the father of former FTX CEO Sam Bankman-Fried, who is currently serving a prison sentence for fraud following the implosion of his crypto exchange. GET FOX BUSINESS ON THE GO BY CLICKING HERE Musk wrote on X that, \"Senator Karen's main economic & tax advisor is SBF's Dad. I suspect some of this is coming from him.\" Reuters contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}