{
    "title": null,
    "date": "3/9/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/03/37573152/tesla-investors-mock-elon-musks-comments-about-rivian-rj-doesnt-sleep-at-the-factor",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla investors Gary Black and Ross Gerber mocked the EV giant’s CEO Elon Musk on Friday for his comments on rival EV maker Rivian Automotive. What Happened: “RJ (Rivian CEO RJ Scaringe) doesn’t sleep at the factory…,” Ross Gerber wrote on X on Friday after fellow investor Gary Black predicted that Rivian could achieve 526,000 deliveries and EBITDA of $2.5 billion in 2030 if it can stick to its current plans. “Maybe that's a good thing,” Black replied to Gerber. While Gerber is the president and CEO of Gerber Kawasaki Wealth and Investment Management, Black is the Managing Partner at The Future Fund. Musk’s Take: The two investors were referring to Musk’s comments from last month when he opined that Rivian executives must sleep at its factory and spend more time there if they are to avoid imminent bankruptcy. Musk also suggested that they cut costs after he predicted the company to go bankrupt in about six quarters given its current trajectory. While acknowledging Rivian's decent product design, Musk emphasized the challenges of achieving volume production and positive cash flow in the automotive industry. Musk has talked about the team at Tesla including himself sleeping at the factory on days to dedicate more time and attention to the production process. Analyst Take: Contrary to Musk’s opinions, both Gerber and Black are optimistic about Rivian. Black predicts a Tesla-like turnaround for the startup ever since it announced its new and cheaper electric vehicles. According to Black, Rivian's shares could be worth $67 apiece by 2030 on applying a 3.5 times EV/revenue multiple – equivalent to Tesla. While discounting the stock price at a 14.1% equity discount rate, the net present value of the stock would be $30 per share, suggesting a 136% upside potential. Gerber, too, is optimistic. “I think Rivian's going to make it. They just need a tremendous amount of capital, and that’s why the stock is down. But the brand is an excellent brand and people love it,\" he said in a recent interview. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Elon Musk Cracks Up As Tesla FSD Testing Raises Concerns Of A Cult In Florida Neighborhood: ‘It Must Look Pretty Weird’ Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}