{
    "title": "Wall Street rebounds but early gains pared as Microsoft and Tesla fall",
    "date": "3/6/2024",
    "url": "https://www.proactiveinvestors.com.au/companies/news/1042534/wall-street-rebounds-but-early-gains-pared-as-microsoft-and-tesla-fall-1042534.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Oliver has been writing about companies and markets since the early 2000s, cutting his teeth as a financial journalist at Growth Company Investor with a focusing on AIM companies and small caps, before a few years later becoming a section editor and then head of research. He joined Proactive after a couple of years freelancing, where he worked for the Financial Times Group, ITV, Press Association, Reuters sports desk, the London Olympic News Service, Rugby World Cup News Service, Gracenote... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Last updated: 08:20 07 Mar 2024 AEDT, First published: 23:47 06 Mar 2024 AEDT US stocks rebounded on Wednesday, led by a surge in the tech sector, following Federal Reserve Chair Jerome Powell's indication that interest rate cuts remain on the table for this year. At the close, the Nasdaq rose nearly 0.6% to hit 13,062 points, reversing losses from the previous day's sell-off. Both the S&P 500 and the Dow Jones Industrial Average also recovered, gaining 0.5% and 0.2% respectively, after experiencing declines of over 1%. The S&P closed at 5,102 and the Dow closed at 38,661. Powell's testimony to Congress is anticipated to provide further guidance, particularly regarding the timing of potential rate cuts, as investors seek clarity amidst recent market volatility. Shares of NYCB are now sailing higher after trading resumed after the trading halt was lifted, up almost 19% to $3.80. That is still down 63% from the start of the year, though. More details on the investment, which involves another change of CEO for NYCB, after it parted ways with former boss Thomas R. Cangemi last Friday after 27 years with the company and moved Sandro DiNello from non-executive chairman to CEO. DiNello will be moved back to non-exec chair, with Joseph Otting, former Comptroller of the Currency and former OneWest Bank CEO, moved into the CEO role. Otting is twice over a former colleague of Steve Mnuchin, whose Liberty Strategic Capital has agreed to invest $450 million as part of the investment package. The pair worked together at the Treasury Department and at OneWest, which was founded by Mnuchin. This has not boosted the Dow Jones, which is now almost flat at 38,630. The S&P 500 and Nasdaq Composite are up 0.4% and 0.5%. Gains for New York's main stock indexes have petered out somewhat after some banking sector drama, with New York Community Bancorp (NYSE:NYCB) crashing 42% on the back of a report that it had put out feelers about a potential capital raise. The Wall Street Journal report came out just before midday and sent shares in the regional lender plunging, while other regional lenders only fell around 3-4%. It forced trading of the stock to be halted on the New York Stock Exchange. But there was a quick validation of the WSJ report from the company, not only that, it said it has secured more than $1 billion of investment from a group of investors, and added four new directors to its board, including former treasury secretary Steve Mnuchin. Mnuchin's Liberty Strategic Capital has agreed to invest $450 million, Hudson Bay Capital $250 million, and Reverence Capital Partners $200 million, with investment also from Citadel Securities, other institutional investors and certain members of the management team. In a statement from NYCB, Mnuchin said: \"In evaluating this investment, we were mindful of the bank's credit risk profile. With the over $1 billion of capital invested in the bank, we believe we now have sufficient capital should reserves need to be increased in the future to be consistent with or above the coverage ratio of NYCB's large bank peers.\" The Dow Jones has dipped into the red, while the gains on the S&P 500 and Nasdaq are down to 0.3% and 0.4%. Wall Street shares are back in optimistic mode again, with the Nasdaq bandleading at the head of the march. The tech-powered index is up 167 points or 1.05% at just over 16,107, led by more advances for NVIDIA Corp (NASDAQ:NVDA, ETR:NVD) and other chipmakers such as AMD. Meanwhile, the broader S&P 500 is 0.9% higher and the Dow Jones has gained 0.5%. A big faller is Foot Locker, Inc. (NYSE:FL), tumbling 31% after the sneaker seller profit guidance disappointed, following increased markdowns to reduce inventory at the end of the year. This meant investors ignored fourth-quarter results that came in better than expected. The main US stock indexes have opened higher as expected, though early gains are already being pared. In early trades, the S&P 500 and Nasdaq Composite both climbed over 0.5%, while the Dow Jones was up 0.4%. But after half an hour of trading, the Nasdaq's gains were down to 0.25%, with the other pair's at 0.3%. A third day of losses for Tesla Inc (NASDAQ:TSLA, ETR:TL0) were joined by further slides for Apple Inc (NASDAQ:AAPL, ETR:APC) and Microsoft Corp (NASDAQ:MSFT), which was hit by reports that an in-house engineer had warned the company’s AI Copilot Designer image tool is \"not safe\" as it creates violent images and ignores copyrights. Gains were being aided by NVIDIA remaining in green, along with a solid rise for Meta Platforms. In macro news, the ADP Research Institute says the US added 140,000 jobs last month, with wage acceleration for the first time in a year. \"While employment growth was steady, year-over-year pay gains for job-changers accelerated for the first time in more than 12 months, rising to 7.6% from 7.2%\". In other macro news, Federal Reserve chief Jerome Powell is speaking to Congress today, where he will tell them that rates cuts are coming, just not for a few months. Elsewhere, the Bank of Canada left rates unchanged, with governor Tiff Macklem stating: \"It's still too early to consider lowering the policy interest rate\". This is considerably more hawkish than many expected. In prepared remarks released ahead of his appearance before the House Financial Services Committee today, Fed head Jerome Powell acknowledged the recent strength of activity and employment growth while noting that, although inflation has “eased notably over the past year”, it remains above the Fed’s 2% target. Powell repeated his claim from the January FOMC press conference that rate cuts are likely to be appropriate “at some point this year”, which was noted by analysts to be in contrast with claims heard in other fed speakers in recent weeks that rates cuts are more likely to be later this year. Powell repeated the guidance that the Fed still wants “greater confidence” that inflation is coming down sustainably to 2% before they would feel comfortable easing policy. He may reveal more under questioning from lawmakers later today, said Andrew Hunter at Capital Economics, where the view is that the Fed is likely to start cutting rates in June. \"We still believe that the stronger rise in core consumer prices in January will prove to be noise rather than a genuine turning point. \"And although we expect the recent strength of employment growth to have continued in February with non-farm payrolls rising by an above-consensus 250,000 (data due on Friday), the wider evidence suggests that wage growth will remain on a downward trend. \"The upshot is that we still see the first rate cut coming in June and scope for rates to then be lowered a bit more quickly than markets are pricing in,\" said Hunter. Other Fed speakers today include San Francisco Fed president Mary Daly and Minneapolis Fed president Neel Kashkari. US stocks are expected to start on the front foot on Wednesday, led by a slew of cybersecurity stocks in the back of a confident update from CrowdStrike. Ahead of Wednesday's opening bell, futures were pointing to the tech-powered Nasdaq rising 0.77%, with the S&P up 0.44% and Dow 0.27%. Later we will hear from Federal Reserve chair Jerome Powell as he delivers his biannual testimony to Congress's House Financial Services Committee on Wednesday, with another chin-wagging session for the Senate Banking Committee on Thursday. Tech supergiants had led the decline on the not-so-magnificent Tuesday, with the Nasdaq Composite index down 1.65%, and both the S&P 500 and Dow Jones falling just over 1%. \"Momentum in US equities has come to a halt in the short-term,\" said market analysts at Saxo Bank, driven by losses across the Magnificent Sevent stocks. \"In today’s session will focus on whether US equities will continue to roll,\" they added. CrowdStrike shares are up 23% premarket, after it reported fourth-quarter earnings last night, beating expectations, as well as delivering strong earnings guidance. Cybersecurity stocks were also lifted by this. New York-listed Chinese electric car maker NIO Inc (NYSE:NIO) also reported earnings last night after the US market close, with Q4 revenue beating estimates while gross margin and earnings disappointed as the EV price war has taken its toll on profitability. Its shares are down 0.9% premarket. Those in another Chinese stock, JD.com Inc (NASDAQ:JD), are up 12% on its earnings that are out pre-US market open showing better-than-expected sales in the fourth quarter and with a $3 billion buyback launched by the online retailer. In macro news, MBA mortgage applications and ADP jobs reports are out this morning, and the Fed's Beige Book of economic anecdotes will be released at 2pm. MBA mortgage applications in March grew 9.7% versus a decline of 5.6% last time. U.S MBA MORTGAGE APPLICATIONS (WOW) ACTUAL: 9.7% VS -5.6% PREVIOUS\n\r\nU.S MBA 30-YEAR MORTGAGE RATE ACTUAL: 7.02% VS 7.04% PREVIOUS\n\r\nU.S MORTGAGE REFINANCE INDEX ACTUAL: 428.1 VS 395.9 PREVIOUS\n\r\nU.S MORTGAGE MARKET INDEX ACTUAL: 188.2 VS 171.5 PREVIOUS\n\r\nU.S MBA PURCHASE INDEX… Sign up to receive alerts and news direct to your inbox Rowena Smith, CEO and managing director of Australian Strategic Materials Ltd (ASX:ASM, OTC:ASMMF), joins Jonathan Jackson in the Proactive studio to discuss the company’ s Dubbo Project, in Central West New South Wales. This project aims to extract and process critical minerals and rare earth... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive Australia PTY LTD ACN:132787654 ABN:19132787654. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}