{
    "title": "Is India doing enough to woo Tesla?",
    "date": "3/27/2024",
    "url": "https://www.dtnext.in/edit/is-india-doing-enough-to-woo-tesla-776619",
    "text": "MORE Elon Musk and Prime Minister Narendra Modi By Murali Krishnan Tesla has long eyed the Indian market, but it didn't want to invest in local production until the government addressed tariff-related issues. Prime Minister Narendra Modi's government approved a new policy for electric vehicles (EVs) this month, offering to lower import tariffs on e-cars for automakers that invest at least $500 million (461.5 million euros) to set up manufacturing units in the South Asian country and begin production in three years. The carmakers are also required to source at least a quarter of their components locally, to begin with. And within five years, the share of local components will have to double. Companies that meet these requirements will be allowed to import 8,000 EVs a year by paying a lower customs duty, equivalent to about 15% of the cost of the vehicle, far lower than the 60-100% tariffs the government imposes otherwise. The move is seen as a part of the government's efforts to fast-track the country's green transition and reduce its carbon footprint. \"We want to drive positive change in India's EV landscape and unlock opportunities for industry stakeholders as well as speed up the country's journey towards sustainable transportation solutions,\" a senior government official told DW. Authorities hope the policy change will lure foreign EV makers like Tesla to set up plants in India. Tesla has long eyed opportunities presented by the Indian market, but it didn't want to invest in local production until the government addressed tariff-related issues and the company gauged market sentiment. \"This policy is designed to attract global investments to promote local manufacturing with adequate value addition and to specifically build the e-car manufacturing,\" Anumita Roychowdhury, executive director at Center for Science and Environment, told DW. Vietnamese automaker VinFast has already announced plans this year to spend up to $2 billion to build an electric vehicle factory in India. Local carmakers like Tata Motors and the Mahindra Group had been against tariff cuts for foreign players. They will now have to brace for increased competition, said Roychowdhury. \"This move should stimulate competition for the front runners in the Indian market and spur those domestic players who are still fence-sitting on electrification,\" she underlined. A growing market with vast potential India, the world's third-largest auto market by sales, is also one of the fastest-growing EV markets. But more than 90% of its 2.3 million electric vehicles are cheaper and more popular motorbikes, scooters and rickshaws. Modi's government has launched a $1.3 billion program to encourage EV manufacturing and sales, as part of the efforts to foster a competitive domestic automaking industry and create manufacturing jobs. It's also a part of New Delhi's efforts to slash carbon emissions to net zero by 2070. The government wants EVs to make up 70% of sales of commercial cars and trucks, and 30% of private cars by 2030. According to the Economic Survey 2023, published by the Finance Ministry, India's EV market will see a 49% compound annual growth rate between 2022 and 2030, with about 10 million annual EV sales projected by 2030. The industry is estimated to create around 50 million direct and indirect jobs in the next seven years. But for this to happen, progress has to be made to create a full-electric ecosystem, including the development of high-performing and cost-effective EVs as well as adequate charging infrastructure, among other things. \"Foreign investments will initially happen in the high-end cars as that market is still smaller in India. But the new players will also get into the affordable car space and that can create opportunities for the local models,\" Roychowdhury said. \"We need additional strategies to scale up the market demand.\" The Society of Indian Automobile Manufacturers (SIAM) said the Indian automobile industry and its members will adapt to the new policy. \"The EV policy is one of the multiple policy initiatives that the government has announced over the past few years to reduce dependence on petroleum and promote green mobility,\" Dilip Chenoy, former director general of SIAM, told DW. \"This policy would certainly act as a catalyst to spur those manufacturers that have India as part of their growth plans to look at manufacturing in India.  © Copyright  | Powered by Hocalwire "
}