{
    "title": "Tesla a “growth company with no growth” – broker | NASDAQ:TSLA, ETR:TL0",
    "date": "3/13/2024",
    "url": "https://www.proactiveinvestors.com/companies/news/1043106/tesla-a-growth-company-with-no-growth-broker-1043106.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Leo joins us with a degree in Media Production from Bournemouth University. His work includes reporting for the UK editorial team and video editing for the broadcast team.\r\n\r\nHe comes with an expertise in video editing and producing. Leo’s specialities include hospitality and leisure, support services, tech and video games.\r\n Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 14:38 13 Mar 2024 EDT Tesla Inc (NASDAQ:TSLA, ETR:TL0) shares have dropped more than 4% on Wednesday after analysts labelled it a “growth company with no growth”. Musk’s electric vehicle business saw its stock rating downgraded to the equivalent of a “sell” rating by Wells Fargo, leading to it shedding more than £11 billion in market value and taking the share price to the lowest point since May. Wells Fargo believes Tesla’s tactic of cutting the prices of its cars to increase demand was losing its effectiveness. The US bank pointed to the company’s marginal 3% lift in volumes during the first half of 2023, which came despite Tesla having cut prices by 5%. Earlier this week, Elon Musk visited Tesla‘s German gigafactory on Wednesday after an arson attack last week left the plant without power for days. Power was restored on Monday following the attack on a nearby power pylon, which halted production at the Tesla plant. Tesla shares have tumbled more than 31% in 2024 and its downturn has led to it falling out of the top ten rankings for the largest stocks in the world. With a market cap of over US$542 billion, the car maker is now smaller than JP Morgan Chase, Visa, Broadcom and Novo Nordisk (NYSE:NVO).  Sign up to receive alerts and news direct to your inbox Hive Digital technologies Executive Chairman Frank Holmes joined Steve Darling from Proactive to share details about the company's engagement with NVIDIA, a pivotal player in the GPU market, particularly in Ethereum mining and the broader digital transformation landscape. Holmes highlighted... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive North America Inc., Proactive Investors LLC. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}