{
    "title": "Elon Musk Dragged Into Fresh $6B Lawsuit Post-OpenAI Brawl",
    "date": "3/3/2024",
    "url": "https://coingape.com/elon-musk-dragged-into-fresh-6b-lawsuit-post-openai-brawl/",
    "text": "News Markets Cryptoguru Collection Contact Follow us on: TRENDING TODAY After initially pushing that Elon Musk‘s $55.8 billion pay package be thrown out, the same lawyers for a Tesla Inc. investor Richard Tornetta, are asking for Tesla shares. Precisely, on Friday these lawyers requested that their legal fees be paid in the form of about $6 billion of stock in the electric-car maker. Concerning the current market value of Tesla shares, their request is worth an hourly rate of $288,888. These lawyers are from three firms; Bernstein Litowitz Berger & Grossmann Friedman Oster & Tejtel, both based in New York, and Andrews & Springer of Wilmington. They had previously contested Musk’s pay package when he was sued by Tornetta in 2018, claiming that it is quite excessive. According to the three firms’ Friday filing with the court of chancery in Delaware, they tried to explain why they deserve stock rather than cash. “We recognise that the requested fee is unprecedented in terms of absolute size.” “This structure has the benefit of linking the award directly to the benefit created and avoids taking even one cent from the Tesla balance sheet to pay fees. It is also tax-deductible by Tesla,” the lawyers added in the filing. Noteworthy, these lawyers are making this request of the electric car maker because Tesla benefitted from the return of Musk’s pay package. The legal team is very positive that the pay package will result in the return of up to 266 million shares to the carmaker. Meanwhile, Musk has other pending lawsuits with Sam Altman and his Artificial Intelligence (AI) OpenAI. He is suing the AI company for a breach of agreement amid concerns about profit-driven AI development. For context, the lawsuit claims that OpenAI has drifted towards commercial interests, particularly with tech giant Microsoft. This contradicts its original mission of developing AI for the benefit of humanity. Agreeing to a settlement in a lawsuit has never been a challenge for Musk, as was seen in the case of a lawsuit by former Twitter employees who claimed that they didn’t receive severance pay during a mass layoff. However, he feels that Tornetta’s lawyers are asking for too much. After the filing was made, the Tesla boss took to X to respond to the bold request of the lawyers. In his opinion, these legal representatives did nothing other than damage Tesla. He referred to them as “criminals” for wanting to receive shares in the company. Ann Lipton, a corporate law professor at Tulane University, shared her stance on the filing. “Now, to be fair, the case involved the largest compensation award ever to an executive,” she said, highlighting how substantial the claim is. In the meantime, the request for $6 million worth of Tesla shares is subject to approval by Judge Kathaleen McCormick, who had previously referred to Musk’s pay package as unfathomable. AI Education on Steady Rise as Job Market Prepares for Greater Influence SlowMist Founder Shares Key Tips on Wallet Signature Security DAILY NEWSLETTER Your daily dose of Crypto news, Prices & other updates.. Top News Cryptocurrency Prices Popular Coingape Academy Blogs Popular Categories Exclusive Contact Exclusive Contact Close "
}