{
    "title": "Tesla slashes electric car range amid claims it exaggerated mileage",
    "date": "1/5/2024",
    "url": "https://ca.finance.yahoo.com/news/tesla-slashes-electric-car-range-171243019.html",
    "text": "Tesla has cut back claims about how far its electric cars can travel as it faces scrutiny from the US government. Elon Musk’s company has reduced the estimated range of several cars on its US website by as much as 37 miles. Tesla, which was this week overtaken by China’s BYD as the world’s best-selling electric car manufacturer, did not give a reason for the adjustment. However, the US Department of Justice has been investigating Tesla’s range claims amid concerns they may be exaggerated. Tesla updated its website to say that its Model Y Performance vehicle has a range of 285 miles, down from its previous 303-mile claim. Meanwhile, the Long Range model has been cut from 330 miles to 310. One version of its luxury Model S car has seen its estimated range reduced from 396 miles to 359 miles. In October, Tesla said it had received legal requests from the Department of Justice over issues including vehicle range. Tesla did not publicly say why it had changed the range estimates. According to internal company documents reviewed by the Drive Tesla website, the changes are in response to new testing conditions from US regulators, and “comfort and functionality improvements” that require more energy from the battery. Tesla has faced questions over its cars’ ranges, a key selling point for electric vehicles as their manufacturers seek to avoid the “range anxiety” that deters many drivers. An investigation by the Reuters news agency last year claimed that Tesla often exaggerated ranges to attract drivers, while the US organisation Consumer Reports found that Tesla cars were among those whose ranges fell short of what was claimed. Tesla owners have sued the company in the US over false advertising related to the range claims. The company has responded to the lawsuits, calling the Reuters investigation “error-ridden” and the lawsuits “legally untenable”. Tesla has not reduced its range claims in other countries, such as the UK, which uses a different testing regime. Separately, Tesla was forced to issue a recall to 1.6m cars in China to fix its Autopilot system, which steers and accelerates automatically. A regulator in China said Tesla would make the changes through a software update issued to the vehicles. It covers almost every Tesla vehicle sold in China since 2014. It comes the month after Tesla was forced to update its Autopilot system to more than 2m cars in the US. The company has not been required to make any changes in the UK. Regulators have launched investigations into Autopilot after dozens of crashes, some of them fatal, in which the technology was activated. The system warns drivers that they should have their hands on the wheel and pay attention to the road when it is activated, but Mr Musk has been criticised for over-stating the cars’ ability to drive themselves. This week, China’s BYD surpassed Tesla as the world’s best-selling electric car maker, after selling 526,409 cars in the fourth quarter of 2023 against Tesla’s 484,507. Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month, then enjoy 1 year for just $9 with our US-exclusive offer. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented.  Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia.  \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o  They soft-launched their relationship at the supermodel's cookbook event in Miami. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company. 2024 Subaru Crosstrek Review, Pricing, and Specs The president mocked his campaign rival for doing the one thing he claimed he wouldn’t have time for. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" "
}