{
    "title": "Elon Musk's price war with Tesla killer BYD claims next victim as Renault \ncancels IPO for its EV startup",
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/news/elon-musk-price-war-tesla-142932476.html",
    "text": "The debilitating year-long price war instigated by Tesla CEO Elon Musk in his ongoing quest for leadership of the EV industry has claimed its latest victim. After both his company and archrival BYD reported disappointing quarterly profits despite record vehicle sales, French carmaker Renault abandoned its 2022 plan to spin off and float its EV unit Ampere on the stock market. Group CEO Luca de Meo acknowledged it would have been foolish to ignore the obvious reality of waning investor enthusiasm for new EV stocks. “It’s one of the elements,” he told reporters on Monday, claiming Renault had the financial wherewithal to internally fund Ampere’s operations until its 2025 breakeven target. That includes this autumn’s key launch of the electric Renault 5 subcompact, a nameplate that carries a lot of history for the brand. But De Meo also made little effort to hide his scorn for Wall Street investors who first hyped EV manufacturers into the stratosphere, before rushing to dump them overboard. “There is a [pendulum] swing to the other side for EVs, which I consider honestly pretty childish,” he said, “because three years ago everyone was telling us if we would not go 100% EV we would be a bunch of zombies in 10 years and now everyone is telling us we shouldn’t.” Renault will now enter into discussions with Nissan and Mitsubishi over whether the two alliance partners would still like to invest in Ampere as part of a bilateral deal rather than the IPO as was planned. In a sign that nerves are running thin in the EV sector, speculation emerged that Renault might not be the only company canceling plans for an IPO. Bloomberg reported sources alleging that Volkswagen Group’s PowerCo battery unit would nix its plans to float on the stock exchange. Volkswagen denied the report, claiming an IPO remains an “option in the future” but was never on the cards for this year. In the past officials have said they first felt PowerCo had to deliver tangible progress on its extensive EV battery cell plans, potentially with the aid of a major external investor, before it would make any sense to take the company public. Nevertheless, it, too, conceded the euphoria surrounding EV demand had cooled dramatically. “The ramp-up of fully-electric vehicles is steady but not as steep as expected,\" the VW group said in a statement it sent to Fortune. It’s not hard to see why. Sentiment for the EV sector depended heavily on the stimulative policies of governments and central banks alike, whether it was maintaining interest rates near zero while steadily expanding the money supply or offering generous subsidies and tax breaks. Once inflation hit multi-decade highs and governments struggled to get their fiscal balance sheets in order, investor appetite for high-growth, high-risk stocks like EV manufacturers began to plummet. Polestar, a Swedish designer and distributor of EVs, is a perfect example. In September 2021, it announced at the height of the everything bubble a deal to float via a reverse merger with a blank-check SPAC fund. Shares finally listed a year later when inflation was already in full swing, and promptly collapsed ever since. On Friday, Polestar confirmed it would be cutting 450 jobs, or 15% of its workforce, as it looks to bridge a $1.3 billion funding gap. Musk hasn’t exactly helped sentiment either—just the opposite, in fact. To maintain Tesla’s hyper-growth investment thesis, he launched a rapid-fire series of worldwide price cuts at the start of last year to slim down swollen inventories. His gamble already claimed a prominent victim late last year, when Hertz became collateral damage. It was the rental car company's purchase of Tesla EVs that first launched Musk's company into the rarified air of the $1 trillion market cap club. Still, Renault CEO de Meo said he had no regrets about his plan to list Ampere, since he claimed it brought focus to Renault’s EV startup and accelerated progress in the group’s gradual transition away from combustion engine vehicles. Regardless of which way fickle investor winds might blow for the moment, De Meo made one thing clear—the widescale deployment of electric cars “is a train that has already left the station.” This story was originally featured on Fortune.com Related Quotes "
}