{
    "title": "Tesla Falls Below Key Level As Hertz Downsizes EV Fleet",
    "date": "1/11/2024",
    "url": "https://www.investors.com/news/tesla-stock-breaks-key-level-for-first-time-since-november-as-hertz-downsizes-ev-fleet/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Tesla (TSLA) traded below its 200-day moving average Thursday for the first since late November as Hertz (HTZ) announced it is selling about one-third of its EV fleet and that it predicts $245 million of incremental depreciation expenses related to the sale in the fourth quarter. Tesla stock fell 2.9% to 227.24 Thursday during market action, moving below its 200-day line and marking its ninth loss in the past 10 trading days. TSLA shares are down more than 8% in January. The move lower comes as Hertz reported early Thursday it will sell around 20,000 electric vehicles and that it expects to reinvest a portion of the proceeds from the sales into the purchase of internal combustion engine (ICE) vehicles to meet customer demand. In 2021, Hertz ordered 100,000 Tesla vehicles, with the goal to convert around 20% of its global fleet to EVs. Many observers saw the move as a win for electric vehicles and a sign of growing demand. The order was valued by Bloomberg to be around $4 billion and helped propel Tesla's market cap to $1 trillion. Hertz said Thursday that its plans to sell about a third of its electric vehicles will \"better balance supply against expected demand of EVs.\" \"This will position the company to eliminate a disproportionate number of lower margin rentals and reduce damage expense associated with EVs,\" Hertz reported. HTZ shares sank 4.4% Thursday. Futures Fall Amid Big Earnings; Tesla Cuts Prices The Hertz news is bad for Tesla on several fronts. Hertz is offloading its Tesla EVs at steep discounts, adding to sharply lower used prices. Lower used Tesla prices will add further pressure to new Tesla prices. Hertz and rental car agencies were seen as a growth area for Tesla and other EV makers. But Hertz and Germany's Sixt are moving to slash their Tesla fleets. One potential upside from EVs in rental-car fleets is that customers would rent them and then choose to buy their own electric vehicles. But customer demand has been lacking, Hertz said. High collision repair costs undermine the argument that EVs, and Tesla EVs in particular, are cheap to own. Tesla stock is in an awkward double-bottom base with a 278.98 buy point according to MarketSmith analysis. The stock had forged a handle, but the midpoint is now below the midpoint of the base, making it no longer valid. On Tuesday, TSLA undercut the 50-day moving average. The relative strength line, which tracks a stock's performance vs. the S&P 500, is at its lowest level since late May, according to MarketSmith. In 2023, Tesla doubled, easily outperforming the broader S&P 500 index. Tesla stock ranks fifth in the 35 member IBD Auto Manufacturers industry group. The stock has a 76 Composite Rating out of a best-possible 99. Tesla also has an 82 Relative Strength Rating and an 88 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla Stock A Buy Or A Sell? Stocks Near A Buy Zone Learning How To Pick Great Stocks? Read Investor's Corner MarketSmith: Research, Charts, Data And Coaching All In One Place Is Rivian A Buy Right Now With The Cybertruck Hype? 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}