{
    "title": "Tesla (TSLA) Recalls 1.6M Vehicles in China to Fix Autosteer",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/tesla-tsla-recalls-1-6m-132700372.html",
    "text": "In China, Tesla TSLA has recalled more than 1.6 million vehicles over defects in automatic assisted steering and door lock systems.Per Bloomberg and the Wall Street Journal, considering the number of vehicles sold in the country, this is Tesla’s largest recall in China.Per China’s state administration for market regulation, in Beijing and Shanghai, the automaker would use remote upgrades to fix the issues, eliminating the need to take the cars to Tesla service centers.Per China’s state administration for market regulation notice, the 1.61 million imported Tesla Model S, X, 3 and Y vehicles covered in the recall have a defect in the automatic assisted steering function, also called Autosteer. Drivers could exploit the defect, which would increase the risk of collision.The automaker has also recalled 7,538 Model S and X vehicles to fix the door lock system. Due to the defect in the door lock system, the car’s side doors could open during a crash.The recall comes less than a month after a federal investigation found a defect in the Autopilot feature, as a result of which the automaker recalled more than 2 million Model S, X, 3 and Y vehicles in the United States.Per the National Highway Traffic Safety Administration’s (“NHTSA”) investigation, the defect in Tesla’s Autopilot feature could result in crashes. The recall followed a two-year NHTSA investigation that was linked to deaths and accidents.The upgrade to the Autopilot system intends to persuade drivers to pay closer attention to the road. Later, a second recall was issued for 120 thousand vehicles over the door unlocking issue during a crash. Both problems were fixed via remote update. TSLA currently carries a Zacks Rank #3 (Hold).Some better-ranked players in the auto space are Volvo VLVLY, NIO Inc. NIO and Toyota Motor Corporation TM. While VLVLY sports a Zacks Rank #1 (Strong Buy) at present, NIO and TM each carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.The Zacks Consensus Estimate for VLVLY’s 2023 sales and earnings suggests year-over-year growth of 4.2% and 73.1%, respectively. The EPS estimates for 2023 and 2024 have improved by 4 cents and 3 cents, respectively, in the past seven days.The Zacks Consensus Estimate for NIO’s 2023 sales indicates year-over-year growth of 11.8%. The EPS estimates for 2023 and 2024 have improved by 2 cents each in the past 30 days.The Zacks Consensus Estimate for TM’s 2024 sales and earnings implies year-over-year growth of 12.4% and 45.4%, respectively. The EPS estimates for 2024 and 2025 have moved up $1.98 and 5 cents, respectively, in the past 60 days. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Toyota Motor Corporation (TM) : Free Stock Analysis Report Tesla, Inc. (TSLA) : Free Stock Analysis Report AB Volvo (VLVLY) : Free Stock Analysis Report NIO Inc. (NIO) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}