{
    "title": "I'm an Investment Expert: 9 Things To Consider Before Investing In Tesla \nStock in 2024",
    "date": "1/3/2024",
    "url": "https://finance.yahoo.com/news/m-investment-expert-9-things-130059121.html",
    "text": "As we move on from 2023, there’s tremendous interest in knowing which stocks will perform well in 2024. One of the hot companies investors want to know more about, as a potential or continued investment, is Tesla, which did quite well in 2023, seeing gains of 112% overall. I’m a Self-Made Millionaire: Here Are 5 Stocks I Won’t SellSee: 3 Things You Must Do When Your Savings Reach $50,000 Despite a stellar 2023, there’s some controversy around whether Tesla will be a lucrative buy in the new year. Let’s find out why — and who Tesla stock may be best suited for. Sponsored: Get Paid To Scroll. Start Now Before we get into what will or won’t happen to Tesla stock in 2024, we must address a major problem with Tesla as a stock in general: it’s not really clear how investors should categorize it. “The great debate among investors and analysts is: ‘Should Tesla be valued as an automobile company or a tech company?'” said Robert R. Johnson, PhD, CFA, CAIA, professor of finance, Heider College of Business, Creighton University, who added that the answer falls somewhere in between — that’s something of a red flag in itself for prospective and present investors who need clear categories when designing their portfolios. Johnson is of the opinion that fundamentally, Tesla is an automobile manufacturer — and one that is “wildly overvalued” at that. As of December 2023, Tesla was valued at $813.86 billion. “There are an awful lot of red flags, starting with the still-atmospheric valuation of the company,” Johnson said. “The bull case for Tesla is predicated on a narrative of Elon Musk being a genius and electric vehicles being the future of transportation. The bottom line is that many investors are swayed by stories and ignore fundamentals.” Johnson points to Nobel Prize laureate Robert Shiller — specifically his book “Narrative Economics: How Stories Go Viral and Drive Major Economic Events” — as a good explainer on how and why companies like Tesla may get overvalued. “Shiller shows how popular stories — narratives — can drive the decisions of individuals and create market inefficiencies,” Johnson said. “Investors would be wise to take Shiller’s advice and consider the narrative. This is how investors become speculators and how speculation is akin to gambling.” Take a Look: 11 Uncommon Investments That Can Actually Make You a Lot of Money As it stands, we can’t make any definite determinations of how Tesla stock will fare in the coming months; but we can look at the performance of electric cars as a possible indicator. “The future of electric cars is the biggest issue going forward with auto stocks,” Johnson said. “While electric cars and driverless vehicles appear to be the future of the automobile industry, renowned baseball philosopher Yogi Berra once said, ‘It’s tough to make predictions, especially about the future.'” The Tesla Cybertruck is expected to deliver big in 2024, and that could boost the profitability and market share of Tesla, as Kevin Luthringshausen, lead market analyst at The Tradier Hub, noted. But even this success isn’t a sure thing, because there will be more EV competition happening in the new year. “Tesla will see increased competition and new EV startups which could erode market share and pressure margins,” Luthringshausen said. “As always, any sort of challenges around production and supply chain could impact valuations. Tesla accounts for approximately 50% of the EV market in the U.S. and nearly 20% of global shipments. Tesla has cut its vehicle prices recently, which could weigh on share valuation. Analysts are mixed on share valuation for 2024 with most seeing not much movement in TSLA shares from current levels.” Since it’s not entirely possible to know how EVs in general (let alone Tesla) will perform in 2024, making predictions about that is a murky business. And history shows that the automobile industry at large is prone to major ups and downs. Especially downs. “Speaking before a gathering of business titans at Sun Valley in 1999, Warren Buffett described the experience of the auto industry in the early part of the last century as follows: ‘There were 2,000 auto companies…but of the 2,000 companies, as of a few years ago, only three car companies survived,'” Johnson said. Johnson said that Buffett went on to say that at one time or another, “‘all three were selling for less than book value, which is the amount of money that had been put into the companies and left there. So autos had an enormous impact on America, but in the opposite direction of investors.'” The bigger question about how Tesla will perform in 2024 is: How will the auto industry as a whole perform in 2024, and, additionally, what role will technology play in its performance? “One not only has to identify the technology that is going to prove to be enduring, but one also has to identify the firms that will be the ultimate winners and losers,” Johnson said. “The second half of that equation has proven to be particularly illusive.” Despite the inability to accurately predict Tesla’s performance in 2024, Johnson finds that many investors are betting on Tesla as the big winner in the electric car space. “In fact, Tesla is really sucking all of the air out of the automobile industry from an investor’s standpoint,” Johnson said. This may not be the smartest approach, as other auto companies could be a better bet. “Given all of the attendant problems with Tesla management, its huge debt load and atmospheric valuation, I believe that a much more prudent investment is GM or Ford at PEs of 4.3 and 5.5 times, respectively, rather than Tesla at a PE of 70.6 times,” Johnson said. “To buttress that point, GM and F sell at price to sales ratios of 0.29 and 0.29, respectively. Tesla sells at a P/S ratio of 9.2. And, the cash flow metrics also favor GM and F, as they sell at a price to cash flow ratio of 2.2 and 3.6, respectively, while Tesla sells at a P/CF ratio of 26.5. Investors committing funds to Ford and GM have a much higher margin of safety than those in Tesla.” Bear in mind that though Tesla is hugely speculative, that doesn’t mean that you can’t make money off of Tesla stocks. “While I wouldn’t bet on Tesla at these valuation levels, I wouldn’t bet against the firm either,” Johnson said. “But, the biggest risk is that Tesla isn’t the big winner in the electric vehicle sweepstakes.” Since we don’t really know what will happen to Tesla stock in 2024, you may be best suited to pursue it if you think it will be a huge and successful disruptor in the EV space, and, if you are passionate about Elon Musk and his approach to business. “Tesla seems best suited for risk-taking investors who buy into the narrative that Elon Musk is much smarter than all of the other automobile executives and that Tesla will capture a huge share of the electric vehicle market in the long term,” said Johnson. “These investors also must believe that Musk’s attention won’t be diverted to Twitter or any of his other business ventures. That, in my opinion, is wishful thinking.” More From GOBankingRates 7 Ways Fraudsters Are Trying to Scam People in 2024 5 Ways to Earn at Least 5% APY on Your Money (Without Using the Stock Market) 3 Ways to Recession Proof Your Retirement 7 Money Secrets All Wealthy People Know -- And How You Can Use Them, Too This article originally appeared on GOBankingRates.com: I’m an Investment Expert: 9 Things To Consider Before Investing In Tesla Stock in 2024 "
}