{
    "title": "Elon Musk wants to sell more Teslas in Japan. Here's why that could be \ntricky.",
    "date": "1/29/2024",
    "url": "https://ca.finance.yahoo.com/news/elon-musk-wants-sell-more-181146695.html",
    "text": "Tesla CEO Elon Musk wants the company to improve its sales in Japan. Despite being a pioneering automaker, the country has been slow to embrace EVs. Japan bet early on hybrids and appears reluctant to move on. Back in 2010, Elon Musk predicted that Japan would become Tesla's largest market outside of the US. But more than a decade later, the EV maker isn't doing as well in the country as Musk had hoped. \"There are some geographies where our market share is remarkably low, like Japan,\" Musk said in a fourth-quarter earnings call earlier this week. \"We should at least have a market share proportionate to, say, other non-Japanese carmakers like Mercedes or BMW, which we do not currently have,\" he added. But while Tesla is already up against major Japanese carmakers like Toyota, Honda, Suzuki, and Nissan, the reality is that all EV makers are struggling to make an impact in Japan. EV sales have soared in recent years in the US and Europe, but Japan has been slow to sell all-electric cars, despite being one of the world's biggest auto markets. One reason for this is that hybrids have tended to dominate the Japanese market — sales of the cars beat out the combined share of gasoline and diesel cars for the first time in 2023, Bloomberg reported. \"In Japan, hybrids are popular because they're affordable and reliable, since they don't rely on the existence of strong charging infrastructure,\" Bloomberg Intelligence senior auto analyst Tatsuo Yoshida said. And leaders appear reluctant to pivot away from this strength to battery-powered alternatives. Toyota's chairman and the head of Japan's automotive association, Akio Toyoda, has previously accused the Japanese media of exaggerating the commercial and environmental advantages of EVs, calling the benefits a \"mirage,\" per The New York Times. That hesitancy has also held back the development of charging infrastructure — there are only about 30,000 EV charging connectors in the whole country — and kept price tags higher. But Japanese carmakers do have some plans to boost their EV efforts. Toyota has said it will roll out 30 battery electric vehicle models by 2030 while Honda wants EVs and hydrogen fuel cell cars to make up 100% of sales by 2040. Tesla and Toyota did not immediately reply to Business Insider's requests for comment. Read the original article on Business Insider Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented.  Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia.  \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o  They soft-launched their relationship at the supermodel's cookbook event in Miami. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  The president mocked his campaign rival for doing the one thing he claimed he wouldn’t have time for. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" "
}