{
    "title": "Tesla Offers China Incentives to Boost Sales as EV Growth Slows",
    "date": "2/29/2024",
    "url": "https://financialpost.com/pmn/business-pmn/tesla-offers-china-incentives-to-boost-sales-as-ev-growth-slows",
    "text": "Tesla Inc. rolled out a number of incentives to boost sales in China, where it is coming under increased pressure from local rivals such as BYD Co. Author of the article: You can save this article by registering for free here. Or sign-in if you have an account. (Bloomberg) — Tesla Inc. rolled out a number of incentives to boost sales in China, where it is coming under increased pressure from local rivals such as BYD Co.  Customers placing orders for a rear-wheel drive Model 3 sedan or Model Y sport utility that are in stock for delivery by the end of March can get an insurance subsidy of as much as 8,000 yuan ($1,030), the US automaker said in a post on Weibo on Friday. It will also offer preferential financing plans and discounts on some optional paint colors. Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience.  Despite not being an official price cut, the insurance subsidy will bring the starting price of the two cars down to 237,900 yuan and 250,000 yuan respectively, Tesla said.  Read More: Five Things to Watch in China’s Car Market This Year: Hyperdrive  Tesla in January lowered the starting price of the Model 3 by 5.9% and marked down the Model Y by 2.8% to 258,900 yuan, triggering further cuts from local competitors. BYD slashed the price of its Qin Plus compact by 20%, with the slogan of “making EV cheaper than gas cars.”  Sales of new-energy vehicles, which includes battery-electric cars and plug-in hybrids, declined 30% in January from December, data from China’s Passenger Car Association showed. Shipments of NEVs to dealers are projected to increase 25% to 11 million units this year, the association has said, a slowdown from 36% growth in 2023 and 96% in 2022.  Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2024 Financial Post, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. You can manage saved articles in your account. and save up to 100 articles! You can manage your saved articles in your account and clicking the X located at the bottom right of the article. "
}