{
    "title": "Even Tesla's Electric Vehicle Growth Is Slowing in 2024 -- 1 Top Chip Stock \nto Bet On Anyways",
    "date": "2/12/2024",
    "url": "https://www.fool.com/investing/2024/02/12/even-teslas-electric-vehicle-growth-is-slowing-in/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More So far in 2024, it looks like the electric vehicle (EV) market is running low on charge. Even mighty Tesla said its vehicle-production volume growth would be \"notably lower\" than in 2023. At 35% year-over-year growth last year, vehicle production was already lower than the 50% growth target Tesla has been aiming for. Numerous headwinds have arisen. For Tesla, it's higher interest rates (which is making financing a new car more difficult for many consumers) as well as being in the midst of a transition to new vehicle models (like Cybertruck). For automakers in general, the higher interest rate environment is pairing with their own desire to manage near-term profitability, and so some legacy automakers are choosing to prioritize hybrid vehicles alongside their newer EV models. It all adds up to a slowing EV market for 2024. But that doesn't mean growth is washed up. In fact, there could be a top stock that could win no matter how this market shakes out: ON Semiconductor (ON -2.73%). Over the last few years, On Semiconductor (also known as \"Onsemi\") has redirected its portfolio of power management and sensor chips to automotive and industrial end markets. Automotive and industrial sales were 80% of Onsemi's $8.25 billion in 2023 revenue, up from 68% of the $8.33 billion in sales in 2022. Included in that total auto business was $800 million in silicon carbide (SiC) chips, a key ingredient in EV powertrains, and $1 billion in image sensors (used in advanced driver-assist systems). SiC in particular rocketed higher from about $200 million in sales in 2022 as Onsemi has reprioritized extensive portions of its manufacturing capacity to these next-gen power chips. However, with the EV market suddenly slowing, many of Onsemi's peers are in the midst of a slump right now due to excess inventory of some parts. Some semiconductor suppliers are forecasting a double-digit-percentage sales decline during the first couple of quarters of this year. Onsemi itself isn't immune. Fourth-quarter 2023 sales were down 4% year over year, and the outlook for the start of 2024 implies about a 5% year-over-year decline. Again, it all comes back to the suddenly slowing consumer-demand environment for EVs, especially in those aforementioned SiC chips that help power an EV. Onsemi CEO Hassane El-Khoury said on the earnings call: \"While market reports still project 30% or 40% growth for silicon carbide in 2024, OEM's latest EV plans indicate a more tapered growth signaling a SiC market growth in the range of 20% to 30%. We still expect to grow at 2x the market growth in 2024 with customers ramping production in both industrial and automotive.\" Hyperfocusing on slowing EV demand, and in particular the slowing rate of growth for SiC chips tied to EVs, misses the bigger picture. EV demand is still on the rise, just not as fast as it was in the last few years. And many automakers are also selling lots of hybrid vehicles. Onsemi's portfolio is tilted toward selling chips to both types of drivetrains. El-Khoury mentioned on the earnings call that Onsemi's 2023 chip sales to hybrid models doubled from the year prior, while actual hybrid-vehicle sales climbed just 30%. And as for Onsemi's sluggish revenue, do bear in mind it is once again outperforming its peers during this industry slump. That means it's taking market share. The longer-term guidance is still in force, with full-year 2027 revenue implied of at least $13 billion (up some 60% from 2023), with gross-profit margin on product sold rising to 53% (compared to 47% in 2023). This kind of growth and profit-margin expansion can add up to a great long-term investment. It has certainly worked during the last few years.  Data by YCharts. At this juncture, Onsemi stock trades at a forward price-to-earnings ratio of just 16x. If a resumption of growth from the EV market, and next-gen autos in general, looks imminent in 2024, this could be a top long-term bet on the whole industry. Nicholas Rossolillo has positions in ON Semiconductor and Tesla. The Motley Fool has positions in and recommends Tesla. The Motley Fool recommends ON Semiconductor. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}