{
    "title": "Proxy Advisors Have Too Much Power, Says Elon Musk. Is He Right?",
    "date": "2/26/2024",
    "url": "https://www.morningstar.ca/ca/news/246482/proxy-advisors-have-too-much-power-says-elon-musk-is-he-right.aspx",
    "text": "Elon Musk isn’t happy.\nElon Musk, the CEO and 13% shareholder of Tesla TSLA, is petitioning the company’s board to grant him more voting power over the electric vehicle maker, according to a recent article in The Wall Street Journal.\nJust for context, Musk sold a chunk of Tesla stock to fund his takeover of Twitter. A conventional reading of the matter would be to say if Musk wanted greater control of Tesla, then he perhaps shouldn’t have sold quite so much stock. But there never was anything conventional about Elon Musk. His aim is to ward off the “activists that basically infiltrate those organizations and have strange ideas about what should be done.”\n“Those organizations” are proxy advisors, which provide research and voting recommendations about the resolutions that shareholders vote on at company meetings. For more about proxy voting, read this. But little is understood about the proxy advisory business, which is led by the firms ISS and Glass Lewis. (Morningstar Sustainalytics also offers voting recommendations through its ESG Voting Policy Overlay service.)\nMusk tweeted:\n\nISS and Glass Lewis have strongly refuted claims like these, which arise frequently. Morningstar researchers have also looked closely at this topic.\nAs the proxy season gets going, this article seeks to answer three important questions: Who are the proxy advisors? What do they do? And how does that affect your investments?\nProxy Advisors: Who They Are and What They Do\nIn the proxy document that precedes every annual meeting, investors usually encounter a raft of proposals made by independent shareholders aiming to improve transparency around how a company does business and manages risk. Proxy advisors help fund managers and other institutional investors decide how to vote on these shareholder resolutions. ISS and Glass Lewis, the market leaders, control over 90% of the proxy advisory market, so their recommendations do matter.\nThere are thousands of companies with hundreds of thousands of resolutions to be voted on. Proxy advisors are an important part of the governance system in public markets. They allow managers to focus on the most important voting issues, and to use proxy advisors’ recommendations to make decisions on more routine matters.\nSo, does that mean key issues at companies are decided by proxy advisors, not shareholders?\nIn short, no.\nProxy Advisors Advise, Fund Managers Decide. Here’s the Evidence.\nIf managers were “outsourcing shareholder voting decisions” to proxy advisors, as Musk claims, then they would make similar decisions. Morningstar found otherwise. Morningstar’s proxy-voting research demonstrates that the opposite is true—asset managers’ votes on environmental, social, and governance proposals have become less correlated over the past few years.\nSo how do asset managers vote on governance and sustainability issues? The answer is that proxy advisors advise, and managers decide. There are a few reasons why we can say this so categorically.\nFirst, most asset managers have their own tailor-made policies for proxy voting, engagement, and ESG integration. These policies have varying degrees of specificity on how the manager may vote on various ESG issues. The issue is complicated by the differing practices of each firm. Depending on the firm, the voting decision-maker can vary—sometimes it’s the portfolio manager, sometimes a stewardship specialist, and in some contentious cases a senior-level committee will decide. Also, the degree of freedom given to voting decision-makers at each firm to make case-by-case decisions also varies.\nOverall, there is a wide range of influencing factors and decision-makers that result in managers making different decisions on the same proxy-voting issues.\nSo, are managers simply copy-and-pasting proxy advisors’ voting recommendations? The data shows that the opposite is true.\nA 2015 study by Proxy Insight indicated that over 70% of asset managers use their own bespoke policy rather than the standard policy of a proxy advisor (known as a benchmark policy). A more recent study in April 2023 published by the Financial Reporting Council, a U.K. regulator, indicated that the figure hasn’t changed much. According to that research, 75% of institutional investors use proxy advisor recommendations tailored to their bespoke voting policy instead of the benchmark policy.\nMorningstar’s research reveals similar findings. We analyzed managers’ voting decisions on key ESG resolutions at U.S. companies. (We define key resolutions as shareholder proposals supported by at least 40% of a company’s independent shareholders.)\nAsset managers make very different decisions on ESG topics. Looking at the Big Three index managers, for example, we found that BlackRock and State Street supported over half of 227 key resolutions at U.S. companies in the last three proxy-voting years (51% and 65% of their fund votes, respectively). Vanguard’s support for these resolutions was around half that of its Big Three peers over the same period (28%). Looking only at the most recent year, the differences are even more stark: 66% of State Street’s fund votes on key ESG resolutions were cast in support of them, compared with 37% at BlackRock and just 9% at Vanguard.\nThese clear differences in approach are why we frequently emphasize the need for investors to assess their manager’s stance on social and environmental issues. That way, investors can ensure that their manager’s engagement and voting efforts are well-aligned with their own values and priorities.\nA Growing Role for Proxy Advisors in the Future\nNotably, BlackRock, State Street, and Vanguard are all rolling out proxy-voting choices to more of their clients this year. (Some also call this “pass-through voting.”)\nThis means a growing number of investors will have the option to select a voting policy that reflects their own ESG priorities or to continue to rely on the asset manager’s discretion. Investors will only be allowed to select a policy they prefer, rather than request specific voting decisions on the resolutions at each company’s shareholder meeting. But these policy options allow investors to express broader voting preferences on key themes like board appointments or ESG shareholder resolutions, and the policies are mostly written by proxy advisors.\nSo, the role of proxy advisors looks set to keep growing, with an even greater emphasis on investor preferences than before.\nAll in all, it’s never been more important to assess what your ESG priorities are as an investor and take steps to ensure that your views are represented.  Elon Musk isn’t happy. Elon Musk, the CEO and 13% shareholder of Tesla TSLA, is petitioning the company’s board to grant him more voting power over the electric vehicle maker, according to a recent article in The Wall Street Journal. Just for context, Musk sold a chunk of Tesla stock to fund his takeover of Twitter. A conventional reading of the matter would be to say if Musk wanted greater control of Tesla, then he perhaps shouldn’t have sold quite so much stock. But there never was anything conventional about Elon Musk. His aim is to ward off the “activists that basically infiltrate those organizations and have strange ideas about what should be done.” “Those organizations” are proxy advisors, which provide research and voting recommendations about the resolutions that shareholders vote on at company meetings. For more about proxy voting, read this. But little is understood about the proxy advisory business, which is led by the firms ISS and Glass Lewis. (Morningstar Sustainalytics also offers voting recommendations through its ESG Voting Policy Overlay service.) Musk tweeted:  ISS and Glass Lewis have strongly refuted claims like these, which arise frequently. Morningstar researchers have also looked closely at this topic. As the proxy season gets going, this article seeks to answer three important questions: Who are the proxy advisors? What do they do? And how does that affect your investments? In the proxy document that precedes every annual meeting, investors usually encounter a raft of proposals made by independent shareholders aiming to improve transparency around how a company does business and manages risk. Proxy advisors help fund managers and other institutional investors decide how to vote on these shareholder resolutions. ISS and Glass Lewis, the market leaders, control over 90% of the proxy advisory market, so their recommendations do matter. There are thousands of companies with hundreds of thousands of resolutions to be voted on. Proxy advisors are an important part of the governance system in public markets. They allow managers to focus on the most important voting issues, and to use proxy advisors’ recommendations to make decisions on more routine matters. So, does that mean key issues at companies are decided by proxy advisors, not shareholders? In short, no. If managers were “outsourcing shareholder voting decisions” to proxy advisors, as Musk claims, then they would make similar decisions. Morningstar found otherwise. Morningstar’s proxy-voting research demonstrates that the opposite is true—asset managers’ votes on environmental, social, and governance proposals have become less correlated over the past few years. So how do asset managers vote on governance and sustainability issues? The answer is that proxy advisors advise, and managers decide. There are a few reasons why we can say this so categorically. First, most asset managers have their own tailor-made policies for proxy voting, engagement, and ESG integration. These policies have varying degrees of specificity on how the manager may vote on various ESG issues. The issue is complicated by the differing practices of each firm. Depending on the firm, the voting decision-maker can vary—sometimes it’s the portfolio manager, sometimes a stewardship specialist, and in some contentious cases a senior-level committee will decide. Also, the degree of freedom given to voting decision-makers at each firm to make case-by-case decisions also varies. Overall, there is a wide range of influencing factors and decision-makers that result in managers making different decisions on the same proxy-voting issues. So, are managers simply copy-and-pasting proxy advisors’ voting recommendations? The data shows that the opposite is true. A 2015 study by Proxy Insight indicated that over 70% of asset managers use their own bespoke policy rather than the standard policy of a proxy advisor (known as a benchmark policy). A more recent study in April 2023 published by the Financial Reporting Council, a U.K. regulator, indicated that the figure hasn’t changed much. According to that research, 75% of institutional investors use proxy advisor recommendations tailored to their bespoke voting policy instead of the benchmark policy. Morningstar’s research reveals similar findings. We analyzed managers’ voting decisions on key ESG resolutions at U.S. companies. (We define key resolutions as shareholder proposals supported by at least 40% of a company’s independent shareholders.) Asset managers make very different decisions on ESG topics. Looking at the Big Three index managers, for example, we found that BlackRock and State Street supported over half of 227 key resolutions at U.S. companies in the last three proxy-voting years (51% and 65% of their fund votes, respectively). Vanguard’s support for these resolutions was around half that of its Big Three peers over the same period (28%). Looking only at the most recent year, the differences are even more stark: 66% of State Street’s fund votes on key ESG resolutions were cast in support of them, compared with 37% at BlackRock and just 9% at Vanguard. These clear differences in approach are why we frequently emphasize the need for investors to assess their manager’s stance on social and environmental issues. That way, investors can ensure that their manager’s engagement and voting efforts are well-aligned with their own values and priorities. Notably, BlackRock, State Street, and Vanguard are all rolling out proxy-voting choices to more of their clients this year. (Some also call this “pass-through voting.”) This means a growing number of investors will have the option to select a voting policy that reflects their own ESG priorities or to continue to rely on the asset manager’s discretion. Investors will only be allowed to select a policy they prefer, rather than request specific voting decisions on the resolutions at each company’s shareholder meeting. But these policy options allow investors to express broader voting preferences on key themes like board appointments or ESG shareholder resolutions, and the policies are mostly written by proxy advisors. So, the role of proxy advisors looks set to keep growing, with an even greater emphasis on investor preferences than before. All in all, it’s never been more important to assess what your ESG priorities are as an investor and take steps to ensure that your views are represented. Subscribe Here She's taken on Elon Musk, IBM, and Apple. So what does this angel investor-turned equality cru... She's taken on Elon Musk, IBM, and Apple. So what does this angel investor-turned equality cru... Amundi joins Tulipshare in asking Magnificent Seven company to report on working conditions. Amundi joins Tulipshare in asking Magnificent Seven company to report on working conditions. It sounds like an absurd question, but one U.S. house of representatives has already pondered ... It sounds like an absurd question, but one U.S. house of representatives has already pondered ... Climate change, AI, elections, and unionization are themes in proxy season. Managers’ proxy-voting policies indicate that divergence on environmental and social issues is se... Use this calendar to keep up with all the 2024 stock market holidays - both in Canada and the U.S. The price of cocoa beans has surged to over US$10,000 a ton, so which chocolate producers are set... Current valuation for the company is propelled by an exaggerated artificial intelligence narrativ... RBC’s Philippe Langham argues that conditions for emerging market equities are improving although... Get a head start on summer with these hospitality companies set to benefit from strong travel tre... Lindsey Stewart \r\n\t Lindsey Stewart is Morningstar’s director of investment stewardship research. About Us Connect With Us Get Help Terms of Use                                                  Privacy Policy                            Disclosures\r\n                            Accessibility The Morningstar Star Rating for Stocks is assigned based on an analyst's estimate of a stocks fair value. It is projection/opinion and not a statement of fact. Morningstar assigns star ratings based on an analyst’s estimate of a stock's fair value. Four components drive the Star Rating: (1) our assessment of the firm’s economic moat, (2) our estimate of the stock’s fair value, (3) our uncertainty around that fair value estimate and (4) the current market price. This process culminates in a single-point star rating that is updated daily. A 5-star represents a belief that the stock is a good value at its current price; a 1-star stock isn't. If our base-case assumptions are true the market price will converge on our fair value estimate over time, generally within three years. Investments in securities are subject to market and other risks. Past performance of a security may or may not be sustained in future and is no indication of future performance. For detail information about the Morningstar Star Rating for Stocks, please visit here Quantitative Fair Value Estimate represents Morningstar’s estimate of the per share dollar amount that a company’s equity is worth today. The Quantitative Fair Value Estimate is based on a statistical model derived from the Fair Value Estimate Morningstar’s equity analysts assign to companies which includes a financial forecast of the company. The Quantitative Fair Value Estimate is calculated daily. It is a projection/opinion and not a statement of fact. Investments in securities are subject to market and other risks. Past performance of a security may or may not be sustained in future and is no indication of future performance. For detail information about the Quantiative Fair Value Estimate, please visit here The Morningstar Medalist Rating is the summary expression of Morningstar’s forward-looking analysis of investment strategies as offered via specific vehicles using a rating scale of Gold, Silver, Bronze, Neutral, and Negative. The Medalist Ratings indicate which investments Morningstar believes are likely to outperform a relevant index or peer group average on a risk-adjusted basis over time. Investment products are evaluated on three key pillars (People, Parent, and Process) which, when coupled with a fee assessment, forms the basis for Morningstar’s conviction in those products’ investment merits and determines the Medalist Rating they’re assigned. Pillar ratings take the form of Low, Below Average, Average, Above Average, and High. Pillars may be evaluated via an analyst’s qualitative assessment (either directly to a vehicle the analyst covers or indirectly when the pillar ratings of a covered vehicle are mapped to a related uncovered vehicle) or using algorithmic techniques. Vehicles are sorted by their expected performance into rating groups defined by their Morningstar Category and their active or passive status. When analysts directly cover a vehicle, they assign the three pillar ratings based on their qualitative assessment, subject to the oversight of the Analyst Rating Committee, and monitor and reevaluate them at least every 14 months. When the vehicles are covered either indirectly by analysts or by algorithm, the ratings are assigned monthly. For more detailed information about these ratings, including their methodology, please go to here The Morningstar Medalist Ratings are not statements of fact, nor are they credit or risk ratings. The Morningstar Medalist Rating (i) should not be used as the sole basis in evaluating an investment product, (ii) involves unknown risks and uncertainties which may cause expectations not to occur or to differ significantly from what was expected, (iii) are not guaranteed to be based on complete or accurate assumptions or models when determined algorithmically, (iv) involve the risk that the return target will not be met due to such things as unforeseen changes in changes in management, technology, economic development, interest rate development, operating and/or material costs, competitive pressure, supervisory law, exchange rate, tax rates, exchange rate changes, and/or changes in political and social conditions, and (v) should not be considered an offer or solicitation to buy or sell the investment product. A change in the fundamental factors underlying the Morningstar Medalist Rating can mean that the rating is subsequently no longer accurate. For information on the historical Morningstar Medalist Rating for any managed investment Morningstar covers, please contact your local Morningstar office. For more detailed information about conflicts of interest, including EU MAR disclosures, please see the “Morningstar Medalist Rating Analyst Conflict of Interest & Other Disclosures for EMEA”here "
}