{
    "title": "Microsoft, Tesla, Netflix, and More: Big Names in the Market Worth Talking \nAbout",
    "date": "2/3/2024",
    "url": "https://www.fool.com/investing/2024/02/03/microsoft-tesla-netflix-and-more-big-names-in-the/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More In this podcast, Motley Fool host Dylan Lewis and analysts Bill Mann and Andy Cross discuss: Motley Fool host Deidre Woollard caught up with Jeff Edison, co-founder and CEO of Phillips Edison & Company, to understand the importance of necessity-based goods in retail and what consumers want right now -- both in terms of concepts and convenience. To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the ten best stocks for investors to buy right now… and Microsoft made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks  *Stock Advisor returns as of January 29, 2024  This video was recorded on January 26, 2024. Dylan Lewis: There's a new king at top of the market and a valuable lesson for investors. Motley Fool Money, starts now. It's the Motley Fool Money radio show. I'm Dylan Lewis. Joining you in the studio, Motley Fool Senior Analysts Bill Mann and Andy Cross, gentlemen great to have you both here. How are you doing? Bill Mann: Yes. Nice to be seen. Dylan Lewis: To see and be seen and be heard as well, Bill, we're going to have you heard as well. We've got to look at the necessity-based approach to retail centers and shopping centers, we've got earnings from Tesla and Netflix, and we've got some legacy names that might be worth a closer look for investors. We're going to start with the new largest name on the market, Andy. This is a company that we have seen at the mountaintop before. It is there again this week. Microsoft opened as the most valuable company in the world passing Apple as they sometimes do jockeying for the crown of most valuable company in the world. What do you make of Microsoft now a little over $3 trillion. Andy Cross: It is that jockeying, right guys? They're neck and neck, they're right there. By the time someone listens to this, they maybe be switched around again. So they're both outstanding companies, obviously some of the most successful businesses. Certainly in our lifetimes, if not almost ever when you think about just the quality of these businesses and what they have earned in both the marketplace. Interesting Apple this month, so year to date, I know it's only been a few weeks guys, but the stock is up a percent or two or so. When you look at the rest of those large tech companies, Microsoft done very well and of course, Nvidia driving so many of the gains so I think you will just see it continue. They are now separating. Microsoft is starting to separate itself because it's tied to so many things and we saw what it is now trying to do in the gaming business with its Activision Blizzard acquisition of almost $70 billion. So they will be neck and neck. It will be very interesting to see how Apple, if it starts to think about really exploiting or using, I should say, its strength in the computer space and the individual space, the consumer market as it thinks about AI and all those investments. We still have really not heard a whole lot about that from Apple yet. Dylan Lewis: Bill, I love checking in on Microsoft and the story because it is a good reminder for investors. It was a long road to becoming a $3 trillion company and one of the most valuable companies in the world period, let alone the largest, and there were a lot of periods where it didn't seem as inevitable as it does now for Microsoft. Bill Mann: No, for a long period of time, Microsoft was pretty much thought to be an also-ran. It had a 14 year period in which it did not reach its previous high so Microsoft was not a company that was being taken seriously as a competitor within that space anymore, and now I'd like to put frames around things. $3 trillion means that Microsoft is worth $428 per man, woman, and child on the planet. Dylan Lewis: It's humongous. Bill Mann: It's humongous and you have to wonder, at what point does that just simply become too large for any company to be able to generate that level of economic return. So it's a massive number. I'm not saying they can't. I mean, I think a lot of people have underestimated Microsoft for a long time. Four hundred and twenty eight bucks, that's a lot. Dylan Lewis: That's incredible. If you add Apple and Microsoft together, you have almost $1,000 per every person. Bill Mann: Apple, by the way, has been buying back shares. They're not committed to being the largest company in the world by market cap. If they did, they wouldn't be buying back shares at all. I mean, Andy's exactly right, maybe there have never been businesses that have been better at generating returns for investors or economic returns than the two of these. Dylan Lewis: One of the ways Microsoft is looking for that next phase of growth is gaming. The company recently acquired Activision Blizzard and we did see it was not all good news over at Microsoft this week. There were announced layoffs of 1,900 employees in gaming, many of them are part of the newly acquired Activision Blizzard Group. Andy, what do you make of this as you're processing the news itself and the broader layoff picture we're seeing? Andy Cross: Well, first on the news Dylan, and not surprising, anytime a company's going to make a significant acquisition, they're going to think of how to rationalize costs, and a lot of these I imagine there's a lot of overhead corporate costs, dual roles they've talked about, and those just are redundant and it doesn't really make sense for the acquiring company as painful as it is for those layoffs to keep those roles and think about trying to get the two companies together in the back office side. What is interesting though is this does come on top of the layoffs that Microsoft had a year ago. Many tech companies as we were seeing, not just in the gaming space, I mean, we're seeing Twitch, we're seeing Unity, we're seeing Riot Games, they are definitely simplifying, reducing their work forces because of some of the gaming slowdown overall. But it does echo with what we are seeing across a lot of the tech sphere when so many companies made so many investments in people. Namely, because I think they were worried they wouldn't be able to get people. During the COVID period, they were just worried about talent, the grab for talent. They made those large investments in those people. They are now starting to deal with that because they are seeing that there are different ways to get value from their assets and it maybe it isn't so much in all of the people, especially as you think about things like how does AI, or how does this technology in general improve the operations of a company that doesn't require having all those employees? So it's painful, but it is a rationalization cost that large companies need to go through. Bill Mann: Some of it has to do with the fact that Microsoft immediately canceled a game that's been in development for six years code named \"Odyssey\" at Activision. So obviously, a long time investment that Microsoft didn't seem to think was worth to continue to make. A lot of it also has to do with the fact that we are in a different environment now in terms of the cost of funds, and so in 2020 you could throw money at anything, and there was almost no loss to it because money was free. It's not free anymore, even at a company like Microsoft. Andy Cross: It'll be very interesting to see how this all works out with Microsoft as they continue to push more aggressively at the cloud. How much is X-box units versus X-box cloud and all those different subscriptions? So I think the acquisition is exciting. It is unfortunate and painful for those people who had to let go. Bill Mann: Always have to remember that that is a human story. Andy Cross: Yeah, sure. Dylan Lewis: Before we go to break, we're going to go global. It has been a tough run for the Chinese stock market and for companies based in China over the last few years, but if you're paying attention to some major moves Bill, things might be getting a little interesting. Alibaba co-founders Jack Ma and Joseph Tsai recently bought $200 million in Alibaba shares. Is this signal? Is this this noise? Bill Mann: Did they? [laughs]. Dylan Lewis: Was it them? Bill Mann: Was it them? Six trillion dollars in losses in the Chinese stock market from its peak, and that by the way, that is Apple plus Microsoft just wiped off their market gap. And by the way, they didn't start with an Apple at a Microsoft. So it has been a brutal run for China and it's possible you are seeing some moves within China. They reduced their banking reserve ratios that were required in order to get some liquidity into the market, and you are starting to see some big purchases by some of the big shareholders of these companies and I think it is very interesting that they came in with $50 million of Jack Ma's money and $150 million of Joseph Tsai's money that they are backing Alibaba the way they have. Because Alibaba has come up against some real competition in the form of Pinduoduo and its Temu platform. Dylan Lewis: Bill, when I look at China, I feel like I've seen different chapters of risk and concern with the overall picture there. Some of it was for a very long time government intervention and the lines between private and public, and the strength of public and private enterprises. Some of it also was demographic story. Knowing that we're seeing slowing demographics and slowing population growth, we're going to see some declines there, is there anything else that you're worried about as you look to that picture or anything you feel like we're getting wrong as we look at some of those stories? Bill Mann: I'm sure we're getting a lot of things wrong in China, but it bears remembering that China has over the last couple of years gone from being a government by committee to really government by one guy. So there are some real concerns in China. There never were in place any real shareholder protections, particularly for international investors into Chinese companies, and I think that people have, you know, they've finally been burned enough times that they're not that excited to go back. There were huge withdrawals from the Chinese market by western investors at the end of this last year. That has continued apace. I think China is at the point where they need to prove that they are a market that is safe for foreign investors before people will get excited about any of the demographic shifts. Actually the demographic shifts aren't that awesome, so that might be anything on top, but it has always been the case. Hey, a billion people and a half in China, that's a huge market. It remains to be the case, but I think people are three times bitten and four times shy at this point. Dylan Lewis: Is that to say you're not following Jack Ma and Joseph Tsai into shares of Alibaba? Bill Mann: Alibaba is a company that I actually feel fairly positively about, and have in fact I believe in China, if you want to invest in there, just play the hits and Alibaba is one of them. Dylan Lewis: Coming up after the break, we've got a run down on the earnings beat with the results from Tesla and Netflix. Stay right here. This is Motley Fool Money. Welcome back to Motley Fool Money, I am Dylan Lewis, joined in studio by Bill Mann and Andy Cross. Gentlemen, it was a busy week for earnings, so we are going to dive right in. Bill, Tesla shares down 10 percent after the company reported this week. Results were below expectations. But am I reading it right that a lot of the attention was on the forward-looking growth estimates and a little bit less on what we saw in the reported quarter? Bill Mann: I think that that's probably true. I mean, in the run-up to the earnings, Elon Musk, the very interesting CEO of this company came out and said that he believed that were there not protections put into place that the Chinese EV manufacturers would pretty much demolish. That's a direct quote, competition around the world. If you've got a $600 billion company that primarily does electric vehicles outside of China, that's something that I think you should pay attention to. I mean, the quarter was expected for them. I'm actually surprised the stock went down as much as it did based on the results because we already knew about the price cuts around the world for their existing fleet. Dylan Lewis: I was going to say I mean, I think we had to know margins were going to get compressed because of what you were talking about there with the price cuts. We've seen the growing traction and the growing deliveries by BYD. We don't see them on the roads here in the United States, but that is a story we've been aware of. Are you surprised at all that this was the reaction or was there anything in there that really surprised you? Outside of what's getting all the headlines? Bill Mann: Look, I think that I think that Elon Musk will remain a complete enigma. The fact that he came out and you had balls, longtime balls like Dan Ives come out and say, the things they were talking about during the conference call. These were not executives who were taking responsibility for margin compression. They were not taking responsibility for some of the mistakes that were happening or the environment that Tesla is in. I think you've got to be mindful of the fact that there actually are many more questions that are being asked about Tesla, including things in governance like Elon Musk came out and basically said that he wants 25 percent of the company, as if he's not already, deeply incentivized enough with the billions and billions of ownership he has of the company. There are some real questions there. A lot of them have been a long time coming. Dylan Lewis: Tough week for Tesla, great week for Netflix. Andy shares the streamer up 15 percent this week following earnings that showed the company can still add subscribers. Andy Cross: The story of two different leaders in two different spaces. I mean, this was a clear case of the clear leader in streaming, Showcasing, gosh, Oscar Worthy status. By adding 13.1 million streaming subscribers, pushing this stock to a two-year high, still far below 20 percent below its all-time high. But as they continue to make investments, including the WWE Raw investment, they made for $5 billion reportedly over 10 years. The outstanding strategy of testing and learning into all these different parts of the market. International expansion live entertainment documentaries, sports documentaries, gaming. With really no corporate acquisitions, they do it all internal house. Netflix is now the go-to space for creators because they know they're going to get the eyeballs, 260 million global subscribers like I just mentioned. They added 13.12 million this quarter. That's 50 percent above expectations and the most since 2020. It almost doubled the ads they had a year ago. The United States was the slowest growing, one of the slowest-growing parts of the market. But they still added 2.8 million. In the US and in Canada, the advertising membership grew 70 percent and equals 40 percent of all new subs in markets where they have the advertising tier, a lot of those new additions are coming in the advertising tier, revenue was up 12.5 percent versus up six percent a year ago, operating income was at 1.5 billion. That was up 172 percent. When you just look at the Netflix story, they continue to widen their lead over the competition, which is a little bit of a disarray, I think it's safe to say. The programming they're making and the success they're having on both the programming for their viewers who see Netflix as the place that I have to maintain my streaming subscription above anything else and that's showing up in the results. Bill Mann: I thought it was super interesting in their report that they basically came out and said that they intend to raise prices a little bit over time. This is a company that is fully confident with where they are right now. What a shock from two years ago. Dylan Lewis: Unbelievable, one of my questions here, Andy, with looking at Netflix is we have seen the push for, we're going to crack down on password sharing. We've seen the push into ads. Do we have to continue to expect this growth? Do we have to think those were quick levers and maybe that we can't expect that growth going forward? Andy Cross: Oh gosh, I think just the different ways. Like they're just starting to get into the gaming. They had some grand theft auto stuff last year. Like I mentioned in different documentaries. They're going to have different live programming events. The WWE, that acquisition of that content for Raw in the licensing agreement and international other assets, that plays really well into their strength. Again, I know $5 billion and a lot of money. They're going to invest 17 billion in programming just this year alone. But that's the way that Netflix has been able to build these properties out. They leak out a little content, they try things, they see what works, they don't, they get the data and they make those smart investments that play out for their members. I think it'll be, I'm not worried about their ability to innovate and find new things for us to enjoy on Netflix. Dylan Lewis: We're going to wrap the earnings chat by checking in on Big Blue. Bill, IBM shares up eight percent post earnings, sending the stock to its highest level since 2013. What has the market so excited about IBM? Bill Mann: IBM is like the nickelback of AI companies. Isn't it? Like nobody wants to admit that they like it because, I mean, it's a company that's disappointed for so long. It is one of the few companies in the last decade that Warren Buffett bought and sold in disgust because they didn't do any of the things that he thought that they were going to do. But IBM has a 25-year library and a head start in AI. They've been doing it for a long time. It is not by accident that you go back and you remember that Big Blue, which was an AI device was IBM's and that's what competed against Gary Kasparov and chess. That was a long time ago. They are now seeing the market catch up with them. One of the reasons that you don't see IBM talked about it as an AI company is that they don't do anything customer-facing. They are doing things which make a lot of sense. When you think about some of the issues with Chat GPT of providing like a ring fence around company's private data. Allows it to interact with public data in AI without compromising that private data. It's a really, really interesting business. Nice to see them get a bid. They're at a multi-year high. And by multi, I mean many, many year high. I think it may be just the beginning for IBM. Dylan Lewis: Bill I can't help but think back to the conversation we were having earlier about Microsoft and that lost period. I think there's probably a younger generation of investors that have not had IBM on their radar at all because it has been during this very tough period for the business. It sounds like you're saying maybe this is one that should be on people's radar. Bill Mann: I think it absolutely should be. Look back and it wasn't that many years ago that the Fang acronym was invented and they left Microsoft off, that was the biggest winner, to me, IBM has the potential, and that's a really important word to be, on the same trajectory as an Nvidia or a Microsoft. A company that has been minding its business and not really in a wonderful way for a long time, but they have actually been still building things while they were going, they invested in R&D the entire time. I think you're now starting to see a payoff. Dylan Lewis: IBM saying, hey, I want to be a rock star. It's your nickel back example there, Bill Mann, Andy Cross, we're going to see a little bit later in the show. Up next we've got a rundown on why grocery stores are a bigger part of the retail picture. Stay right here, you're listening to Motley Fool Money. Welcome back to Motley Fool Money, I'm Dylan Lewis. As some of you are listening to this very radio show, you might be out on the roads driving your car, maybe passing a strip mall or shopping center and you might notice that the formula for retail has changed a bit in recent years. Increasingly, supermarkets and medical services are the features of the modern shopping center and that's partially the work of Jeffrey Edison. He's the co-founder and CEO of Philip's Edison Company. They are a real estate investment trust focused on retail with over 275 locations in 31 states. Motley Fool Money's Deidre Woollard caught up with Edison to understand the importance of necessity based goods in retail, what consumers want right now, both in terms of concepts and convenience and how foot traffic is trending in shopping centers. Deidre Woollard: I want to talk about the journey of this company because you were in the private markets a long time. You've only been publicly traded since 2021. You came to the market in an interesting time. How is being public changed the company or changed how you think about things, if at all? Jeffrey Edison: Surprise. I hate to date myself, but we've been doing this for 30 years. We started the business 30 years ago. Bought a grocery anchored shopping center in Virginia, and we've continued for a sustained period of time now, 30 years, staying in that business and developing what we think is the best team operating in that particular niche. Our niche is, we buy shopping centers that are anchored by the number 1 or 2 grocer and they're in markets where the market supports not only the grocer, which is about 35-40 percent of the space, but also the small stores. What we've targeted is that center where when somebody wakes up on a Saturday in the suburbs, they go to get their necessity based goods. They get their groceries, they get their hair done, they get their nails done, maybe they get a workout in and get a smoothie. We want to be the place near their home where they go to do that type of thing. We continue to build this team over a sustained period of time. You just started with friends and family and went into institutional funds and then got into the non traded at space, raised equity there, and we got to a size where being a listed public company and the access that gave us to capital was a logical next step in that process. It really hasn't been a major change for us. I mean, we've been SEC filing for over 10 years, so all the reporting stuff was all common stuff that we've done and we're actually one of the only companies to come public where it was simpler from a reporting standpoint than it was before when we had multiple different groups. It's been for us, a journey but where we're learning a lot about our new set of investors and how that, and a lot of our investors have stayed with us over that period of time, through that whole process and have been great supporters of us. Those were almost all retail investors. Now we're much more involved with the institutional investors. But our retail investors are still at a core ownership of the company. Deidre Woollard: You mentioned big grocery stores, one of the biggest ones has been involved in this merger. I'm talking about Kroger and Albertsons, of course, major tenant of yours. We just found out that it's going to be a little while longer before that merger takes place. They pushed it back. Does that new extended timeline have any impact on you or how are you thinking about that merger in general? Jeffrey Edison: I think in general, if it happens, it will be a positive impact on us because it will take a grocer that is going through other stuff and put them in a much more, really strong financial position. The market still is very reluctant to say whether it's going to happen or not. Albertsons trading 15 percent below where the strike price is on the merger. The market, which we look at pretty closely is still questioning whether they're going to get SEC approval and what that process will go through. These are really strong grocery locations where they will be grocery stores on a long term basis. That improved capital that will come back with a Kroger ownership we think would have a positive impact on our overall portfolio. We're Kroger's largest landlord, we're Public's second largest landlord. We're working with the grocers and have been now for 30 years on how their business works and where they can be successful. Deidre Woollard: Interesting. Well, I listened to your investor day and one of the things that I heard you and the team talk about is medical. I've heard this from other red operators as well. Tell us a little bit more about it. What type of medical are you seeing? Are you seeing chains or local operators? What's the story there? Jeffrey Edison: Retail is always changing and what a lot of people are realizing is that they have to do what the consumer wants, and that is in all parts of retail. What's happening, and we call it medtail. Ln the medtail side, is they're seeing the advantages primarily on a cost basis but also on a convenience basis for the customer being closer to them. We're seeing a wide variety of different medical uses coming into our shopping centers. They are long term players who will be in our centers for a long term. They bring additional convenience to the markets that we're in. They're an important part of our growth in Tennessee over time. It includes everything from the chiropractor to the physical therapy, to the dentist, to urgent care. All of those are part of that and some people are even including veterinary services for the animals in that medtail category. It's a strong growing part of the demand for our shopping centers. Deidre Woollard: I'm wondering what foot traffic trends you've seen in the post pandemic time. Certainly, we always talk about the death of retail being overstated. Have you seen a lot of return to your shopping centers? Jeffrey Edison: Yeah. I think the days of that conversation are limited. It's almost all being driven by two factors, one, the increased demand and the other the lack of new supply. For the last 10 years, there's been very little new retail product. There's been more destroyed retail than there has been a created retail. What that's done, it's really limited the supply. At the same time we've had a great operating environment for our suburban located centers. Because if you look at suburbanization, that's a trend that has continued which we think is very positive for us. Working from home is a big part of that because people are around our centers more of the day. Rather than being in the office and going down to have lunch, they'll go to the shopping center and have lunch. That's been very positive for us. Jeffrey Edison: There's a sense of buying local, which is our centers are great for, 27 percent of our neighbors are local in nature and they've been with us on average nine years in our centers. These are bringing something unique to the merchandising mix of our center and an important part of why our centers have continued to operate at a really high level. I think we're 98 percent occupied today, the highest level we've been at in the 30 year history. It's a really positive operating by. Those macro tailwinds are not short term. I mean, from our perspective, we think there's going to continue to be suburbanization, continue to be work from home, continue to be migration to the sun belt. All of those are long term trends and we believe that rents have to go up somewhere between 50 and 100 percent before really new development is economically warranted, which is a major move. Deidre Woollard: What do you think in terms of how tenants are using space? We've seen so much change to curbside pick up and things like that. Jeffrey Edison: The retailers are really good at what they do and they're very good at reading where the consumer is. It's very expensive to acquire new shoppers to your store, so you don't want to lose any of your shoppers. Because of that, today's shopper wants an omnichannel approach to retail. They want to be able to go and have BOPUS and pick it up at the store. They want to go in and shop the store and they want to be able to order online and have it delivered to their house. Our retailers have to have that omnichannel approach. It's going to be long term successful from our opinion. What we've done, I think I'll get the numbers wrong a little bit, but it's like 90 percent of our grocers have BOPUS so that you can order it, pick it up at the store and do it. It's in the high '90s. We have a front row to go, which is our program where we have dedicated parking spaces for our small store spaces so they can get that. Then we've had an extensive program of getting drive-throughs continuously added to our shopping center. Again, all the pieces that the consumer wants trying to create those for them. Dylan Lewis: Listeners, if you see something interesting related to investing while you're out in the world, we want to hear about it. Shoot any questions or ideas for show topics over to radio at Fool.com. Coming up after the break, Bill Mann and Andy Cross return with a couple of stocks on their radar. Stay right here, you're listening to Motley Fool Money. As always, people on the program may have interests in the stocks they talk about, and the Motley Fool may have formal recommendations for or against. Don't buy or sell anything based solely on what you hear. I'm Dylan Lewis, joined again by Bill Mann and Andy Cross. We've got one more earning story before we get over to our radar stocks. Andy, it's going to be a name that we don't talk about all the time on the show, but I think it's worth bringing up because some interesting results, and some interesting insights, and maybe to the future of streaming in what we saw from Comcast this week. Andy Cross: Well, in the news too, after they hosted the Chiefs, Bill's playoff game on Peacock, which was criticized a lot of course. But when they decided to go purely with streaming, but there's still 23 million viewers tuned into that. That was a huge success, and they talked a lot about that in the call. I mean, it's $182 billion market cap company, that's still smaller than Netflix is very interesting, but still a very large company and many subscribers. Of course, the revenue was flat, up 2.3 percent during the quarter EBITDA. They're earnings before interest, taxes, depreciation, and amortization flat. What's interesting though, Dylan, is that so much talk about the subscriber base. The connected broadband subscribers were basically flat. They continue to see people leave for video who don't want to have video and the phone. But when you look at the broadband business, and you look at their mobile business, the mobile business actually is doing quite well. Revenue with subscribers grew more than 20 percent in that quarter. Broadband about flat. What was really interesting is the Peacock, that streaming platform that they have launched. Revenues in Peacock was up 57 percent and hit 1 billion for the first time ever in a quarter. The subscriber revenues were up 88 percent and advertising was up 50 percent. If you back out some of the effects of the World Cup from last year, so much talk about Peacock, is that the future for Comcast, it will be a big part of their growth is right now, pretty much the only exciting part to the growth picture for Comcast. But you've got a company that basically sells at 10-12 times earnings per share. a middling grower stock, not super exciting, but also not super volatile. If that's your interest, Comcast might be worth it. Dylan Lewis: I remember seeing the story that they had spent about $110 millions for the exclusive streaming rights to that playoff game. Based on data we saw from Antenna, they wound up with just under 3 million new subscribers during the days leading up to that game. Do you feel like that was money well spent for Peacock? Andy Cross: I think it is. If you just think again long term, and the benefit, and the more and more push toward streaming. Their advertising business is strong on the streaming. When you start looking at the investments they're making in there and the experiences they have. Of course, with all the other advertising properties they have, and with the theme parks, and all that thing. But making the right investments in Peacock and 23 million people viewing that. That is an impressive number when you look at just the previous one of the other NFL games, it was, I think, a second highest. That game was on broadcast TV, so this was just on Peacock. Obviously, we'll have to see the investments they make and will they ultimately pay out. But I think from an initial go, there's some excitement behind what's happening at Peacock. Bill Mann: Was it actually an NFL game, or was it actually just another Taylor site? Andy Cross: Yes, exactly. Now, maybe if you X out the Chiefs and somebody else, we'll have to see. Dylan Lewis: That would be an incredibly captivating exclusive if they were able to get Taylor Swift exclusives. I wouldn't be surprised if that drove three million sign-ups as well. Andy Cross: I will say Peacock did lose $2.7 billion last year, so they have a long way to go to catch up to the likes of Netflix. But at least they are pushing aggressively into that streaming business. Bill Mann: That's one 200th of what China has lost. They're in great shape. They're fine. To me, ultimately, it's a sheriff eyeball. They brought subscribers in. Will those subscribers stick? It is only down to their willingness to continue to consume content from Peacock. Andy Cross: Bill, for folks watching the NFL games this weekend, there's some splash around Peacock. But also I think there are going to be a lot of ads for the sports betting sites, DraftKings, MGM, and Caesar's advertising heavily trying to get a lot of users, a lot of new people acquired during this period. We'll have to wait until earnings to see if that pays off, but what are some of your impressions, seeing some of that? Bill Mann: I think it's been a really fascinating five years for sports betting in the US. Because you have gone from the major leagues, keeping them at arm's length. Then all of a sudden like nudge, nudge, wink at arm's length. Now, you're seeing things where ESPN is going to buy part of one of a betting network and NFL might buy part of ESPN. Betting it's not just that it's here to stay, but it is going to become a more and more integral part of the sports viewing experience for a lot of people, I think. Andy Cross: I think it's going to be very hard for them to separate the egg whites and the egg yolk at a certain point, it is going to be scrambled together. Bill Mann: That's a great allegory because I don't know how they would undo it if it does, in fact, impact competition. Dylan Lewis: Let's get over to stocks on our radar. Our man behind the glass, Dan Boyd, is going to hit you with a question. Andy, you're up first. What are you looking at this? Andy Cross: Guys, I'm looking at Spotify ticker S-P-O-T. I'm sticking with the streaming theme here, but turning more toward the ears rather than the eyes, 226 million paying subscribers of about $11 per month, which I'm sure many of us are over 570 million total monthly active users. They can access 100 million digital tracks, 5 million accounting podcasts, and that's a big part of what their business is. A $41 billion market cap with almost 4 billion in cash and a little more than $1.2 billion of debt, 88 percent of revenues come from those subscriptions. But advertising is where some of the excitement is. I know one thing we're excited about, they report earnings in a couple of weeks. I'm really interested to see what they are doing on the margin side. They unfortunately had to go through some of those other layoffs we talked about. They let go of a lot of people last year. There was some excitement, enthusiasm that might really boost the profitability. Analysts are expecting profits this year, so looking to see what Dan act and his team is saying about Spotify. About the market, the investments and the cost that they've been able to save and how that's going to impact profits and margins. Dylan Lewis: Dan, a question about Spotify. Dan Boyd: More of a comment about Spotify. I hate their app, I really do. It's slow. It sucks. I don't love it, but I still pay for it. I think that says something about the company. Dylan Lewis: It sure does. Spotify's shareholders, thank you for that, Dan. Dan Boyd: The hate listen is as good as a love listen. Dylan Lewis: A shameless plug to our radio audience if you like, Motley Fool Money. Also available on Spotify as well as iTunes. Wherever you get your podcasts, Bill, what is on your radar this week? Bill Mann: I want to talk about Mercado Libre. There is something fascinating to me, and this has been one of the most successful companies on the US exchanges over the last 20 years. An absolute miraculous growth story in Latin America. I say miraculous purposefully, because their largest market has been Argentina. Argentina is a long term disaster of an economy. But they have a new president now, Javier Milei, who is saying that he wants to dollarize the economy. That he wants, Argentina to privatize a lot of their economy. It's very heavily state owned. It's going to be really interesting to see from Mercado Libre's standpoint because if you think about it, in some ways it's an advantage for them to know how to operate in a basket case economy like Argentina. If it becomes simpler to operate in Argentina, does that help companies like Sea Limited who have been trying to come into Latin America if the ground becomes more simple? To me, Mercado Libre has an opportunity, but it has a little bit of risk wrapped up into it. Dylan Lewis: Dan, a question about Mercado Libre. Dan Boyd: The stock has been a powerhouse over the last couple of years, that's for sure. But is the general strike that was called on Wednesday in Argentina going to be a problem looking forward. Bill Mann: You said Wednesday? Not the Tuesday one or the last Wednesday one. I think they will be fine. They are very accustomed to operating in an economy where things are just a little wild. Dylan Lewis: Dan, which one's on your list? Dan Boyd: It's not Spotify. I'll tell you that. Dylan Lewis: That's going to do it for this week's Motley Fool Money radio show. Show is mixed by Dan Boyd. I'm Dylan Lewis. Thanks for listening. We'll see you next time. Andy Cross has positions in Comcast, MercadoLibre, Microsoft, Netflix, Spotify Technology, and Tesla. Bill Mann has positions in MercadoLibre. Dan Boyd has no position in any of the stocks mentioned. Deidre Woollard has positions in Apple and Microsoft. Dylan Lewis has positions in MercadoLibre and Spotify Technology. The Motley Fool has positions in and recommends Apple, MercadoLibre, Microsoft, Netflix, Spotify Technology, Tesla, and Unity Software. The Motley Fool recommends Alibaba Group, Comcast, International Business Machines, and Kroger. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}