{
    "title": "Tesla and BYD had 35% of global electric car market in 2023",
    "date": "2/11/2024",
    "url": "https://auto.hindustantimes.com/auto/electric-vehicles/tesla-and-byd-had-35-of-global-electric-car-market-in-2023-41707626785342.html",
    "text": "Copyright © HT Media Limited  All rights reserved. In the global all-electric car registrations, Tesla and BYD together grabbed a 35.6 per cent market share, significantly up from 2022 when these two EV manufacturers grabbed a 30.8 per cent market stake. A study by EV-Volumes Data has revealed that Tesla was the top with more than 18 lakh units registered in 2023 grabbing 19.1 per cent of the BEV segment, up from 18.2 per cent in 2022. This reveals that the US-based electric car major was growing faster than the rest of the EV industry on average. BYD was the second-best in the global EV industry by registering 1,570,388 units and a 16.5 per cent share in the BEV segment, up from 12.6 per cent in 2022. With this growth trajectory, BYD may surpass Tesla in 2024, just like it happened in the fourth quarter of 2023. Also Read : EV pricing rule to avail FAME II subsidy modified. Why they could cost more The third EV manufacturer in the chart is SAIC, which recorded 748,159 units and a 7.9 per cent market share. This automobile group witnessed a drop in EV registrations last year compared to 9.3 per cent recorded in the previous year. At the fourth position was Volkswagen Group, which sold 742,703 units and grabbed 7.8 per cent market share. The German automobile giant too witnessed its market share slumped marginally from 7.9 per cent in 2022. At the fifth position was Geely Volbo, with 589,932 units grabbing 6.2 per cent market share, marginally up from 5.3 per cent registered in 2022. The study has revealed that these top five car manufacturers were responsible for 57.5 per cent of sales of total global battery electric vehicles. This also revealed bigger OEMs are growing even bigger in the all-electric car segment globally. Combined, these five automakers sold 5,459,834 units of battery electric vehicles in 2023 and grabbed a whopping 57.5 per cent market share worldwide, where a total of 9,493,040 units of electric cars were sold globally. Copyright © 2023 HT Auto "
}