{
    "title": "Tesla shares more footage of Optimus walking improvements",
    "date": "2/24/2024",
    "url": "https://www.teslarati.com/tesla-footage-optimus-walking/",
    "text": "Tesla has shared its latest clip of the Optimus humanoid robot, once again showing off how smoothly the bot is able to walk around. On Saturday, Tesla’s Optimus account on X shared footage of the humanoid robot walking around one of its testing facilities, featuring the caption “Getting my daily steps in.” The robot appears to be a newer, or at least more complete, build than a similar video shared a few weeks ago, depicting the robot as it smoothly strides around the area. Getting my daily steps in pic.twitter.com/cEE4RBNdfo — Tesla Optimus (@Tesla_Optimus) February 24, 2024  In a repost of the video, Tesla’s Head of Optimus Engineering, Milan Kovac, noted that the robot’s walking speed is its fastest yet. Kovac says the unit can now walk at around 0.6 meters per second (~1.34 mph), representing a 30 percent speed boost since the last video had been released. Eventually, Optimus is expected to be able to walk up to five miles per hour. This is our fastest gait ever at ~0.6 m/s, > 30% speed boost since our last video in December. We’ve improved our vestibular system, our foot trajectory, and our ground contact logic. We’ve upgraded our motion planner, and made cuts to the loop latency across the bot. Optimus… https://t.co/CXwkjujD6S — Milan Kovac (@_milankovac_) February 24, 2024  The post comes just a few weeks after CEO Elon Musk shared another video of a second-generation Optimus prototype walking, showing a more stripped-back version of the technology than the current one as it similarly paced around the facility. It also comes after Tesla opened up 61 Optimus jobs earlier this month, featuring listings for manufacturing and testing engineers, along with a wide range of other related roles. You can see the video posted by Musk in January below. Going for a walk with Optimus pic.twitter.com/6mLJCUp30F — Elon Musk (@elonmusk) January 31, 2024  Tesla unveiled its Optimus project in August 2021, and Musk last month said that the company could begin shipping the Optimus robots as soon as next year. The robot is being designed to help eliminate dangerous, repetitive and boring tasks for humans, and Musk has also said that the first production versions of the technology will work in Tesla’s factories. The Optimus program has come a long way since it was unveiled, with recent updates from Tesla showing that prototypes of the robots can already fold laundry, balance well, move their necks, arms and legs, and handle tasks that require fine motor skills and discernment, like sorting blocks into matching categories. In December, Musk also said he expects Optimus to be able to thread a needle within the next year, and original claims about the humanoid robot’s cost say it could be under $20,000 once Tesla begins selling the units. Updated 2/25/24: Added Tesla Optimus Engineer’s comments on this being the fastest the robot has walked yet, and embedded the January video for comparison. Tesla updates Optimus Bot production figures and why they might be lower than expected  What are your thoughts? Let me know at zach@teslarati.com, find me on X at @zacharyvisconti, or send us news tips at tips@teslarati.com. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Copyright © TESLARATI. All rights reserved. "
}