{
    "title": "3 Up-and-Coming EV Giants You Can Ride to the Finish Line",
    "date": "2/8/2024",
    "url": "https://investorplace.com/2024/02/3-up-and-coming-ev-giants-you-can-ride-to-the-finish-line/",
    "text": " Here are three EV giants investors should consider Advertisement Source: Roschetzky Photography / Shutterstock.com There are many reasons for individuals to buy an electric vehicle (EV) in 2024. And a lot more reasons for stock investors to add some up-and-coming EV giants in their portfolios. For one, climate change is on everyone’s minds. Buying electric vehicles is seen as one of the key and easy ways consumers can help. EVs offer carbon footprint reduction and portfolio growth potential, aligning with the shift to zero-emission transportation. Additionally, in response to China’s declining lithium prices, potential has emerged for investors in undervalued EV stocks. Amidst the nascent EV revolution, these companies overlooked by Wall Street, hold substantial upside. I think three strong and potential EV stocks deserve attention from EV fans and investors. BYD Co. (OTCMKTS:BYDDF), the world’s largest electric vehicle manufacturer, has now expanded beyond roads to seas. In January, the company’s inaugural vessel, “BYD Explorer No. 1,” set sail with 5,000 cars. This strategic move to launch the company’s own shipping fleet addresses global demand and cost efficiencies. It’s also one I’m very keen on, and think other major players in this space will likely copy. Notably, BYD surpassed its ambitious three million unit sales target, topping global new electric vehicle sales for the second consecutive year. Entering the top 10 global auto sales, it remains China’s best-selling brand with a remarkable 62% year-over-year growth. Despite December’s impressive 45% sales surge to 341,000 units, aggressive sales tactics like discounts and cash prizes impacted profit margins, with an anticipated 86.5% increase in profits for 2023. In a press release, BYD announced plans to expand its fleet with seven additional vessels within two years. This vertical integration move is one long-term investors will want to consider. And with the stock still trading at an impressively low multiple of 17-times earnings, there’s plenty of room for upside from here. Known to be Volvo’s (OTCMKTS:VLVLY) biggest partner, Sweden-based Polestar (NASDAQ:PSNY) recently revealed their latest SUV model, the Polestar 3. Set to be the EV market’s biggest challenger yet, the model EV will drive Polestar to growth. With an impressive 300-mile range and excellent reviews from those who have bought it, it’s expected to rival Tesla’s Model Y. That said, the stock also trades at a low forward price-sales ratio, which is a good opportunity for investors to buy. Presently, PSNY stock has declined as Hertz (NADSAQ:HTZ) delayed purchasing its EVs, opting to sell some Tesla (NASDAQ:TSLA) models instead. Hertz previously ordered 100,000 Tesla Model 3s in 2021, followed by adding Model Ys the next year. Later, it struck a deal with Polestar for up to 65,000 EVs, aiming for a quarter of its fleet to be electric by 2024. However, the plans have now been abandoned. However, Polestar did see upward earnings estimate revisions, a bullish sign for long-term investors. Over the past month, Polestar’s consensus EPS estimate for the year rose by 1.7%, indicating analysts anticipate improved earnings. General Motors (NYSE:GM) is set for higher heights this 2024 especially after it revealed a successful Q4 earnings report and an optimistic 2024 guidance. The report showed an impressive $1.8 billion profit and an equally-impressive earnings per share number of $1.24. Thus, the company surpassed guidance and expectations on both the top and the bottom-line, providing a reprieve for investors who know how tough 2023 was for the auto maker. In Q4, GMC and Cadillac saw declines of 6.5% and 7% in higher-priced vehicle sales. A key strike cost GM $1.3 billion. However, the guidance for this year is skewed positively, with GM anticipating a $14 billion profit at most and $9.50 earnings per share. The company also aims to produce over 250,000 battery EVs, about 30% more than they produced in the past 12 months. Current GM CEO Mary Barra has outlined her priorities. These include: optimizing the company’s ICE lineup, expanding the profitable EV business and revamping Cruise’s autonomous vehicle unit. Following incidents in California, Cruise testing ceased in October, with CEO Kyle Vogt resigning the following month.  After a challenging 2023, GM’s recovery may already be underway, making it an opportune time for a buy-and-hold strategy. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Automotive, Consumer Discretionary, Electric Vehicles Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/3-up-and-coming-ev-giants-you-can-ride-to-the-finish-line/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}