{
    "title": "China, Xi Jinping Plan to Crush Elon Musk, Tesla, and the US EV Industry",
    "date": "2/25/2024",
    "url": "https://www.businessinsider.com/china-xi-jinping-crush-tesla-elon-musk-american-ev-industry-2024-2",
    "text": "Inside Beijing's grand plan to dominate the future of electric cars        When Tesla CEO Elon Musk was asked in 2011 about the Chinese electric-car maker BYD — a Warren Buffett-backed company focused on cheaper eclectic vehicles with a name short for Build Your Dreams — he simply laughed it off. \"Have you seen their car?\" he said with a giggle to Bloomberg TV, adding that BYD didn't \"have a great product\" and \"the technology is not very strong.\" Musk's juvenile expression of hubris was (and still is) singular, but his belief that China's automakers were not a threat was shared across the US auto industry at the time. A lot can change in 13 years. BYD eclipsed Tesla in 2023 as the best-selling EV maker in the world. One out of every three electric cars sold is made by the company, up from 15% in 2020. Instead of laughing off the competition, Musk is now sounding the alarm on threats from Chinese automakers. On a conference call with investors in January, he said Chinese EVs would \"pretty much demolish\" other American carmakers if allowed to enter the US. America's biggest car companies have also started to recognize that they must figure out how to make electric cars cheap as soon as possible before China eats their lunch. While the likes of Tesla, GM, and Ford are rolling out a handful of high-priced luxury EV models, Chinese companies already offer a slew of options across a range of price points: starter EVs, beater EVs, ones for getting from point A to point B. And while the American automakers are still trying to win over consumers just in their own country, Beijing is already planning to work around trade barriers and get these cars sold around the world, including in the US. \"The thought that Chinese-quality engineering and design are not as high quality as the legacy carmakers — that should be put to bed,\" Tu Le, the founder of Sino Auto Insights, a consultancy focusing on the Chinese EV market, told me. \"Right now, the legacies don't have competitive products. There's a vacuum. If China EV Inc. were allowed to enter the US today or next year, the legacies would be gutted.\" We are witnessing a shock to the global automotive order unseen since Japan barreled into the market in the 1970s. China's EV ascendance has sparked a fight that is forcing companies to stretch the limits of their technological capability and policymakers to reimagine the ideological underpinnings of decades of trade strategy. What's at stake is nothing less than a US industry worth $104 billion, about as much as Angola's national GDP, and all the 3 million jobs that come with it. \"It's a global game. It has been a global game,\" Le said. \"Motherfuckers just haven't been paying attention.\" It's safe to say EVs have moved beyond the \"early adopter\" phase of the technological life cycle and are now working to conquer mainstream car buyers in the US. In 2023, 1 million were sold in the country for the first time, up from 918,500 in 2022. Despite this growth, there have been flashing red signs that American automakers' strategy — making EVs that are just like combustion-engine cars but about $10,000 more expensive — isn't working. Projections for sales growth in the years ahead have come down, and consumers have expressed dissatisfaction with the crop of cars available. To overcome that, carmakers have realized they must lure customers with cheaper models. Earlier this month, Ford CEO Jim Farley said his company was \"ruthlessly\" focused on developing a more affordable mass-market car. Tesla has been saying a cheaper car is on the way for years, without success (yet). While US carmakers are still figuring out how to please a wide variety of customers, Chinese brands have EVs in about every form imaginable. Want a $10,000 car? Try the BYD Seagull. Want a luxury SUV that can float in water? That's the BYD U8 Premium Edition. Want something more luxurious? Chery, another Chinese carmaker, launched a sexy EV sports car with scissor doors called the iCar, which costs between $21,800 and $58,000. China's ability to expand its suite of offerings comes down to cost. Of course, the US has higher labor costs, but China has also taken great pains to own the EV supply chain. Legacy carmakers are still searching around the world to source the raw materials and parts they need, a project the Chinese government has been working on for over a decade. In fact, many of these companies are selling their products to American firms: Tesla buys batteries from BYD, for example. That doesn't mean Chinese car companies aren't facing challenges. While the US's strategy (or lack thereof) has left us without enough chargers or the right kind of inventory, China has the opposite problem. It has too many EVs, too many EV makers, and a flagging domestic economy. China EV Inc. needs to expand to new markets. The future of the auto industry hangs on whether it can start to do that before the rest of the world can catch up. The year Musk tittered at the idea of Chinese EVs overtaking Tesla, the country produced only 5,000 electric cars. But Beijing's plan to dominate the global EV space was already well underway. The Chinese Communist Party started out by setting the goal of having EVs make up 25% of all cars sold in China by 2025 and showered money on companies with anything even resembling a plan to contribute to that goal. At the same time, the government set about marshaling all the raw materials Chinese companies would need for EV batteries and drivetrains, creating a domestic ecosystem for suppliers. In this way, its industrial policy for EVs copied past plans to dominate steel and solar panels — flood the market with supply until Chinese manufacturers were the only game in town. But in 2016, the CCP changed course. The grant money for EV research and development petered out, and the government announced that by 2027, it would phase out subsidies that lowered the price of electric cars for consumers. Beijing also instituted policies that opened the door for foreign carmakers to invest more in China's domestic industry and move manufacturing there. The result was pure carnage for China's domestic EV industry. Companies that depended on Beijing for subsidies began to implode, and small players got pushed out of the market. But the chaos ended up strengthening the country's auto sector, ensuring that the most competitive carmakers gained market share. What emerged started to look more like a more mature industry — one with the capacity to manufacture world-class products. Last year, China became the world's largest auto exporter. None of this means the road ahead is any easier for the victors of Beijing's EV wars. Chinese automakers now have to deal with slower domestic demand as the Chinese economy enters a protracted phase of slower growth. At the same time, they know that their growth and success are central to the vision of China's technological landscape that its leader, Xi Jinping, has. Slowing down is not an option. The sector is expected to add capacity for 5 million more cars (most of them EVs) by 2025. Domestic sales are projected to reach only 3.7 million in that same period. Sales for standout startups such as Nio, Li Auto, and XPeng are already coming in lower than expected. BYD alone has built enough capacity to manufacture 4 million cars in China. In 2023, it sold 3 million cars total. All these cars need somewhere to go, and for China EV Inc., the more profitable option is to move them west — first to Europe, where trade barriers are easier to overcome (for now), and eventually to the US. That is why brands such as BYD, Chery, and SAIC are all in discussions with the Mexican government to expand operations there. They need a toehold in North America to even begin conquering the US market. In the meantime, the US government is trying to spend an EV-parts ecosystem into existence, in part by handing out grants from the Energy Department to domestic companies working on battery technologies. No country wants to lose its automotive sector, so in Brussels and Washington, the rise of China's national champions has become a thorny topic between international-trade interlocutors. In public forums, Chinese trade apparatchiks have talked a good game about culling excess capacity to assuage the fears of their counterparts. But at the same time, Beijing has put out an 18-point plan to counter trade restrictions and push Chinese EVs out to the world. None of this is really up for negotiation. To dominate the global market, Chinese automakers have to find ways to slip around the various barriers Western nations have put up. To crack Europe, BYD has announced plans to build a factory in Hungary. Cracking the US is more complex. It has more trade barrier protection from a China Auto Inc. onslaught, but it may not work forever. Take, for instance, America's taxes on Chinese EV imports. The Trump administration smacked a 25% tariff on Chinese EVs, bringing the total levy for their entrance to the US up to 27.5%. To avoid the tariffs, brands like BYD, Chery, and SAIC are all in discussions with the Mexican government to expand operations there. \"Most likely, the way Chinese companies would be able to participate in the US EV market would be by investing in the Mexican auto-parts sector,\" Mary Lovely, an economist and senior fellow at the Peterson Institute, told me. Parts that come from Mexico would be considered North American-made and subjected to lighter restrictions under the US-Mexico-Canada trade agreement. EVs fully built in China would also not be eligible for a $7,500 tax rebate for consumers created under President Joe Biden's Inflation Reduction Act. They would be eligible, though, if they were built in Mexico and met specific battery-sourcing requirements. For some stakeholders, the barriers aren't high enough. US consumers have shown that if the price is low enough, \"Made in America\" takes a backseat. That's why the United Auto Workers union is already so worried about Chinese cars that it has asked the White House to raise tariffs even more. The Biden administration has said it's seriously considering such a move. This auto industry has become caught up in the existential question that is bedeviling societies all over the world — is globalization worth it? In this case: What do we care about more, preserving the auto industry or giving consumers a variety of cheap EVs to choose from? \"We want to maintain an auto industry in the US — that's essential for jobs, national security, and for other sectors of the economy,\" Lovely said. \"But then the question is how much protection do you need, recognizing that it's not a free lunch. This is why people don't like economists. We keep reminding people none of this is free.\" There is no telling how this will all shake out. Sure, Chinese EV makers are lean and mean, but they've never had to deal with international markets before. Beijing is used to dealing with foreign brands entering its market, not the other way around. For most of China's rise, it has operated in a cooperative world. Now it's operating in a world where its most important trading partners no longer trust Beijing. EVs collect so much data that policymakers have started to frame this debate as one not just about trade but also about national security. That's a harder debate for China to win. In the US, the race to counter China by building a cheaper EV is on. Tesla could pull ahead if delivers on its promise to get its $25,000 car out by 2025. But the company has a history of delayed product launches, an ongoing price war impairing cash flow, and an erratic, X-distracted CEO to deal with. Big Auto is contending with a more muscular United Auto Workers, more skittish shareholders, and management that has done nothing but fall behind. That said, America's legacy automakers have experience fighting for their survival and winning. Whatever happens, what is guaranteed is a transformation of the auto industry. Linette Lopez is a senior correspondent at Business Insider. Through our Discourse journalism, Business Insider seeks to explore and illuminate the day’s most fascinating issues and ideas. Our writers provide thought-provoking perspectives, informed by analysis, reporting, and expertise.\n                              Read more Discourse stories here. Related stories More from Transportation Jump to "
}