{
    "title": "Tesla Bull Adam Jonas' Investor Survey Reveals Overwhelming Negativity \nTowards EV Giant's Stock, Analyst",
    "date": "2/19/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37204975/tesla-bull-adam-jonas-investor-survey-reveals-overwhelming-negativity-towards-ev-gi",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Morgan Stanley analyst and Tesla Inc TSLA bull Adam Jonas on Monday conducted an investor survey to note the overwhelming negative sentiment on the EV giant’s shares. The analyst, however, continues to be bullish. What Happened: 84 investors responded to Morgan Stanley’s investor survey and the results are largely negative, Jonas said. Three-quarters of the respondents believe the stock is yet to bottom, bears outnumber bulls by over 2 to 1, and investors are focussed on the dwindling EV demand narrative. While a whopping 60% of the respondents expect Tesla shares to underperform as compared to the S&P through year-end, about 75% of the survey takers expect the shares to bottom at or below $150 before. Jonas, however, continues to maintain his overweight rating on Tesla with a $345 price target. The analyst reiterated his view of Tesla as more than a mere EV company but as an energy, AI/robotics combined company with the different segments of operations coming together to reach his price target. Morgan Stanley is now awaiting Tesla’s AI Day 2024 for further updates on its AI efforts. Why It Matters: During Tesla’s fourth-quarter earnings call in January, Tesla CEO Elon Musk said that the company refrained from hosting another AI day event since 2022 due to concerns about potential imitation. The CEO, however, also expressed openness to considering such an event this year. \"Our main goal with these AI Day things is recruiting and to sort of change the perception of Tesla as people thinking of Tesla as a car company when they should be thinking of Tesla as an AI robotics company,\" Musk explained. Musk has emphasized Tesla's leading position in real-world AI and has consistently stressed that Tesla is not just an automobile company but an AI and robotics company. He has even rejected comparisons with Japanese automaker Toyota Motor Corp, deeming it a \"wrong frame of reference.\" While Tesla remains rooted in electric vehicle manufacturing, the company has diversified its business to encompass energy storage solutions, solar products, supercharger stations, software, and robotics. Photo Courtesy: Shutterstock.com Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Tesla Engineer Clears The Air On Rusting Cybertrucks, Gives Cleaning Tips On How To Deal With ‘Surface Contamination’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}