{
    "title": "Bet On Tesla Stock, It's A Bet On Elon Musk's AI Future (NASDAQ:TSLA)",
    "date": "2/21/2024",
    "url": "https://seekingalpha.com/article/4671901-bet-on-tesla-its-a-bet-on-elon-musks-ai-future",
    "text": "FotografieLink FotografieLink Tesla, Inc. (NASDAQ:TSLA) reported Q4 earnings last month, which thoroughly disappointed a lot of investors. The company missed both EPS and revenue and over the last year, and it has not shown a great trajectory. Revenue growth has slowed down, margins peaked in 2022, and the stock price has also been sliding down since then. Margins are down, production has faced issues, and overall demand just doesn't seem to be as strong as one might have expected. Following the latest quarter, it has become very clear that, as a car maker, Tesla is falling behind. The company will be able to achieve neither the margins nor the revenues to justify the price solely with car sales. Tesla owners today are inherently betting on CEO Elon Musk's artificial intelligence (\"AI\") vision. The eccentric billionaire has already said he wants to own 25% of the company in order to pursue his AI ambitions. The company's AI projects include Dojo, Optimus, and even, hypothetically, being the world's largest computing power providers. Does it make sense to bet on Musk here? In this article, I look at each of the company's AI endeavors qualitatively to better understand the kind of advantage, if any, Tesla has in this segment. In my last Tesla article, I quantified the value of Tesla's \"side projects\", to see just how much the company could be worth by 2030. Today, however, I want to dive deeper into the qualitative assessment of Musk's recent claims that Tesla should be viewed as an AI and robotics company. If that is indeed the case, what are Tesla's main products and value propositions aside from cars? What are its competitive advantages? And who are its main competitors? Given the latest results, I am still bullish on the future of the company, but I am moving to a buy rating, given the poorer outlook for the business in this last quarter and for 2024. The latest earnings were disappointing to many investors, and though the stock sold off, we have seen somewhat of a recovery since the release. Financial Summary (Investor slides) Financial Summary (Investor slides) As we can see, automotive revenues for the full year grew a \"measly\" 15%. However, we saw a 54% increase in energy storage and 37% in services. I think the biggest issue for investors was the reduction in operating margins, which peaked in 2022 and have come down significantly this year. Operational Summary (Investor slides) Operational Summary (Investor slides) In terms of production, it's also quite discouraging to see the fact that the Model Y is the only car that grew this year, with production in other models down 12%. Some of this can be attributed to the company's hard-fought road to get the Cybertruck out. It remains to be seen if this will pay off: As long as the price is affordable, I mean, I see us ultimately delivering on the order of 0.25 million, something like 0.25 million Cybertrucks a year in North America, maybe more. But give or take roughly on that time frame, and it sure is a head-turner.\" Source: Elon Musk, Q4 earnings transcript. A bold statement from Musk, but 2024 still seems like it could be a tough year. Vehicle production is expected to be notably lower in 2024 as the company transitions to a more efficient model. Musk and Tesla have always had high ambitions. Did they bite off more than they could chew? 2024 will hold the answer, but even I have concerns over the more immediate outlook for the company. A few years ago, Tesla was an absolute pioneer in electric vehicles. It was thought that the company could easily dominate market share in foreign regions like Europe and China, but the reality has been far from this. Europe Market Share (Zoltan Ban SA Article) Europe Market Share (Zoltan Ban SA Article) Over in Europe, Tesla has amassed a 12.7% market share throughout the first nine months of 2023. The European automakers have caught on to the EV trend fast and now pose a very significant competitive threat to Tesla. The situation in Europe was very well covered in this article by my fellow SA contributor, Zoltan Ban. But the situation seems to be even worse in China. NEV sales china 2023 (CPCA) NEV sales china 2023 (CPCA) EV competition has been even more fierce in China than anywhere else. New small competitors have popped up everywhere, and Tesla is already second to the unchallengeable BYD. BYD Auto is a subsidiary of BYD Company (OTCPK:BYDDF), a Chinese multinational manufacturing company. It was founded in 2003 and released its first car in 2005. Since 2020, the company has seen a great acceleration in growth, as it has taken the Chinese market by storm, and it now has plans to debut its first model in Europe. Still, it looks like in 2023, Tesla maintained a solid second place. Well, based on the most recent data, Tesla is quickly slipping. NEV sales China January 2024 (CPCA) NEV sales China January 2024 (CPCA) In January, Tesla ranked fifth in terms of market share, with Geely (OTCPK:GELYF), Changan, and SAIC all moving ahead. Bear in mind China accounted for 22.5% of Tesla's revenues in 2023. This is a huge market for Tesla and one that it is losing its grip on. And that's not even mentioning all the geopolitical risks of doing business in China. Such a high concentration of revenue in China is definitely a problem. With the latest 2023 numbers in the rearview mirror, one thing is clear: Tesla needs to do more. The company has always commanded a premium valuation, and this can no longer be justified on EV hype alone. Tesla Market cap vs other automakers (Wolf street) Tesla Market cap vs other automakers (Wolf street) At one point, Tesla's market cap equalled that of most of its main competitors. Now, it is true that right now market cap sits around $600 billion, but that would still be more than its four largest competitors combined. It's time for Tesla to take the next steps in developing its software and AI initiatives and really show investors how and when these will begin to pay off. While we continue to execute on innovations to reduce the cost of manufacturing and operations, over time, we expect our hardware-related profits to be accompanied by an acceleration of AI, software and fleet-based profits, Source: Press Release. In fact, Musk himself has been very clear in recent weeks that he wants to make Tesla a leading company in AI and robotics, and in order to do so, he wants to increase his position in the company. I am uncomfortable growing Tesla to be a leader in AI and robotics without having 25% voting control, Source: Elon Musk on X. AI has been talked about a lot in the last year; it was again a central part of the Tesla earnings call, and it will no doubt define Tesla's future. So, let's go ahead and analyze Tesla's AI roadmap, which I have broken down here into three distinct initiatives. Tesla's Dojo supercomputer made headlines when it was released at Tesla's AI day in August 2021. Dojo is only one of the two ways in which Tesla is currently trying to achieve full self-driving (\"FSD\") technology. The Dojo could be seen as an \"alternative\" to Tesla's primary GPU cluster using Nvidia (NVDA) chips. The Dojo supercomputer runs on Tesla's custom-designed D1 chips, produced by Taiwan Semiconductor aka TSMC (TSM). The Dojo supercomputer is used to train machine-learning models that support Tesla's self-driving technology. At one point, Dojo was valued at a potential $500 billion by Morgan Stanley. However, it's very important to note that Elon Musk has really tempered down the expectations on Dojo in the last earnings call. And we're pursuing the dual path of Nvidia and Dojo. But I would think of Dojo as a long shot. It's a long shot worth taking because the payoff is potentially very high. But it's not something that is a high probability. It's not like a sure thing at all. It's a high-risk, high-payoff program. Dojo is working, and it is doing training jobs, and we are scaling it up, and we have plans for Dojo 1.5, Dojo 2, Dojo 3, and whatnot. So I think it's got potential, but I can't emphasize enough. High risk, high payoff. Source: Elon Musk, earnings call transcript. High-risk, high-reward. When Musk says something is a high-risk long shot, I take it to mean it is highly improbable. With that said, FSD isn't a long shot. Core technology (Investor slides) Core technology (Investor slides) The company's FSD software continues to accumulate driven miles quarter after quarter, and this is a testament to Tesla's key advantage in this area. Each Tesla the company sells is a walking and talking computer, sending very valuable data back to the company. Musk himself has talked about the fact that Tesla could be selling cars at a loss, and it would still be generating huge value. This value lies in the network of cars that are roaming the street, which are feeding Tesla's machine learning models and could potentially one day even operate as a huge fleet of robot-taxis, and perhaps even more. …I mean, there's a potentially interesting play where when cars are not in use in the future that the in-car computer can do generalized AI tasks, can run a sort of GPT-4 or GPT-3 or something like that. If you've got tens of millions of vehicles out there, even in a robotaxi scenario where they're in heavy use, maybe they're used 50 out of 168 hours, that still leaves well over 100 hours of time available -- of compute hours. It's possible with the right architectural decisions that Tesla may in the future have more compute than everyone else combined. Source: Elon Musk, earnings call transcript. That's certainly an interesting notion. It's possible that one day, Tesla's cars will literally be used for much more. This is still a long way away, but it can give us some insights into what Musk's vision is. Tesla's Optimus robot is in my opinion an underappreciated project. A lot of people see this as a gimmick, but the potential market moving forward in robotics is huge, especially once we fully integrate it with AI. Optimus, obviously, is a very new product, an extremely revolutionary product, and something that I think has the potential to potential to far exceed the value of everything else that Tesla combined. When you think of an economy, economy is productivity per capita times capita. But what if there's no limit to capita? There's no limit to the economy. Source: Elon Musk, earnings call transcript. The Optimus Gen 2 is a humanoid robot that can walk and perform some everyday tasks. Clearly, this is an initiative with tons of potential. A few weeks ago, Musk actually took the Optimus 2 on a walk around the Tesla factory. The robotics industry could grow to over 270 billion by 2032. And, as mentioned by Musk in the earnings call, Tesla is arguably already the largest robot maker in the world, as, in essence, cars are four-wheeled robots. With that said, competitors are already at Tesla's heels, with Microsoft (MSFT) and Figure AI already in talks to raise $500 million for FigureAI, a competing humanoid robot. Again, we can't deny that Tesla does hold a competitive advantage in this segment. Even if, arguably OpenAI and Microsoft can produce a better AI, the larger hurdle will be production, something that Tesla has a lot of experience in. Again arguably, a lot of the infrastructure they already possess could be repurposed to scale up the production of humanoid robots and other types of robotics. Tesla's energy business is booming, with energy deployment increasing by 125% in 2023. Energy storage (Investor slides) Energy storage (Investor slides) By itself, the energy business is already another reason to be bullish on Tesla. It's not crazy to think that this could one day contribute as much in revenue as car manufacturing. But there's even more to this. I see the energy segment as another area where Tesla can leverage the best from its software and machine learning. In fact, the company is already doing this through the Tesla Autobidder, which provides energy users with a way of monetizing their energy assets. The autobidder is a real-time algorithm that optimizes energy operations. It is part of the larger Energy Software that Tesla calls Autonomous control. According to a Tesla employee, the autobidder has a global portfolio of 7GWh of battery storage, and has generated over $330 million in profits to its users. As we know, energy production, especially when it comes to renewables, is only a small part of education. Storage and distribution are even more important, and Tesla is making great leaps in this department. It's important to note, that Dojo and Optimus do not currently produce any revenue for the company. But can they? The Dojo supercomputer could be the base for the company's FSD technology, which would initially help Tesla increase service revenues. Tesla would probably charge a subscription in order to access FSD. Goldman Sachs predicts FSD could contribute as much as $75 billion in revenues by 2030. This would be level one. The second level, would be leveraging each car in a fleet of robo-taxis, which Musk has also alluded to, and the third level, would be simply harnessing the raw computing power of each car, which Musk alluded to in the last earnings call. Of course, any revenues from these two would probably take years to materialize. I'd be looking at a time frame beyond 2030. Moving on to the Optimus, it's also very hard to value this segment, but we can give it a shot. Robotics is becoming a very important technology. Just look at the current trend in Amazon (AMZN). Amazon employees vs robots (blog.finxter) Amazon employees vs robots (blog.finxter) Robots could one day even outstrip humans in the workforce. For the time being, though, I think humanoid robots could become as ubiquitous as phones. Apple (AAPL), one of the most dominant companies, sells close to 230 million new phones per year. This seems like an achievable target for the Optimus, eventually. Optimus projections (finxter) Optimus projections (finxter) We can estimate that revenues could be close to $4 trillion, with a sale price of $20,000. Lastly, looking at the energy segment. As shown in the investor slides above, this contributed $6 billion in revenue in 2023, with a projected gross margin of 25%. gross margins by segment (Heller House) gross margins by segment (Heller House) By my previous calculations, energy could add almost $55 billion in gross profits by 2030, but this doesn't even take into account the added revenues that could come from integrating AI technology like the autobidder, which is already adding significant value. Following the latest earnings results, it should be clear to everyone that Tesla's car business is slowing down in terms of growth and will likely fail to produce meaningful margins. Anyone interested in buying at today's price is taking a leap of faith in Musk's AI vision. I see some similarities between Musk's moves and what Amazon did with AWS, or perhaps a more recent comparison can be made between Musk and MicroStrategy's (MSTR) Saylor. Saylor went all in on Bitcoin (BTC-USD), and, at least today that bet is paying off. Musk's Tesla has the right ingredients to become a leading AI and robotics company. Good software, manufacturing infrastructure, a visionary CEO and plenty of talent amongst its ranks. But will this be enough? I am happy to place a small bet on Musk and Tesla. He has a solid track record and the right tools for the job. This is a high-risk/high-reward opportunity, which is exactly what I look for in my YOLO portfolio. Joint the Pragmatic Investor today to get insight into stocks with high return potential. You will also get: - Weekly Macro newsletter - Access to the End of The World and YOLO portfolios - Trade Ideas - Weekly Video This article was written by James Foord is an economist by trade and has been analyzing global markets for the past decade. He leads the investing group The Pragmatic Investor where the focus is on building robust and truly diversified portfolios that will continually preserve and increase wealth. Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSLA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}