{
    "title": "What it's like to take the Cybertruck camping",
    "date": "2/10/2024",
    "url": "https://www.businessinsider.com/tesla-cybertruck-owner-camping-trip-video-2024-2",
    "text": "       Tesla's rough-and-tumble Cybertruck might be perfect for camping, at least according to one owner, but it's missing one key feature — enough heat in the truck's bed for chilly nights. Cybertruck owner Ben Levin said he doesn't camp often, but he wanted to put the electric vehicle to the test so he spent a night sleeping in the bed of the truck at Pace Bend Park in Spicewood, Texas. \"There's a stigmatism that EVs aren't good for camping and I wanted to see for myself,\" Levin told Business Insider. \"It's basically like camping with a mobile power station — or really more like 'glamping.'\" Levin, who documented the experience in a YouTube video, said he used the truck to power a griddle for cooking, charge his phone, and even tested out a gaming setup powered by the Cybertruck and Starlink's portable internet service. Overall, the YouTuber said he was impressed by the experience. \"The best part was the ability to power all the devices,\" he said. \"The fact you can just plug a griddle into the back of the truck is pretty cool.\" The Cybertruck owner said he didn't see a dramatic power drain as a result, even though he used Tesla's Camp Mode feature to keep his dog warm inside the truck's cabin for a portion of the night. Related stories Levin identified several Cybertruck features that made it ideal for camping, including the spacious design of the truck. Between the frunk, tonneau-covered bed, and large cabin, Levin said he had more than enough space to pack all his camping gear. He also pointed out that the light bar in the bed of the truck was the perfect night light that he could control from Tesla's app and he took  advantage of the power outlets in the bed of the Cybertruck. Despite all of the perks, Levin said the camping trip wasn't ideal for a Texas winter night, where the temperatures hit 34 degrees. \"I slept like shit,\" Levin said in the video. \"It was really really cold. I was freezing.\" Ahead of the Cybertruck's release, some Tesla enthusiasts had speculated that the carmaker might design a truck bed that would connect to the vehicle's HVAC system, allowing the bed to be warmed or cooled while in Camp Mode. In 2019, Tesla CEO Elon Musk said on social media that the truck would \"probably\" be able to pump heat and air conditioning into the bed of the truck when the tonneau is closed. But when the Cybertruck was released late last year, it became clear Tesla had chosen to keep the vehicle's bed completely separate from the cabin, eliminating the option to adequately heat the back of the vehicle. To combat the cooler temperatures, Levin said he'd recommend Cybertruck owners consider bringing a heated blanket or portable heater for camping trips in colder weather. While Levin camped with a generic truck tent, several companies have been building prototypes for Cybertruck-specific campers. Ahead of the Cybertruck's release, Space Campers began collecting $100 refundable reservations for its $24,000 Cybertruck camper attachment. And another company, CyberLandr, designed a prototype for a $55,000 attachment. Tesla, however, recently announced the $2,975 Cybertruck Basecamp, a \"fully collapsible, self-contained pack\" that is mounted \"above the truck bed but below the tonneau cover\" to conserve storage and range. Do you own an EV or work for Tesla? Reach out to the reporter from a non-work device and email at gkay@businessinsider.com Read next Jump to "
}