{
    "title": "World EV Sales Report — Tesla Model Y is the Best Selling Model in the \nWorld!",
    "date": "2/5/2024",
    "url": "https://cleantechnica.com/2024/02/05/world-ev-sales-report-tesla-model-y-is-the-best-selling-model-in-the-world/",
    "text": " The last months of 2023 brought a record-fest for world plugin vehicle sales, with 3 months out of the last 4 setting new sales records. December was one of them, with over 1,550,000 registrations. With plugin registrations jumping a significant 35% in 2023 compared to 2022, the year ended with the plugin market above the 13 million mark for the first time. In fact, it almost reached 14 million. Approximately 13.7 million units were registered in 2023. Plugin hybrid electric vehicles (PHEVs) ended the year growing faster than BEVs — +47% year over year (YoY) versus +30% YoY. That allowed them to end the year with 31% of plugin EV sales, up 3 percentage points from the 28% of 2022. Interestingly, the EV sales breakdown between the two powertrains has been balancing between 31% and 26% since 2018, giving credit to those who say that PHEVs will still be around for a while. The December plugin vehicle (PEV) share jumped to a record 22% share (15% BEV), pulling the final 2023 plugin share to 16% (11% BEV), a small rise from the 14% (10% BEV) of 2022. That’s because the overall market also grew in double digits in 2023. Still … the Disruption Zone is here to stay. The 16% share (11% BEV) is a significant departure from the 9% (6.1% BEV) of 2021, and an even bigger jump from the 4% of 2020…. There’s no turning back, folks. Sure, in 2024, Trump could be elected in the USA and end EV subsidies there; in this year’s European elections, the far right could win big and soften the EU’s 2035 ICE ban; protectionist moves could happen across the world — but the truth is that those setbacks would only delay the EV Revolution, not derail it. We are already too far ahead in the process. But back to 2023: with double-digit scores being the rule in 2023, strange things happened in the overall market, like the Tesla Model Y becoming the global best seller (of all light-duty vehicles) and BYD surpassing Volkswagen in China and becoming that market’s new king. So, yes, disruption is official and the global automotive market will never be the same again. What previously unthinkable trends will pop up in the global market due to plugins rising? Please place your bets now.  The Tesla Model Y won another monthly best seller title, with over 128,000 deliveries. Expect the Model Y to continue racking up a series of monthly best seller titles in 2024, as the midsize crossover is now in full maturity this year. With a refresh coming around April, expect 2024 to be the best year of the current generation’s career. Just below, the BYD Song was again runner-up, hitting a record 76,086 registrations. That could possibly be its peak performance, given that the just-landed Song L will steal a significant volume of sales from it in 2024, as will the future Sea Lion, BYD’s real Tesla Model Y competitor. The last place on the podium went to the Model 3, which had more than 56,000 deliveries, ending well ahead of the #4 BYD Qin Plus. Off the podium, the highlight is the #8 Wuling Bingo. Thanks to its continuous production ramp-up, the small EV seems ready to go neck and neck with the BYD Armada for top 5 positions in 2024. And BYD sure needs some competition…. Going up a notch, when it comes to size, the compact category saw two models shining. First was the #15 VW ID.3, which, thanks to some aggressive price cuts in China, saw its fortunes change completely in that market, compensating for the so-so performances of the model in Europe. In December, the ID.3 reached 17,861 sales, its best score since the artificial 28,000 sales of December 2020 (when Volkswagen basically dumped thousands of ID.3s on dealerships in order to comply with emission requirements). So, one can say that this December result is, in reality, a record performance. Now all the German brand needs is to fix (as in, cut prices significantly) its European operations and it could get the ID.3 into the top 10. The other category highlight was SAIC’s MG4 (MG Mulan in China), with the good looking hatchback scoring 12,964 sales in December, its second record score in a row. It looks we will start to see this value for money EV more regularly on the table. Chip in a few dollars a month to help support independent cleantech coverage that helps to accelerate the cleantech revolution! Being a record month, record performances haven’t stopped here. In fact, the most significant record scores came in the full size category, with the highlights being the fact that the whole Li Auto lineup reached record heights (20,428 units for the L7, 15,013 for the L8, and 14,913 for the L9), which meant that the hot startup scored over 50,000 units in December alone! And that was in only the full size category. The most immediate victim was BYD, still the category leader in 2023, which saw sales of its full size duo (Han/Tang) pale next to Li Auto, with some 33,000 combined units. With this in mind, Li’s current profit margin per unit sold must be among the best in the industry…. And still, December’s best selling full size model was neither a BYD nor a Li Auto, but a model from another make. It was the #10 AITO M7, which had an amazing 25,545 deliveries! With Huawei putting the whole weight of its strength into the AITO brand, sales are jumping through the roof. Clearly, Huawei is looking to replicate Li Auto’s formula. If someone is looking for an underdog that will surprise everyone in 2024, this could be it.  Interestingly, all of the 20 models present here are being made in China — 16 belong to Chinese OEMs, and 7 come from BYD alone. These stats speak volumes to the importance of the Chinese market in the broader EV industry. Outside the top 20, there is also a lot to talk about. Going by size category, the little Geely Panda Mini was close to joining the table, having ended the month fewer than 300 units behind the #20 BYD Tang. The compact Audi Q4 e-tron was also close, with 11,260 registrations. In the midsize category, SUVs are on trend, with several record performers, the most surprising of which was the Volvo XC60 PHEV. After several years on the market, it reached a record 7,868 registrations in December. Lynk & Co saw its 08 PHEV reach 10,055 registrations, SAIC’s IM brand is ramping up its LS6 midsize SUV (9,878 registrations in only its 4th month on the market), and Changan is doing the same with its Deepal S7 (11,360 registrations). But because not everyone likes SUVs, the recent Wuling Starlight, a rather stylish sedan coming from the SGMW joint venture, seems to be on track for success, having gotten 8,050 deliveries in December. With all the talk of GM investing in PHEVs, maybe the OEM could bring the production of the Wuling Starlight to the USA, as a Chevrolet maybe? I will even give them one suggestion, after having the Chevy Volt and the Bolt, why not the Chevy Jolt? (Editor’s note: A Chevy fan had the idea for this several years ago, and even created a fake webpage for it, which is still live! See — sometimes the internet is a cool place. —Zach) Regarding the full size category, the highlight is coming from the USA (surprise!), with the Jeep Grand Cherokee PHEV (surprise, surprise!) reaching a record 7,299 registrations. That might not sound like much, especially compared to the 25,000 registrations of the AITO M7, but it was enough to be the best selling full size model not made in China. Finally, a special mention goes out to BMW. The i4 continued to ramp up deliveries, reaching another record score of 11,203 registrations in December. This allowed it to be the best selling EV without production in China. Still, the BMW fastback has a long way to go in order to become relevant in the midsize category. After all, despite this constant improvement, the electric BMW only had about one fifth of the sales of the best selling midsize sedan in December (the Tesla Model 3 — 56,896 registrations). But the good news does not end there for BMW. The compact IX1 is also on a records streak and reached 8,775 registrations, its 3rd record in a row, while the big iX SUV also shined, with 7,027 deliveries. With the rather good looking i5 in ramp-up mode, expect the German models to continue being mentioned here in 2024.  In the final 2023 table, the Tesla Model Y again had the highest place on the podium, with 1.2 million registrations. That allowed it to be the best selling model not only in the EV category but also on the mainstream market! This 1.2 million volume represented a 57% increase over the 771,000 units registered in 2022. Expect it to again be the main candidate for the global leadership position in 2024, ahead of globetrotters like the Toyota Corolla and Toyota RAV4. The podium was the same as in 2022, with the BYD Song beating the Tesla Model 3 and taking the silver medal. The Chinese SUV ended the year with 636,000 registrations, 33% progress over 2022. As for the #3 Tesla Model 3, it ended with 529,000 registrations, its best result ever. Still, despite the recent refresh, this is a model at full maturity. Not only has the sedan seen its market share erode (14% in 2019; 12% in 2020; 8% in 2021, 4.7% in 2022, 3.9% this year), but its sales have basically stagnated since 2021, the year when the sedan had 501,000 registrations, its best result until now. So, the 529,000 registrations of 2023 represented a 6% increase over 2021. In the same period, the plugin market jumped from 6.6 million units to 13.7 million units, more than 100%. So, yes, there are market limits to how much a given model can grow. By the way, for reference, the best sales year for the BMW 3 Series was 2007, when it had 555,000 registrations, and the Toyota Camry’s sales record isn’t that much higher than that, so 529,000 units is a great result for a midsize sedan. The problem is that the demand ceiling is sitting just a little bit above it. So, the medals went to Tesla (gold for the Model Y and bronze for the Model 3) and BYD (silver for the Song). Below the podium, we have a squad of BYD models (#4 Qin Plus; #5 Yuan Plus/Atto 3; #6 Dolphin; #7 Seagull). In the case of the small EV, it profited from another great performance in December to jump two spots into 7th, thus putting five BYDs in the top 7 positions, with the other two spots being filled by Tesla. This is further proof that these two brands are really in a different league….  In the second half of the table, let’s note one last-minute position change. The VW ID.3 was up one position to 15th. This was a great year for the German hatchback, having seen its sales jump 79% compared to 2022 — to 139,000 units — the first time it crossed the 100,000 units mark. All thanks to the Chinese operations…. GAC’s Aion Y and S also had great years, having seen their sales almost double, but the real climbers were the Li Auto models. The startup placed all three full size models in the top 20! Li Auto’s, and more recently AITO’s, successes have made a dent in the full size leaders. The BYD Han did win another full size category title, followed by its sibling the Tang, allowing BYD to have another #1 plus #2 win in the full size category. But the truth is that both models saw their sales drop in 2023, by 17% for the Han and 7% for the Tang. In 2024, it will be much harder for BYD to retain the full size category title. Finally, while there were four legacy OEM models in the table in 2022 (VW ID.4, Hyundai Ioniq 5, Ford Mustang Mach-E, Kia EV6), there are now only two. Both came from Volkswagen Group (#12 VW ID.4 and #15 VW ID.3). Adding the #21 Audi Q4 e-tron into the mix, we have the top three legacy OEM models in 2023 coming from the German conglomerate. Which says a lot about how far ahead they are from the remaining legacy OEMs…. Here’s a look at the 2023 segment winners: A-segment/City Cars — This is all about Chinese EVs. The #7 BYD Seagull stole the category title from the hands of the #8 Wuling Mini EV in December, which is major news in this category. The Changan Lumin was 3rd this year, but it ended far from the top two. It seems clear that the 2024 winner is already chosen — the BYD Seagull should take the title without a sweat. B-segment/Subcompacts — Another example of the Chinese takeover: In 2021, there was a French model (Renault Zoe) on top, followed by a Korean (Hyundai Kona EV). Since then, the Chinese models have taken over. This year, the leader was by far the #7 BYD Dolphin, followed by the#13 Wuling Bingo, a welcome surprise. The Peugeot e-208 was 3rd, but it was far, far, FAR away from the top two, with the French hatchback collecting just 51,000 registrations, more than 100,000 units below the Bingo and some 300,000 units behind the leader, the Dolphin. C-segment/Compacts — This category was Volkswagen’s turf in 2021, with the ID.4 on top followed by the smaller ID.3. But in 2022, the title went to the BYD Yuan Plus/Atto 3, and this year it was no different, with the crossover ending with some 419,000 registrations, doubling last year’s result! The BYD EV was followed by the MPV-disguised-as-a-crossover GAC Aion Y, which took silver thanks to 236,000 registrations. In the last position on the podium, we have the #12 VW ID.4 (up 11% YoY to 193,000 registrations). For 2024, expect an interesting race between the top two. Although, the BYD Yuan Up, a smaller and above all cheaper sibling to the Yuan Plus, could be a surprise. D-segment/Midsize — This is Tesla’s turf. The #1 Model Y was on top, up 57% compared to 2022, and the Model 3 was in third. Between these two, we had the #2 BYD Song (up 33% YoY), bringing hope to the competition. Still, the category winner for 2024 has already been found: the Tesla Model Y. E/F-segments/Full Size — Three Chinese models were on top here, with the #10 BYD Han (228,000 registrations), #14 BYD Tang (142,000 registrations), and #17 Li Xiang L7 (134,000 registrations) taking the top spots. If someone from Li Auto or AITO is looking for a podium position in 2024, they’d better have production capabilities for at least 150,000 units/year, because that should be the bare minimum to get there. And the title winner will probably end up north of 300,000 units by end of year. Pickup Trucks — This was the second year that this category had relevant numbers, with around 52,000 registrations in 2022. This is not worlds apart from the 36,000 registrations of 2022. Still, it is a 44% increase, so not too bad…. Unlike 2022, when the Rivian R1T (16,074 registrations) narrowly beat the Ford F-150 Lightning (15,625 registrations), this year things were the other way around. And, actually, Ford won by a sizable margin — the Ford model had 25,000 deliveries, while the Rivian was stuck at 15,000. In 3rd we have a new Chinese pickup truck, Geely’s Radar RD6, with 4,736 registrations. Will Tesla’s Cybertruck steal the show in 2024? I believe so. Even if Tesla delivers a low number of units in 2024, say 55,000 units, Ford’s F-150 Lightning is not likely to reach 50,000 units in 2024, so … I would be surprised if Tesla didn’t take this category’s title in 2024. LCVs/Vans — With data being less precise and a wide variety of models and body types, it is wiser to look at this category by OEM. In this case, Stellantis is the winner, with 47,000 registrations, followed by Hyundai–Kia (41,000) and Ford (20,000). Finally, a few quick notes on fuel cell vehicles. 9,511 units were registered in 2023, a drop of 38% compared to 2022, which itself had been a drop from 2021, the year FCEVs reached their peak (15,434 registrations). This year, the Hyundai Nexo (5,000 registrations) has again beaten the Toyota Mirai (4,000 registrations), thanks to its relative success in its native South Korea. Always interested in the auto industry, particularly in electric cars, Jose has been overviewed the sales evolution of plug-ins on the EV Sales blog, allowing him to gain an expert view on where EVs are right now and where they are headed in the future. The EV Sales blog has become a go-to source for people interested in electric car sales around the world. Extending that work and expertise, Jose is also market analyst on EV-Volumes and works with the European Alternative Fuels Observatory on EV sales matters. José Pontes has 469 posts and counting.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\tSee all posts by José Pontes "
}