{
    "title": "Govt's new e-vehicle policy seen as a major incentive for the sector",
    "date": "3/18/2024",
    "url": "https://www.newindianexpress.com/business/2024/Mar/18/govts-new-e-vehicle-policy-seen-as-a-major-incentive-for-the-sector",
    "text": "Analysts expect India's EV industry to get a major boost from government's just-announced e-vehicle policy and attract global players like Tesla and Vinfast to enter the segment, raising competition levels for local players like Tata Motors and choice for consumers. \"The scheme will certainly encourage global OEMs to set up manufacturing facilities in India,\" said Motilal Oswal in a note on the government's latest move. \"Also, with its emphasis on toward localization, it will foster the development of an EV ecosystem in India. This, in turn, will benefit domestic auto component players who invest in advanced technologies that are currently not manufactured in India,\" it added. Under the new policy, a minimum investment of Rs 4,150 crore (or $500m) is required to set up EV manufacturing in India, with no upper limit on investment. Manufacturers will have a three-year timeline to set up facilities and start commercial production, with a target of 25% localization by the 3rd year and 50% by the 5th year. A customs duty of 15% will be imposed on vehicles with a minimum CIF value of $35,000 and above for five years, subject to the manufacturer establishing facilities within three years. The total number of EVs allowed for import will be limited to the lower of the investment made or Rs 6,484 crore. A maximum of 40,000 EVs at a rate of 8,000 per year would be allowed if the investment is USD800m or more. The policy comes at a time when Tesla and Vietnamese EV maker Vinfast are considering India as an EV manufacturing hub. Tesla is expected to launch its most affordable EV, the Model 2, by July 2025 priced under 30,000 British pounds. If manufactured in India and priced around Rs 20 lakh, it could be a concern for domestic players like Tata Motors. Vinfast has announced plans to invest $2 billion in India for an EV plant with an initial 150,000 unit annual capacity. Its VF3 mini EV could be a fit for the price-sensitive Indian market. Analysts feel that domestic auto component players investing in advanced EV technologies stand to benefit from the policy. The entry of attractively priced global EVs under INR 2m could impact Indian OEMs. Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest  Copyright - newindianexpress.com 2024. All rights reserved.  "
}