{
    "title": "Lawyers in Musk pay case seek fee of $6 billion in Tesla stock",
    "date": "3/1/2024",
    "url": "https://www.nbcnews.com/tech/tech-news/lawyers-musk-pay-case-seek-6-billion-tesla-stock-free-rcna141480",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News There are no new alerts at this time Lawyers asked a Delaware judge to award them Tesla stock worth nearly $6 billion as of Friday as their fee for successfully arguing that CEO Elon Musk’s 2018 pay package was unlawful. The fee would dwarf records for attorney paydays if a judge approves it. Lawyers who worked on Enron-related class actions were awarded $688 million in fees in 2008. The lawyers had earlier convinced the Delaware chancery court to revoke Musk’s $56 billion pay package from 2018, with the judge ruling that Tesla’s board of directors failed to prove it was fair to shareholders. On Friday, in a petition for fees and expense reimbursement filed to that court, the attorneys argued that the fee would be justified given how much value they delivered to Tesla shareholders. The lawyers represent former heavy metal drummer Richard Tornetta, who filed the suit on behalf of his fellow Tesla investors. The lawyers are asking for just over 11% of the Tesla shares that would have gone to Musk, or slightly more than 29.4 million shares. Tesla’s stock closed Friday at $202.64 per share, meaning the fee would be worth about $5.96 billion. Taking their pay in Tesla shares demonstrates they are prepared to “eat our cooking,” the lawyers wrote. They added: “This structure has the benefit of linking the award directly to the benefit created and avoids taking even one cent from the Tesla balance sheet to pay fees. It is also tax-deductible by Tesla.” The shares they’re asking for would be freely tradeable, they noted, while Musk’s stock options included a five-year holding period starting from when he exercised them. Still, the lawyers described the nearly $6 billion in shares as “conservative” under Delaware law, which they said entitles them to 33% of the “quantifiable conferred benefit.” “Nevertheless, in an effort to be conservative, Plaintiff’s Counsel does not seek the 33%” warranted by previous cases, they wrote. They noted that they took the case on a contingency basis and would have gotten nothing if they had lost. “Plaintiff’s Counsel have not been paid for their work, nor have any of their costs or expenses been reimbursed, and litigating this Action required the allocation of a substantial amount of Plaintiff’s Counsel’s time and resources over six years, including considerable out-of-pocket expenses,” they wrote. Greg Varallo, lead counsel for the plaintiffs and the lawyer who signed the brief, did not immediately respond to a request for further comment. He’s the head of the Delaware practice for the law firm Bernstein Litowitz Berger & Grossmann. Representatives for Musk and Tesla also did not immediately respond to requests for comment. The lawyers wrote that throughout the history of the case, they collectively logged 19,499.95 hours — meaning that a nearly $6 billion award would equal a per-hour rate of $305,550. They argued, though, that the hours worked was of secondary importance, if it was worth considering at all. “Delaware seeks to incentivize, not punish, efficient litigation,” they wrote. The lawyers, based in Delaware and New York, are also asking for an expense reimbursement of $1.1 million. Musk’s pay package was the largest ever disclosed in corporate America, according to Delaware Chancery Court Judge Kathaleen McCormick’s 200-page ruling. She said that the process leading to the package was “deeply flawed” in part because Musk drove the process for determining it, and it was agreed upon by Tesla board members “who were beholden to Musk.” Musk is expected to appeal the ruling. The CEO and centibillionaire has also said he will seek to move Tesla’s site of incorporation to Texas. David Ingram covers tech for NBC News. © 2024 NBC UNIVERSAL "
}