{
    "title": "Tesla's stock is a prime example of a bubble: Research Affiliates' Rob \nArnott",
    "date": "3/25/2024",
    "url": "https://au.news.yahoo.com/teslas-stock-is-a-prime-example-of-a-bubble-research-affiliates-rob-arnott-195453373.html",
    "text": "Tesla (TSLA) shares rose by nearly 700% in 2020, and the year was capped off by their entry into the S&P 500. The “ludicrous speed” continued into 2021 — where shares went up another 18%. That means the automaker’s price-to-earnings ratio is an eye-rubbing, nose-bleeding 1,601. For context, the P/E of the S&P 500 is 30, itself, well above the historical average of 15. The next-highest tech valuation in the index belongs to Western Digital (WDC), with a P/E of 860. All of which is to say Tesla might be a bubble. Rob Arnott, founder and CEO of giant investment advisor Research Affiliates, certainly thinks so. He spoke to Yahoo Finance about the “heroin-like” monetary and fiscal stimulus that has found its way into stocks, creating bubbles. His prime example is Tesla. “When you have Tesla trading for more than the entire rest of the auto industry, excluding companies that deal exclusively in electric vehicles... what you’re looking at is an extraordinary spread in valuations,” he said. First, it’s important to define a bubble, he said. He and colleagues did so in a 2018 article, which he boiled down in an interview: “One, you’d have to use implausible assumptions in a discounted cash flow model or some similar model for valuation — implausible assumptions to justify today’s price. Part two of the definition — the marginal buyer doesn’t use those tools and doesn’t care about them,” he said. That is, they’re buying because they believe in the story to the exclusion of the numbers. Of course, there are plenty of Tesla bulls who don’t consider their assumptions to be implausible. One of them is Wedbush analyst Dan Ives, who expects the company’s production to reach 1 million vehicles annually by 2022. Last week, he raised his price target on the stock to $950, with a “bull-case” target of $1,250 a share. The cornerstone of that case is demand in China, where Tesla on Tuesday began deliveries of its Model Y. Arnott doesn’t argue that investors need to avoid Tesla, and said he’s using it as an “illustrative example. I don’t mean to single it out. There’s lots of bubbles percolating right now.” The challenge, he said, is to be prepared for the inevitable burst. “If you want to buy Tesla, buy Tesla,” Arnott said. “Have an exit strategy. Have a reason in mind in advance for what’s going to cause you to sell.” Julie Hyman is the co-anchor of Yahoo Finance Live, weekdays 9am-11am ET. Read the latest financial and business news from Yahoo Finance Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit. This food habit is linked to a specific type of dementia. Abby Hensel officially tied the knot in 2021, it has been revealed  The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The British monarch will not host an Easter lunch after the service, either.  The actress is soaking up every moment of 'paradise.' 'We love a girly that shreds,' one fan said of the very 'Barbie' moment. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret.  Benny Larkin and daughter Taylor Larkin, 14, were boating down Dora Creek, New South Wales, Australia, when they broke down and were approached by a fuming kayaker. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president.  Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’  The person who wrote on the road has been called a \"top bloke\" by motorists. ‘I guess turning 29 isn’t so bad,’ the ‘American Idol’ alum joked. King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service  \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann. Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent. ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says "
}