{
    "title": "Used Tesla Model 3 stock nearly at an all-time high",
    "date": "3/27/2024",
    "url": "https://thedriven.io/2024/03/28/used-tesla-model-3-stock-nearly-at-an-all-time-high/",
    "text": "    Last month, Tesla sold over 3,500 of its recently refreshed Model 3 sedan, making it the best-selling passenger car in Australia. On the back of these elevated levels of new Tesla deliveries, used Tesla Model 3 stock is also now nearly at an all-time high. New data from carloop reveals an 18% rise in used Tesla Model 3 inventory across the country, leading to 603 used listings. It’s the second time the total used Tesla Model 3 listings has surpassed the 600 mark. The first time was back in January 2023. Part of the recent surge has been on the back of leases on early Model 3s coming to an end, with owners upgrading to the newly refreshed 2024 Tesla Model 3. With a rise in listings, the prices of used Model 3 have also been gradually declining, making EV ownership accessible for more drivers. Tesla has sold 4,316 of its electric sedan in 2024 after having a slower start to its deliveries in January. This slowdown was due to deliveries being stopped as the company worked on ensuring that the child restraint anchor point was compliant with Australian Design Rules (ADR). Since the deliveries were re-commenced, Tesla has delivered thousands more vehicles to customers across Australia and this trend will continue. So far in Australia, Tesla has only sold the new Tesla Model 3 under either a single-motor RWD or the dual-motor Long Range configuration. The single-motor variant is the most popular model which starts at $61,900 before on-road costs. Meanwhile, the dual-motor Long Range variant starts at $71,900 before on-roads. The second hand market is offering some Model 3 EVs at less than $40,000, with one on offer in Queensland at around $35,000. Tesla is currently not selling the Performance variant in Australia or any other market as it’s likely to make some substantial upgrades over the last generation model. This could lead to existing owners of the Performance variant selling their cars on the used EV market in the coming months. It would further add to the supply of used Model 3s on the market. With the supply of new EVs continuing to rise, used EV stock is expected to remain high. This will keep prices lower than they had been in 2023, making it an ideal time to for many drivers to consider a quality used electric car. Riz is the founder of carloop based in Melbourne, specialising in Australian EV data, insight reports and trends. He is a mechanical engineer who spent the first 7 years of his career building transport infrastructure before starting carloop. He has a passion for cars, particularly EVs and wants to help reduce transport emissions in Australia. He currently drives a red Tesla Model 3. I agree to the Terms of Use Sorry. No data so far.  I agree to the Terms of Use Input your search keywords and press Enter. "
}