{
    "title": "Rivian owners can now access Tesla's Supercharger network",
    "date": "3/20/2024",
    "url": "https://www.aol.com/finance/rivians-now-access-teslas-supercharger-161652735.html",
    "text": "Advertisement For premium support please call: Rivian (RIVN) owners can now access the Tesla (TSLA) Supercharger network, adding another automaker to Tesla's charging business. In a blog post, Rivian said owners will be able to use certain Superchargers with the appropriate adapter starting on Monday. Rivian stock rose as much as 3% on Monday afternoon, while Tesla stock gained as much as 5%. Rivian owners are now able to use Tesla Superchargers equipped with an NACS (North American Charging Standard) plug by attaching a complimentary adapter issued by Rivian or using a certified NACS to CCS1 (Combined Charging Standard) adapter to plug into their Rivian EVs to charge. Rivian confirmed to Yahoo Finance the changes were effective as of 12:00 p.m. ET on Monday. Similar to Tesla's deal with Ford, Rivian owners will now have access to Tesla's massive Supercharger network, the largest DC fast-charging system with over 15,000 chargers. \"Compatible Superchargers will show up in Rivian navigation when you are planning trips, with charger speeds and availability information listed,\" the company said. \"You’ll also be able to 'plug and charge' with automatic billing. Simply plug the charger into the vehicle and charging will begin automatically without having to pull up an app,\" the company noted. Though Rivian announced a charging deal with Tesla last year, the electric SUV maker had yet to make an official announcement about when it would be implemented. Rivian owners and EV watchers were tipped off to this move by a report by InsideEVs, which pointed to X user @ryanhuber’s video that shows his Rivian EV communicating with and charging on the Tesla Supercharger. As Rivian said in its announcement, the user notes the session begins automatically as long as there’s a payment method set up with Rivian's mobile app, which is used to access charging locations. First @Rivian customer to supercharge for the second time. :)Now with plug n charge. pic.twitter.com/MAVx30DpZN — @ryanhuber (@ryanhuber) March 18, 2024 Last month, Ford (F) became the first automaker to gain access to the Tesla Supercharger network. Ford is issuing free adapters designed and engineered by Tesla for use on the Supercharger network. If Rivian EV owners can't wait to receive their complimentary charger, they can purchase an adapter like this one, which is compatible with the Tesla’s V3 and V4 Supercharger DC fast chargers. Rivian’s upcoming R2 and R3 vehicles coming in 2026 will have the Tesla NACS inlet plug as standard on the vehicles, with R1 vehicles getting the NACS inlet in 2025. Pras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}