{
    "title": "Tesla Win in India: Govt to Slash EV Import Tax if $500m Invested",
    "date": "3/16/2024",
    "url": "https://www.asiafinancial.com/tesla-win-in-india-govt-to-slash-ev-import-tax-if-500m-invested",
    "text": "Modi government agrees to Tesla push, says carmakers that invest $500m and set up a car plant within 3 years can import up to 8,000 EVs a year at 15% tax rate, down from 70-100%  The Indian government said on Friday it will slash import taxes on electric vehicles made by companies that vow to invest $500 million and set up a local manufacturing plant within three years. The move is seen as a triumph for Tesla, as it conforms with what the company has been lobbying for in New Delhi, despite opposition from domestic carmakers. Tesla CEO Elon Musk has been trying to enter the Indian market for years but New Delhi wanted a commitment to local manufacturing. Tesla officials visited India several times over the last year, with Musk meeting Prime Minister Narendra Modi in June.   Sources said in July that the US carmaker had offered to produce a $24,000 car at a yet-to-be-built factory but wanted a cut in import taxes that Musk said were among the highest in the world. Under the new policy, effective immediately, companies that meet the requirements will be allowed to import up to 8,000 EVs costing $35,000 or more a year at a lower tax rate of 15%. India currently levies a tax of 70% or 100% on imported EVs depending on their value. Tesla’s cheapest vehicle, the Model 3, starts at $38,990 in New York, according to the company’s website. Tesla did not respond to an email seeking comment.  “We invite global companies to come to India. I’m confident India will become a global hub for EV manufacturing and this will create jobs and improve trade,” Commerce minister Piyush Goyal told reporters at a press briefing. India’s EV market is small but growing, with domestic carmaker Tata Motors dominating sales. Electric models made up about 2% of total car sales in India in 2023, with the government targeting 30% by 2030. EV imports at the lower tax rate will be allowed for a maximum of five years. The duty foregone would be limited to the investment made by the company or around $800 million, whichever is lower. The policy comes at a time when global EV sales growth has eased slightly. This will open up the world’s third-largest auto market to new carmakers, suppliers, technologies and the overall EV ecosystem, Gaurav Vangaal, associate director at S&P Global Mobility, said. “Multiple carmakers, who are sitting on the fence, would now like to enter India,” he added. Tesla, weighed down by a lack of entry-level vehicles and the age of its line-up, is battling a decline in demand and stronger competition from rivals like China’s BYD. BYD wants to invest in building EVs in India but has been stalled by New Delhi’s strict investment rules for countries sharing the land border. Vietnam’s VinFast, which also wanted lower EV import taxes, plans to invest $2 billion and last month began constructing a factory in the southern state of Tamil Nadu. India has been working on the EV policy for several months despite lobbying from Tata Motors and rival Mahindra & Mahindra . The Nifty Auto index ended a volatile session 1.6% lower. Mahindra was the biggest faller, losing 4.8% while Tata Motors was down 2.3%. The objective of the new policy is to “strengthen the EV ecosystem by promoting healthy competition among EV players,” the commerce ministry said.             Jim Pollard is an Australian journalist based in Thailand since 1999. He worked for News Ltd papers in Sydney, Perth, London and Melbourne before travelling through SE Asia in the late 90s. He was a senior editor at The Nation for 17+ years.  Asia Financial is owned by Capital Link International Holdings Ltd,\n902, Wilson House 19-27 Wyndham Street, Central, Hong Kong. www.capitallinkintl.com "
}