{
    "title": "Direxion Daily TSLA Bear 1X Shares (NASDAQ:TSLS) to Issue Dividend Increase \n- $0.24 Per Share",
    "date": "3/19/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsls-dividend-announcement-2024-03-19/",
    "text": "Direxion Daily TSLA Bear 1X Shares (NASDAQ:TSLS - Get Free Report) declared a dividend on Monday, March 18th, NASDAQ reports. Stockholders of record on Wednesday, March 20th will be paid a dividend of 0.2399 per share on Tuesday, March 26th. The ex-dividend date is Tuesday, March 19th. This is a positive change from Direxion Daily TSLA Bear 1X Shares's previous dividend of $0.19. Get TSLS alerts:Sign UpDirexion Daily TSLA Bear 1X Shares Stock Up 0.5 % Shares of NASDAQ:TSLS traded up $0.14 on Tuesday, reaching $26.13. 1,217,405 shares of the company traded hands, compared to its average volume of 1,241,565. The business's 50-day simple moving average is $23.76 and its 200 day simple moving average is $21.27. Direxion Daily TSLA Bear 1X Shares has a 52 week low of $17.11 and a 52 week high of $34.92. Institutional Inflows and Outflows Institutional investors and hedge funds have recently modified their holdings of the stock. Morgan Stanley grew its stake in shares of Direxion Daily TSLA Bear 1X Shares by 1,580.1% during the fourth quarter. Morgan Stanley now owns 2,453 shares of the company's stock valued at $120,000 after buying an additional 2,307 shares during the last quarter. UBS Group AG bought a new position in shares of Direxion Daily TSLA Bear 1X Shares during the third quarter valued at about $116,000. Jane Street Group LLC bought a new stake in shares of Direxion Daily TSLA Bear 1X Shares in the fourth quarter worth about $646,000. GTS Securities LLC purchased a new position in Direxion Daily TSLA Bear 1X Shares during the 2nd quarter valued at about $411,000. Finally, JPMorgan Chase & Co. increased its holdings in Direxion Daily TSLA Bear 1X Shares by 6.4% during the 2nd quarter. JPMorgan Chase & Co. now owns 22,353 shares of the company's stock valued at $439,000 after purchasing an additional 1,353 shares during the period. Direxion Daily TSLA Bear 1X Shares Company Profile (Get Free Report) The Direxion Daily TSLA Bear 1X Shares (TSLS) is an exchange-traded fund that is based on the Tesla, Inc index. The fund provides inverse (-1x) exposure, less fees and expenses, to the daily price movement for shares of Tesla stock. TSLS was launched on Aug 9, 2022 and is managed by Direxion. Further ReadingFive stocks we like better than Direxion Daily TSLA Bear 1X Shares3 Healthcare Dividend Stocks to BuyGrowing Twice as Fast as Tesla, XPeng is a BuyHow Investors Can Identify and Successfully Trade Gap-Down Stocks4 Stocks Building Long-Term Value for Shareholders Market Cap Calculator: How to Calculate Market CapFedEx Stock Has Analysts Upgrading in Bulk, a Sudden DiscountThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ I tried to warn you  (From Porter & Company) (Ad)Should you invest $1,000 in Direxion Daily TSLA Bear 1X Shares right now?Before you consider Direxion Daily TSLA Bear 1X Shares, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Direxion Daily TSLA Bear 1X Shares wasn't on the list.While Direxion Daily TSLA Bear 1X Shares currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here The Best High-Yield Dividend Stocks for 2024Looking to generate income with your stock portfolio? Use these ten stocks to generate a safe and reliable source of investment income.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Direxion Daily TSLA Bear 1X Shares, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Direxion Daily TSLA Bear 1X Shares wasn't on the list. While Direxion Daily TSLA Bear 1X Shares currently has a \"hold\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Looking to generate income with your stock portfolio? Use these ten stocks to generate a safe and reliable source of investment income. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}