{
    "title": "Tesla's Quarterly Deliveries At Risk? 'There Are Massive Challenges With Q1 \nSales,' Says A Numbers Tracke",
    "date": "3/3/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/37445654/teslas-quarterly-deliveries-at-risk-there-are-massive-challenges-with-q1-sales-says-a-numbers-tr",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla, Inc. TSLA, which has had back-to-back quarterly disappointments, may not be out of the woods yet. Troy Teslike, who is considered to be a fairly accurate Tesla numbers tracker, said so as much on the social media platform X (formerly Twitter) on Saturday, lending credence to these fears. What Happened: On Friday, Tesla introduced a special promotion for U.S. customers, which would run until the quarter ends on March 31. Purchasers of a new Tesla who trade in their current vehicle will receive 5,000 free Supercharging miles, according to the company’s website. These miles will remain valid for two years from the delivery date. In response, Teslike said, “Tesla just pulled another demand lever because there are massive challenges with Q1 sales. Let’s hope this helps.” In a separate post, he underlined the challenges Tesla faces that could impact its first-quarter deliveries. In the U.S., the Elon Musk-led company could be stymied by low Model 3 production at Fremont due to the Highland upgrade, low Cybertruck production and demand softness for Model Ys, he said. In the company’s key Chinese market, Tesla could be impacted by competition and the weeklong Chinese New Year holiday, Teslike said. Cancelled incentives in the European Union could also hurt Tesla in Europe, he added. In his latest update about Tesla’s first-quarter deliveries, Teslike said he expects the number to come in much less than the 484,000 units reported for the fourth quarter. “It’s not great,” he said. “Over the last 3 years, Tesla sales in Q1 have been higher than the preceding Q4. That’s not going to be the case in this quarter.” See Also: Everything You Need To Know About Tesla Stock Why It’s Important: Tesla’s 2023 deliveries did not pick up significantly despite the company announcing a series of price cuts across its markets. The price reductions only served to hurt the company’s margins and bottom line. Tesla has reported below-consensus earnings and revenue for two straight quarters. The company is also stymied by a lack of entry-level EV model and an aging product lineup. The Cybertruck, which was touted to have a “Halo effect” on the sales of other models, hasn’t quite gotten users excited. Production ramp-up has also been very slow. The electric vehicle industry is facing multiple headwinds, including slowing EV adoption and intensifying competition, with the startup ecosystem feeling the pinch even more. As recently as last week, Fisker, Inc. FSR flagged a “going concern” about its ability to continue. Tesla ended Friday’s session up 0.38% at $202.64, although it has lost about 18.5% for the year-to-date period, according to Benzinga Pro data. Read Next: Elon Musk Teases Amped-up Roadster, Apple’s Self-Driving Car Debacle, Fisker’s ‘Going Concern’ Warning And More: Biggest EV Stories Of The Week Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}