{
    "title": "‘Anytime’: Sam Altman responds to old X thread after Elon Musk sues OpenAI",
    "date": "3/2/2024",
    "url": "https://www.businesstoday.in/technology/news/story/anytime-sam-altman-responds-to-old-x-thread-after-elon-musk-sues-openai-419788-2024-03-02",
    "text": "Feedback OpenAI CEO Sam Altman has recently reignited an old discourse with tech titan Elon Musk, stemming from a brief exchange that occurred years ago. The conversation resurfaced amidst legal battles, as Musk accused the AI powerhouse of violating their initial contractual understandings regarding artificial intelligence (AI). Altman, who had previously voiced support for Musk's Tesla venture in 2019, expressed his dismay at the opposition faced by the electric vehicle manufacturer. In a resolute statement on X platform, Altman urged individuals to stand on the side of environmental consciousness and innovation, rather than speculating for financial gain. Musk, acknowledging Altman's stance, responded with a simple \"Thanks Sam\". Fast forward to the present, Altman revived the conversation by responding to Musk's gratitude with a casual \"Anytime\" and a salute emoji, five years after the initial exchange. The backdrop to this renewed interaction is a lawsuit filed by Musk in a San Francisco court, alleging that OpenAI, backed significantly by Microsoft under Altman's leadership, has unlawfully licensed its latest natural language model, GPT-4. Musk contends that this contravenes their prior agreement to maintain the non-profit status of artificial general intelligence (AGI) advancements for the betterment of humanity. Musk, who served as an original board member of OpenAI until 2018, has thus sparked a legal tussle that delves into the complexities of AI development and the ethical obligations surrounding its application. anytime 🫡 Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}