{
    "title": "Tesla Stock Is Sliding Thursday: What's Going On? - Tesla (NASDAQ:TSLA)",
    "date": "3/7/2024",
    "url": "https://www.benzinga.com/news/24/03/37535055/tesla-stock-is-sliding-thursday-whats-going-on",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla Inc TSLA shares are trading lower Thursday, adding to losses of more than 12% for the week. Here’s a look at what’s going on. What To Know: Tesla shares are on pace for their worst week since January when the stock fell after the EV maker reported worse-than-expected results and turned in disappointing delivery numbers for the second straight quarter. Tesla kicked off the week down more than 7% after the company's China sales fell significantly in February. According to recent data from the China Passenger Car Association, Tesla sold just 60,365 vehicles made in China last month, down 15.51% from January and down 18.87% on a year-over-year basis. Trending: Market makers trigger a Tesla stock anomaly on Thursdays, here’s how to exploit it. Tesla has also shut down operations at its Gigafactory in Germany following a suspected arson attack. Gigafactory Berlin reportedly suffered a power outage and was forced to halt production on Tuesday following the suspected attack that caught a nearby electricity pylon on fire. A far-left activist organization named the Volcano Group has claimed responsibility for the incident. A Tesla spokesperson confirmed that the site had been evacuated and production had been stopped. As previously reported by Benzinga, the Future Fund’s Gary Black expects the production halt to lower production volumes out of the factory by 9,000 vehicles. Morgan Stanley’s Adam Jonas cut his price target on the EV maker from $345 to $320 this week. Several other analysts have also raised concerns that Tesla could miss delivery numbers again this quarter. Tesla’s declining sales numbers have sparked demand concerns across the broader EV space. Many of the legacy OEMs have scaled back electrification efforts, Apple recently abandoned its electric car project and several other EV players have raised profitability concerns and issued weak production guidance. Tesla is not due to report earnings again until next month. Analysts currently expect the EV maker to report earnings of 67 cents per share on revenue of $25.384 billion, according to estimates from Benzinga Pro. Read Next: Tesla Introduces 2-Seater Model Y In France Aimed At Businesses TSLA Price Action: Tesla shares were down about 1% at around $174 at the time of publication, according to Benzinga Pro. Photo: courtesy of Tesla. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}