{
    "title": "Tesla boss Elon Musk trolls Boeing, but it's his own growth story where the \nwheels are coming off",
    "date": "3/23/2024",
    "url": "https://ca.finance.yahoo.com/news/tesla-boss-elon-musk-trolls-163513111.html?prefer_reader_view=1&prefer_safari=1",
    "text": "Ever the trickster, Elon Musk joked this week screwdrivers and drills are now permissible on all Boeing flights so passengers can help keep the plane from falling apart. Fate loves irony though, as the tycoon likes to say, because the wheels are also coming off his own equity story. The only company in the S&P 500 whose shares have performed worse than the scandal-plagued aircraft manufacturer this year is Tesla. It’s down more than 30% since January, plumbing depths not seen since last May. Musk now faces mounting concerns his EV company—relegated to second place behind BYD—could deliver quarterly results that fail to show either sales or earnings are increasing. Thanks to a series of deep price cuts last year, he managed to buy himself the former at the cost of the latter. pic.twitter.com/Z2UtwdHBJS — Elon Musk (@elonmusk) March 17, 2024 That could very well change now that volumes are also expected to ground to a halt even when compared to the very low bar of last year’s first quarter, when he sold only 423,000 vehicles. Normally Tesla investors expect sequential improvement in volumes: Tepid year-over-year growth would be a major disappointment given annual increases were as high as 83% in the past few quarters. Should Tesla only manage a low single digit increase over Q1 of 2023, Tesla risks becoming a growth stock minus the growth—a toxic combination that could result in severe multiple compression as fewer investors are willing to pay 60 times earnings to own a company mired in stagnation. “The impact of the price cuts are surprisingly low at this point,” Wells Fargo analyst Colin Langan told CNBC after he shocked markets by downgrading Tesla to sell on the back of a prediction that annual sales volumes would be flat this year at around 1.8 million cars. Tesla appeared to confirm these fears when it warned buyers last week to order their new $43,990 Model Y now before the quarter ends lest they get hit by a $1,000 price hike taking effect in April. “Order in 2 minutes,” urged its official account, directing readers to its vehicle configurator site. Far from signaling higher demand, it came across more as a ploy to push volumes before the quarter ends while providing an excuse should sales drop hard in the next three months. “Tesla is trying to increase demand with this FOMO (fear of missing out) strategy,” wrote sales tracker Troy Teslike, who has been at the very forefront of those predicting soft Q1 demand. “The message is that buyers should buy now to get the $1,000 cheaper price.” The exhortation came even as rules took effect in January that allow for consumers to take instant advantage of U.S. federal EV tax credits at the point of sale, rather than wait to eventually be reimbursed with their tax filing. Meanwhile on Friday anonymous sources told Bloomberg that Tesla was cutting production in Shanghai, its largest and most profitable plant, by nearly a third this month amid weakening demand. Prices in the US will increase by $1k for all Model Y trims on April 1st Order in 2 mins via https://t.co/oLrTGTu522 — Tesla North America (@tesla_na) March 16, 2024 The reason this is so devastating is that, since the ramp of the Model Y at the start of 2020, the company has only ever known one direction—up. Apart from government-mandated pandemic lockdowns, each and every quarter has always been better than the last with just one brief exception, and that was down to factory upgrades. Even during the chip crunch, Tesla was busy manufacturing more cars while others were forced to mothball their plants. That clockwork-like reliability to produce exponential sales growth in the face of adversity is why the company earned its rich valuation in the first place. Even longtime Tesla bulls are at least temporarily getting out. Kevin Paffrath, who manages the Pricing Power exchange-traded fund, sold all 36,840 shares in the company last week and is now actively shorting it. For the moment, the market continues to give Musk the benefit of the doubt—at least until Tesla publishes its Q1 production, deliveries, and earnings in April. “The bear case depends on the multiple cracking, which may require an outcome significantly worse than our base case,” UBS analyst Joseph Spak wrote last week after slashing his Q1 delivery forecast to 432,000 vehicles, trimming his full-year earnings estimate in the process. Carmakers earn their profits through three key levers. The first is prices, as slow-moving vehicles need corrosive rebates and incentives before a customer will drive one off the lot, while fresher models in demand can command a premium. The second is mix: Sell larger-sized models more skewed to popular bodystyles like SUVs and pickups in wealthier countries and you’ll typically be better off than if you relied on compact hatchbacks and sedans in poorer ones. Well… No refreshed Model 3 for me. This offer is way too low 🤣 pic.twitter.com/Xd7ZgfCXYg — Ethan (@EZebroni) March 19, 2024 Finally and most importantly there is volumes. Since almost all carmakers operate their own plants, these need to be pumping out automobiles constantly to achieve a return. Whether a factory operates at 80% utilization or just 60% can be the difference between a solid profit and a hefty loss. Tesla’s problem is that mix and pricing are likely going to be net negatives, meaning it must rely on volume growth to fuel Q1 profits, and here consensus EPS estimates have steadily crept lower. Part of that can be blamed on roughly three weeks of lost production at Tesla’s German factory, which could cost it up to 18,000 vehicles. But Tesla’s most recent data shows the company overall entered this year with 16 days’ worth of supply, so it has a buffer of existing inventory. Increasingly it appears as if Musk’s strategy that seemingly worked so brilliantly last year of cutting prices to maintain growth may have ultimately backfired. Not only has he trained customers to wait in the hopes of getting a better deal, he’s enraged a number of existing ones as well. Rental agencies Hertz and Sixt were both burned as the value of their cars in the used car market plummeted (one CEO even lost his job over it), while Salesforce rival SAP booted Tesla from the list of brands eligible for its company car fleet. “They’re being dumped by the corporate fleet market because their discount strategy caused resale prices to completely crash,” says Europe-based EV analyst Matthias Schmidt. “That should be part of their expansion strategy, but they burned their bridges.” In other words, Musk needs to spend less time trolling Boeing and more time figuring out how to reignite his own sputtering growth engines. This story was originally featured on Fortune.com This dividend stock has been absolutely crushing the TSX 60 and looks like it will continue to do so while providing a juicy dividend. The post Beat the TSX With This Cash-Gushing Dividend Stock appeared first on The Motley Fool Canada. Truth Social's owner, which counts Donald Trump as its biggest shareholder, is now worth more than American Airlines and Ralph Lauren by one measure. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 Here's why undervalued TSX energy stocks such as Secure Energy Services should be part of equity portfolio in 2024. The post 2 Absurdly Cheap Energy Stocks I’d Buy in April 2024 appeared first on The Motley Fool Canada. Berkshire Hathaway’s chairman Warren Buffett, one of the world's most famed investors, is still faithful to the fact that holding steady, being patient and believing in the power of value investing is key to successful investments. Just as important to Buffett's investment strategy, though, are the investments he doesn't believe in. Here are but a few of the investment types that the Oracle of Omaha would rather not waste money on. BCE (TSX:BCE) stock is a dividend juggernaut that's getting beyond cheap at multi-year depths. The post 1 Nosediving Blue-Chip Stock That’s Getting Ridiculously Cheap appeared first on The Motley Fool Canada.  With stocks off to their best start in five years, many strategists on Wall Street still make a case for the S&P 500 to keep chugging higher. Good Friday is here—and Easter Sunday is around the corner.  The New York Stock Exchange and the Nasdaq Stock Market will both be closed on Friday.  Since Good Friday is not a federal holiday, the U.S. Postal Service and banks will both be open. Fairfax Financial Holdings (TSX:FFH) and another TSX stock I'd buy and hold for the next five decades in a TFSA! The post Millennials: 2 TFSA-Worthy Stocks to Buy and Hold for 50 Years appeared first on The Motley Fool Canada.  Investors can be safe while still making large amounts of passive income, even from an investment you can afford! The post 2 Dividend Stocks That Could Create $553.72 in Passive Income in 2024 appeared first on The Motley Fool Canada. Sienna stock (TSX:SIA) looks like a strong dividend stock that's only getting stronger, but there is more growth available. The post 1 Dividend Stock Down 20% to Buy Right Now appeared first on The Motley Fool Canada. If you've already created a diversified portfolio and are looking for more options from a windfall, here is where I would invest next. The post Where to Invest $10,000 in April 2024 appeared first on The Motley Fool Canada.  Do you own Enbridge (TSX:ENB) in your portfolio? Here's why every investor needs to own some Enbridge stock. The post Why Enbridge Stock Belongs in Every Portfolio appeared first on The Motley Fool Canada. Existing home inventory increased nearly 6% last month, suggesting the housing market's inventory crisis is easing. If you follow technology stocks, mutual funds, and ETFs, as well as the people who make their living by picking the best ones, you've probably heard of Cathie Wood. She's made quite a name for herself...  There are plenty of growth stocks in the market worth considering, but Shopify (TSX:SHOP) looks like one of the best right now. The post 1 Growth Stock Down 50 Percent to Buy Right Now appeared first on The Motley Fool Canada. In this article, we will be taking a look at 11 undervalued semiconductor stocks to buy according to hedge funds. To skip our detailed analysis of the semiconductor sector, you can go directly to see the 5 Undervalued Semiconductor Stocks To Buy According to Hedge Funds. Semiconductor Industry Outlook The semiconductor space is now more […] Boom and Bust It was only a matter of time. Reddit shares are cratering right now, plunging almost 25 percent in just two days, as CNBC reports. The social media company went public last week at an IPO price of $34 and initially rallied to around $65. This week, however, shares started slipping, following Hedgeye […]  The price of gold hit a record high this week. While support for the rally may be fading, the yellow metal could still gain. Canopy Growth (TSX:WEED) stock saw its share more than double in the last two weeks. So, can it do it again with all this good news? The post Why Canopy Growth Stock Could Double in 2024 appeared first on The Motley Fool Canada. My children have inherited $5 million of stock from their father (whose estate has not yet been dispersed after 11 months) leaving them with a 30% or so loss of value over which they have had no control. Is there … Continue reading → The post Ask an Advisor: My Kids Inherited $5 Million. How Should They Handle It? appeared first on SmartAsset Blog. "
}