{
    "title": "'As negative as we have seen in the last few years': Why a number of Wall \nStreet analysts are souring on Tesla",
    "date": "3/29/2024",
    "url": "https://finance.yahoo.com/news/news/negative-seen-last-few-years-140627753.html",
    "text": "Tesla stock has dropped nearly 30% so far this year, and has been downgraded by multiple Wall Street firms. Wells Fargo, Wedbush Securities, and Bernstein were the latest firms to temper their forecasts on the EV maker. They cite delivery disappointment, lower demand, and leadership conflict. While stock market indexes continue to notch a string of record highs this year, 2024 has not been so kind for Tesla. In less than three months, the electric carmaker has shed nearly 30%, erasing more than $230 billion in value. As of Thursday's close, its stock price sat at $175.79. Listed below are the three firms to lower their price targets on Tesla, and their reasons why: Tesla has become a \"growth company with no growth,\" Wells Fargo analysts wrote two weeks ago, downgrading the firm to \"underweight\" and slashing its price target from $200 to $125 a share. The strategists warned of a demand slowdown for electric vehicles this year, which could force Tesla to have to implement more price cuts on its products. Lower pricing and recent delivery disappointment, bodes ill for Tesla's earnings per share, which Wells Fargo expects to come in 32% below estimates this year. The upcoming Model 2 launch is unlikely to reassure investors, as its more affordable pricing means low profitability, on top of \"rushed\" timing,\" Wells Fargo said. But analysts still praised some of Tesla's approach, such as its so-called unboxed production methods that reduce costs. Wells Fargo is also optimistic about Tesla's full-self driving and Dojo supercomputer, if the firm manages to pull these technologies off. Although Wedbush Securities is still holding out bullish on Tesla, it cut the firm's price target from $315 to $300 a share. However, it still maintains an \"outperform\" rating on the manufacturer, citing corrective measures that could help if applied. In a Thursday note, analysts led by Dan Ives called out Tesla's \"nightmare\" first quarter, citing falling deliveries to China as the chief culprit for its weaker performance; Tesla is now unlikely to reach an estimated 2.1 million deliveries this year, Wedbush said. Supply issues, such as a factory fire in Berlin, also compounded the problematic quarter, Ives wrote. Meanwhile, he noted that investors are starting to grow impatient with the company's leadership. Among cited reasons is CEO Elon Musk's plan to move AI projects outside of Tesla and a Delaware court pay package dispute. \"We believe the Tesla narrative is as negative as we have seen in the last few years with Musk/Tesla getting attacked by the bears from all directions,\" Ives wrote. \"But unlike other times, now it's warranted as growth has been sluggish and margins showing compression with China a nightmare.\" Ives still remains confident in Tesla's full-self driving and autopilot technologies, which should eventually support its valuations. Bernstein cut Tesla's price target from $150 to $120 a share, reiterating an \"underperform\" rating in a note published Tuesday. The EV maker is bound for tepid growth in both 2024 and 2025, analysts led by Toni Sacconaghi said. Bernstein lowered Tesla's production forecasts for both years, as slowing EV adoption in Europe and the US cut consumer appetite for its products. Demand in China is also weak, Bernstein said. Given its growth prospects, Tesla's high stock valuations are hard to justify, the analysts wrote. The firm trades at an enormous premium to other auto manufacturers, even though its margins are on par with these competitors. Tesla's full self-driving could add $40 per share, Bernstein said, but noted that the pricing would be competed away, as Tesla is not alone in pursuing FSD. The company is already behind in robotics, AI, and the robotaxi service. Read the original article on Business Insider "
}