{
    "title": "Tesla's Model Y Prices to Spike in Europe: €2,000 Increase Confirmed",
    "date": "3/17/2024",
    "url": "https://www.techtimes.com/articles/302646/20240317/teslas-model-y-prices-spike-europe-%E2%82%AC2-000-increase-confirmed.htm",
    "text": " Tesla intends to raise Model Y EV costs in some European regions by 2,000 euros ($2,177) on March 22. The announcement on X follows the company's Friday revelation of a $1,000 price hike for all Model Y automobiles in the US, beginning April 1. European pricing changes mirror Tesla's $1,000 price increase for Model Y rear-wheel drive and long-range models to $43,990 and $48,990, respectively, on March 1, according to a Reuters report. Tesla CEO Elon Musk discussed manufacturing's delicate balance between continuous production for efficiency and variable customer demand. A year-long pricing war with rivals has hurt Tesla's profit margins.  A Tesla Model y car stands in front of the company's plant as Tesla CEO Elon Musk visits the company's electric car plant in Gruenheide near Berlin, eastern Germany, on March 13, 2024, as employees resumed work after production had to be halted due to a suspected arson attack that caused a power outage. (Photo : ODD ANDERSEN/AFP via Getty Images) This Tesla price update follows the EV manufacturer's settlement of Owen Diaz's racial discrimination case. Diaz and the corporation settled after a federal jury awarded them $3.2 million. Representatives from Diaz's legal team at the California Civil Rights Law Group confirmed the resolution, as TechTimes previously reported. Diaz, who worked as an elevator operator at Tesla's Fremont, California, plant in 2015, demonstrated remarkable courage in confronting the corporate giant. His attorney, Lawrence Organ, stressed the significance of individuals standing up against such challenges for civil rights laws to have a meaningful impact. Organ suggested that a public commitment from Elon Musk to intolerance of discriminatory behavior could put an end to such conduct at Tesla. Despite significant verdicts and years of litigation, including substantial financial awards, Musk has yet to issue such a statement, leaving Organ puzzled by Tesla's continued behavior. Read Also: TikTok Faces National Security Review in Canada Amid Brewing Threat of US Ban Diaz and his legal team persuaded the jury that Tesla had failed to prohibit racial discrimination during his original trial, culminating in a $137 million award, including punitive damages. Diaz and Tesla requested a retrial after Judge William H. Orrick reduced the jury's judgment to $15 million. Despite the decrease, Diaz won again, receiving a $3.2 million final verdict. The Equal Employment Opportunity Commission (EEOC) is suing Tesla for its alleged tolerance of chronic racial harassment against Black workers and retribution against whistleblowers. The EV manufacturer argues the EEOC's assertions are misleading, noting its history of equal employment opportunities. Meanwhile, Nissan and Honda have announced a collaboration to advance electric vehicles (EVs) and auto intelligence technology. The CEOs of both automobile manufacturing companies revealed their intent to explore collaboration opportunities during a press conference in Tokyo. Details of the partnership agreement focus on jointly developing core technologies while maintaining separate product lines. Nissan's CEO, Makoto Uchida, emphasized the urgency of technological development. At the same time, Honda's president, Toshihiro Mibe, highlighted shared values and synergies to counter competitors in the global automotive industry's shift to EVs. Nissan and Honda teamed up because EV suppliers face market uncertainty as recent data demonstrate weak driver enthusiasm-to-sales conversion of EVs despite predicted component demand rises. Major manufacturers are revising EV plans because of low customer demand. Related Article: CEO Angela Chao's Fatal Tesla Accident: New Details Emerge After Weeks of Speculation   Sign up for our free newsletter for the Latest coverage!   "
}