{
    "title": "Elon Musk wants what Mark Zuckerberg has — why shareholders would lose out",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/elon-musk-wants-what-mark-zuckerberg-has--why-shareholders-would-lose-out-163952450.html",
    "text": "Elon Musk might be the face of Tesla (TSLA), blurring his own reputation and the identity of the brand. But as closely tied as the man is to the company and its $700-billion-dollar valuation, there is one thing he doesn’t have that some of his other tech industry peers enjoy: more control. Last week, Musk publicly demanded that Tesla’s board give him even greater influence over the company by boosting his stake to 25%, or else he’d continue to develop artificial intelligence tech somewhere else. Musk, the richest person in the world, was quick to point out that this wasn’t about the money. Rather, he was pushing for greater decision-making power. In fact, he even floated the idea of receiving another class of shares that would grant him more votes without diluting existing Tesla shares or forcing the company to hand over billions of dollars in extra compensation. The dual-class share model is one enjoyed by Musk’s frequent rival, Meta (META) CEO Mark Zuckerberg, who commands control of his company through super-voting stock. It appears Musk wants what Zuckerberg has. But a look at the arrangement shows the limits of unchecked executive control and the double-edged nature of creating unequal voting rights. Historically, companies used dual-class structures in certain sectors, including the so-called vice industries, like alcohol and tobacco, to guard against corruption, and in situations where families vied for legacy control over the whims of short-term interests, most notably in publicly traded newspapers like the New York Times (NYT). But in recent decades, younger companies have increasingly adopted the structure. Super-voting arrangements have grown on the belief that the success of early-stage enterprises are bound up with the founders themselves, whose vision, drive, and leadership are intrinsic to the worth of the company. That startups tend to heavily rely on equity-linked compensation is another reason proponents of dual-class structures use them. Since managers and their employees are also major shareholders, the leaders’ incentives are aligned with lifting the stock price, keeping their employees motivated and working in their own self-interest to accumulate wealth. For dual-class backers, the setup keeps the people best equipped to make strategic decisions in charge, while granting them access to more capital, all without diluting their influence. IPOs in the tech industry using dual-class shares have been on the upswing, according to data compiled by Jay Ritter, a finance professor at the University of Florida. Over the last 10 years, the percent of tech IPOs with dual-class structures has averaged about 36%, up from the prior decade of about 22%, the data shows. “Investors are relatively complacent with dual-class stock with tech companies because in the US, on average, public market investors have done well,” Ritter said, pointing to notable dual-class examples including Meta and Alphabet (GOOG, GOOGL), whose stock prices have more than doubled in recent years. From 1980 to 2020, companies that used dual-class shares have outperformed single-class stocks, offering returns of roughly 30% versus 19% respectively, according to Ritter's data, which averaged three-year buy and hold returns from the closing price of the IPO. The success stories, however, can turn on themselves. Propping up shareholder managers who hold the majority of voting shares leaves companies with weaker institutional checks on executive power. When the stock is up, a less constrained leader can be a good thing. But when prospects are sinking, there's little recourse for investors to course correct if they are relegated to a voting minority. A key criticism of dual-class shares is that they downgrade shareholders to second-class status, said Jun Frank, managing director at ISS-Corporate. Founders and insiders can maintain significant control with much less capital at stake. And the structure reduces the level of influence the public can have on a company, he said. Financial arrangements that grant executives outsized power can also attract harsh scrutiny. Part of WeWork's spectacular IPO implosion in 2019 was tied to corporate governance issues and the multiple-class shares that gave then-executive Adam Neumann tremendous voting sway. Uber (UBER), the ride-hailing giant, dispensed with its super-voting share structure in the wake of its widely covered scandals and the eventual ouster of former CEO and co-founder Travis Kalanick in 2017. The long-term risks of founders and early investors wielding heavy decision-making power are recognized even among companies that use dual-class shares. An increasing amount of such companies are relying on sunset provisions that phase out multiple-class shares when certain trigger conditions are met, typically when the founder leaves the company. In 2023, about 52% of Russell 3000 companies with dual-class structures also had sunset clauses, according to data from ISS-Corporate. That's up from 44% in 2021. But a relatively weak executive can pose other dangers, as Musk sees in Tesla's current structure. His stake in the company leaves the carmaker open to takeovers \"by dubious interests,\" he said on X. But with a boosted share count, he'd still have checks on his power while giving him enough heft to protect the company. \"If I have 25%, it means I am influential, but can be overridden if twice as many shareholders vote against me vs for me,\" he said. For as much control as he already exercises, there's still room for more. Hamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on Twitter @hshaban. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Related Quotes "
}