{
    "title": "Rental giant Hertz dumps EVs, including Teslas, for gas cars",
    "date": "1/11/2024",
    "url": "https://ca.finance.yahoo.com/news/hertz-sell-20-000-evs-123933213.html",
    "text": "By Nathan Gomes and Joseph White (Reuters) -Rental firm Hertz Global Holdings is selling about 20,000 electric vehicles, including Teslas, from its U.S. fleet about two years after a deal with the automaker to offer its vehicles for rent, in another sign that EV demand has cooled. Hertz will instead opt for gas-powered vehicles, it said on Thursday, citing higher expenses related to collision and damage for EVs even though it had aimed to convert 25% of its fleet to electric by 2024 end. CEO Stephen Scherr had last year at the JPMorgan Auto Conference flagged headwinds from higher expenses for its EVs, particularly Teslas. Hertz even limited the torque and speed on the EVs and offered it to experienced users on the platform to make them easier to adapt after certain users had front-end collisions, he said. Shares of the company, which also operates vehicles from Swedish EV maker Polestar among others, fell about 4%. Tesla's stock was down about 3%. Hertz also expects about $245 million in charges related to depreciation expenses from the EV sale in the fourth quarter of 2023. Its decision underscores the bumpy road EVs have hit as their sales growth slows, causing carmakers like General Motors and Ford to scale back production plans. Morgan Stanley analyst Adam Jonas said in a note Hertz's move was another sign that EV expectations need to be \"reset downward\". While consumers enjoy the driving experience and fuel savings (per mile) of an EV, Jonas said there are other \"hidden costs to EV ownership\". \"Expenses related to collision and damage, primarily associated with EVs, remained high in the quarter,\" Hertz said in a regulatory filing on Thursday. The company, which had earlier planned to order 100,000 Tesla vehicles by 2022 end and 65,000 units from Polestar over five years, said it would focus on improving profitability for the rest of its EV fleet. German rental car company Sixt said in December it had not purchased Tesla vehicles since 2022 and was selling its fleet of Teslas \"as part of our regular de-fleeting process\". It still plans to offer a range of electrified vehicles and \"stick to our goal to electrify 70-90 percent of our rental fleet in Europe by 2030\", it said on Thursday. Meanwhile, wholesale used-EV prices fell for most of 2023 as prices for new EVs fell and inventories of unsold electric vehicles rose, according to Cox Automotive data. Cox forecast before Hertz's decision that used-EV prices would decline more than overall used vehicle prices in 2024. \"While 20,000 cars isn't a large number in the total used vehicle market, it does mean Hertz will be taking a major loss on each of these sales while further contributing to the trend of falling used EV values,\" iSeeCars.com analyst Karl Brauer said. Hertz is selling some Tesla Model 3 for as low as about $20,000, nearly half the purchase price for the cheapest variant of the compact sedan, its used car website showed. It lists more than 700 EVs on sale, including BMW's i3, Chevrolet's Bolt and Tesla's Model 3 and Model Y SUVs. (Reporting by Nathan Gomes and Akash Sriram in Bengaluru, Joe White in Detroit; Editing by Shilpi Majumdar, Sriraj Kalluvila and Arun Koyyur) Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia. Trade 24 hours a day on the world's most popular platform. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o  They soft-launched their relationship at the supermodel's cookbook event in Miami. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  The president mocked his campaign rival for doing the one thing he claimed he wouldn’t have time for. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" "
}