{
    "title": "Rivian, Tesla, Nio: EV stocks in focus",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/video/rivian-tesla-nio-ev-stocks-165547490.html",
    "text": "Rivian (RIVN) was downgraded by Deutsche Bank analysts to a \"Hold\" rating over the American EV maker's margin outlook and production forecasts. Tesla (TSLA) shares dip after slashing Model Y prices in Europe, This comes after already implementing price cuts in Chinese markets. Additionally, Chinese electric vehicle manufacturer Nio (NIO) will be offering discounts on its cars, feeling extensive pressure from China's strained GDP growth. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. [AUDIO LOGO] RACHELLE AKUFFO: All right, now let's get you a look at some of our trending tickers. Shares of EV makers down broadly today with Rivian taking the biggest hit. The auto company was downgraded at Deutsche Bank with the analysts citing downside risk to 2024 expectations around the company's volume and gross margins writing in-- note, writing in a note to clients that they expect 2024 volume guidance of just 65,000 units amid prolonged factory shutdowns and slow ramp up. And Akiko, this seems to be a consistent problem. When it comes to Rivian, you keep waiting for that next catalyst where they'll really get production and volumes up. It just doesn't seem to be happening here, which is how they ended up on this list. How fair do you think this is, though? What are you seeing in terms of the commentary around Rivian? AKIKO FUJITA: Yeah, you know, I mean what we're hearing from analysts at Deutsche Bank pretty much what we've been watching in the EV space as a whole. We have seen softening demand. There are concerns about this transition that's happening to all electric. Is it going to slow down because of lack of infrastructure, and quite frankly, because of the lack of affordability. When you think about Rivian specifically, there are two considered to be another catalyst moving forward. Some have called it that potential Model 3 moment for Rivian, but that's still to be determined here. So in many ways, this downgrade from Deutsche Bank not necessarily a surprise. I mean, you have to wonder how much of that, Rachelle, is a Rivian-specific story, which you could argue part of it is. But also, how much of that is a broad EV story? And on that note, another stock that we're watching today, Tesla trending on \"Yahoo Finance,\" as global demand, competition forces the EV giant to slash prices once again. Tesla trimming prices for its Model Y across several countries in Europe a week after announcing similar price cuts for its Model 3 and Model Y cars in China. Rachelle, we're talking specifically about four countries in Europe, including Germany, as well as France. Price cuts anywhere from roughly 4% to 8%. I mean, this is the reality that Tesla is now dealing with. Again, not just Tesla, all EV makers as a whole. But these price cuts are increasingly getting really aggressive. The question is, as we've been speaking to so many analysts, is this about volume for Tesla? And does that make up for the lack of pricing power that they now have in a very, very competitive environment? RACHELLE AKUFFO: It's true. I mean, it is-- especially when you think of how they're competing in China, a very competitive environment there. So when you look at some of the cuts they had to make-- so for the long-range Model Y and the performance, reduced by 9% and 8.1% the prices there. And then of course, when you think of some of these other car companies, UBS removing BYD from their China focus list, because they also were cutting prices in Q4 as well of last year. So you have this sort of race to the bottom here, but they-- obviously, Tesla are more flexible than some of these other companies, your traditional EV makers in this country. They're able to do that with pricing. But we keep seeing that focus on what that's doing to margins. I mean, obviously a lot of Tesla bulls still think that Tesla can manage it. But it speaks to that broader picture, as you mentioned there. Is it so much of a demand picture versus Tesla having some of its own internal issues with the fundamental business as well? AKIKO FUJITA: Well, and Rachelle, it feels like we're talking about Tesla every day. But Tesla's been hit with a lot of negative headlines over the last few months. I mean, most recently, we had that massive recall for Tesla cars. There's questions about the reliability and safety of the car at a time when there are more options for consumers out there. And of course, yesterday, we were talking about Elon Musk trying to get more control within Tesla, but that's more of his focus on AI and robotics. RACHELLE AKUFFO: That's true. It really does speak to some of the dynamics within these companies. So of course, we have to talk NIO, another one cutting prices. The Chinese EV maker announcing that it will offer discounts on current models as it begins to roll out the 2024 vehicles. NIO also feeling the pressure as China's GDP comes up short. Now, this was tough, because China's GDP grew 5.2% in the fourth quarter compared to a quarter a year ago. And that came from the National Bureau of Statistics. But that came in below expectations. We keep waiting for this recovery, especially as China's economy has a dual mandate that includes getting a lot more consumer demand there, and not seeing it. This sluggish demand, it really does trickle into other companies, as we mentioned with Tesla, one of the most exposed companies to China other than Apple. So when you see this slow growth, growth that they hadn't seen as slow since I believe 1976, apart from the COVID years, this really does spark concerns about whether or not these companies can bounce back, Akiko. AKIKO FUJITA: Yeah, more of a macro econ story there, particularly around EV market in China. You could argue the infrastructure story is a little better there. But you're certainly right. There are concerns about just the pricing power or just how-- the appetite consumers have for spending on some of these cars. Related Quotes "
}