{
    "title": "If You Like Tesla, Then You Will Love These 2 Beaten-Down EV Stocks",
    "date": "1/30/2024",
    "url": "https://www.fool.com/investing/2024/01/30/if-you-like-tesla-then-you-will-love-these-2-beate/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Extending the rally that resulted in a gain of more than 24% last year, the S&P 500 is off to a strong start for 2024, thanks to the prospect of lower interest rates and encouraging economic data. But many electric vehicle (EV) stocks have driven in the opposite direction. Tesla (TSLA -2.25%), Rivian (RIVN -0.36%), and Lucid (LCID -4.04%), for example, are three EV stocks that have faced a rocky road in the early days of 2024. Despite their poor performances, though, there are valid reasons to believe that they can all accelerate higher in the months -- and years -- to come. Image source: Getty Images. Lee Samaha (Tesla): The company operates in an auto market characterized by legacy automakers used to low growth and with businesses structured to extract every bit of cost and margin from their operations. That's what you might expect in a mature industry. However, the EV manufacturer operates in the growth bit of the auto market. That means its strategic focus should be on maintaining market leadership and developing products capable of capturing market share. Like all growth companies, Tesla's approach is that it's OK to sacrifice some near-term margin to keep growing in end markets set for super-long-term growth. For example, many investors see the company's long-term value in robotaxis, autonomous driving technology, and lower-cost EVs. These are considerations when reviewing Tesla's latest earnings, which are replete with falling profits and profit margins. In a nutshell, Tesla is lowering average selling prices to maintain market share in a relatively high-interest rate environment. It's investing in developing \"our next-generation low-cost vehicle,\" according to CEO Elon Musk on the earnings call. It's ramping up production of the Cybertruck. Meanwhile, Tesla continues to invest in technologies and facilities that result in lowering its cost per vehicle, enabling it in the future to offer lower-priced cars and support margins. All these things come at the expense of near-term margins, but they are essential in a marketplace with a long runway of growth ahead. As such, long-term Tesla believers will put the recent results into context and use the dip as a buying opportunity in a stock and company whose best days are yet to come. Daniel Foelber (Rivian): Rivian continues to live up to its reputation as a volatile stock. After gaining 40% in December 2023 alone, Rivian is now down 34.6% year to date. The big swings to the upside and downside on essentially no news (Rivian reported Q3 earnings in early November) could give Rivian shareholders some unwanted car sickness. But the company has actually been remarkably stable. Rivian produced 57,232 vehicles in 2023, exceeding its goal of 54,000. Q4 2023 production was 17,541 units, a 75% increase from Q4 2022. The growth rate is solid, but Rivian's cost management is the real standout.  RIVN Free Cash Flow (Quarterly) data by YCharts. Cash burn is slowing despite higher production. Operating losses are also stagnating. Rivian's cash burn is top of mind in 2024. The company should have plenty of cash to get through this year. But it's still losing money on every vehicle it produces. Rivian's manufacturing capacity is greater than its production. As it ramps production, the cost per vehicle will fall because the fixed costs will be spread over a larger volume. Rivian reports Q4 figures on Feb. 21. Aside from Rivian's 2024 production target, it will be interesting to see how the company responds to slowing EV demand. Tesla's revenue growth is falling, and 2024 is expected to be a much lower growth year than 2023. Rivian is producing about one-twentieth the number of vehicles as Tesla. It could be niche enough to avoid the broader demand issues larger manufacturers are dealing with. But if consumers are unwilling to pay for a high-priced vehicle, Rivian could face the added challenge of cutting prices or risk stockpiling inventory in empty lots. Management does a good job communicating with investors, and I expect the same on this upcoming earnings call. The company has an amazing product and potential; it's just a matter of managing through the cycle. The stock could be worth buying now for investors who believe Rivian is up to the task. Scott Levine (Lucid): Plunging almost 37% since the start of the year, Lucid has hit some potholes early on in 2024. But don't let the sell-off keep you from clicking the buy button. If you're a fan of Tesla, you're likely familiar with its business strategy over the past 15 years: Start off offering higher-end models and expand to more affordable options. After initially launching the luxury Roadster, Tesla has diversified its offerings to the more affordable Model S and Model 3. Lucid is taking a similar tack. While its first model available, Lucid Air, is an upscale option limited to more affluent customers, the company has articulated a vision to \"start with high end cars, build the brand synonymous with luxury, and then manufacture progressively more affordable vehicles in higher volumes.\" Taking a notable step toward following this trajectory, Lucid recently announced a significant expansion of its production facility in Arizona. The additional 3 million square feet includes both a manufacturing facility and a warehouse to support the production of the company's newest offering, the Gravity SUV, which is expected to begin production in late 2024. The company foresees using the site to support the production of future models as well. Another parallel that exists between Lucid and Tesla is the failure to meet expectations. Tesla has often over-promised with regard to production volumes and the timelines for product launches -- two things Lucid has been guilty of recently. For one, Lucid initially expected to commence production of the Gravity in 2023, now expected later this year. Plus, the company disappointed investors recently when it announced the production of 8,428 vehicles in 2023, coming up short of the over 10,000 vehicles forecast it provided during its first-quarter 2023 earnings presentation. Naturally, there's no guarantee that Lucid will execute its growth plans. Still, for investors looking for an investment comparable to what Tesla represented about 15 years ago -- and who aren't risk averse -- Lucid is a great option to park in one's portfolio. Daniel Foelber has positions in Rivian Automotive. Lee Samaha has no position in any of the stocks mentioned. Scott Levine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}