{
    "title": "Just as Tesla loses the EV crown, Elon Musk's biggest market in Europe \npulls the rug out from under him",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/just-tesla-loses-ev-crown-134510604.html",
    "text": "A fresh crisis may be brewing for Elon Musk in Europe. Tesla’s demanding CEO recently had to tackle the vexing problem of a widening labor union strike in Sweden affecting its Scandinavian operations. Now it seems as if demand is starting to soften across key parts of the continent at a time when Warren Buffett–backed BYD eclipsed Tesla globally for the very first time in the fourth quarter. Sales of Tesla cars in Germany, home to its only European manufacturing plant, plunged a breathtaking 77% in December year on year according to government data, capping off a disastrous fourth quarter in its largest market in the region. Normally Tesla expects to increase monthly sales not just on an annual basis—which is typically a given—but even sequentially, in other words from one period to the next. This kind of hyperbolic growth is how it justifies a $750 billion market value on par with its next nine largest rivals combined. A year-on-year sales decline for Musk’s carmaker is therefore an unusual occurrence to say the least, let alone one as severe as December's. In fact, those four weeks proved so damaging they managed to wipe out the brand’s entire gains in Germany it had previously accumulated through November. This left Tesla nursing a 9% contraction in annual volumes even as the country’s electric car market itself expanded at an 11% rate in 2023. The news wasn't any better in the U.K., where both November and December proved exceptionally weak, leading to a 9% annual drop for the year. For a growth stock that boasts disruptive technology, shrinking (especially when the rest of your competitors are not) ought to prove a humbling new experience for Musk. Fortunately for the company, China is a far larger market and Tesla has been on a tear in the fourth quarter, helping push global sales to a new record of 1.8 million vehicles last year. Part of the reason sales cratered in Germany and the UK last month can be chalked up to buyers delaying their purchase after the Model 3 received a facelift, dubbed “Highland”. At six-and-a-half years old now reaching an age where most cars are due for replacement, Tesla's entry sedan received some touch-ups to give it a fresher look and EV customers likely held off in anticipation. This temporary lull should then turn into tailwinds once the vehicle is available in larger numbers as Tesla’s Shanghai plant in China ramps up production and exports. The shocking drop of nearly 80% year on year in Germany is also mitigated somewhat by a high comparison figure from December 2022, when customers were still rushing to take advantage of government subsidies worth as much as €6,000 per car before they were cut to €4,500 at the start of 2023. Finally, the entrepreneur encountered fresh obstacles thrown in his path by Germany’s fractious and bumbling tripartite coalition in Berlin. Chancellor Olaf Scholz had planned to scrap all EV subsidies entirely at the start of this year, but a budget crisis prompted him to advance plans by two weeks as his finance ministry scrounged for every saved penny. The announcement came essentially overnight, catching buyers off guard and infuriating the entire car industry. Nevertheless, Musk may have a growing problem on his hands. The Tesla CEO already took a costly first step by shutting down his Model Y production line in Germany entirely for two weeks in December to keep inventories under control. This story was originally featured on Fortune.com Related Quotes "
}