{
    "title": "Watching Tesla, IBM, Intel, Disney share prices, earnings reports",
    "date": "1/25/2024",
    "url": "https://www.ig.com/en/news-and-trade-ideas/beat-the-street--tesla-shares--ibm-shares--us-data-points-to-a-r-240125",
    "text": "We want to clarify that IG International does not have an official Line account at this time. We have not established any official presence on Line messaging platform. Therefore, any accounts claiming to represent IG International on Line are unauthorized and should be considered as fake. CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. \n CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. View more search results US investors digest a slew of data indicating a resilient US economy. Tesla, all-sessions, indicated lower after Musk warns of slow sales growth. IBM, all-sessions, in focus after its forecasts. Plus, Disney's India unit valuation has halved in Ambani merger talks, reports Bloomberg. (AI Video Summary) In today's edition of \"Beat the street,\" the host Angeline Ong shares important news about trading before the Wall Street Market opens. She talks about the S&P 500, which is about to reach another all-time high. She also mentions that Intel and Visa will be releasing earnings reports soon. However, Tesla's shares are expected to go down because Elon Musk warned about slow sales growth. On the other hand, IBM's shares are expected to rise because their revenue and forecasts are strong. Next, she discusses the European Central Bank's decision to keep interest rates unchanged. This decision, along with disappointing data and forecasts from Germany, might have a negative impact on the eurozone economy. But the US data shows that the economy is still doing well, which supports the idea of a soft landing. Ong thinks that the Federal Reserve is also on track for a soft landing, but there might be some market volatility because of the record highs. An IG analyst named Axel Rudolph talks about the Dow Jones, which has been consolidating after reaching a new high. He believes it will retest the high and as long as it stays above a certain support level, the uptrend will continue. The S&P 500 is also discussed because it recently closed at another record high with high trading volumes. Then, Ong talks about Tesla's earnings report, which fell short of expectations. This leads to a decrease in Tesla's shares. IBM, on the other hand, exceeded earnings forecasts and expects revenue growth, yet its shares are still down. Disney's India unit received a lower valuation than expected in a merger with an Indian media empire, showing the challenges faced by global media giants in India. Finally, she mentions three more companies, Intel, Visa, and American Airlines, that will be reporting earnings soon. American Airlines is expected to make a profit higher than expected, which leads to an increase in its shares. This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. Go long or short on thousands of international stocks. See more forex live prices See more shares live prices See more indices live prices Prices above are subject to our  website terms and agreements. All share prices are delayed by at least 20 minutes. Prices are indicative only. See more forex live prices See more shares live prices See more indices live prices Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Share CFDs Forex Indices Commodities Other markets Web platform Trading apps MetaTrader 4 ProRealTime Compare features Demo News and trade ideas Trading strategy  Charges and margins Premium services Refer a friend Marketing partnerships Corporate accounts New clients: +44 (20) 7633 5430 or email sales.en@ig.com Clients: Help & Support  IG | Terms and agreements | Privacy | How to fund | Vulnerability | Cookies | About IG Follow us online: ^IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG Group established in London in 1974, and is a constituent of the FTSE 250 index. The risks of loss from investing in CFDs can be substantial and the value of your investments may fluctuate. 70% of retail client accounts lose money when trading CFDs, with this investment provider. CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. You should consider whether you understand how this product works, and whether you can afford to take the high risk of losing your money. CFD Accounts provided by IG International Limited. IG International Limited is licensed to conduct investment business and digital asset business by the Bermuda Monetary Authority. IG provides an execution-only service. The information in this site does not contain (and should not be construed as containing) investment advice or an investment recommendation, or an offer of or solicitation for transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. The information on this site is not directed at residents of the United States and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG International Limited receives services from other members of the IG Group including IG Markets Limited. Careers | IG Group "
}