{
    "title": "Tesla recalling nearly 200,000 vehicles",
    "date": "1/26/2024",
    "url": "https://spectrumlocalnews.com/tx/south-texas-el-paso/news/2024/01/26/tesla-recalling-nearly-200-000-vehicles-because-software-glitch-can-cause-backup-camera-to-go-dark",
    "text": "Get the best experience and stay connected to your community with our Spectrum News app. Learn More Get the best experience and stay connected to your community with our Spectrum News app. Learn More Continue in Browser Get hyperlocal forecasts, radar and weather alerts. Please enter a valid zipcode. Save Tesla is recalling nearly 200,000 vehicles in the U.S. because the backup camera may not function while the car is in reverse. The recall covers certain Models Y, S and X from the 2023 model year. All are equipped with “Full Self-Driving” computer 4.0 and run software version 2023.44.30 through 2023.44.30.6 or 2023.44.100.\nWhat You Need To Know\n\nTesla is recalling nearly 200,000 vehicles in the U.S. because the backup camera may not display an image\n\nThe recall covers certain Models Y, S and X from the 2023 model year. All are equipped with “Full Self-Driving” computer 4.0\n\nThe company says in documents posted by the U.S. National Highway Traffic Safety Administration that software instability may prevent the camera image from showing while the Teslas are in reverse\n\nThe safety agency says the lack of an image can increase the risk of a crash. Tesla says it's not aware of any crashes or injuries. The company says in documents posted by the U.S. National Highway Traffic Safety Administration that software instability may prevent the camera image from showing images while the Teslas are in reverse. The safety agency says that can increase the risk of a crash. Tesla says in documents that it is not aware of any crashes or injuries. Documents say the problem has been fixed with an online software update. Owners will be notified by letter starting March 22. Tesla said in documents that it is not aware of any crashes, injuries or deaths related to the issue. Tesla began getting complaints about the problem in late December and decided to do a recall on Jan. 12, documents say. As of Jan. 22, the company had 81 warranty claims potentially related to the problem. Teslas cannot drive themselves despite having a “Full Self-Driving” system, and human drivers have to be ready to intervene at all times. "
}