{
    "title": "Elon Musk can't make in India? Local auto firms put speed-breaker for Tesla",
    "date": "1/18/2024",
    "url": "https://www.businesstoday.in/auto/story/elon-musk-cant-make-in-india-local-auto-firms-put-speed-breaker-for-tesla-413933-2024-01-18",
    "text": "Feedback Resistance from domestic firms could delay Elon Musk's India debut.  New Delhi is still weighing on cutting import taxes on electric vehicles (EVs) under a new policy proposed for carmakers that commit to local manufacturing and ease Tesla’s entry into the market, a top government official told Reuters. Local automakers are concerned about the possibility of Tesla entry in the market. India has been working on a proposed policy to slash a 100% EV import tax to as low as 15% for automakers that commit to investing and manufacturing in India eventually. Deliberations over the import tax began after Tesla said it was interested in building a factory in India to produce an EV priced at $24,000, around 25% cheaper than Tesla’s current entry model. Tesla has also called for lower taxes on more expensive models it wants to sell in India, Reuters has reported. Rajesh Kumar Singh, top bureaucrat at department for industry and trade promotion, said at the World Economic Forum meeting in Davos that Tesla would likely try to bring cars to the market in India in the range of $24,000 to $36,000 because they know “that’s where the volumes” will be available. “The issue is raising resistance from domestic industry because they are also in that (EV price) segment,” Singh said late on Wednesday. “It’s a very contested area and we’ve not been able to take a final call on this so far.” Singh did not name any domestic automakers, but Reuters has reported that Tata Motors, India’s biggest EV player, and Mahindra & Mahindra have pressed officials to not lower EV import taxes to protect local firms amid Tesla’s possible entry plans. Mahindra & Mahindra Managing Director Anish Shah this week in an interview called for a level playing field between domestic and foreign EV automakers, saying India must promote local manufacturing. Tesla did not immediately respond to a request for comment outside regular U.S. business hours. Tesla first tried to enter India by demanding lower import taxes, which Elon Musk said were “highest in the world by far of any large country”. That demand on taxes led to deadlocked talks with New Delhi in 2022. Recently, in a shift in stance, Tesla has offered to set up local manufacturing as India has pushed for. “There have been some discussions on whether you lower the tariff for a short period of time but he (Musk) also accepts fairly significant investment and domestic value addition criteria,” Singh told Reuters. This would allow Tesla to bring in a limited number of vehicles for a short period of time, although Musk would also need to provide “cast iron commitments to invest in India, make in India,” Singh said. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}