{
    "title": "Tesla, BlackRock, gold prices: Trending tickers",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/video/tesla-blackrock-gold-prices-trending-215358949.html",
    "text": "Tesla (TSLA) shares closed lower following a Reuters report that the company is shutting down most production at its Berlin factory due disruptions in the Red Sea. BlackRock (BLK) is buying Global Infrastructure Partners in a $12.5 billion deal. It comes on the same day the asset management firm reported fourth quarter earnings that topped Wall Street estimates. the firm now as $10 trillion in assets under management. Gold (GC=F) prices rose thanks to investors seeking safety as tensions in the Middle East escalate. Yahoo Finance's Jared Blikre and Josh Lipton break down some of Friday's top trending tickers. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich JOSH LIPTON: Tesla temporarily halting most production out of its Berlin factory for the next two weeks, it's according to Reuters. The EV maker also slashing starting prices in China for its Model 3 and Model Y vehicles. So listen, we were talking earlier in the show about this issue, Jared, these Iran-backed militants, the Houthis, how they've been disrupting global trade, attacking ships in the Red Sea. And this is an example of the kind of downstream effect we're seeing here because Tesla now telling Reuters, listen, we're going to suspend most production at our Model Y plant in Germany near Berlin from January 29 to February 11, it sounds like. And that's as supplies now shift transport routes due to these attacks. So you're starting to see the kind of ripple effects show up for companies. JARED BLIKRE: Yeah, these costs are non-trivial. I was speaking to one analyst, just ballpark figure, it costs an extra million dollars to go around the Cape of Africa there to make that alternate route. And that's just for one supertanker. And so you add that, anything getting shipped around the Middle East, Asia to Europe, Europe to Asia, all of that, the costs are just skyrocketing here. And I want to go to the Wi-Fi interactive just to show you what's going on with Tesla recently. Tesla really just took a downturn at the end of last year. It's been down most of these last two, two and a half weeks there in the broader context. And let me just show you a two-year chart. That's pretty sideways choppy action. Here is a five-year chart. This is just a giant, giant consolidation area and we are just about in the middle of it there. So really not a lot to get excited about from a chart perspective. You either got to come down here all the way to support around 150, all the way up here by about 400, and that could take a little while to get to. So anything to add to that? JOSH LIPTON: I just like watching you spin those charts. JARED BLIKRE: Oh, thank you. JOSH LIPTON: I was just kind of mesmerized there for a second. JARED BLIKRE: All right, I appreciate that. And it is a busy day for BlackRock. The investment management company announcing it will acquire Global Infrastructure Partners for 12 and a half billion dollars. BlackRock also reporting a beat on earnings for the fourth quarter with assets under management. Here is the lede, $10 trillion. I remember my jaw dropping when it was $5 trillion and that was maybe what, 2017, 2018? Hard to remember. But just a behemoth. And by the way, that was their ETF, EBIT, and I think they were ringing the closing bell there. That was one of the highest volume ETFs of the new spot Bitcoin ETFs that got launched just yesterday. JOSH LIPTON: And so that's one big number. And then obviously, this big acquisition made a lot of headlines too today. So this buying this private equity firm, Jared, Global Infrastructure Partners for about $12.5 billion, it sounds like in cash and stock. So this sounds like Larry Fink kind of just pushing hard into private market investment operations, which he obviously sees as a real potential moneymaker beyond just the sort of passive investment products BlackRock is, of course, known for. And these guys, basically, they own energy, transportation. They own water and waste companies. And Larry Fink kind of laid out the strategy here saying infrastructure, one of the most exciting long-term investment opportunities, he says, as a number of structural shifts reshape the global economy. So he's placing a big bet there. JARED BLIKRE: Yeah. Wall Street seems to like it too. Jefferies, here's a quote for them calling BlackRock's plan to acquire them \"transformative\"-- that's a quote there-- because it's an area BlackRock has been-- BlackRock has been growing in both organically and inorganically with about $50 billion in existing assets under management. So only $50 billion in this particular category, but just shows the growth potential that we have there. One more quick comment by Citigroup said that BlackRock's earnings beat was primarily driven by lower salary and benefit expenses, which amounted to 1 and a half billion dollars. So they're also cost cutting and that's just kind of strikes the chord that Wall Street has been striking, which is to lower those costs, get that headcount down if you can. JOSH LIPTON: Yup. JARED BLIKRE: And we got to talk about gold prices. They are rising, just a little bit as tensions escalate in the Middle East while softer US producer price inflation boosts optimism on the path for interest rate cuts. And gold has been interesting for me to watch. We can pull up a chart on the Wi-Fi interactive here. I got gold up here 1 and 1/2% today. Let me change this to a line chart, so we can see it a little bit better. This goes back five years and you can see how gold was stuck just trying to get through $2,000 an ounce. It did it by a little bit, but only broke out relatively recently and hasn't really taken that next lift off step. But from a technical analysis point of view, if you've been consolidating for four years, well, that just-- and you break to the upside successfully, that just means that you're going to have that long-- a continuation potentially. And so $2,500 is a big target that some analysts are looking for here. JOSH LIPTON: Yeah, so it sounds like really kind of two big factors, right, Jared, when you talk about gold here. One, it's this bet on Fed rate cuts. Investors typically want to own the metal in a rate cutting cycle. And then we're talking about it again, it's geopolitical conflict. I mean, that's playing a role here and well shouting support. JARED BLIKRE: Yeah, and I have one more chart on the Wi-Fi interactive to be indulged here. JOSH LIPTON: Do it. JARED BLIKRE: This is central banks buying gold. You're talking about geopolitical risk? Well, guess who wants to hedge against that, central banks. And in 2023, they just about tied 2022. Actually, I think the final totals may have pushed that a little bit above because that's from the last week of the year. But the point is central banks doubling down, tripling down on their gold buying. Related Quotes "
}