{
    "title": "Elon Musk's $56 billion pay package saga ensnares Tesla chair Robyn \nDenholm, the woman who was supposed to ...",
    "date": "2/16/2024",
    "url": "https://finance.yahoo.com/news/elon-musk-56-billion-pay-134422827.html",
    "text": "Good morning, Broadsheet readers! Judges from the New York Court of Appeals could revisit Harvey Weinstein's previous convictions, funding for women-led health startups spiked more than 2,000% in 2023, and a Delaware judge’s decision striking down Elon Musk’s pay package puts Tesla chair Robyn Denholm in the spotlight. Have a restful weekend. - Pay package. Late last month, a Delaware court struck down Elon Musk's $55.8 billion Tesla pay package in response to a shareholder lawsuit that claimed the proposal breached fiduciary duty to investors. Chancellor Kathaleen McCormick's decision enraged the Tesla CEO, who has said he plans to reincorporate Tesla in Texas rather than stay in Delaware. But McCormick's decision didn't only target Musk. Another figure in her 200-page document is Robyn Denholm, Tesla's board chair. Denholm, an Australian former telecom exec who is also a partner at Canva investor Blackbird, became chair of Tesla's board in 2018 after Musk was forced to step down from the role as part of an SEC settlement. At the time, the SEC said Musk’s removal as chairman—and the appointment of an independent successor—was “intended to prevent further market disruption and harm to Tesla’s shareholders.” Denholm has served on Tesla's board since 2014. McCormick struck down Musk's pay package because she determined the process that led to its approval was deeply flawed, pinning most of that blame on the board and its compensation committee. Musk's pay was the largest ever proposed for an executive at a publicly traded company, she found. She argued that several decision-makers were \"beholden to Musk\" because of personal relationships and sky-high compensation. Denholm, in particular, is called out for earning $280 million from sales of Tesla options in 2021 and 2022. McCormick repeatedly cites Denholm's testimony that the money was \"life-changing\" compared to the $3 million a year she earned beforehand. Tesla and Denholm haven't respond to requests for comment. McCormick's decision prompted all kinds of reactions—Musk's fury, Denholm's silence so far, and others' defense of the chair. ARK Invest's Cathie Wood, a major Tesla investor, defended Denholm after the ruling as a \"professional of unquestionable integrity.” Two weeks after the decision, shareholders and others are still waiting to find out what it will mean for them. In the meantime, the situation provides a fascinating look at one of the trickiest jobs in corporate America. When Musk was forced to step down as Tesla's chair, some questioned whether any incoming chair would be able to effectively oversee one of the world's richest men. Denholm was cast as a kind of \"adult in the room,\" a role that women in Silicon Valley—starting with Sheryl Sandberg—have often been slotted into. (It's a dynamic Musk seems to seek out—see: Linda Yaccarino at X and Gwynne Shotwell at SpaceX.) And governing Musk—a CEO who this week posted, \"boobs just rock, it's a fact\"—is arguably a challenge levels beyond overseeing another eccentric CEO. As recently as 2022, Denholm was praised by another judge as an \"independent, powerful and positive force\" in a lawsuit over Tesla's 2016 acquisition of SolarCity. So what changed? During the SolarCity acquisition, Denholm was only a director—not chair. In the years since, Musk has become even more of a wildcard, with his attention diverted to his purchase of Twitter. And the spotlight on Denholm's decision-making has grown brighter. Charles Elson, a retired professor at the University of Delaware who specializes in corporate governance, argues that directors should never sell stock. He believes the recent court decision damages the reputations of Tesla's directors and says the board will need to be \"refreshed.\" \"No one should have taken that kind of money,\" he says of the board's compensation. \"At that point, it begins to compromise your independence.\" And, he tells me, this episode provides some insight for other boards overseeing headstrong CEOs. \"Stand your ground,\" he advises. \"You have to represent the investors.\" Emma Hinchliffeemma.hinchliffe@fortune.com@_emmahinchliffe The Broadsheet is Fortune's newsletter for and about the world's most powerful women. Today's edition was curated by Joseph Abrams. Subscribe here. This story was originally featured on Fortune.com Related Quotes "
}