{
    "title": "That anti-Tesla Super Bowl ad just got the wrong kind of attention from the \nNTSB",
    "date": "2/12/2024",
    "url": "https://au.finance.yahoo.com/news/anti-tesla-super-bowl-ad-215803115.html",
    "text": "The National Transportation Safety Board, a U.S. government agency that investigates crashes, has ordered the Dawn Project organization to stop using its seal after it appeared in a Super Bowl ad that called for consumers to boycott Tesla. The NTSB said in a letter that its seal must be immediately removed from the Dawn Project's website and YouTube page, as well as any further airings of the commercial. NTSB said in a news release that it did not authorize the use of its seal and does not endorse the work of the Dawn Project. \"We used the NTSB’s seal in our second Super Bowl LVIII commercial whilst we were referring to Tesla refusing to implement the NTSB’s prudent safety recommendations, recommendations with which The Dawn Project fully agrees,\" an emailed statement from a Dawn Project spokesperson. \"Unlike Tesla, we have great respect for the NTSB.\" The Dawn Project, a safety advocacy group funded by tech CEO Dan O'Dowd, aired two ads during Super Bowl LVIII in Washington, DC, Dover, Delaware, Santa Barbara, California and Traverse City, Michigan -- the city where U.S. Secretary of Transportation Pete Buttigieg lives. The cost of airing the ads in those markets was $552,000. The ads criticize Tesla Full Self-Driving, advanced driver assistance software that O'Dowd has alleged has critical safety defects. FSD is not self-driving. Instead, the upgraded $12,000 system performs some automated driving tasks and requires a human driver to be ready to take control at any time. The Dawn Project has campaigned against the use of Tesla FSD for years now, including airing an ad in last year's Super Bowl. This year, the group used the NTSB seal in its ad, which got the attention of the agency. NTSB General Counsel William McMurry Jr. called the use unlawful and noted the commercial has also been posted to the group's webpage and YouTube page. The agency also included a screenshot of the ad, which is shown below. Image Credits: NTSB \"Due to the nature of our work and the need to be unambiguously independent from commercial interests, we strive to protect the international reputation of the NTSB by preventing unapproved use of our seal,\" the letter reads. \"Contrary to Federal law, you did not obtain, and the NTSB did not grant, permission to use the NTSB Seal in your Super Bowl LVIII commercial or on any other materials. Moreover, your unauthorized use of the NTSB’s seal spuriously implies endorsement of your company and/or message by the NTSB.\" This food habit is linked to a specific type of dementia. Abby Hensel officially tied the knot in 2021, it has been revealed Trade 24 hours a day on the world's most popular platform. The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Harry Enten ran the numbers on Trump's dismal fundraising so far.  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Benny Larkin and daughter Taylor Larkin, 14, were boating down Dora Creek, New South Wales, Australia, when they broke down and were approached by a fuming kayaker. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show.  MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. The not-so-happy campers were stunned by the unexpected guest at their beachside campsite. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia.  The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. The person who wrote on the road has been called a \"top bloke\" by motorists. Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent.  ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ Footage shows Dylan Edwards moved out of the way. Find out more here.  Despite referee Gerard Sutton labelling the collision \"incidental\", Souths superstar Latrell Mitchell has been charged for dangerous contact on Josh Addo-Carr. The ugly incident involving the AFL veteran has sparked debate. More here. An anonymous motorist shared the location to warn others. And it is not the first time motorists have complained about the speed camera set-up in this exact location. "
}