{
    "title": "Noted investor Cathie Wood dishes on power of AI, Tesla",
    "date": "2/29/2024",
    "url": "https://www.businessobserverfl.com/news/2024/feb/29/cathie-wood-power-ai-tesla/",
    "text": "Loading St. Pete investor Cathie Wood says if you're interested in artificial intelligence, be very interested in Tesla. Wood, ARK Investment Management CEO who moved her company from New York to St. Pete, explained why on a Friday webcast on X (formerly Twitter), hosted by the Carson Group of Omaha, Nebraska. Wood, a big believer in future tech investing, says Tesla meets four characteristics in the AI age that AI companies must have \"if they are going to win.\" Tesla has No. 1: deep domain expertise, she says. \"Tesla's expertise is not only battery technology and robotics, because autonomous cars are robots,\" says Wood. \"It is artificial intelligence. It is the only auto company to have designed its own chip for autonomous driving.\" Wood says Tesla's chip is a lesson page from Apple, which made its own chip for its cellphones. Tesla also has No. 2: AI expertise. \"It's hiring the best and the brightest,\" says Wood. \"This is the largest AI project in the world.\" No. 3? Global distribution. Tesla CEO Elon Musk of course has that, Wood says. And No. 4: \"Most important, it has proprietary data that no one else has,\" says Wood. \"It has orders of magnitude … of more data collected of real-world driving data.\" Those billions and billions of gigabytes of data will set Tesla up to be the No. 1 autonomous taxi network of the United States and other countries, Wood says. A sign of that is how many other automakers are signing on to Tesla charging networks, she told her hosts. Musk is not spreading himself too thin, she told her hosts. Instead, Musk realizes we are in a world of tech convergence, she says. And AI will bring differing technologies together. AI will also bring physical and digital worlds together. \"He's making it happen,\" says Wood. As for her own take on the future, Wood says she started ARK Investment Management because few people realized that the future of investing was \"investing in the future.\" Thus, buys like Tesla were a no-brainer because of the powerful potential Tesla has, she says. And because Musk and Tesla itself were disruptive. ARK's corporate nutshell is that it \"invests solely in disruptive innovation\" for long-term growth. High-tech tends to disrupt older industries, and that philosophy got ARK noticed in 2020 when her innovation fund got 149% returns. Sign up for Daily BriefReceive the top Gulf Coast business news of the day in your inbox. Receive the top Gulf Coast business news of the day in your inbox. The fund has sometimes struggled, but 2023 saw 68% returns, according to Morningstar. Wood says ARK is up to 60 employees now, from 45, after the purchase of an United Kingdom company late last year. The purchase was made, she told host Ryan Detrick, to \"spearhead our entry into Europe.\" Wood says ARK manages $30 billion. It holds \"eight or nine\" ETFs (exchange-traded funds), Wood says. And Wood runs ARK 21Shares Bitcoin ETF, or ARKB. Not surprisingly, Wood is a big believer in Bitcoin, believing one bitcoin could jump to be worth more than $1.5 million by 2030, in a bull estimate. Her lesser estimate could be $600,000, according to a CNBC interview. (So far, more than 19 million bitcoins have been unlocked by computer users and data centers, with the last coin expected by 2140.) Either way, that is a big return based on bullish prices on Friday: Bitcoin flirted with a record, trading at more than $61,000 per bitcoin.  Jim Stinson is the Business Observer's Tampa Bay business reporter and editor, having previously written about business and policy in Washington, D.C.; Rochester, New York; Gary, Indiana; and Daytona Beach. He attended Boston University for business and Indiana University for journalism. Your free article limit has been reached this month.Subscribe now for unlimited digital access to our award-winning business news. Join thousands of executives who rely on us for insights spanning Tampa Bay to Naples. Click here to Subscribe Click here to Login "
}