{
    "title": "Tesla Stock Keeps Tanking After a 2.2 Million EV Recall: Bargain ... or \nBeware?",
    "date": "2/5/2024",
    "url": "https://www.fool.ca/2024/02/05/tesla-stock-keeps-tanking-after-a-2-2-million-ev-recall-bargain-or-beware/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Tesla stock (NASDAQ:TSLA) saw shares shrink lower after recalling 2.2 million cars, and there are more recalls on the way. Image source: Getty Images Shares of Tesla (NASDAQ:TSLA) continued to drop this week as the electric vehicle (EV) company came under fire by United States safety regulators. In fact, Tesla stock will need to recall about 2.2 million vehicles, nearly every single one in the U.S. right now. But, it keeps getting worse. Tesla stock will need to recall the vehicles after finding that the company used the incorrect font sizes on warning lights, creating a crash risk. Although no crashes or injuries have been reported, it was another blow to the stock, which saw shares fall 3%. This comes on top of the 63% drop in share price experienced since highs. While this can be fixed through a software update, the probe later released more issues the same day. In this case, about 334,000 vehicles could be subject to a power steering loss. U.S. safety regulators have upgraded their probe into Tesla (TSLA.O) vehicles over power steering loss to an engineering analysis – a required step before the agency could demand a potential recall. This occurred after steering control was lost in about 280,000 Tesla vehicles back in July. These are just the latest recalls from Tesla stock, adding onto another 2.03 million vehicle recalls to install new autopilot safeguards. However, it has been reported that even the new safeguards aren’t sufficient. So while the innovator remains on top when it comes to bringing out new ideas and tech, it doesn’t look like it’s all that safe. And it’s likely that these probes will continue until they are. Which leads many to perhaps wonder if there isn’t another EV stock to consider besides Tesla stock? If you want a deal with lots of exposure to EVs, then I would consider Magna International (TSX:MG) instead. Magna stock continues to make quite the comeback after falling to dramatic lows during the pandemic. The company suffered under supply-chain disruptions. Yet now, it has shown that it can pick up the pace. Magna stock continues to make partnerships with some of the largest manufacturers in the world. It continues to create new assembly locations across the country. As the world shifts towards EVs, it’s likely that Magna stock will only surge in use. So with shares trading down 14% in the last year, but up 12% since bottoming out in October, now could be the time to buy. Especially with earnings around the corner. Meanwhile, investors today can bring in a dividend yield of 3.24% as of writing. Tesla stock continues to be an innovator, it’s true. But that brings attention along with it, and not all of it positive. Therefore, it might be a better choice to choose a safer EV stock such as Magna stock today – one that seems to only be climbing higher, instead of falling further down. As for Tesla stock, it’s certainly best to remain on the sidelines. At least perhaps until this probe comes to an end. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 29, 2024 |\n        Puja Tayal Have you given a thought to how you plan to retire? Your decision depends significantly on how much your investments… Read more » March 29, 2024 |\n        Andrew Button AI stocks like Kinaxis (TSX:KXS) are rallying in the markets. Read more » March 29, 2024 |\n        Andrew Button Hot AI stocks like Open Text Corp (TSX:OTEX) have been rallying lately. Read more » March 29, 2024 |\n        Amy Legate-Wolfe Hut stock (TSX:HUT) surged by 23% after the company reported strong earnings, and even more growth occurred in 2024. Read more » March 28, 2024 |\n        Puja Tayal Nvidia stock has made investors millionaires in the last 10 years. Is it too late to invest to become a… Read more » March 28, 2024 |\n        Chris MacDonald There are plenty of growth stocks in the market worth considering, but Shopify (TSX:SHOP) looks like one of the best… Read more » March 28, 2024 |\n        Puja Tayal The TSX has been favouring tech stocks, but not this one. However, it has the potential to trounce the market… Read more » March 27, 2024 |\n        Rajiv Nanjapla These three under-$20 stocks offer excellent buying opportunities for long-term investors. Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. ©  2024 The Motley Fool Canada, ULC. All rights reserved. "
}