{
    "title": "How Tesla's new pay levels compare to unionized workers at Ford and GM",
    "date": "2/9/2024",
    "url": "https://www.businessinsider.com/tesla-pay-vs-ford-gm-uaw-union-factory-workers-2024-2",
    "text": "       Tesla recently gave some of its factory workers raises, but union-represented workers at Detroit’s Big Three will still make a lot more per hour. According to internal documents reviewed by Business Insider, new pay guidelines for Tesla workers were implemented on January 8. Factory workers at Tesla now make anywhere from $22 to $39 an hour, according to the documents. Tesla is the latest automaker to raise wages after the United Auto Workers won massive pay hikes for their members at Ford, GM, and Jeep-maker Stellantis last year. While Tesla’s new wages bring its workers closer in line with the industry's average wages for auto factory workers, base pay is still far behind that of a UAW worker. At GM, for example, the starting rate for a production worker is $25.25 per hour, with a top rate of $36.00 per hour, as of the end of last year. By the end of the contract term in September 2027, the minimum will be $30.60 per hour, with a top end of $42.95 per hour. Wage scales at Ford and Stellantis are similar, with top-end wages above $42 per hour by the end of their four-year contracts. These workers also pay dues out of their paychecks — between 0.8% and 1.1% of gross monthly wages — which goes into a strike and defense fund to pay workers if the union opts to walk off the job. After a historic strike to win their contracts last year, the UAW now has its eyes on Tesla. But sentiment from workers there, and the company's previous anti-union rhetoric stand to make that an uphill battle. Despite the pay discrepancy, some Tesla workers previously told BI they’d be hesitant to join a union. Related stories The workers spoke under the condition of anonymity in order to avoid potential repercussions for speaking publicly about their employer. Some Tesla workers said they joined the company because they believe in CEO Elon Musk’s vision. They’re willing to trade off lower pay in order to work at the company, multiple workers said. Some also pointed to the millions of dollars longtime Tesla workers have made from stock options, a unique aspect of working for a company that has seen 800% share price growth in the past five years. The carmaker has its ways of weeding out pro-union employees, multiple workers said. “It’s not exactly a requirement to be a Tesla fanatic, but it can have some sway,” one worker with knowledge of Tesla’s hiring process said. Given Musk and Tesla’s popularity, the EV company has had no shortage of interest from factory workers. Over 3.6 million people applied to work at Tesla in 2022. Tesla’s startup culture — which has Musk calling for factory workers to be practically “sleeping on the line”  — isn’t necessarily in line with a union culture, one worker said. Musk and his EV company have clashed with The National Labor Relations Board more than once. Last year, the National Labor Relations Board alleged that Tesla laid off dozens of workers at its Buffalo, New York, site after the employees had announced plans to unionize. Similarly, in 2021, the NLRB  ruled that Tesla and Musk \"unlawfully threatened\" the workers hoping to unionize in 2017 and ordered the company to rehire a union-activist worker it had fired even after Tesla attempted to appeal the decision. The board said Tesla \"interrogated\" employees involved in the effort and ordered Musk to delete a tweet it deemed \"anti-union.\" (The tweet is still up). Tesla has never held a union vote at any of its US facilities. But the German union IG Metall said last year that some Tesla workers at the company's Brandenburg plant had joined its union. Musk, for his part, has in the past publicly invited the UAW to hold a union election at Tesla, expressing confidence that his workers would vote against organizing and saying that \"former UAW members who work at Tesla are not huge fans of UAW.\" Tesla employs over 140,000 workers across the globe, including over 20,000 at its Fremont factory in California. Read next Jump to "
}