{
    "title": "Tesla Price Yo-Yo Continues With Model Y Hikes In Europe",
    "date": "2/13/2024",
    "url": "https://www.investors.com/news/tesla-price-yo-yo-continues-with-model-y-hiked-in-europe/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Tesla (TSLA) raised Model Y prices in some European countries overnight, less than a month after cutting European prices on its top-selling EV and days after temporarily reducing U.S. prices. Tesla stock fell modestly early Tuesday. The U.S. EV giant hiked its Standard Range+ Model Y in Germany by 2,000 euros to 44,990 euros. It raised its Long Range and Performance variants by 2,500 euros, to 52,490 euros and 58,490 euros, respectively. That's after cutting the Model Y SR+ by 1,900 euros on Jan. 17, while reducing the other two variants by 5,000 euros. Tesla also raised Model Y prices in Norway by 3.9%-5.3%, after reducing them by 5.6%-7.1% on Jan. 17. Prices are still slightly lower than they were before the Jan. 17 cut. On Feb. 12, Tesla's Berlin plant restarted production after a two-week suspension. The company cited parts shortages due to Red Sea shipping delays, but there was no question that Model Y inventories were high. While Tesla prices have trended sharply lower since the start of 2023, the EV maker has raised prices at times. On Saturday, Tesla reduced U.S. prices on its Real Wheel Drive and All Wheel Drive Model Y variants by $1,000, but only through Feb. 29. Tesla still discounts Model Y inventory by far more than current list prices. A week earlier, Tesla raised the Model 3 Long Range price in the U.S. by $1,000. TSLA stock sank 2.2% to 184.02 Tuesday. Shares fell 2.8% on Monday. Please follow Ed Carson on  Threads at @edcarson1971 and X/Twitter at @IBD_ECarson for stock market updates and more. YOU MIGHT ALSO LIKE: Why This IBD Tool Simplifies The Search For Top Stocks Want To Get Quick Profits And Avoid Big Losses? Try SwingTrader Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Tesla, BYD Struggle Amid Weak Earnings, Tough Climate Market Rally Tested; Lyft Soars Late 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}