{
    "title": "NaakMusiQ Lives It Up in America, Shares Video Driving a Tesla, Mzansi \nAmazed: “Bring It Home” - Briefly.co.za",
    "date": "2/26/2024",
    "url": "https://briefly.co.za/entertainment/celebrities/180954-naakmusiq-lives-america-shares-video-driving-a-tesla-mzansi-amazed-bring-home/",
    "text": "Global site navigation PAY ATTENTION: We are on WhatsApp! Get trending news in your favourite app - FOLLOW NOW! South African musician and actor Anga Makubalo, popularly known by his stage name NaakMusiQ, is living his best life in the USA. The star left Mzansi green with envy when he shared a glimpse of his trip on social media. South African celebrities love travelling internationally and ensure their fans get a glimpse of their lives overseas. Top stars like Minnie Dlamini, Cassper Nyovest and NaakMusiQ are currently abroad. Minnie and Cassper shared on their social media pages that they are in London and Naak is in America. Read also Oskido posts hilarious Pastor Shepherd Bushiri TikTok skit, Mzansi reacts: \"This man is a problem\" Taking to his Instagram page, NaakMusiQ shared a series of pictures and videos from his trip. What caught Mzansi's eye was the Tesla he was driving in one of the videos. He captioned the post: PAY ATTENTION: stay informed and follow us on Google News!  Tesla is undoubtedly one of the most recognised car brands in the world. South Africans loved that their fav got to drive one of the fancy cars. @thanyanirinae said: @nthathimoshesh commented: @prime_sanelaire added: @khumalo_enest noted: @xcreatar commented: Read also Sports presenter Walter Mokoena gives sports legend Robert Marawa a heartfelt salute @khanye_sunshine added: @oka_nhlanhla wrote: Meanwhile, Briefly News reported that coming from seeing Lil Wayne perform in America, Bontle Modiselle-Moloi jumped onto the popular Tshwala Bami TikTok challenge with Robot Boii. The dancers hit the ball out of the park with their dance moves, with Mzansi dubbing them two of the best performers in the challenge. The Tshwala Bami dance challenge has a new entry, and netizens think Bontle Modiselle-Moloi and Robot Boii took the top spot. PAY ATTENTION: Follow Briefly News on Twitter and never miss the hottest topics! Find us at @brieflyza! Source: Briefly News Recommended for you      Check more articles for you "
}