{
    "title": "Rockline Wealth Management LLC Makes New $2.52 Million Investment in Tesla, \nInc. (NASDAQ:TSLA)",
    "date": "3/21/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsla-sec-filing-2024-03-21/",
    "text": "Rockline Wealth Management LLC bought a new position in shares of Tesla, Inc. (NASDAQ:TSLA - Free Report) during the fourth quarter, according to its most recent filing with the SEC. The fund bought 10,156 shares of the electric vehicle producer's stock, valued at approximately $2,524,000. A number of other hedge funds also recently made changes to their positions in TSLA. Axiom Financial Strategies LLC raised its stake in shares of Tesla by 9.8% during the 1st quarter. Axiom Financial Strategies LLC now owns 906 shares of the electric vehicle producer's stock worth $777,000 after purchasing an additional 81 shares during the period. Mirae Asset Global Investments Co. Ltd. raised its stake in Tesla by 19.7% in the 1st quarter. Mirae Asset Global Investments Co. Ltd. now owns 1,001,923 shares of the electric vehicle producer's stock valued at $1,079,672,000 after acquiring an additional 164,789 shares during the period. MAS Advisors LLC increased its position in shares of Tesla by 25.7% during the first quarter. MAS Advisors LLC now owns 396 shares of the electric vehicle producer's stock valued at $433,000 after buying an additional 81 shares during the period. Ergoteles LLC increased its position in shares of Tesla by 33.4% during the first quarter. Ergoteles LLC now owns 3,567 shares of the electric vehicle producer's stock valued at $3,844,000 after buying an additional 893 shares during the period. Finally, Mackenzie Financial Corp increased its position in shares of Tesla by 6.8% during the first quarter. Mackenzie Financial Corp now owns 72,167 shares of the electric vehicle producer's stock valued at $77,767,000 after buying an additional 4,593 shares during the period. 41.87% of the stock is currently owned by institutional investors. Analysts Set New Price Targets Several equities research analysts have recently weighed in on the company. Barclays decreased their price target on Tesla from $250.00 to $225.00 and set an \"equal weight\" rating on the stock in a research report on Thursday, January 25th. UBS Group cut their price objective on Tesla from $225.00 to $165.00 and set a \"neutral\" rating for the company in a report on Thursday, March 14th. JPMorgan Chase & Co. cut their price objective on Tesla from $135.00 to $130.00 and set an \"underweight\" rating for the company in a report on Friday, January 26th. The Goldman Sachs Group cut their price objective on Tesla from $220.00 to $190.00 and set a \"neutral\" rating for the company in a report on Monday. Finally, Robert W. Baird reissued an \"outperform\" rating and set a $300.00 price objective on shares of Tesla in a report on Thursday, January 25th. Ten analysts have rated the stock with a sell rating, fourteen have issued a hold rating and nine have assigned a buy rating to the company's stock. According to data from MarketBeat, the company has a consensus rating of \"Hold\" and an average target price of $211.93. Check Out Our Latest Report on TeslaInsider Buying and Selling In other news, Director Robyn M. Denholm sold 93,706 shares of Tesla stock in a transaction dated Wednesday, February 21st. The stock was sold at an average price of $194.73, for a total transaction of $18,247,369.38. Following the transaction, the director now directly owns 15,000 shares of the company's stock, valued at approximately $2,920,950. The transaction was disclosed in a legal filing with the SEC, which can be accessed through this link. In other news, Director Robyn M. Denholm sold 93,706 shares of Tesla stock in a transaction dated Wednesday, February 21st. The stock was sold at an average price of $194.73, for a total transaction of $18,247,369.38. Following the transaction, the director now directly owns 15,000 shares of the company's stock, valued at approximately $2,920,950. The transaction was disclosed in a legal filing with the SEC, which can be accessed through this link. Also, Director Robyn M. Denholm sold 93,705 shares of the business's stock in a transaction that occurred on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total value of $16,439,605.20. Following the completion of the transaction, the director now directly owns 15,000 shares in the company, valued at $2,631,600. The disclosure for this sale can be found here. In the last ninety days, insiders sold 198,598 shares of company stock worth $36,952,434. 25.10% of the stock is owned by corporate insiders. Tesla Stock Down 1.6 % Tesla stock traded down $2.84 on Thursday, hitting $172.82. 73,032,695 shares of the stock traded hands, compared to its average volume of 104,309,336. The company has a current ratio of 1.73, a quick ratio of 1.25 and a debt-to-equity ratio of 0.05. The firm has a market cap of $550.40 billion, a P/E ratio of 40.10, a price-to-earnings-growth ratio of 3.85 and a beta of 2.41. The business's fifty day simple moving average is $192.31 and its 200 day simple moving average is $224.71. Tesla, Inc. has a 1 year low of $152.37 and a 1 year high of $299.29. Tesla (NASDAQ:TSLA - Get Free Report) last issued its quarterly earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share for the quarter, missing the consensus estimate of $0.74 by ($0.03). Tesla had a net margin of 15.50% and a return on equity of 16.62%. The company had revenue of $25.17 billion for the quarter, compared to the consensus estimate of $25.64 billion. During the same quarter in the previous year, the business earned $1.07 earnings per share. Tesla's revenue was up 3.5% compared to the same quarter last year. As a group, sell-side analysts forecast that Tesla, Inc. will post 2.45 earnings per share for the current year. About Tesla (Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.Read MoreFive stocks we like better than TeslaHow to Calculate Inflation RateGoogle and Meta Circling the Market on a TikTok Ban RallyStock Dividend Cuts Happen Are You Ready?Intuitive Machines: Charting a Course Among the StarsHow to Invest in Biotech StocksKB Home’s Stock Price Can Move Higher, Here’s Why Want to see what other hedge funds are holding TSLA? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Tesla, Inc. (NASDAQ:TSLA - Free Report).This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ I tried to warn you  (From Porter & Company) (Ad)Should you invest $1,000 in Tesla right now?Before you consider Tesla, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list.While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here The Best High-Yield Dividend Stocks for 2024Looking to generate income with your stock portfolio? Use these ten stocks to generate a safe and reliable source of investment income.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Tesla, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list. While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Looking to generate income with your stock portfolio? Use these ten stocks to generate a safe and reliable source of investment income. If the last year of price cuts and sluggish sales weren’t enough to tip off the market to the fact the EV bubble has burst, Tesla’s NASDAQ: TSLA Q4 results and outlook for 2024 should do it. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}