{
    "title": "Xiaomi challenges Tesla in Chinese market with $29,870 electric car",
    "date": "3/28/2024",
    "url": "https://www.republicworld.com/automobile/xiaomi-challenges-tesla-in-chinese-market-with-29870-electric-car/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated March 29th, 2024 at 09:18 IST During the launch event, Xiaomi CEO Lei Jun revealed that the standard SU7 EV model would be priced at 215,900 yuan ($29,872.02), undercutting Tesla's offering. Xiaomi against Tesla in China: Chinese technology giant Xiaomi unveiled its latest venture into the electric vehicle (EV) market with the launch of a sporty electric car priced competitively below Tesla's Model 3. During the launch event, Xiaomi CEO Lei Jun revealed that the standard SU7 EV model would be priced at 215,900 yuan ($29,872.02), undercutting Tesla's offering. The new electric car, drawing inspiration from Porsche's styling cues, promises advanced features surpassing those of both Tesla and Porsche, according to Lei. Xiaomi's entry into the EV market aligns with Lei's ambitious plan announced in 2021, investing $10 billion in the auto business. The company's manufacturing partnership with state-owned automaker BAIC Group facilitated the production of the SU7 sedan, first showcased in December. Xiaomi's move received an overwhelming response, with 50,000 orders placed within 27 minutes of opening sales. Deliveries are scheduled to begin in late April for standard models and in May for Pro models. However, analysts remain divided on Xiaomi's prospects in the competitive EV market, questioning whether consumers will embrace the company's transition from electronics to premium EVs. Despite challenges, Xiaomi's diversified revenue streams and expertise in smartphones could give it an advantage, particularly in smart cockpit technology highly valued by Chinese consumers. The SU7 features Xiaomi's self-developed Hyper OS, integrating EV users with its ecosystem of devices, including smartphones. (With Reuters Inputs) Published March 29th, 2024 at 09:10 IST Send us your views, we’ll publish them. This section is moderated. 'To Share Grief': Husbands in Jail, Mrs Kejriwal And Mrs Soren Meet Hostages in Dutch Town Ede Rescued, Man Arrested UP: Portion of Under-Construction Bridge Collapses in Bulandshahr Upset Over Relationship Issues, B.Tech Student Dies by Suicide in Noida Daughter-in-Law of Former Lok Sabha Speaker Shivraj Patil Joins BJP Google's timeline for RCS support on iPhone Han So Hee-Ryu Jun Yeol Call It Quits Within Two Weeks Amid Controversy Zodiac Signs That Are Born To Be Rebels And Challenge The Status Quo 'Received I-T Notice Last Night', Claims DK Shivakumar AAP's Bharadwaj, Atishi to Address Press Conference at Noon Today | LIVE © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}