{
    "title": "Tesla is increasingly a '2027 story,' Evercore analysts warn after touring \nTexas factory",
    "date": "3/11/2024",
    "url": "https://fortune.com/2024/03/11/tesla-2027-story-evercore-analysts-model-2-deliveries/",
    "text": "Tesla Inc. is likely years away from fully ramping a new lower-cost model, which will take the company longer than Wall Street is assuming, Evercore analysts said after touring the carmaker’s Texas factory. “Tesla increasingly is a ‘2027 story,’” Evercore analysts led by Chris McNally wrote in a report Monday. He questioned whether the best-case scenario for a cheaper vehicle colloquially referred to as Model 2 is more like 500,000 units in 2026, rather than consensus for 1 million-plus. McNally has the equivalent of a hold recommendation on Tesla and hasn’t rated the company a buy since he initiated coverage in January 2020, according to data compiled by Bloomberg. The stock has risen 310% in that span. Chief Executive Officer Elon Musk has said Tesla is “between two major growth waves,” with the first underpinned by the Model 3 sedan and Model Y crossover, and the second expected from a cheaper next-generation electric vehicle. The company expects to start production of this EV toward the end of 2025 at its plant in Austin. The next-gen model’s bill of materials will decline from $28,000 to $20,000, and likely have around 250 miles of range and no glass roof, McNally wrote. A “big debate” will be whether Tesla’s driver-assistance hardware will be standard, he said, citing his team’s belief that the hardware could cost $2,000 to $3,000. Evercore now expects Tesla to deliver around 2.7 million vehicles in 2026, meaning its estimate for earnings per share that year is 18% to 20% below consensus. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}