{
    "title": "Amid Tesla Challenge, Ford Pins Hopes On Hybrids For Relevance As Mach-E \nSales Dip",
    "date": "3/8/2024",
    "url": "https://www.tradingview.com/news/benzinga:db65bdad8094b:0-amid-tesla-challenge-ford-pins-hopes-on-hybrids-for-relevance-as-mach-e-sales-dip/",
    "text": "Michigan-based Ford Motor Co F is relying on its hybrid offerings to keep it relevant in the U.S. EV market amid dwindling demand for its popular EV- the Mustang Mach-E. Rising Hybrid Sales: Ford sold 23,202 hybrid vehicles in the U.S. since the start of the year, marking a jump of 36.7% year-on-year. In comparison, the company sold only 11,042 battery-electric vehicles in the same time frame, despite a near 26% YoY jump. Until the end of last year, Ford’s Mustang Mach-E was the company’s best-selling battery electric vehicle (BEV) and also the second-best-selling EV SUV in the U.S. after Tesla’s Model Y. However, since the start of 2024, its sales have dipped about 4.2%. Sales were more disappointing in January when the company witnessed sales drop by about 51% as compared to the corresponding month of 2023. February saw sales rise back up, possibly due to the company cutting prices on 2023 model-year vehicles by as much as $8,100 mid-month. Why It Matters: Ford CEO Jim Farley has previously clarified that the company doesn’t intend to phase out combustion engine vehicles and hybrids even as it scales its pure EV business. This is unlike Elon Musk‘s Tesla which makes solely BEVs. \"Hybrids will play an increasingly important role in our industry's transition and will be here for the long run,\" Farley said during the company’s fourth-quarter earnings call in February, adding that the margins on hybrids are closer to combustion vehicles and much higher than EV margins. The company expects its global hybrid sales to be up 40% in 2024. \"We're now the number one and number two best-selling hybrid trucks in the U.S. Maverick is number one and we're the number three hybrid brand in the U.S. behind Toyota and Honda. But unlike them, our hybrids really sell best on trucks,\" Farley said. However, Ford expects losses to widen to a range of $5 billion to $5.5 billion for its electric vehicle segment Model-e this year, owing to pricing pressure and investment into its next generation of vehicles. The EV business segment posted a full-year EBIT loss of $4.7 billion for 2023. The company is struggling to scale EV sales profitably amidst an intense price war initiated by Tesla since the start of 2023 with heavy price cuts and discounts. The company’s EV team is now focused on cost and efficiency to withstand \"ultimate competition\" from Tesla and other Chinese EV makers who have more affordable offerings, Farley said in February. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read More: Rivian Halts Georgia Plant Construction, To Launch R2 SUV In Illinois Facility — Ross Gerber Terms It The ‘Right Strategy' Photo via Wikimedia Commons © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}