{
    "title": null,
    "date": "3/9/2024",
    "url": "https://finance.yahoo.com/news/teslas-german-plant-restart-next-165940224.html",
    "text": "(This March 8 story has been corrected to change the weekly output capacity to 6,000 cars in paragraph 7) By Oliver Barth GRUENHEIDE, Germany (Reuters) - Tesla's German plant near Berlin will resume operations next week, the head of its works council said on Friday, after a power outage stopped production. The Tesla electric vehicle (EV) factory has been closed since March 5 after a fire at a nearby power pylon, which police are investigating as an arson attack. German police said they believed a letter from a far-left organisation called the Volcano Group claiming responsibility for the fire was authentic. \"We will restart the factory next week,\" Michaela Schmitz told a gathering of several hundred workers at the electric vehicle (EV) production site, known as a Gigafactory. Some were holding a banner saying \"We won't be shut down!\" \"Alongside many chapters of outstanding achievements, this attack will go down as a dark chapter in our history. But also that will not stop us,\" said Schmitz. The attack has left the site's 12,500 employees in limbo and means the U.S. EV maker is unable to produce around 6,000 vehicles a week, resulting in losses that are expected to be at least several hundred million euros. Tesla's plant in Gruenheide has for years been the subject of criticism by some locals and activists, who are concerned about its environmental impact. Schmitz said that Tesla employees would receive information about the restart soon, but did not give any further detail on the potential timing of it. \"Colleagues have been condemned to sit at home, instead of contributing successfully together to the energy transition,\" Schmitz added. Tesla has previously said that the factory might be without electricity until the end of next week. Germany's federal prosecutors office said on Friday it had taken over the investigation into the arson attack, looking into charges of terrorism and \"anti-constitutional sabotage\". (Reporting by Oliver Barth; Writing by Ludwig Burger; Editing by Alexander Smith and Kirsten Donovan) "
}