{
    "title": "Tesla share price dropping, UBS trims PT",
    "date": "3/14/2024",
    "url": "https://www.ig.com/uk/news-and-trade-ideas/tesla-shares-slip--ubs-trims-pt-240314",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money.\n\n Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money. WHY IG? GET TO KNOW US TRADING THE FINANCIAL MARKETS IMPORTANT INFO SHARES AND ETFS KEY MARKETS MORE OPPORTUNITIES EXTENDED HOURS OUR PLATFORM AND FEATURES THIRD-PARTY PLATFORMS START EXPLORING NEWS AND ANALYSIS LEARN TO TRADE View more search results Tesla, all-sessions, falls after UBS cut the EV maker’s PT and lowered its Q1 delivery forecast. IGTV’s Angeline Ong looks at the stock reaction and the reasons behind UBS’ move. (AI Video Summary) UBS, a financial institution, has recently made some changes to their assessment of Tesla, a popular electric car company. They have lowered Tesla's estimated value and adjusted their forecast for the company's car deliveries for the first quarter of the year. UBS believes that the demand for Tesla vehicles has slowed down in Western countries and that there is increasing competition for the company in China. These adjustments by UBS have affected Tesla's stock price, which has been falling since July 2023. If we look at a two-day chart, we can see the downward trend, and even on a 15-minute chart, we can observe a drop just before the market opens. In fact, as of now, Tesla's stock price has decreased by more than 1% on the IG trading platform. UBS is worried about the decreased demand for Tesla cars in Western countries. The company is also concerned about the growing competition in China, which may impact Tesla's sales there. These concerns have led UBS to lower their estimated value for Tesla and revise down their forecast for the number of cars Tesla will deliver in the first quarter of the year. Investors are paying close attention to these changes as they greatly influence Tesla's stock. The 15-minute chart clearly shows how UBS's announcement has immediately affected Tesla's stock price. As the market opens, it is expected that the price will continue to fall as investors react to the news. This downward trend is especially noticeable for those using the IG platform, where Tesla's stock price is currently down more than 1%.  This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. See full non-independent research disclaimer and quarterly summary.  Go long or short on thousands of international stocks with spread bets and CFDs. Try a risk-free trade in your demo account, and see whether you’re on to something. Don’t miss your chance – upgrade to a live account to take advantage. Don’t miss your chance. Log in to take advantage while conditions prevail. Prices above are subject to our website terms and agreements. Prices are indicative only. All share prices are delayed by at least 15 minutes. Prices above are subject to our website terms and agreements. Prices are indicative only. All shares prices are delayed by at least 15 mins.  Get the week’s market-moving news sent directly to your inbox every Sunday. The Week Ahead gives you a full calendar of upcoming economic events, as well as commentary from our expert analysts on the key markets to watch.  For more info on how we might use your data, see our privacy notice and access policy and privacy webpage. Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of spread betting and CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Forex Indices Shares Options Other markets Spread betting CFD trading Share dealing Web platform Mobile trading MetaTrader 4 ProRealTime Compare features The Week Ahead News and trade ideas Strategy and planning Contact us  IG | Sitemap | Terms and agreements | Privacy | IG Community | Cookies | Investors | Modern slavery act | Vulnerability Follow us online: Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money. Professional clients can lose more than they deposit. All trading involves risk.\n\nThe value of shares, ETFs and ETCs bought through a share dealing account, a stocks and shares ISA or a SIPP can fall as well as rise, which could mean getting back less than you originally put in. Past performance is no guarantee of future results.\n\nCFD accounts provided by IG Markets Ltd, spread betting provided by IG Index Ltd and share dealing and stocks and shares ISA accounts provided by IG Trading and Investments Ltd. IG is a trading name of IG Markets Ltd (a company registered in England and Wales under number 04008957), IG Index Ltd (a company registered in England and Wales under number 01190902) and IG Trading and Investments Ltd (a company registered in England and Wales under number 11628764). Registered address at Cannon Bridge House, 25 Dowgate Hill, London EC4R 2YA. IG Markets Ltd (Register number 195355), IG Index Ltd (Register number 114059) and IG Trading and Investments Ltd (Register number 944492) are authorised and regulated by the Financial Conduct Authority.\n\nThe information on this site is not directed at residents of the United States, Belgium or any particular country outside the UK and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. Careers | Marketing partnership "
}