{
    "title": "Tesla stock rises nearly 10% on 'AI mojo'",
    "date": "3/20/2024",
    "url": "https://sg.news.yahoo.com/tesla-stock-rises-nearly-10-on-ai-mojo-140524891.html",
    "text": "Tesla (TSLA) stock popped nearly 10% on Monday as a prominent Wall Street analyst stirred up excitement about the artificial intelligence prospects for the electric vehicle maker. In a research note titled \"Unlocking Tesla's AI mojo,\" Morgan Stanley analyst Adam Jonas upgraded Tesla to Overweight from Equal Weight and boosted his price target to $400 from $250. \"Investors have long debated whether Tesla is an auto company or a tech company,\" Jonas wrote. \"We believe it's both, but see the biggest value driver from here being software and services revenue. The same forces that have driven AWS to reach 70% of AMZN total EBIT can work at Tesla, in our view, opening up new addressable markets that extend well beyond selling vehicles at a fixed price.\" Jonas had previously downgraded Tesla in June amid its stock surge saying that investors needed to \"wake up\" from the AI-fueled dream. But now, Jonas is honing in on Dojo, Tesla's custom supercomputing system that trains its full self-driving model. Dojo could add \"up to\" $500 billion to Tesla's enterprise value, per Jonas, through faster adoption rate in mobility (meaning robotaxis) and network services. \"Dojo is the key to unlocking Tesla's double-flywheel effect – integrating and accelerating the synergies between Tesla's Core Auto Flywheel and Tesla's SAAS Flywheel ... accelerating time to market and expanding the addressable market,\" Jonas wrote. Musk has mentioned before that Tesla is currently dependent on Nvidia for its chips, and it can't access as many as it wold like due to high demand. Jonas wrote that Tesla thinks it can \"develop a more efficient system\" without Nvidia instead. \"With a highly experienced semiconductor team, Tesla has built a custom AI ASIC chip, that, due to its core function of processing vision-based data for autonomous driving use cases, can operate more efficiently (energy consumption, latency) than the leading cutting-edge generative Al-purpose chips on the market (NVIDIA's A100s and H100s), and at a fraction of the cost.\" Tesla has made a slew of supercharging deals over the past several months, including a deal last week with Hilton hotels. The supercharger network has been seen as another source of revenue for Tesla outside the car market and its chips could further that growing investor thesis. \"With significantly increased computing power and faster processing speeds (latency), Tesla's path to monetizing vehicle software can materialize sooner, and at higher recurring revenue rates,\" Jonas wrote. \"We also for the first time incorporate non-Tesla fleet licensing revenue into our Network Services model as we expect recent charging station cooperation will extend into FSD licensing (discussions ongoing) and operating system licensing.\" Josh Schafer is a reporter for Yahoo Finance. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" Abby Hensel officially tied the knot in 2021, it has been revealed \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap. This food habit is linked to a specific type of dementia. My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp. Devastating glide bombs have been a major threat to Ukraine's forces, and they can only be beaten by shooting down planes before they're released. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. There is a growing understanding across the Western allies that Ukraine is losing the ground war against Russia, and by summer could face defeat.  Russia is pounding front lines with artillery, rocket and drone fire — and at over five times the rate the Ukrainian army can reply.  Volodymyr Zelensky’s troops are exhausted — after sustaining in some sectors a heavier concentration of incoming artillery than at the Somme in 1916, or the Normandy Bocage after D-Day in 1944. A Russian fighter jet crashed into the sea off the Crimean port of Sevastopol on Thursday, the regional governor has said. The post Lian Hup Heng: Underrated atas cafe-style tarts & cake loaves for $3.80, hidden within a hawker centre appeared first on SETHLUI.com. Nordegren has moved on and built a life that focuses on her six kids Premier League ball boys and girls have been ordered to stop throwing the ball back to players during matches, amid concerns that the “multi-ball” system is giving home teams an unfair advantage. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}