{
    "title": "Tesla Owners Who Claimed Elon Musk's EV Company Misrepresented Vehicle \nRange, Lose Bid For Class Action Suit",
    "date": "3/7/2024",
    "url": "https://www.tradingview.com/news/benzinga:3255b6b63094b:0-tesla-owners-who-claimed-elon-musk-s-ev-company-misrepresented-vehicle-range-lose-bid-for-class-action-suit/",
    "text": "Buyers who approached a federal court alleging that Elon Musk-led Tesla Inc TSLA falsely stated the range of their vehicles have been recommended to pursue their complaints in individual arbitrations as opposed to a class action lawsuit. What Happened: On purchasing a Tesla car, the drivers entered into an arbitration provision with the EV giant in case of disputes, U.S. District Judge Yvonne Gonzalez Rogers said, according to a Reuters report. The plaintiffs claimed that Tesla had fraudulently induced consumers to purchase its cars by overstating the distance they could travel on a single charge. The lawsuits also alleged that Tesla misrepresented the driving range on vehicle dashboards. Despite the ruling, Judge Rogers did not dismiss the lawsuits and suggested that she could potentially issue an injunction against Tesla if the drivers successfully arbitrated their claims under California’s unfair competition law and other provisions, according to the report. Why It Matters: Earlier this year, Tesla revised its range estimates for certain variants of Model S, X, and Y, following a new government vehicle-testing regulation requiring automakers to advertise range closer to real-world performance. The range estimates were subsequently lowered, with some vehicles showing as much as a 37-mile drop in range. Photo by Betto Rodrigues on Shutterstock Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read More: Tesla Introduces 2-Seater Model Y In France Aimed At Businesses Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}