{
    "title": "Tesla shares video from Baja Cybertruck testing trip",
    "date": "3/17/2024",
    "url": "https://www.teslarati.com/tesla-baja-cybertruck-testing/",
    "text": "Tesla has shared a video documenting some Cybertruck testing performed in Baja California, Mexico, prior to the electric pickup’s release last year. In October, ahead of Tesla’s November 30 delivery event, the automaker shared photos, videos and a short livestream of the Cybertruck team testing the vehicle in Baja California. On Friday, Tesla shared a 15-minute video on YouTube about the experience, showing interviews with some of the engineering team while there, and on-the-ground coverage of the testing process. The video chronicles the two Cybertrucks and their trip through the Baja 1,000, also alluding to their use of Starlink “mini” dishes for staying connected and sharing data as it comes in. The roads are fairly unpredictable, going from super rocky and bumpy to smooth, washed-out areas, and later to sandy surfaces, at times even forcing the Cybertrucks to cross shallow waterways. Tesla launches Cybertruck service and owner’s manuals  The trip consists of the following five stages: The team features several engineers who talk about the trip as they make their way south, including Lead Cybertruck Engineer Wes Morrill. While the team notes at a couple of different points that they’re impressed with the Cybertruck’s efficiency, some of the harsher driving roads do take a toll on the electric vehicle (EV). As one example, one of the Cybertruck’s hits a deep berm during stage three of the trip, causing the windshield glass to break. This portion of the drive is full of extra-deep washouts due to a recent hurricane that damaged much of the road, according to the team. The trip also let employees test features such as traction control, extract clearance and off-road mode, and more at various points in the team’s travels. You can watch the full 15-minute video from Tesla below.  The Baja 1,000 is not the only off-road testing Tesla has performed on the truck, though it may be the longest single trip taken on one of these tests. The Cybertruck recently was featured in an off-road demo at Hell’s Revenge, after having been tested at Hollister Hills and in the Tahoe National Forest over the past few months. Tesla is currently ramping up production of the Cybertruck at its Gigafactory in Austin, Texas, with a recent drone flyover showing more than 300 units outside the plant. The U.S. automaker has also been showing the Cybertruck off at multiple automotive expos, and it has been touring through China and Japan. What are your thoughts? Let me know at zach@teslarati.com, find me on X at @zacharyvisconti, or send your tips to us at tips@teslarati.com. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Copyright © TESLARATI. All rights reserved. "
}