{
    "title": "Tesla, Volvo Car pause output as Red Sea shipping crisis deepens",
    "date": "1/12/2024",
    "url": "https://finance.yahoo.com/news/exclusive-tesla-berlin-suspend-most-202020861.html",
    "text": "By Victoria Waldersee, Anna Ringstrom and Marie Mannes BERLIN/STOCKHOLM (Reuters) -Automakers Tesla and Geely-owned Volvo Car said they were suspending some production in Europe due to a shortage of components, the first clear sign that attacks on shipping in the Red Sea are hitting manufacturers in the region. The United States and Britain launched a series of strikes on Yemen on Thursday, aimed at the Iran-backed Houthi militia whose attacks on international shipping have disrupted one of the world's most important shipping routes. Container shipping rates jumped further this week as concerns grew that vessels carrying everything from clothes to phones and car batteries will have to avoid the Suez Canal, the fastest route between Asia and Europe, for longer than expected. The biggest supply chain upheaval since the COVID-19 pandemic risks derailing the global economic recovery, while higher freight and oil prices could reignite inflation. The canal accounts for about 12% of global container traffic. Late on Thursday, Tesla told Reuters it will suspend most car production at its factory near Berlin from Jan. 29 to Feb. 11, citing a lack of components after many ships were re-routed around the southern tip of Africa. \"The armed conflicts in the Red Sea and the associated shifts in transport routes between Europe and Asia via the Cape of Good Hope are having an impact on production in Gruenheide,\" a Tesla statement said. \"The considerably longer transportation times are creating a gap in supply chains.\" It did not say what components were delayed arriving at the factory, where it assembles electric vehicles for sale in Europe. Volvo Car, which is majority-owned by China's Geely, said it will pause output at its plant in Ghent in Belgium for three days next week due to a delayed delivery of gearboxes. Some tanker operators have ceased traversing the Red Sea following the U.S. and British air strikes on Yemen's Houthis, as regional conflict stemming from Israel's war in Gaza widens. Adding to the logistical headaches hampering trade, low water levels due to drought have reduced crossings of the Panama Canal, another key maritime trade route. FALL-OUT Shipping giants such as Maersk and Hapag-Lloyd have been sending their vessels on the longer, more expensive journeys around Africa. Last Friday, Maersk said it expects the re-routing, which adds about 10 days and around $1 million in extra fuel to a journey from Asia to Northern Europe, to last for the foreseeable future. Both companies on Friday welcomed moves to improve security for shipping in the region, but did not say if Thursday's strikes would make a difference. Many companies, including Geely, China's second-largest automaker by sales, Swedish home furnishing company IKEA and British clothes retailer Next, have warned of potential delays to deliveries of goods. U.S. retailers Target and Tractor Supply are also facing delays. Target faces some delays on items from India and Pakistan, which are big apparel suppliers, though most imported merchandise comes across the Pacific and is not affected, a source said. Colin Yankee, chief supply chain officer at Tractor Supply, said there were delays of two to more than 20 days on some products, although spring merchandise is mostly in or will be soon. \"With the Panama Canal restricting daily trips, extended transit times and costs with moving around Africa, and the International Longshoremen's Association contract expiring in Fall of 2024, we see the potential for volume that was moving from Asia to the US East Coast to shift to the US West Coast throughout the year,\" he said by email. Some retailers are stocking up before China's Lunar New Year holiday and seeking air or rail alternatives in a scramble to avoid empty shelves in the northern hemisphere spring. \"If the Red Sea disruption lasts another two to three weeks, I expect to see product shortages on shelves in April and May,\" said Seth Frederickson, vice president of Product Management at FourKites. Other automakers could also suffer shortages from the Red Sea conflict, said Sam Fiorani of AutoForecast Solutions, which tracks automotive supply chains and production. \"It can't be believed that they're alone, only the first to reflect the issue.\" Tesla shares fell 3.7% in New York trade and Volvo Car fell 2.8% in Stockholm. Stellantis said it has seen \"almost no impact\" on manufacturing and has used air freight in limited instances. BMW, Volkswagen and Renault said on Friday production was not affected. But EU carmakers rely heavily on Asia for EV supplies. The region accounted for 67% of EU imports of components for EV batteries in the 12 months to Sept. 30 and just over two thirds of lithium ion batteries shipments, according to S&P Market Intelligence data. Carmakers and analysts in Europe have warned in recent months that EV sales were not growing as fast as hoped, with some companies cutting prices in an attempt to boost demand. (Reporting by Victoria Waldersee in Berlin and Anna Ringstrom and Marie Mannes in Stockholm; Additional reporting by Jonathan Saul in London, Gilles Gillaume in Paris and Siddharth Cavale and Kate Masters in New York; Writing by Josephine MasonEditing by Catherine Evans and Rosalba O'Brien) Related Quotes "
}