{
    "title": null,
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/video/tesla-netflix-earnings-econ-data-211956210.html",
    "text": "Yahoo Finance Live anchors Josh Lipton and Jared Blikre look ahead to the top earnings results and economic data expected out next week, including earnings from companies like United Air Lines (UAL), Netflix (NFLX), and Tesla (TSLA), as well as Personal Consumption Expenditures (PCE) index and preliminary fourth-quarter GDP prints. Yahoo Finance is also kicking off its \"AI Revolution\" special coverage all of next week. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. JOSH LIPTON: All right, time now for what to watch next week. Well, on the earnings front, airlines in focus with United, Alaska Air, and Southwest all set to report. Investors will closely watch Netflix earnings after the bell Tuesday for any insight into how its ad tier is faring. And then there's Tesla earnings, set for Wednesday, will come days after Elon Musk threatened to move his AI efforts elsewhere, unless he gains more control of the company. JARED BLIKRE: Yeah, and it's also a big week for econ data. Flash PMI, that's out Thursday. It's going to give investors a fresh insight into the growth and inflation trends in the new year. Plus, we're going to get preliminary Q4 GDP data for a look at how much the economy grew in the final quarter of 2023. And the Fed's favorite inflation gauge is out Friday. Investors closely watching PCE data-- that's personal consumption expenditures-- for signs of a continual cooling to bolster the case for a March rate cut that investors don't think is coming. JOSH LIPTON: And tune in for Yahoo Finance's latest theme week, the AI Revolution. After the hype of 2023, what is next for artificial intelligence? We are talking about the biggest players, top ways to play a trend, and of course, we will see a regulation crackdown in 2024. Bringing you coverage all week long on Yahoo Finance. Related Quotes "
}