{
    "title": "China’s BYD overtakes Tesla as top-selling electric car seller",
    "date": "1/2/2024",
    "url": "https://www.theguardian.com/environment/2024/jan/02/chinas-byd-overtakes-tesla-as-top-selling-electric-car-seller",
    "text": "Build Your Dreams outsells rival in final quarter of 2023 figures for battery-only vehicles Elon Musk’s Tesla has been overtaken by its Chinese rival, BYD, as the world’s top selling electric carmaker. BYD, which has been backed by the US investment billionaire Warren Buffett since 2008, has beaten Tesla’s production for a second consecutive year. BYD, which stands for Build Your Dreams, said it produced 3.02m new energy vehicles in 2023. The American multinational Tesla announced on Tuesday that it made 1.84m cars. However, BYD’s sales figures include 1.6m battery-only cars, and 1.4m hybrids, which means Tesla is still the leader in the production of electric battery-only cars. Nevertheless, in the final quarter of last year BYD outsold Tesla in battery-only cars – 526,000 to 484,000 – for the first time. Most of BYD’s vehicles sell at a lower price point than Tesla, which derives about 20% of its sales from the Chinese market. Chinese electric carmakers such as BYD and Nio have set their sights on becoming major players in international markets, with a particular focus on Europe. In December, BYD, which sells five models in Europe and has plans to launch three more this year, announced plans to build a new factory in Hungary. Last year, the company said it did not consider building its first European factory in the UK because of the impact of Brexit. BYD said the UK had not even made a top 10 list of possible locations to build its first European car plant. China’s top-selling electric carmaker is targeting sales of about 800,000 cars annually in Europe by 2030. However, these goals could be under threat after the European Commission launched an anti-subsidy investigation last September into Chinese electric vehicle imports. Commenting on the decision at the time, the European Commission president, Ursula von der Leyen, said that Chinese electric vehicles were now flooding global markets and were being “kept artificially low by state subsidies”. The investigation, which is expected to last a year, could result in the EU imposing punitive tariffs on Chinese vehicles. The Hong Kong-listed BYD, which was founded by a former university professor, Wang Chuanfu, and began developing batteries in 1995, intends to become a global powerhouse in the electric vehicle market. Tesla, which is led by Musk, said last month it was recalling just over 2m vehicles in the US fitted with its Autopilot advanced driver-assistance system to install new safeguards One of the advantages BYD has over its US and European counterparts is its ability to manufacture electric vehicle batteries in-house. Susannah Streeter, head of money and markets at the investment platform Hargreaves Lansdown, said: “While it’s the world’s leading supplier of rechargeable batteries, Tesla relies on several suppliers and has flagged shortages of lithium as demand ratchets up as a supply chain obstacle in the years to come. “BYD is already making moves to secure the precious metal by buying a stake in a Chinese lithium producer. It’s had its eye on purchasing mines in Africa and is scouting assets in South America, where the metal is mined.” The emergence of China as the top-selling electric vehicle producer comes at a significant time: the start of a presidential election year in the US. China-US relations, particularly around trade, are likely to be a key part of the campaign for the presidency, which looks likely to be fought between Joe Biden and Donald Trump. Last month, the Biden administration brought in new protectionist measures for its EV market by blocking full subsidies through his Inflation Reduction Act to EV companies with significant Chinese links. US-manufactured electric vehicles that include Chinese-made battery components would also be blocked from accessing full subsidies. The Wall Street Journal also reported just before Christmas that the US government was looking at raising tariffs on some Chinese goods, including electric vehicles, to bolster the US clean energy sector. This would be on top of the 25% tariffs on vehicles imported from China, which were brought in under Trump’s presidency, and extended under the Biden administration. The US is looking to take action in other areas where it has security concerns about China’s manufacturing capabilities. On Monday it was reported that the Biden administration had put pressure on the Dutch government to block the shipments of hi-tech chip-making machinery to China by one of its key technology companies. ASML, a leading supplier to the semiconductor industry, confirmed that the government had partially revoked its licence to export three chip-making lithography machines to China. Bloomberg reported that the decision came after US officials had requested the move in an attempt to restrict the growth in China’s semiconductor manufacturing capabilities. "
}