{
    "title": "Elon Musk’s $50 Billion Tesla Pay Package Was Just Voided by a Judge in \nDelaware",
    "date": "1/31/2024",
    "url": "https://robbreport.com/motors/cars/judge-voids-elon-musks-tesla-pay-package-1235494257/",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Subscribe now and get up to 61% off the cover price. Includes access to the digital magazine. Plus, get the exclusive Robb Report tote bag FREE. Give the Gift of Luxury Subscribe to RR1 Live+ for exclusive virtual events all year long (at least 1 per month), conversations with Robb Report editors, special perks, and more. Senior Staff Writer Here’s something you can add to the list of things that Elon Musk will complain about loudly and frequently on his social media platform X. A Delaware judge voided the billionaire’s Tesla pay package on Tuesday, reports The New York Times. The judge found the package, which has helped make the executive one of the richest humans in history, to be excessive and now wants Musk to return the unnecessary pay.\n\n\n\n\nRelated Stories\n\n\n\n\n\t\t\t\t\t\tThis New 131-Foot All-Aluminum Superyacht Lets You Take a Dip at Tip and Tail\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\tSomeone Finally Made a One-Person Scooter That Drives Like a Tank\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\tTesla May Be Blacklisting Cybertruck Flippers The unexpected ruling is a result of a lawsuit from Tesla shareholders. In 2018, Musk and the Tesla board devised a package consisting of lucrative stock options if the company achieved certain revenue, profit, and sharing goals, according to the paper. This would allow Musk to acquire around 304 million Tesla at a preset price of $23.34 if they were met. They were, which meant the executive was due $51.1 billion worth of stock (as of the end of trading on Tuesday), which was issued in 12 separate grants tied to a specific goal. As part of the agreement, Musk would have to hold onto the stock for at least five years. Tesla shareholders challenged this package, and, on Tuesday, Chancellor Kathaleen St. J. McCormick of the Delaware Court of Chancery sided with them. The judge found that the company’s eight-person board included several people close to Musk, including his brother Kimbral, who owed much of their wealth to the executive, effectively allowing him to dictate the terms. She noted that the package was not necessary to retain or motivate Musk, since he already owned tens of billions of dollars worth of Tesla stock, and that the information given to shareholders when they voted to approve the plan was “materially deficient.”\n\n\n\nWATCH “The process leading to the approval of Musk’s compensation plan was deeply flawed,” Chancellor McCormick said. Musk has since posted on X that you should “Never incorporate your company in the state of Delaware,” and shared screenshots of a Wall Street Journal op-ed titled “Delaware Is Trying to Drive Away Corporations.” Tesla, meanwhile, did not immediately respond to a request for comment. The EV maker disbanded its media relations team back in the fall of 2020. Because of the ruling, which will certainly be appealed, Musk’s shares will be canceled, according to a lawyer for the shareholders. This will reduce both his personal fortune, which currently stands at $181.4 billion, and his stake in Tesla, which currently stands at 13 percent after he sold shares to fund the acquisition of X back when it was still known as Twitter. In light of the ruling, it will be interesting to see how the board now responds to Musk’s claim last month that he needs to own 25 percent of Tesla to expand its AI efforts. If he didn’t, he said he would “prefer” to develop such projects outside the company. Senior Staff Writer Bryan Hood is a digital staff writer at Robb Report. Before joining the magazine, he worked for the New York Post, Artinfo and New York magazine, where he covered everything from celebrity gossip to… MAY 17 - 19\nJoin us for extraordinary meals from the nation’s brightest culinary minds. Give the Gift of Luxury "
}