{
    "title": "Tesla lowers range estimates as U.S. regulators tighten vehicle-test rules",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/tesla-lowers-range-estimates-u-154352348.html",
    "text": "By Norihiko Shirouzu (Reuters) -Tesla has lowered driving-range estimates across its lineup of electric vehicles as a new U.S. government vehicle-testing regulation takes effect with the goal of ensuring that automakers accurately reflect real-world performance. Tesla has historically issued range estimates that overstate what its cars can deliver, prompting widespread complaints from customers, according to some automotive testing experts and a Reuters investigation last year. Reuters reported in July that the automaker, about a decade ago, rigged the algorithm that controls in-dash range estimates in Tesla vehicles to give rosy projections of how far owners can drive before needing to recharge. The story also found the automaker created a secret team in 2022 to suppress thousands of driving-range complaints and cancel owners' range-related service appointments. Tesla later disclosed in an October regulatory filing that federal investigators had subpoenaed the automaker for information involving its vehicles' driving range. Driving range has been a key selling point for Tesla vehicles and other electric models in the United States, where consumers cite a lack of public charging infrastructure as a primary reason for avoiding battery-powered cars. Tesla has recently lowered the driving range estimates for variants of its model X, S, Y, and 3 vehicles, according to a Reuters review of marketing pages on its website compared with archived versions of the same pages and range estimates for 2023 models on a U.S. government site. Tesla's website now estimates the range of a Model Y Long Range, for instance, at 310 miles, while the government's fuel economy site, maintained by the Environmental Protection Agency (EPA), still lists the same vehicle's range at 330 miles. Tesla dropped the range estimate for the performance variant of the Model Y, a small crossover SUV, from 303 miles to 285 miles, the Reuters review showed. The new rules require automakers to test electric vehicles (EVs) for driving range and fuel efficiency in their \"default\" driving mode - the one the car uses when a driver first turns it on. Many modern vehicles including Teslas have an array of driving modes that allow for tuning the vehicle to maximize either efficiency or power. If a car doesn't have a default or standard driving mode, then the EPA requires an automaker to test the vehicle in its best-case and worst-case modes for efficiency and average the results, according to an EPA letter to automakers in July 2022, describing test rule changes that take effect for 2024 models. Telsa does not specify a model year in the marketing pages on its website that list estimated ranges for its models. Tesla offers driving modes ranging from \"Chill\" mode for efficiency and better range to \"Drag Strip Mode\" in higher performance models to boost acceleration, according to 2023 Tesla owners' manuals posted online. Under \"tips to maximize range\" in its Model Y owner's manual, Tesla advises drivers to \"consider using Chill Mode.\" Telsa did not respond to requests for comment on the range-estimate reductions, the new EPA rule or whether it has previously used Chill Mode, or any efficiency-geared setting, during its testing to determine driving range. The EPA, which regulates automakers' advertised fuel-economy and driving-range estimates, did not answer questions from Reuters about the rationale for its testing rule, how it affected Tesla or other automakers and whether the agency had certified Tesla's new range estimates. EPA spokesperson Nick Conger said in a statement that automakers routinely adjust efficiency estimates \"with a new model year when vehicle changes or updates to test procedures provide new data.\" Reuters could not determine if Tesla lowered range estimates on every variant of every model. Automakers conduct their own tests to determine range and fuel-efficiency estimates for advertising purposes, but they must follow EPA guidelines. The EPA retests a certain number of vehicles to verify the manufacturers' figures. Tesla is by far the top seller of electric vehicles in the United States. Other major automakers producing multiple electric models include Ford, General Motors and Hyundai. Spokespeople for Ford and GM said the new EPA rules will not require them to change range estimates for any electric model. GM said its testing regimen complied with the new regulations before they took effect. Hyundai did not respond to a request for comment. Some of Tesla's downward revisions were slight, such as the change from a 333-mile estimated range to 326 miles for its Model X Plaid variant, a high-performance version of the luxury SUV. Other changes were more dramatic, such as the lowering of the estimate for the Model S Plaid, a luxury sport sedan, from 396 miles of range to 359 miles, according to a comparison of Tesla's current website and an archived version of the same page from a few days ago. Automotive experts who have tested Tesla's range estimates and found them inflated said the reduction of the estimates was a necessary change. Automotive website Edmunds said the vast majority of electric vehicles it has tested performed better than their advertised ranges - with Tesla being the exception. \"All of the eight Tesla vehicles we have tested failed to match their EPA estimate,\" Edmunds editor-in-chief Alistair Weaver said in a statement. He called Tesla's reduced estimates \"an important step in providing car shoppers with a more accurate reflection of how far their vehicle will travel on a single charge.” Seattle-based EV analytics firm Recurrent said it noticed last November that the dashboard range estimate in a Model 3 Long Range it was monitoring had been reduced to 333 miles from the previous estimate of 358 miles. That matches the current difference between the Tesla website's estimate for that model and the estimate on the EPA site. Recurrent Chief Executive Scott Case called the automaker's revisions \"a step in the right direction\" for Tesla owners. Previous estimates, he said, have historically been \"30% or more optimistic than the vehicles' real-world range.\" Alex Knizek, manager of automotive testing at Consumer Reports, applauded the new EPA rule change for providing a more standardized way of measuring range. \"It all comes down to making the numbers more comparable across different cars from different producers, which goes back to making the information more reliable for consumers when shopping for a vehicle,\" he said. (Reporting by Norihiko Shirouzu; additional reporting by Joseph White; editing by Brian Thevenot. To keep up with the fast-paced world of auto industry news, sign up for the Auto File newsletter.) Related Quotes "
}