{
    "title": "Tesla CEO Elon Musk warns China EVs will 'demolish' competition",
    "date": "1/24/2024",
    "url": "https://fortune.com/asia/2024/01/25/tesla-ceo-elon-musk-warns-china-evs-competitive-protectionism-demolish-competition/",
    "text": "Competition from Chinese EV makers may be starting to get to Elon Musk and Tesla. After a long battle for market share in China, Tesla’s CEO issued a warning to his fellow automakers: On a level playing field, Chinese carmakers will outcompete almost everyone else. “Our observation is generally that Chinese car companies are the most competitive car companies in the world,” Musk said Wednesday, during Tesla’s earnings call. “If there are no trade barriers established, they will pretty much demolish most other car companies in the world,” he continued. Musk’s tune on Chinese EVs has changed significantly since 2011, when he downplayed the quality of cars made from companies like BYD. Last May, he acknowledged that BYD’s cars were “highly competitive.” Then, in November, he suggested that the world’s top 10 automakers could end up being Tesla and nine Chinese carmakers. Tesla, an early mover in the industry, faces intense competition from BYD. The Chinese EV maker took Tesla’s crown as the world’s top-selling EV brand in the final quarter of 2023. BYD sold 526,409 pure electric vehicles in the October–December period last year, about 40,000 more than Tesla over the same period. Beijing lavished manufacturing subsidies on the Chinese EV sector in a bid to develop a globally competitive industry. That government support is now attracting scrutiny from lawmakers in the West. Last September, the European Commission launched an anti-subsidy probe into Chinese EV brands. A few months later, the Biden administration barred vehicles that used Chinese-made battery parts from being eligible for consumer tax credits. (Tesla sources some of its parts from CATL, a Chinese battery manufacturer.) The U.S. imposes a 25% levy on imported Chinese cars on top of a general 2.5% tariff on all auto imports. The Trump administration imposed the China-focused tariff, which the Biden administration has extended. The European Union currently imposes a 10% tariff on imported vehicles. China also imposes import tariffs for foreign-made autos, depending on their place of origin. Tesla faces an array of competitors in China, the world’s largest EV market, not just from BYD, but also large automakers like GAC Group, startups like Nio and Xpeng, and even tech companies like phonemaker Xiaomi. The U.S. carmaker helped to spark a price war in China at the start of 2023, and has continued to slash prices in a bid to capture market share. The U.S. carmaker again cut prices of its Model 3 and Model Y cars earlier this month. Tesla did not give a full-year guidance target on Wednesday and warned of slower growth in the coming year. Shares in the EV maker are down 6% in after-hours trading. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}