{
    "title": "Stellantis Just Predicted a Major Bloodbath for TSLA Stock. Here's Why.",
    "date": "1/22/2024",
    "url": "https://investorplace.com/2024/01/stellantis-just-predicted-a-major-bloodbath-for-tsla-stock-heres-why/",
    "text": " One auto CEO believes Musk has made a mistake Advertisement Source: ssi77 / Shutterstock.com CEO Elon Musk turned plenty of heads in 2023 when he opted to slash prices on multiple Tesla (NASDAQ:TSLA) models. A clear attempt to compete with the growing number of electric vehicle (EV) makers undercutting Tesla’s high prices, Musk’s decision didn’t really help TSLA stock or the broader EV market. Now, though, the company is moving into a new year with no plans to stop lowering its prices. As Investor’s Business Daily reports, this trend is sparking concern among Wall Street analysts. Some business leaders are opting against following Musk’s example, however. In fact, one rival CEO recently stated that, if price cuts continue without leading to profits, the industry could experience a “bloodbath.” If that happens, it could significantly hinder the entire EV market’s progress as well as EV stocks. News of ongoing Tesla price cuts hasn’t been well received by Wall Street. Multiple analysts have lowered their price targets on TSLA stock recently and things only seem to be getting worse. Today, Tesla shares closed down by 1.6%. Shares have also fallen more than 15% since the year began and investors have cause for concern. Stellantis (NYSE:STLA) CEO Carlos Tavares shares in this concern, as he recently made clear. What’s more, while TSLA stock has mostly trended downward over the past six months, STLA stock has managed to remain in the green by over 15%. So, why is Tavares worried? Specifically, the CEO is taking a stand against Elon Musk’s chosen method of trying to spur growth. While he didn’t name Tesla directly, the Stellantis CEO did state, “I know a company that has brutally cut pricing, and their profitability has brutally collapsed.” Tavares seems to have no intention of letting Stellantis sell discounted EVs at a loss, noting that his company is already making money from EV sales and that he expects this growth trend to continue. “There is no such thing as slowing down for the EV road map for Stellantis” he added. This full-steam ahead approach comes at a time when rivals Ford (NYSE:F) and General Motors (NYSE:GM) are cutting back on EV production due to demand concerns. But international auto giants like Hyundai (OTCMKTS:HYMTF) and Volvo (OTCMKTS:VLVLY) have actually reported impressive growth — and seem to have the same mindset as Tavares. Even Musk has admitted that cutting prices hasn’t quite helped Tesla, which he attributes to high interest rates. But no matter what this year brings from the Federal Reserve, it’s clear that Tesla’s price cuts haven’t led to enough sales. The fact that the EV market is growing all the time and competition is fierce is also too important to disregard. As InvestorPlace contributor Chris MacDonald reports: “Tesla, with fewer vehicle sales but higher margins, faced pressure as it reduced model prices. Although subscriptions could enhance profits, challenges, including the loss of EV tax credits, may require further price cuts. Slowing growth suggests a potentially challenging year for the stock, particularly with other higher-growth options available to investors in this sector right now.” If Stellantis reports high sales growth this year and Tesla reports low numbers, it will demonstrate that Tavares’ thesis on price cuts is likely correct. And if it is, TSLA stock and the larger EV market may have a difficult time righting the ship. On the date of publication, Samuel O’Brient did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Samuel O’Brient is a Reporter for InvestorPlace, where his work focuses primarily on financial markets, global economic trends, and public policy. O’Brient writes a weekly column on recent political news that investors should be following. Consumer Discretionary, Automotive, Electric Vehicles Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/stellantis-just-predicted-a-major-bloodbath-for-tsla-stock-heres-why/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}