{
    "title": "Going Into Earnings, Is Tesla Stock a Buy, a Sell, or Fairly Valued?",
    "date": "1/18/2024",
    "url": "https://www.morningstar.com/stocks/going-into-earnings-is-tesla-stock-buy-sell-or-fairly-valued-2",
    "text": "With Tesla’s margins under pressure and an uncertain 2024 outlook, here’s what we think of its stock. Tesla TSLA is set to release its fourth-quarter earnings report on Jan. 24, 2024, after the close of trading. Here’s Morningstar’s take on Tesla’s earnings and stock. With its 3-star rating, we believe Tesla’s stock is fairly valued compared with our long-term fair value estimate. Our fair value estimate is $210 per share. We use a weighted average cost of capital of just under 9%. Our equity valuation adds back nonrecourse and non-dilutive convertible debt. In the longer term, we assume Tesla will deliver around 5 million vehicles per year in 2030. This includes fleet sales, an expanding opportunity for the firm. Our forecast is well below management’s aspirational goal of selling 20 million vehicles by the end of this decade. However, it is nearly 4 times the 1.31 million vehicles delivered in 2022. Our forecast assumes Tesla increases its Model 3 and Model Y deliveries, that the Cybertruck is a success, and that the company ramps up volumes over several years. We also believe Tesla will ramp up semi-truck volumes over time. Further, we forecast that Tesla will launch its sports car and eventually its affordable sedan and SUV platforms in the second half of the decade. We think the company will successfully continue to reduce its manufacturing costs on a per-vehicle basis. Combined with a shift to producing a greater proportion of higher-priced Model Y vehicles, we forecast segment gross margins will expand to roughly 30%, near the 29% level achieved in 2022, as automotive profit growth grows faster than revenue over the medium and long term. We assume revenue growth and margin expansion from autonomous software sold on a subscription basis. We also assume the successful growth of the insurance business and increased profits from the charging business result in long-term profit growth and margin expansion in the “services and other” segment. Read more about Tesla’s fair value estimate. We award Tesla a narrow moat, stemming from its intangible assets and cost advantage. The company’s strong brand cachet as a luxury automaker commands premium pricing, while its EV manufacturing expertise lets it make vehicles more cheaply than competitors. We think Tesla’s moat sources will persist, letting the firm generate excess returns on capital. We see the potential for it to outearn its cost of capital over at least the next 20 years, which is the measurement we use for a wide moat rating. However, the second 10-year period carries significant uncertainty for both Tesla and the broader automotive industry, given the rapid advancement of autonomous driving technologies, which could transform how consumers use vehicles. As such, we view a narrow moat rating, which assumes a 10-year excess return duration, as more appropriate. Read more about Tesla’s moat rating. We assign Tesla a Very High Morningstar Uncertainty Rating, as we see a wide range of potential outcomes for the company. The automotive market is highly cyclical and subject to sharp demand declines based on economic conditions. As the EV market leader, Tesla is subject to growing competition from traditional automakers and new entrants. As new lower-priced EVs enter the market, Tesla may be forced to continue to cut prices, reducing its industry-leading profits. With more EV choices, consumers may view Tesla less favorably. The company is investing heavily in capacity expansions that carry the risk of delays and cost overruns. It is also investing in R&D to maintain its technological advantage and generate software-based revenue, with no guarantee these investments will bear fruit. Tesla’s CEO owns a little over 20% of the company’s stock and uses it as collateral for personal loans, which raises the risk of a large sale to repay debt. Read more about Tesla’s risk and uncertainty. This article was compiled by Frank Lee. The author or authors own shares in one or more securities mentioned in this article.\n\n\t\t\t\t\t\tFind out about Morningstar’s editorial policies. Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}