{
    "title": "Judge throws out Elon Musk's $56 billion Tesla pay package",
    "date": "1/30/2024",
    "url": "https://www.nbcnews.com/business/business-news/judge-throws-elon-musks-56-billion-tesla-pay-package-rcna136468",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News There are no new alerts at this time A Delaware judge on Tuesday voided the $56 billion pay package of Tesla CEO Elon Musk, ruling that the company’s board of directors failed to prove “that the compensation plan was fair.” Tesla’s share price slid about 3% in after-hours trading Tuesday following news of the decision in the Delaware Chancery Court lawsuit filed by Richard Tornetta, a shareholder in the electric automaker. The pay package that Tesla granted Musk in 2018 was the largest compensation plan in public corporate history, the judge noted, making the Tesla and SpaceX boss a centi-billionaire and the richest person on the planet. The plan offered Musk the chance to secure 12 tranches of Tesla stock options, which would vest if the company’s market capitalization increased by $50 billion and Tesla achieved a revenue target. “Was the richest person in the world overpaid?” asked Chancery Court Judge Kathaleen McCormick in her 200-page ruling. “The stockholder plaintiff in this derivative lawsuit says so. He claims that Tesla, Inc.’s directors breached their fiduciary duties by awarding Elon Musk a performance-based equity-compensation plan.” In her decision, McCormick found that Tornetta had proved that Musk “controlled Tesla,” and that the process leading to the board’s approval of his compensation was “deeply flawed.” Musk had “extensive ties with the persons tasked with negotiating on Tesla’s behalf,” including management members who were beholden to Musk: among them General Counsel Todd Maron, who was his former divorce attorney. “In the final analysis, Musk launched a self-driving process, recalibrating the speed and direction along the way as he saw fit, the judge wrote. “The process arrived at an unfair price. And through this litigation, the plaintiff requests a recall.” “The plaintiff is entitled to rescission,” McCormick wrote. “The parties are to confer on a form of final order implementing this decision and submit a joint letter identifying all issues, including fees that need to be addressed to bring this matter to a conclusion at the trial level,” McCormick said. Musk, his lawyer and Tornetta’s attorney did not immediately respond to requests for comment on the decision. In a tweet Tuesday afternoon, Musk wrote, “Never incorporate your company in the state of Delaware.” McCormick noted her ruling hinged on a finding that Musk, rather than its board of directors and shareholders, controlled Tesla, at least when it came to the question of setting his compensation. The judge wrote, “In addition to his 21.9% equity stake, Musk was the paradigmatic ‘Superstar CEO,’ who held some of the most influential corporate positions (CEO, Chair, and founder), enjoyed thick ties with the directors tasked with negotiating on behalf of Tesla, and dominated the process that led to board approval of his compensation plan.” Tesla and Musk’s attorneys, the court decided, “were unable to prove that the stockholder vote was fully informed because the proxy statement inaccurately described key directors as independent and misleadingly omitted details about the process.” Earlier this month, Musk began angling for 25% of voting control over Tesla. He currently owns about 13% of the company’s stock outright. “I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control. Enough to be influential, but not so much that I can’t be overturned,” he wrote in a post on X, the social media site formerly known as Twitter. Musk owns X and runs it. © 2024 NBC UNIVERSAL "
}