{
    "title": "Tesla deployed 14.7GWh of energy storage in 2023",
    "date": "1/25/2024",
    "url": "https://www.energy-storage.news/tesla-deployed-14-7gwh-of-energy-storage-in-2023/",
    "text": "Tesla’s energy storage and generation revenues have tripled since 2020, largely driven by its growing deployments of the company’s Megapack battery storage systems. The California-headquartered technology company reported its Q4 and full-year 2023 financial results yesterday. It said energy storage deployments for last year totalled 14,724MWh, which is a company record. It’s also more than double the 6.5GWh of storage deployments Tesla reported for 2022. It’s also nearly 10x the 1,651MW of storage deployments recorded by the company in 2019. For context, Germany’s total cumulative installs as of the end of 2022 stood at 6.5GWh across all market segments, rising to 11.2GWh by the end of last year. CEO Elon Musk noted in an analysts’ call to discuss results that he has been saying for some time – as reported by Energy-Storage.news – that Tesla Energy could be expected to grow at an even faster rate than the automotive business, “…and it is doing that,” Musk said. Along with next-generation electric vehicles (EVs) and self-driving EVs, energy storage will be among the key offerings driving Tesla’s “next growth wave,” according to the CEO. In reporting for Q3 2023 a few months ago, Musk had said energy is becoming Tesla’s “highest margin business,” and a bright spot in what was otherwise a fairly downbeat quarter. Something else Musk has said in the past, is that demand is such that Tesla’s battery products sell out as they come off the production line. The company has built a dedicated factory in Lathrop, California, to cater to that demand. Another company executive on the call, whose name wasn’t given, said that: “Megapack continues to see strong demand signals globally, driving consistent growth trajectory through ’24 and ’25. The exec said that the ramp-up of Lathrop is underway and will continue through this year, for Tesla to reach 40GWh of annual Megapack production capacity, doubling its current 20GWh annual production capability by the end of 2024. Deployments did see a bit of a dip sequentially: 3,202MWh deployed in Q4 last year represented a 30% decrease compared to Q3 2023. The company said it expected to see some volatility in deployments on a sequential basis, which could be impacted by “logistics and the global distribution of projects at any given time”. Nonetheless, year-on-year, the Q4 2023 figure compares favourably to the 2,462MWh recorded in Q4 2022. That said, when it comes to the energy business, batteries are doing the heavy lifting in contributing. Tesla’s solar business continues to shrink. It made just 41MW of deployments during Q4 2023, the lowest of any quarter last year, while no quarter in 2023 even got close to Q4 2022’s 100MW of installs. Put into year-on-year context (see chart below), the difference is stark. Tesla doesn’t break out the revenue figures for its energy business, including both storage and generation one on line its reports, although based on the above, it can be reasonably inferred that again, storage makes the far bigger contribution. Generation and storage revenue was US$1.43 billion for Q4 2023 and US$6.035 billion for the full year. The combined segment’s revenues have nearly quadrupled since 2019, when US$1.53 billion was reported. The 2022 figure was US$3.9 billion. Overall, including all other business segments including automotive (US$82.4 billion) and services (US$8.32 billion), Tesla earned US$96.77 billion in revenue in 2023, for a total gross profit of US$17.66 billion and a total GAAP gross margin of 18.2%. Unsurprisingly, Tesla is on the inaugural Tier-1 battery energy storage system (BESS) provider list from BloombergNEF which the research and analysis group has just produced. Some notable recent and ongoing projects for the company include developer Strata Clean Energy’s 255MW/1,020MWh Scatter Wash project in Arizona which has just begun construction and Plus Power’s 185MW/565MWh ‘shock absorber’ for the grid in Oahu, Hawaii, which went into operation a few weeks ago. Energy-Storage.news’ publisher Solar Media will host the 9th annual Energy Storage Summit EU in London, 20-21 February 2024. This year it is moving to a larger venue, bringing together Europe’s leading investors, policymakers, developers, utilities, energy buyers and service providers all in one place. Visit the official site for more info. Energy-Storage.news’ publisher Solar Media will host the 6th Energy Storage Summit USA, 19-20 March 2024 in Austin, Texas. Featuring a packed programme of panels, presentations and fireside chats from industry leaders focusing on accelerating the market for energy storage across the country. For more information, go to the website. "
}