{
    "title": "Short Seller Jim Chanos Calls Out Elon Musk for Tesla Power Grab",
    "date": "1/16/2024",
    "url": "https://markets.businessinsider.com/news/stocks/chanos-elon-musk-tesla-stock-voting-rights-equity-stake-fidelity-2024-1",
    "text": "       Elon Musk pushed for greater control over Tesla, and suggested his equity stake isn't enough to drive him, in a X post on Monday. Jim Chanos, a veteran short seller and longtime Tesla bear, called out the world's richest man for being unreasonable and obtuse. Musk threatened to develop AI and robotics offerings separately from Tesla if his voting power isn't raised from 13% to around 25%. A larger say in big decisions would protect him from being overpowered by interlopers, and the immense scope of Tesla's operations justifies his demand, he said. \"Let me get this straight…Elon wants another 450M new shares ($100B) or conversion of existing shares into super-voting status, or he will 'prefer to build products outside of Tesla?!'\" Chanos posted on X. \"I know this is Elon, but you do realize how outrageous this is, right? What say you, $TSLA board?\"  Chanos seemed to bristle at the idea of Tesla's CEO deliberately withholding new products to the detriment of his company and shareholders unless his stake or voting rights are doubled. He suggested Musk might be angling for Tesla to buy X from him using stock. Musk also indicated that owning roughly $90 billion of Tesla stock isn't a strong enough incentive for him to perform. He noted that Fidelity and other providers of index funds and mutual funds, which hold Tesla on behalf of millions of individual investors, own big stakes in his company but don't have to run it. \"Does he really not understand how index/mutual funds work…?!\" Chanos asked. Chanos is best known for spotting fraud and successfully betting against Enron and Wirecard. His firm held bearish puts on Tesla stock as the end of September, SEC filings show. He recently announced the closure of his main, short-focused hedge funds after years of poor performance. In a Pensions & Investments interview in December, Chanos compared Tesla to IBM, Xerox, Polaroid, AOL, and other tech businesses that enjoyed intense hype but were ultimately usurped by rivals. Tesla stock is down nearly 50% from its November 2021 peak, but it's still up nearly 10-fold in just over four years, giving the EV maker an almost $700 billion market capitalization that ranks it among the world's most-valuable companies. \"When it comes to Tesla, he's the narrative,\" Chanos said about Musk, describing his company as the \"it girl\" of this market cycle with a stock built on \"hopes and dreams.\" Read next Indices Commodities Currencies Stocks Jump to "
}