{
    "title": "Tesla, Colgate-Palmolive, BrightSpring Health: Top Stocks",
    "date": "1/26/2024",
    "url": "https://finance.yahoo.com/video/tesla-colgate-palmolive-brightspring-health-215050022.html",
    "text": "Tesla (TSLA) recalled approximately 200,000 vehicles this week due to a software malfunction, compounding recent headwinds for the company. The recall adds to Tesla's challenges including Elon Musk's bid for more control, JPMorgan slashing its price target, and softer-than-expected earnings for the sixth straight quarter amid slowing EV demand. In IPO news, BrightSpring Health Services (BTSG) began trading publicly Friday, finishing below its $13 per share offering price. Despite rising investor enthusiasm for IPOs this year, the weak debut indicates a continued rocky IPO market. Colgate-Palmolive (CL) shares trended higher after the company beat fourth-quarter estimates on organic sales growth. The stock hit a new 52-week high as a result, showcasing strong performance. Yahoo Finance's Josh Lipton and Julie Hyman break down the details. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith JOSH LIPTON: Tesla recalling nearly 200,000 cars. That's due to a software instability issue, closing out what's been a roller coaster week for the company. JPMorgan, by the way, also slashing its price target on that stock after the automaker reported softer than expected earnings for the sixth straight quarter. So this one, Julie, we did hear from Dan Ives over at Wedbush today, interesting note. Now, Mr. Ives still bullish, outperform, target's 315. But he was, in his words, massively disappointed with that conference call. Here's what he told his clients this morning. Here is what Musk needs to do. Want to hear what Dan Ives says-- JULIE HYMAN: Yes, I-- yes. JOSH LIPTON: Here it is. One, he says, let's get some capital return going. You've got to announce a $10 billion buyback. He says it gives Musk more control. Remember, there's this drama playing out. Musk says, listen, I want control, or I might just take my AI and robotics projects, Julie. I might take them someplace else. I will pick up these marbles. And I will go to a different game. And stop the price cuts, he says. Maintain margin leverage over other auto players. So that was the Dan Ives playbook for Mr. Musk. JULIE HYMAN: Well, if Musk listened to Ives or anyone except the voices in his head, that would be a first. So we'll see if he does make any of these changes here. Just a couple of superlatives for you as we look at the Tesla performance on the week here, Tesla on-track for its worst week since the one that ended October 20, which incidentally, it also reported earnings. So in words, it fell after that last earnings report, fell after this earnings report. It's now down 26.5% year to date or so, at the lowest price since May. And it looks like we are now looking at the sixth straight weekly decline for those Tesla shares. There's a lot of discussion here about how long these doldrums for Tesla might last or whether the stock is nearing a bottom now and then could reset. I think time will tell. We do know that, after the close yesterday, we learned that Cathie Wood's Ark had come in and bought some Tesla here, in fact, almost 178,000 shares of Tesla. Last year, we saw her kind of get in and out of the stock a little bit, not out entirely but add and subtract a little bit from Tesla. So we'll see if some other bulls who are devoted end up getting in. JOSH LIPTON: It's just, after that print and after that call, you just had so much uncertainty still. JULIE HYMAN: Yeah. JOSH LIPTON: I mean, one is just kind of big picture uncertainty. Where is EV demand exactly? I mean, it's certainly slowing here. And the price cuts that Dan Ives is talking about and the margin trajectory, and then, of course, competition with Chinese rivals, the BYD's of the world. JULIE HYMAN: Yeah, yeah, a lot of questions remain. Let's get to another mover on the day, health services provider Brightspring, which went public today. The company opening below its $13 offer price. And it didn't get back up there. So the shares finishing lower by 15%, the company raising almost $693 million in that IPO. But it did price the shares at below the expected range. It is backed by KKR, by the way. So everybody is looking at the IPO market this year. We've been talking to guests about it. They're hoping that things are going to open back up. This is not a very good omen. JOSH LIPTON: No, you know, it's funny. You're right. There's been this kind of conversation, kind of this trickle last fall, the ARM, right, and Instacart. We actually-- remember just this week, we talked to Jon Keidan over at Torch Capital. And we asked Jon, do you think it's-- is the trickle going to turn into a stream? He was like, no, it's going to be a trickle, at least the first half, in part because, he said, just too much uncertainty still and questions about the economy. And in part, it was, he said, because the reception that these folks are getting has not been encouraging. JULIE HYMAN: Right. And this is not a buzzy tech startup, right? This is a community-based health provider backed by KKR. So it's not like this one had the most hype surrounding it. But still, folks who are looking for that IPO market opening cannot be too overjoyed with this kind of result. JOSH LIPTON: No, for sure. All right, finally, let's take a look at Colgate-Palmolive shares. They're rising after beating on the top and bottom line, nice pop in today's trade. Company expecting organic sales growth to be within its long-term target range of 3% to 5%. So let's talk household products, Julie, just for a hot second. JULIE HYMAN: Let's do it. JOSH LIPTON: The stock did hit a 52-week high in today's trade. And just looking at the results, it was interesting. Q4 adjusted earnings beat. It looks like sales clocked in at $495 billion. That was also a beat. It looks like the Latin America division, that was one real standout in the print. Stock's up about 10% now over the past 12 months. JULIE HYMAN: Yeah, oral care also doing well, the classic toothpaste stuff that Colgate-Palmolive makes. I mean, a lot of the commentary I'm seeing around the earnings is like, OK, this was good. It wasn't fantastic. One analyst at Wells Fargo said, it checked the boxes, the numbers. So it's not an enormous amount of enthusiasm here, but just nothing that really raised alarm bells. The company, for the full year, says organic sales growth is going to be 3% to 5%, which leaves it a little bit of room, potentially, to beat analysts' estimates. JOSH LIPTON: Yeah, team at Evercore, now, they do like this name, told their clients their price target's $90. They like what they say is a high-quality beat, meaning EPS and margins beat, despite the reinvestment in advertising. And they call that oral care, Latin America, and North America, where volumes stabilized, Julie. JULIE HYMAN: Yeah, that's what analysts want to-- investors want to see right now, volumes looking better. JOSH LIPTON: For sure. Related Quotes "
}