{
    "title": "Elon Musk loses $56 bn pay package in legal battle led by former heavy \nmetal drummer",
    "date": "2/2/2024",
    "url": "https://www.wionews.com/business-economy/elon-musk-loses-56-bn-pay-package-in-legal-battle-led-by-former-heavy-metal-drummer-686281",
    "text": "Tesla CEO Elon Musk faced a significant legal setback this week as he lost his $56 billion pay package in one of the most substantial legal defeats in US history. The case was brought forth by an unexpected adversary, Richard Tornetta, a former heavy metal drummer. Tesla CEO Elon Musk faced a significant legal setback this week as he lost his $56 billion pay package in one of the most substantial legal defeats in US history. The case was brought forth by an unexpected adversary, Richard Tornetta, a former heavy metal drummer. According to Reuters, Tornetta, who held just nine shares of Tesla when he initiated the lawsuit in 2018, emerged victorious on Tuesday when a judge deemed the massive pay deal unfair to him and all fellow Tesla shareholders. Tornetta's case, which began in 2018 and reached trial in late 2022, represents a noteworthy legal challenge for Musk, who had previously triumphed in various trials related to defamation, breaches of duty to shareholders, and violations of securities laws. Tornetta's interest in audio gear for car-customising enthusiasts, as showcased on his online presence, contrasts with the typical profile of those pursuing corporate accountability. Notably, he has shared light-hearted videos about his gadget creations and drumming performances with his metal band, \"Dawn of Correction.\" Delaware, known for corporate case precedents, has seen cases led by investors with minimal shareholdings influencing US corporate law. Eric Talley, a corporate law professor, notes that law firms often collaborate with investors to bring cases on contingency. Tornetta, benefiting from the case like other Tesla shareholders, saves the company substantial sums that a compliant board might pay to Musk. Critics argue that cases initiated by individual investors may lead to potentially abusive litigation. A decade ago, Delaware faced challenges from retail investors challenging merger deals, often resulting in settlements that critics deemed meaningless. However, experts argue that individuals like Tornetta play a vital role in overseeing boardrooms. Large investment firms are considered better equipped for corporate litigation, but they often avoid challenging relationships on Wall Street. (With inputs from Reuters) "
}