{
    "title": "Small black-owned pie shop suffers after Tesla cancels mega order",
    "date": "2/23/2024",
    "url": "https://www.tag24.com/entertainment/celebrities/elon-musk/small-black-owned-pie-shop-suffers-after-tesla-cancels-mega-order-3108312",
    "text": "A small pie business was reportedly significantly hurt when the giant car manufacturer Tesla first ordered thousands of pies and then later canceled the order. San Jose, California - A small business owner said her California pie shop was significantly hurt when Elon Musk's car brand Tesla first ordered thousands of pies on short notice and then later canceled the order. Voahangy Rasetarinera, the proprietor of the small business known as The Giving Pies, said the cancellation had a significant impact on her finances. Tesla had reached out to order 2,000 mini pies to be delivered the following Tuesday and Thursday, Rasetarinera told ABC 7 News. Despite the short notice for delivery, the business owner agreed to double the order after a request from a Tesla representative named Laura. However, Tesla eventually reneged on the deal, claiming, \"It unfortunately sounds like we will be changing plans and will not be needing this order. Thank you so much for your support I appreciate it.\" Rasetarinera took to social media to share her disappointment and the consequences for her business. \"To fulfill the order, I had turned down other Black History Month catering inquiries, purchased supplies, and prepared for a demanding production schedule,\" Rasetarinera wrote. She also criticized Tesla for prioritizing convenience over accountability and highlighted the challenges faced by small businesses when dealing with large corporations.  Despite Tesla's attempt to explain the \"miscommunication\" and their willingness to reconsider purchasing pies, Rasetarinera remains cautious about future interactions with major companies. The abrupt cancellation, attributed to \"upper management\" by the Tesla representative, left Rasetarinera feeling disheartened. Cover photo: Collage: BRANDON BELL/GETTY IMAGES NORTH AMERICA/GETTY IMAGES VIA AFP & Screenshot/The Giving Pies More on Elon Musk: "
}