{
    "title": "Nvidia flips Tesla, suffers pre-earnings performance anxiety",
    "date": "2/20/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1041364/nvidia-flips-tesla-suffers-pre-earnings-performance-anxiety-1041364.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence William kickstarted his career as a researcher and reporter for a global legal publication, covering everything from public law to M&A. Before moving to Proactive Investors, he worked as a reporter for a major fintech company with a focus on cryptocurrency and blockchain technology.\r\n\r\nHarking from Queensland, Australia, William obtained first-class honours in journalism and media from Birkbeck University before going on to complete an MA in creative and critical writing. Other jobs have... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 17:23 20 Feb 2024 GMT It has been a jam-packed fourth-quarter earnings eve for Nvidia Corp, with the fabless semiconductor titan overtaking Tesla Inc (NASDAQ:TSLA, ETR:TL0) as Wall Street’s most-traded stock, all the while getting slapped over 6% lower in morning US trades. Data compiled by the London Stock Exchange Group and shared by Reuters shows that Nvidia’s 30-day average turnover has flipped Tesla Inc (NASDAQ:TSLA, ETR:TL0), making it officially Wall Street’s number-one trade.  This follows Nvidia’s market capitalization flipping Google parent Alphabet Inc (NASDAQ:GOOG) as America’s third-largest corporation, mere weeks after besting Amazon.com Inc (NASDAQ:AMZN, ETR:AMZ) for the fourth spot. Evidently, not all Nvidia trades were bullish; the trillion-dollar megacap just got tossed 6.2% lower when markets opened this morning. Not that that takes much of the shine off the stock as a whole- it is still up over 40% year to date after rallying a walloping 230% throughout 2023. Still, it raises the question - is the market anxious about what Nvidia might or might not disclose in tomorrow’s fourth-quarter earnings call? The group is expected to post a quarterly revenue target of $20 billion on a 74.5% gross margin. That would make for another all-time quarterly record following an $18.1 billion top-line figure in the third quarter and $13.5 billion in the second quarter of its annus mirabilis. Both of these quarterly results represented significant, multibillion-dollar forecast beats. On the back of such lofty precedents, Nvidia risks disappointing the market with anything less than a phenomenal outcome. Front and centre will be sales in the data center segment, which houses sales of Nvidia’s flagship ‘H’ range of artificial intelligence-focused chips. Rivals Advanced Micro Devices Inc (NASDAQ:AMD, ETR:AMD) and even Intel Corp (NASDAQ:INTC, ETR:INL) are ramping up their AI chip offerings, with the former’s MI300X turning industry heads and winning orders from big-ticket clients including Microsoft, Meta and even OpenAI, which famously uses Nvidia chips to power its landmark ChatGPT large-language model. With competition beginning to eye up Nvidia’s lunch, pricing pressure will be another thing under the market’s microscope tomorrow. Nvidia is still considered the gold standard of AI computing hardware, but tomorrow’s earnings – or more importantly, future guidance – are not a closed book. The performance anxiety is real. Sign up to receive alerts and news direct to your inbox Oriole Resources PLC (AIM:ORR) CEO Tim Livesey and chief financial officer Bob Smeeton join Proactive's Stephen Gunnion with details of the company's 2023 financial and operational performance.\r\n\r\nLivesey highlighted successful exploration programs in Cameroon, at the Bibemi and Mbe projects,... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}