{
    "title": "Tesla paid a bakery it stiffed on a big order after Elon Musk promised to \n'make things good'",
    "date": "2/27/2024",
    "url": "https://qz.com/elon-musk-tesla-bakery-small-business-1851289471",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Tesla has reportedly settled its payment to a California bakery owner who said she was stiffed out of thousands of dollars after an employee at the EV-maker cancelled an order for thousands of pies. Voahangy Rasetarinera, the owner of Giving Pies, posted her experience working with Tesla on an Instagram post titled, “How Tesla’s Actions Hurt My Small Black Women-Owned Business.” In the post, Rasetarinera said she received an inquiry on Feb. 14 from a Tesla employee named Laura for an order of 2,000 mini pies, but “complications arose when the payment process was redirected.” “Despite this hurdle, I remained optimistic as I awaited payment,” she said, but she “grew concerned” when she didn’t receive the payment. Rasetarinera said she heard back from Laura who apologized for not paying on time, and who requested to double the order to 4,000 pies. However, after preparing the extra order, Rasetarinera said she had still not received payment, and could not contact the Tesla employee. “[M]y hopes were shattered when I received a text from Laura, CASUALLY informing me that the plan had changed and Tesla would no longer require the order,” Rasetarinera wrote. “This abrupt reversal left me reeling, realizing the extent of the impact on my small business. I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry.” After her story gained media attention, Tesla CEO Elon Musk responded on X, saying, he would “make things good with the bakery.” “People should always be able to count on Tesla trying its best,” Musk wrote. Rasetarinera confirmed with The Guardian Monday that,“Tesla just paid the $2k that I was out of” for the cost of ingredients for the order. She did not immediately respond to a request for comment from Quartz. Despite the fiasco with Tesla, Rasetarinera told ABC 7 sales at her small bakery were up after the story went viral, and she had to close the shop to catch up on orders. She also told the news outlet she would be open to working with Tesla again. “I think that we’re all humans, we all make mistakes, and they’re trying to do good on their mistakes,” Rasetarinera said, “So if they want to work with me, and they’re not bitter about the whole experience - then yes, I would love to.” Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}