{
    "title": "TRICK! YouTuber beats Tesla chief Elon Musk to become the richest person in \nthe world",
    "date": "2/18/2024",
    "url": "https://tech.hindustantimes.com/tech/news/trick-youtuber-beats-tesla-chief-elon-musk-to-become-the-richest-person-in-the-world-71645170059425.html",
    "text": "Copyright © HT Media Limited  All rights reserved. In a weird turn of events, a UK-based YouTuber became the richest person in the world, beating Tesla chief Elon Musk, but only for 7 minutes. Max Fosh, a YouTuber with more than 6.4 lakh subscribers, detailed how he pulled this stunt off in a video uploaded on his channel on February 13. He achieved this feat by creating a company - Unlimited Money Limited - with as many as 10 billion shares. The entire thing was a company registration process loophole that the YouTuber exploited for a few minutes. Even if it lasted just 7 minutes, the YouTuber beat Tesla chief Elon Musk to become the richest person in the world. Check out how he actually took the crown off Elon Musk. “Luckily in the UK it is quite easy to set up a company…You essentially just fill a big old form,” said Fosh, in the beginning of his video as he began filling a digital form on the website of the Companies House, the United Kingdom's registrar of companies. Hilariously, Fosh registered the company's name as Unlimited Money Limited. Filling the box which asked what the company would be doing, he wrote - making money. However, the website displayed an error and he had to change the response to ‘manufacture of macaroni, noodles, couscous and similar farinaceous products', even as he admitted he did not know what the word ‘farinaceous' meant. But this was just the start of the crazy ride, which would soon put him on top of the world rich list. On the next page, he was asked how many shares he would want to create for his company. Fosh started with a trillion shares but after the website repeatedly rejected it calling it invalid, he settled for 10 billion shares. This was step one for our richest person in the world (even if it was for just 7 minutes). After filling in the details, he submitted his form which told him it would take two working days to register his company. But to Fosh's surprise, the registration certificate came through in the time it took him to get a Starbucks coffee. Now that he had his company running, he put his phase two in action to beat Elon Musk for the richest person title. Next, he set up a table and a couple of chairs next to a bank on the street and started looking for people to invest in his company. If a person bought one share for £50, that would technically make his company's worth £500 billion, nearly twice of Elon Musk. However, trying to persuade the passerby, he warned them that this was not a “safe investment”. Even after hours of waiting, he could not find anyone to invest in the company. But just as he was about to give up, a woman agreed to invest £50 for one share, making Fosh the richest person in the world on a technicality. But he had to make it official first. So, Fosh sent the details to a financial advisor who sent out a letter to him saying that “given the range of information provided to us, the market cap of Unlimited Money Limited has been assessed at £500 billion”. But the happiness was short-lived. The letter further explained that due to lack of revenue activity, there is a high likelihood that he might be accused of fraudulent activity. The letter recommended him to dissolve the company. But there was one obstacle. To dissolve the company, Fosh needed to find the sole investor and take their permission to dissolve the company and return the money to them. To his luck, he had the investor's email address and quickly resolved the situation. However short lived it may be, Fosh did become the richest person in the world, leaving behind Elon Musk. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71645170059425 "
}