{
    "title": "It's a Great Time to Buy EV Stocks. TSLA Is Another Story.",
    "date": "2/22/2024",
    "url": "https://www.tradingview.com/news/investorplace:d6cf1bd34094b:0-it-s-a-great-time-to-buy-ev-stocks-tsla-is-another-story/",
    "text": "The latest news to hit Tesla’s TSLA stock is that Ford F is cutting prices on its 2023 Mustang Mach E crossover by anywhere from $3,100 to $8,100, depending on the version. With all the price cuts on EVs, it’s a great time to buy one, but the TSLA stock analysis suggests it’s not so good for EV stocks. Tesla might have been the first company to lower prices, but it’s got plenty of company. “This year also marks the beginning of a fierce competition that may end in a ‘bloodbath’ (or as I prefer to call it, the brutal ‘knockout round’) among Chinese auto makers,” Xiaopeng wrote in the employee memo,” CNBC reported CEO He Xiaopeng’s comments in a memo to employees. “XPeng has engaged in this cutthroat competition right from the outset, thus accumulating considerable experience. Our guts, grit and perseverance, I firmly believe, will lead us to victory.” Bring it on, Tesla, Xiaopeng appears to be saying. That’s terrible news for Tesla shareholders. You might want to hold tight if you’re considering buying TSLA stock. Here’s why. Cybertruck: A Bridge Too Far I recently argued that Nio’s NIO expansion plan made no sense, given it already had nine models compared to five for Tesla. From Tesla’s perspective, it’s made money by keeping its model number low and its margins high. Of course, with the slashing of prices, Tesla’s Q4 2023 operating margin fell by 50% to 8%. Wall Street expects it won’t be much better in the first quarter, coming in at 9%, well below its 2022 level of 17%. There is no question Elon Musk believes that a prolonged price war with its competitors in China will enable it to capture future market share as its competitors go out of business. So far, that hasn’t happened with Xpeng and others following Tesla down the price-cutting hole. I suspect that Tesla’s undoing won’t be because of price cuts. Instead, it will be the Cybertruck that takes it down. In terms of vehicle development, it is a bridge too far. Recently, Cybertruck owners posted photos of the truck rusting on social media. That’s not a good look for a vehicle that can cost $100,000 and looks anything but attractive. Tesla employee Wes Morrill suggested the photos showed “rust dust,” that had collected on the vehicle as they transported it to its final destination. One can use a blue, non-scratch Scotch Brite pad to wipe it off. Maybe so, but I’ve always wondered why Tesla went with such a wild-looking vehicle when the most popular type in America is the crossover SUV, which accounts for more than 45% of all vehicles sold. If price cuts were inevitable, it would have been helpful to use lower prices for an affordable crossover SUV, not an expensive, ugly monster truck with limited appeal and demographics. TSLA Stock Analysis: Cybertruck Is a Drag It would be different if the EV market were going gangbusters right now. That’s not the case with companies worldwide unloading excess inventory because of lower demand caused by higher interest rates. Wall Street often talks about “catalysts” for moving stocks higher. Tangible information and news that suggests revenue and profit growth are on the horizon. Gabelli Funds portfolio manager Brian Sponheimer recently told Yahoo Finance that now is not a good time to buy EV stocks. “We are value investors, and while the automakers are statistically inexpensive, investors face prospects for considerable CAPEX, reduced margins, and an uncertain outcome as it relates to electric vehicle market share,” Sponheimer recently told Yahoo Finance. With Tesla trading at 200x earnings, Sponheimer suggests that Tesla’s too expensive right now for value investors like himself. That doesn’t mean you shouldn’t consider TSLA stock at current prices because the future looks bright for EV development. However, despite Tesla being down 22% in the first two months of 2024, it needs to fall further for Sponheimer to think about buying. I’m neither buying nor selling TSLA stock at the moment. If you own it, don’t sell it. If you don’t, according to my TSLA stock analysis, wait for a better entry point. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}