{
    "title": "How Much Profit is Hiding Within Tesla's Enormous $78 Billion in Automotive \nRevenue?",
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/news/much-profit-hiding-within-teslas-112200420.html",
    "text": "Tesla (NASDAQ: TSLA) is coming off a record year for electric vehicle sales. It delivered 1.8 million cars in 2023, including 1.2 million of its Model Y which became the best-selling vehicle of any kind, globally. Tesla made headlines throughout the year for slashing prices to spur demand, because consumers were suffering under the pressures of high inflation and rising interest rates. The company reduced the sticker price of its electric vehicles by an average of 25.1% between December 2022 and December 2023. That significantly impacted the company's bottom line. So, just how much of Tesla's $78.5 billion in car sales during 2023 was profit? In 2023, it cost Tesla $65.1 billion to manufacture and sell $78.5 billion worth of electric vehicles, which left the company with $13.4 billion in gross profit. By comparison, in 2022, it cost Tesla $49.6 billion to manufacture and sell $67.2 billion worth of electric vehicles, leaving a gross profit of $17.6 billion. That represented a gross profit margin of 26.2%, which declined to 17.1% in 2023, highlighting the effects of Tesla's price cuts. At the bottom line, Tesla's companywide earnings per share -- which includes the financial results of its solar, storage, and services businesses -- came in at $3.12. It marked a 23% decline compared to its 2022 result, and it was the first time the company's annual earnings slipped since 2017. Tesla's price cuts have continued in the early stages of 2024, so Wall Street analysts are betting its earnings could fall again this year. Tesla stock has plunged 54% from its all-time high because falling earnings have forced investors to reconsider the company's valuation, and it might struggle to recover in the short term. But here's something interesting to consider. According to Cathie Wood's Ark Investment Management, the majority of Tesla's profit might not come from selling cars in the long term. It might come from the company's autonomous self-driving software instead. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Tesla made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of February 6, 2024 Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. How Much Profit is Hiding Within Tesla's Enormous $78 Billion in Automotive Revenue? was originally published by The Motley Fool Related Quotes "
}