{
    "title": "How China built BYD, its Tesla killer",
    "date": "2/12/2024",
    "url": "https://www.businesstimes.com.sg/international/global/how-china-built-byd-its-tesla-killer1",
    "text": "Hello, your email is unverified. Please confirm  for access to all your SPH accounts. Create a free account with Business Times  for seamless access across SPH Media products. Welcome,  Create a free account with Business Times  for seamless access across SPH Media products. Welcome,    \"How China built BYD, its Tesla killer\" Already have an account? Log in The Business Times Personal Edition at$9.90/month*\nSUBSCRIBE NOW\nFind out more about subscription packages here. Find out more about subscription packages here. The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. Subscribe to The Business Times Personal Edition at $9.90/month*\n*Terms and conditions apply.\nSUBSCRIBE NOW\nFind out more about subscription packages here. *Terms and conditions apply. Find out more about subscription packages here. CHINA’S BYD was a battery manufacturer trying its hand at building cars when it showed off its newest model in 2007. American executives at the Guangzhou auto show gaped at the car’s uneven purple paint job and the poor fit of its doors. “They were the laughingstock of the industry,” said Michael Dunne, a China auto industry analyst. Nobody is laughing at BYD now. The company passed Tesla in worldwide sales of fully electric cars late last year. BYD is building assembly lines in Brazil, Hungary, Thailand and Uzbekistan and preparing to do so in Indonesia and Mexico. It is rapidly expanding exports to Europe. And the company is on the cusp of passing Volkswagen Group, which includes Audi, as the market leader in China. BYD’s sales, over 80 per cent of them in China, have grown by about one million cars in each of the past two years. The last carmaker to accomplish that in even one year in the American market was General Motors – and that was in 1946, after GM had suspended passenger car sales during the four preceding years because of World War II. “BYD’s growth is unlike anything the industry has seen in many decades,” said Matt Anderson, curator of transportation at the Henry Ford Museum in Dearborn, Michigan. Start and end each day with the latest news stories and analyses delivered straight to your inbox. Based in Shenzhen, the hub of China’s electronics industry, BYD has shown how Chinese carmakers can tap the country’s dominance of electrical products. No company has benefited as much from China’s embrace of battery-electric cars and plug-in petrol-electric cars. These vehicles together make up 40 per cent of China’s car market, the world’s largest, and are expected to be more than half next year. Like most Chinese carmakers, BYD doesn’t sell its cars in America because Donald Trump-era tariffs remain in place, but BYD does sell buses in the US. BYD is leading China’s export push in electric cars, and is rapidly building the world’s largest car carrier ships to transport them. The first of the ships, the BYD Explorer No 1, is on its maiden voyage from Shenzhen with 5,000 electric cars on board, and is expected to arrive in the Netherlands by Feb 21. With China’s and BYD’s success has come more scrutiny. Elon Musk, CEO of Tesla, warned about the strength of Chinese electric car exports in a company earnings call in January. “Frankly, I think if there are no trade barriers established, they will pretty much demolish most other companies in the world,” he said. The rapid gains by BYD and other Chinese carmakers in Europe have prompted a European Union investigation of Chinese government subsidies and could result in tariffs. BYD’s annual reports show a total of US$2.6 billion in government assistance from 2008 through 2022. And that does not include other help, like making sure that taxi companies in BYD’s hometown buy only BYD electric cars. BYD declined to comment about subsidies. In a statement, the company said the BYD Explorer No 1, its new ship, “signifies a significant milestone for BYD as it expands into international markets and contributes to the development of the global new-energy vehicle industry”. China has built enough factories to make more than twice as many cars as its market can buy. That has led to a price war in China, particularly between BYD and Tesla, with discounting that has inflicted heavy losses. One of BYD’s newest models, the subcompact Seagull, starts at less than US$11,000. A real estate crisis and a falling stock market are now making Chinese consumers more wary about buying a car at all. But BYD’s low manufacturing costs have left it in a better position than most rivals to survive any long slowdown in sales and industry shakeout. BYD’s chair, Wang Chuanfu, founded the company in 1995 to make batteries for Motorola and other consumer electronics companies. He had studied at Central South University in Changsha, an elite institution famed for battery chemistry research. But he dreamed of making cars. In 2003, BYD bought a factory in Xi’an that was building petrol-powered cars. But the company had trouble at the start, gaining an early reputation for building clunkers. In a visit to the factory in 2006, a large repair area at the end of the assembly line was clogged with newly built cars that already needed more work. BYD’s sales grew as the Chinese market soared. Warren Buffett bought a nearly 10 per cent stake for US$230 million in 2008, giving BYD not just a cash infusion but also global cachet. The same year, Wang promised to start exporting battery-electric cars to the US within two years. But electric cars at the time cost a lot to build and had limited range, and Wang had to scotch his plans to enter the American market. In an interview in 2011, he second-guessed his emphasis on battery-electric cars. Carmakers should focus on petrol-electric hybrids, he declared. He added: “There is still tremendous potential in the Chinese market for electric cars.” By 2012, car production in China had caught up with demand. Buyers became more choosy. BYD’s car sales and stock price plunged as multinationals offered more stylish models. Industry executives and analysts questioned whether BYD had a future. But Wang proceeded to make two risky bets that paid off. In 2016, he hired Wolfgang Egger, a prominent Audi designer, who in turn hired hundreds more car engineers with bold tastes. They completely redesigned BYD’s models. Wang also figured out how to replace the industry’s standard chemicals in rechargeable lithium batteries – nickel, cobalt and manganese – with cheaper iron and phosphate. But early batteries made from the inexpensive chemical compounds ran out of juice quickly and had to be recharged after even short trips. In 2020, BYD introduced its Blade batteries, which closed most of the so-called range gap with nickel-cobalt batteries at a fraction of what they cost. Tesla began making and selling large numbers of cars in China the same year, and enthusiasm for electric cars swept the nation. BYD was ready with inexpensive battery chemistries and Egger’s new designs. Tesla also began using lithium iron phosphate batteries in less expensive models. BYD still sells mostly cheaper cars with lower range, while Tesla mostly sells costlier cars with more range. The Swiss bank UBS found last year that a BYD Seal electric hatchback sedan cost 35 per cent less to make than a slightly smaller Volkswagen ID.3 of similar quality made in Europe. The savings came only partly from the cheaper lithium iron phosphate batteries. BYD makes three-quarters of the Seal’s parts. Like Tesla, BYD uses only a few electronic systems in each car. By contrast, VW outsources up to two-thirds of its components. BYD also has benefited from lower labour costs in China, although those have risen as factories compete to hire skilled workers. BYD now has its own walled town in Shenzhen, a south-eastern city next to Hong Kong. An airport-style monorail carries workers from 18-storey company apartments to BYD’s office towers and research labs. Liu Qiangqiang, an engineer at the Shenzhen centre, said the staff of his car development team had almost trebled since he joined the company 15 months ago. “The pace is fast,” he said. After dismissing autonomous driving a year ago, BYD swung into action when the consumer electronics companies Huawei and Xiaomi introduced cars with considerable autonomous driving abilities. Wang announced in January that BYD had 4,000 engineers working on assisted driving, a limited form of autonomous technology that works mainly on highways and large roads, and would invest US$14 billion in the technology. BYD has a lingering advantage over Tesla: Wang’s decision by 2011 to develop plug-in hybrid cars, which account for nearly half of BYD’s sales. Li Jingyu, a salesman at a BYD dealership in Shenzhen, said many families bought a hybrid as their first car so that they could drive during Chinese New Year back to their ancestral villages. Most villages in China now have chargers, Li said, but not enough for the throngs of visiting drivers. “People are just worried about the waiting time,” he said. NYTIMES BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to t.me/BizTimes Now that you have experienced myBT with just a few keywords, subscribe to BT Premium to get full-access. You have reached your limit of 30 keywords.\nTo follow new keywords, edit your myBT settings. By signing up, you agree to our Privacy policy and Terms and Conditions.  Everything you need to know about Global Enterprise and the people behind them. Powered by  SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}