{
    "title": "Tesla shareholders are taking a stand against law firm’s $6B TSLA stock \nrequest",
    "date": "3/7/2024",
    "url": "https://www.teslarati.com/tesla-shareholders-judge-against-law-firm-6b-tsla-stock-request/",
    "text": "Is the law firm behind the legal complaint that ultimately rescinded Elon Musk’s 2018 pay package looking to get overpaid? A growing number of Tesla shareholders say so. This is highlighted in a grassroots effort from Tesla stockholders who are currently using their voices to ask Delaware Judge Kathaleen McCormick to deny the request of law firm Bernstein Litowitz Berger & Grossmann, which is demanding a compensation of nearly $6 billion for their services in the case against Musk. Elon Musk’s 2018 pay package was rescinded by Judge McCormick in late January. The case was filed by a thrash metal drummer and car enthusiast, Richard Tornetta, who held nine TSLA shares when the legal complaint was filed. In a brief, the lawyers noted that they should be compensated in the form of 29 million TSLA shares. The block of TSLA stock would be worth nearly $6 billion, which would translate to an hourly rate of about $288,888. #DelawareCourt81 letter sent in support of giving the plaintiff's attorneys the reward they deserve: 9 shares. pic.twitter.com/cGWHx5Xxym “Plaintiff’s Counsel instead seeks a fee award in kind—a percentage of the shares returned for unrestricted use by Tesla (rather than cash). In other words, we are prepared to ‘eat our cooking.’ This structure has the benefit of linking the award directly to the benefit created and avoids taking even one cent from the Tesla balance sheet to pay fees. It is also tax-deductible by Tesla,” the lawyers wrote in a brief. #DelawareCourt81Fullfilled my duty from EUROPE as well 🫡 pic.twitter.com/0fATjfdnvF Elon Musk has responded to the Delaware court’s decision on X, stating that the idea of paying the lawyers behind the case nearly $6 billion in TSLA stock was “criminal.” Musk’s sentiments are understandable, especially since the vast majority of TSLA shareholders did approve his 2018 compensation plan. A number of these shareholders have now decided to make their voices known by sending letters to Judge McCormick explaining that they do not just support Musk’s 2018 pay package — they are also against the idea of paying Bernstein Litowitz Berger & Grossmann nearly $6 billion in TSLA stock. 💔😭#DelawareCourt81 pic.twitter.com/yy8WqewatA The TSLA shareholders have selected the hashtag #DelawareCourt81 for their movement. A look at the hashtag on X, the social media platform formerly known as Twitter, shows that retail shareholders from all walks of life are now sending letters to Judge McCormick. Some have even sent letters from abroad. Others shared personal stories about how their retirement is tied to TSLA stock, and how a $6 billion TSLA share grant to Bernstein Litowitz Berger & Grossmann would cause them great financial harm. Ready to 💌 in the morning. This letter to the Delaware judge highlights these 4 points:#DelawareCourt81 1️⃣ The excessive $6 BILLION in attorney fees lacks transparency and does not benefit shareholders.2️⃣ The invalidation of Elon Musk’s 2018 pay package is not based on a… pic.twitter.com/3I5Xeq7bDc It remains to be seen if the Tesla shareholders’ efforts would affect Judge McCormick’s final rulings on the matter. But regardless of the Delaware Judge’s decision, the efforts undertaken by the Tesla shareholders deserve a notable amount of praise. Elon Musk seems to appreciate the shareholders’ efforts, at least, as the CEO expressed his thanks in a reply to a shareholder’s post about the initiative. Bernstein Litowitz Berger & Grossmann’s brief about its request for compensation can be viewed below. March 1, 2024 – Fee Brief as Filed_Tesla by Simon Alvarez on Scribd Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}