{
    "title": "Courier Capital LLC Invests $2.83 Million in Tesla, Inc. (NASDAQ:TSLA)",
    "date": "3/28/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsla-sec-filing-2024-03-28/",
    "text": "Courier Capital LLC bought a new position in Tesla, Inc. (NASDAQ:TSLA - Free Report) during the fourth quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The institutional investor bought 11,375 shares of the electric vehicle producer's stock, valued at approximately $2,826,000. Other hedge funds have also recently modified their holdings of the company. Contravisory Investment Management Inc. purchased a new position in Tesla during the third quarter worth approximately $25,000. Wyrmwood Management LLC purchased a new position in Tesla during the fourth quarter worth approximately $25,000. Halpern Financial Inc. boosted its position in Tesla by 1,111.1% during the third quarter. Halpern Financial Inc. now owns 109 shares of the electric vehicle producer's stock worth $27,000 after purchasing an additional 100 shares in the last quarter. Alpha Paradigm Partners LLC purchased a new position in Tesla during the third quarter worth approximately $27,000. Finally, MayTech Global Investments LLC purchased a new position in Tesla during the fourth quarter worth approximately $30,000. Hedge funds and other institutional investors own 66.20% of the company's stock. In other Tesla news, SVP Xiaotong Zhu sold 687 shares of the firm's stock in a transaction on Wednesday, March 6th. The stock was sold at an average price of $177.11, for a total value of $121,674.57. Following the sale, the senior vice president now directly owns 63,171 shares in the company, valued at $11,188,215.81. The transaction was disclosed in a legal filing with the SEC, which can be accessed through this link. In related news, SVP Xiaotong Zhu sold 687 shares of the business's stock in a transaction dated Wednesday, March 6th. The stock was sold at an average price of $177.11, for a total value of $121,674.57. Following the transaction, the senior vice president now owns 63,171 shares in the company, valued at approximately $11,188,215.81. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, SVP Andrew D. Baglino sold 10,500 shares of the business's stock in a transaction dated Thursday, February 29th. The shares were sold at an average price of $204.17, for a total value of $2,143,785.00. Following the completion of the transaction, the senior vice president now owns 31,230 shares in the company, valued at approximately $6,376,229.10. The disclosure for this sale can be found here. Insiders have sold a total of 198,598 shares of company stock worth $36,952,434 over the last ninety days. Corporate insiders own 20.90% of the company's stock. A number of equities analysts have commented on the company. The Goldman Sachs Group reduced their target price on Tesla from $220.00 to $190.00 and set a \"neutral\" rating for the company in a report on Monday, March 18th. Piper Sandler reduced their target price on Tesla from $295.00 to $225.00 and set an \"overweight\" rating for the company in a report on Monday, February 5th. Morgan Stanley reaffirmed an \"overweight\" rating and issued a $320.00 price target on shares of Tesla in a report on Wednesday. JPMorgan Chase & Co. cut their price target on Tesla from $135.00 to $130.00 and set an \"underweight\" rating for the company in a report on Friday, January 26th. Finally, KGI Securities reaffirmed a \"neutral\" rating and issued a $213.00 price target (down previously from $309.00) on shares of Tesla in a report on Thursday, January 25th. Ten analysts have rated the stock with a sell rating, fifteen have issued a hold rating and eight have assigned a buy rating to the company. According to data from MarketBeat.com, Tesla presently has an average rating of \"Hold\" and a consensus price target of $204.63. Get Our Latest Research Report on TSLA Shares of TSLA traded down $4.04 during midday trading on Thursday, hitting $175.79. 77,386,336 shares of the stock were exchanged, compared to its average volume of 102,682,047. The firm has a market cap of $559.85 billion, a P/E ratio of 40.79, a P/E/G ratio of 4.01 and a beta of 2.41. The stock has a fifty day simple moving average of $187.78 and a 200 day simple moving average of $222.06. Tesla, Inc. has a 52-week low of $152.37 and a 52-week high of $299.29. The company has a debt-to-equity ratio of 0.05, a quick ratio of 1.25 and a current ratio of 1.73. Tesla (NASDAQ:TSLA - Get Free Report) last released its earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share (EPS) for the quarter, missing analysts' consensus estimates of $0.74 by ($0.03). Tesla had a net margin of 15.50% and a return on equity of 16.62%. The company had revenue of $25.17 billion during the quarter, compared to analysts' expectations of $25.64 billion. During the same quarter last year, the business posted $1.07 earnings per share. The company's revenue for the quarter was up 3.5% on a year-over-year basis. On average, research analysts anticipate that Tesla, Inc. will post 2.44 EPS for the current fiscal year. Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.Recommended StoriesFive stocks we like better than TeslaHow to Find Undervalued Stocks3 Value Stocks Too Small For Buffett’s PortfolioHow is Compound Interest Calculated?Foot Locker Builds Up Another Head of Steam; Gains ImminentAre Penny Stocks a Good Fit for Your Portfolio?Disney Stock Catches 3 Upgrades In a Single Week  Before you consider Tesla, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list. While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's guide to investing in 5G and which 5G stocks show the most promise. If the last year of price cuts and sluggish sales weren’t enough to tip off the market to the fact the EV bubble has burst, Tesla’s NASDAQ: TSLA Q4 results and outlook for 2024 should do it. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}