{
    "title": "Tesla scraps Elon Musk's no-advertising mantra as stock nosedives nearly \n30% this year",
    "date": "3/29/2024",
    "url": "https://au.finance.yahoo.com/news/tesla-scraps-elon-musk-no-213627809.html",
    "text": "Amid rising competition and a lackluster stock performance, Tesla is brushing off CEO Elon Musk’s previous disdain for marketing and pushing ahead with digital ads in search of a much needed sales boost. The company spent an estimated $6.4 million on digital advertising last year, the Wall Street Journal reported, citing data from Vivvix, a subsidiary of ad-tracking platform MediaRadar. The company’s marketing budget last year dwarfed the $175,000 Vivvix estimates that the company spent in 2022. Tesla has spent 900 times more on U.S.-targeted digital advertising in the first quarter compared to a year ago, according to a report by market intelligence firm Sensor Tower. Tesla’s ad spend was mostly focused on YouTube, Sensor Tower reported, but also included campaigns on Facebook, Instagram, Google, and the Musk-owned X platform, according to a review of publicly available data. More affordable than you think World’s bestselling SUV is $1k off this month Prices will go up again in Marchhttps://t.co/tEj0udh3Ll pic.twitter.com/aFPqU1CnyG — Tesla (@Tesla) February 11, 2024 Many of the ads are promoting the company’s Model Y vehicle, with a call to buy before prices increase on April 1. Some tout Tesla features such as its Autopilot and extra cargo space, while others show families using the touchscreen to play games or stream video. Musk and Tesla have often dismissed traditional forms of promotion, relying instead on word-of-mouth, referral programs, and the starpower of its chief executive to attract customers. The Tesla CEO has previously said money spent on publicity campaigns would be better spent elsewhere. “Tesla does not advertise or pay for endorsements. Instead, we use that money to make the product great,” he wrote in a post on X, formerly Twitter, in 2019. Still, Tesla shares’ nearly 30% nosedive since January and heightened competition from Chinese EV makers has recently led Musk to open up more to advertising. In response to a question at last year’s annual shareholder meeting in May, Musk said Tesla would “[T]ry a little advertising and see how it goes.” The company’s reversal on advertising comes as the first three months of the year wrap up and analysts prepare for what could be a subpar quarter for the EV maker. Several analysts have already downgraded their estimates for first quarter vehicle deliveries (an approximation for sales) after Bloomberg reported last week that Tesla was cutting back production at its plant in China. On Wednesday, Wedbush Securities cut its estimate to 425,968 from about 475,000, according to a note. The consistently bullish Wedbush analyst Dan Ives also cut his price target to $300 from $315, although the firm reiterated its “outperform” rating for the company. A recent internal email to staff showed Musk is not just relying on digital advertising but also aggressive promotion to beef up sales of its $12,000 per year subscription for “full-self driving.” In a leaked internal email this week, Musk said Tesla staff were required to give potential customers a quick trial while they are picking up their cars. “I know this will slow down the delivery process, but it is nonetheless a hard requirement,” he wrote in the internal email. This story was originally featured on Fortune.com As Tesla (TSLA) prepares to release its first quarter earnings results, Wedbush Securities has lowered its price target on the stock, citing a demand slowdown and headwinds impacting the company's margins. Wedbush Securities Managing Director Dan Ives joins Yahoo Finance Live to explain why he believes the quarter will be \"brutal.\" Ives anticipates Tesla's first quarter performance to be \"a nightmare on Elm Street,\" with demand slowing both domestically and internationally. Despite the disappointing expectations, \"the growth story is still there,\" he says. Ives highlights the ongoing price war in China's electric vehicle market and emphasizes that while Wall Street acknowledges this challenge, Tesla needs to \"draw a line in the sand.\" He believes the company must reevaluate its China strategy to improve margins amid the rapidly evolving technology landscape in the country, stating, \"It's a defining chapter in the Tesla story.\" According to Ives, for Tesla to regain momentum, the company needs to implement a clear communication strategy regarding margins, outline \"strategic targets\" for its AI initiatives, and for Elon Musk must stop threatening to leave the company: \"Tesla is Musk, and Musk is Tesla.\" He notes that although Tesla still holds growth potential, they must provide clarity to investors, asserting, \"this is a quarter that's really gonna shake some confidence.\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination. Editor's note: This article was written by Angel Smith Long story short, Grok is willing to speak to topics that are usually off-limits to other chatbots, like polarizing political theories and conspiracies.  Ask it \"What's happening in AI today?\" and Grok will piece together a response from very recent headlines, while ChatGPT will provide only vague answers that reflect the limits of its training data (and filters on its web access).  Earlier this week, Musk pledged that he would open source Grok, without revealing precisely what that meant. Trade 24 hours a day on the world's most popular platform. In this article, we discuss 13 best growth ETFs to buy now. If you want to skip our discussion on growth investing, check out 5 Best Growth ETFs To Buy Now. When interest rates went up in 2023, things changed. Companies had to rethink their plans and prioritize financial resilience over mere growth. Despite two […] In this article, we list and discuss the 15 States with the Highest Female to Male Ratio in the US. If you would like to skip our detailed discussion of the topic, you can go directly to the top 6 States with Highest Female to Male Ratio in the US. Since the mid-1960s, there have […] The Biden administration on Friday revised rules aimed at making it harder for China to access U.S. artificial intelligence (AI) chips and chipmaking tools, part of an effort to hobble Beijing's chipmaking industry over national security concerns.  The rules, released in October, seek to halt shipments to China of more advanced AI chips designed by Nvidia and others as Washington cracks down on Beijing over concerns its advancing tech sector could help boost China's military. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 At 53, Guan Junling is too old to get hired at factories anymore.  Toiling in sweatshops and building apartment complexes they could never afford to live in, they played a vital role in China's transformation into an economic powerhouse.  As they grow older, the first generation of migrant workers is struggling to find jobs in a slowing economy. In this article, we will look at the 25 countries with the highest average salaries in the world. We have also discussed the global unemployment rates. If you want to skip our detailed analysis, head straight to the 10 Countries with the Highest Average Salaries in the World. The International Labour Organization (ILO) has reported […] In this piece, we will take a look at the 25 largest automotive companies and suppliers in the world. If you want to skip our overview of the global automotive industry, then you can take a look at the 5 Largest Automotive Companies and Suppliers in the World. The global automotive industry is one of the […]  If you want to enjoy your retirement and not have to stress about working into your 70s, it's essential to sidestep the pitfalls that loom during your working years. Ill-advised decisions can shrink... In this article, we will take a look at the top 15 3D printing companies in the US. If you want to skip our detailed analysis, you can go directly to Top 5 3D Printing Companies in the US. Recent Trends in 3D Printing According to a report by Grand View Research, the global 3D […] Early retirement sounds like a dream come true, but it's not all rainbows and roses for most people. Find Out: I Retired at 65: Here's My Monthly BudgetLearn More: 7 Unusual Ways To Make Extra Money... 2024 Subaru Crosstrek Review, Pricing, and Specs The SA government has unveiled a package to help winemakers return to China's huge market with the lifting of punitive tariffs. In this article, we will discuss the 20 countries with the highest GDP per capita by 2024. If you want to skip our analysis, you can proceed to the section highlighting the 5 Countries with Highest GDP per Capita by 2024. Global Economic Outlook: Advanced Economies to Pick Up Pace in 2025 According to a […] Making wise financial plans for retirement is essential if you want to enjoy your golden years without having to worry about making ends meet. Be Aware: Cutting Expenses in Retirement: 6 Stores To...  If you're thinking about retirement, even if it's still quite a ways away, it's important to start planning. One way to do this is to look at your paycheck and see if there are new or more ways to... (Bloomberg) -- Oil scored a 16% quarterly gain in the latest sign that export curbs by OPEC and its allies are reining in global supplies.Most Read from BloombergBank of Russia Sees No Alternative to Yuan for Its ReservesFed’s Preferred Inflation Metric Cools While Spending ReboundsPowell Reiterates Fed Doesn’t Need to Be In Hurry to Cut RatesSBF’s Best Friends Who Turned on Him Brace for Their PunishmentTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineWest Texas Intermediate This food habit is linked to a specific type of dementia.  An alleged plant thief who continued to come back to the same house has been stopped by the efforts of one very determined plant owner and technology. The \"Late Night\" comedian brutally summed up the former president's media company. 'You can't park there mate'. "
}