{
    "title": "Lawyers who killed Elon Musk’s $56 billion pay pact seek Tesla stock",
    "date": "3/2/2024",
    "url": "https://www.moneycontrol.com/news/world/lawyers-who-killed-elon-musks-56-billion-pay-pact-seek-tesla-stock-12387951.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Lawyers for a Tesla Inc. investor who persuaded a judge to throw out Elon Musk’s $55.8 billion pay package are making an unusual request to have their legal fees paid in the form of about $6 billion of stock in the electric-car maker. Attorneys for the Tesla investor who challenged Musk’s executive-compensation award – the largest ever given to a corporate titan – filed the request Friday in Delaware state court. The attorneys for shareholder Richard Tornetta argued in a court filing they deserve more than 29 million Tesla shares. They explained why they prefer stock to cash. “We are prepared to ‘eat our cooking,’” according to the filing. “This structure has the benefit of linking the award directly to the benefit created and avoids taking even one cent from the Tesla balance sheet to pay fees. It is also tax-deductible by Tesla.” Austin-based Tesla, with a $645 billion valuation, is among the largest companies in the world by market cap. Ann Lipton, a corporate law professor at Tulane University, said it’s the largest attorney fee request she’s ever heard of.“Now, to be fair, the case involved the largest compensation award ever to an executive,” she said. Lipton had her own theory for why the lawyers prefer stock. “I assume the plaintiffs’ attorneys figured if they sought $6 billion in cash in fees it could cripple Tesla,” she said. “Since the case involved a stock award to Musk, they thought it would be appropriate to ask for the fee in shares so it wouldn’t be as rough for Tesla shareholders. That makes a lot of sense to me.” Because Tornetta brought the case on behalf of shareholders, about 267 million shares that were promised to Musk in his pay plan will be returned to Tesla as a result of the investor’s victory, according to the filing. The filing is the latest step toward finalizing Delaware Chancery Court Chief Judge Kathaleen St. J. McCormick’s conclusion that Tesla directors gave Musk the excessive compensation plan because they were handcuffed by conflicts of interest. The judge also faulted Tesla’s public disclosure about the pay package. Once McCormick enters a final judgment in the case, Musk then has 30 days to decide whether to appeal her ruling under Delaware law. Musk has signaled to Tesla’s board that he’d like to arrange another massive stock award for him, years after he sold a significant chunk of his shares in the company to acquire the social-media company once-known as Twitter. The billionaire has said he is “uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control.” Some experts have questioned whether Musk’s focus on Tesla will be weakened without another super-sized pay package. Tesla directors cited that fear in approving the package that McCormick voided in January. Musk also has moved all his companies except Tesla out of Delaware for incorporation purposes in the wake of McCormick’s ruling. He’s encouraged other business owners to shift their incorporations out of the state, which is still the corporate home to more than 70% of Fortune 500 companies. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}