{
    "title": null,
    "date": "3/9/2024",
    "url": "https://www.tronweekly.com/tesla-spacex-bitcoin-stash-exposed/",
    "text": "TronWeekly Crypto World News March 9, 2024 by Lipika Deka Electric car maker Tesla holds over $771 million worth of Bitcoin across its wallets, while aerospace firm SpaceX’s BTC holdings are roughly $555 million. Data from Arkham Intelligence further revealed that Tesla’s public disclosures have remained unchanged in its BTC holdings. Business tycoon Elon Musk, co-founder of two tech enterprises, had previously declared that none of his companies would venture into creating a cryptocurrency token. Notably, Musk owns BTC, Ethereum, and Dogecoin [DOGE]. In early 2021, Tesla invested $1.5 billion in Bitcoin and briefly accepted BTC payments. However, the company reversed its stance due to environmental concerns related to BTC mining, prompting it to halt accepting BTC payments. As reported by TronWeekly, Tesla recently released its financial performance for the fourth quarter of 2023, which disclosed a total revenue of $25.2 billion and an operating profit of $2.1 billion. Notably, the automotive giant maintained a static stance on Bitcoin, refraining from any buying or selling activities during Q4. This marks six consecutive quarters where its BTC positions have remained at 9,720 BTC, a status unchanged since the last quarter, ending on September 30, 2023. The firm’s persistent reluctance to engage in Bitcoin transactions has fueled discussions about the company’s underlying strategy. One plausible explanation is that Tesla perceives BTC not merely as a speculative trading asset but as a long-term store of value. The steadfast approach adopted by the company could be interpreted as a cautious measure, prioritizing stability and risk management in the volatile cryptocurrency market. Bitcoin is like gold. BTC is not good for payments. I own a lot of Dogecoin and SpaceX owns Bitcoin. SpaceX, too, did not publicly disclose its BTC holdings, except for an excerpt from Musk confirming that the firm owns some of the tokens. The other day, Bitcoin reached a new all-time high of $69k, propelling the capitalization of BTC spot ETFs in the U.S. above an impressive $50 billion mark. Avid BTC proponent and MicroStrategy founder Michael Saylor voiced optimism about the influx of new spot Bitcoin ETFs launched by BlackRock and Fidelity, stating that these have surpassed expectations and are emerging as a competitor with S&P 500 ETFs. Saylor believes that BTC-related products are expected to surpass gold ETFs shortly, even if gold ETFs remain the largest commodity ETFs in the United States. Filed Under: Bitcoin News Tagged With: Bitcoin, spacex, tesla Copyright © 2024 · Tron Weekly. All Rights Reserved. NOTE: Tron Weekly is an independent crypto news site that adheres to the strict journalism policy anchored on transparency, trust, and objectivity, we have no affiliation with the TRON Foundation, its founder Justin Sun or any other cryptocurrency firm. "
}