{
    "title": "IFP Advisors Inc Reduces Stock Holdings in Tesla, Inc. (NASDAQ:TSLA)",
    "date": "3/18/2024",
    "url": "https://www.defenseworld.net/2024/03/18/ifp-advisors-inc-reduces-stock-holdings-in-tesla-inc-nasdaqtsla.html",
    "text": "Posted by Defense World Staff on Mar 18th, 2024 IFP Advisors Inc lowered its stake in shares of  Tesla, Inc. (NASDAQ:TSLA – Free Report) by 13.6% during the fourth quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The fund owned 10,510 shares of the electric vehicle producer’s stock after selling 1,658 shares during the period. IFP Advisors Inc’s holdings in Tesla were worth $2,612,000 as of its most recent SEC filing. A number of other large investors have also made changes to their positions in the stock. Contravisory Investment Management Inc. acquired a new stake in  Tesla in the 3rd quarter worth about $25,000.  Wyrmwood Management LLC acquired a new stake in  Tesla in the 4th quarter worth about $25,000.  Halpern Financial Inc. boosted its stake in  Tesla by 1,111.1% in the 3rd quarter. Halpern Financial Inc. now owns 109 shares of the electric vehicle producer’s stock worth $27,000 after buying an additional 100 shares during the last quarter.  Alpha Paradigm Partners LLC acquired a new stake in  Tesla in the 3rd quarter worth about $27,000.  Finally, MayTech Global Investments LLC acquired a new stake in  Tesla in the 4th quarter worth about $30,000. Institutional investors and hedge funds own  41.87% of the company’s stock. A number of analysts have issued reports on TSLA shares. Oppenheimer  reissued a “market perform” rating on shares of Tesla in a research note on Tuesday, January 2nd. Daiwa Capital Markets downgraded Tesla from an “outperform” rating to a “neutral” rating and dropped their target price for the company from $245.00 to $195.00 in a report on Tuesday, February 6th. Morgan Stanley dropped their target price on Tesla from $345.00 to $320.00 and set an “overweight” rating on the stock in a report on Wednesday, March 6th. Wedbush  reiterated an “outperform” rating and set a $315.00 target price on shares of Tesla in a report on Wednesday, January 31st. Finally, Edward Jones downgraded Tesla from a “buy” rating to a “hold” rating in a report on Friday, January 26th. Ten equities research analysts have rated the stock with a sell rating, fourteen have given a hold rating and nine have assigned  a buy rating to the stock. According to MarketBeat.com, the company presently has an average rating of “Hold” and a consensus target price of $213.04. Get Our Latest Research Report on Tesla NASDAQ:TSLA opened at $163.57 on Monday. Tesla, Inc. has a 12-month low of $152.37 and a 12-month high of $299.29. The firm has a market capitalization of $520.94 billion, a P/E ratio of 37.95, a P/E/G ratio of 3.81 and a beta of 2.41. The company has a debt-to-equity ratio of 0.05, a current ratio of 1.73 and a quick ratio of 1.25. The business has a 50 day simple moving average of $196.08 and a 200 day simple moving average of $226.17. Tesla (NASDAQ:TSLA – Get Free Report) last announced its earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share for the quarter, missing the consensus estimate of $0.74 by ($0.03). The business had revenue of $25.17 billion for the quarter, compared to the consensus estimate of $25.64 billion. Tesla had a net margin of 15.50% and a return on equity of 16.62%. The firm’s revenue was up 3.5% on a year-over-year basis. During the same period in the previous year, the firm earned $1.07 EPS.  Equities research analysts predict that  Tesla, Inc. will post 2.45 EPS for the current year. In other news, Director Robyn M. Denholm sold 93,706 shares of the business’s stock in a transaction on Wednesday, February 21st. The stock was sold at an average price of $194.73, for a total value of $18,247,369.38. Following the sale, the director now owns 15,000 shares of the company’s stock, valued at approximately $2,920,950. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this link. In other news, Director Robyn M. Denholm sold 93,705 shares of the business’s stock in a transaction on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total transaction of $16,439,605.20. Following the sale, the director now directly owns 15,000 shares of the company’s stock, valued at $2,631,600. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, Director Robyn M. Denholm sold 93,706 shares of the business’s stock in a transaction on Wednesday, February 21st. The stock was sold at an average price of $194.73, for a total value of $18,247,369.38. Following the sale, the director now directly owns 15,000 shares in the company, valued at $2,920,950. The disclosure for this sale can be found here. Insiders have sold 198,598 shares of company stock valued at $36,952,434 in the last quarter. Corporate insiders own  25.10% of the company’s stock. (Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.  Want to see what other hedge funds are holding TSLA? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Tesla, Inc. (NASDAQ:TSLA – Free Report).   Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter. Wedmont Private Capital Increases Stock Holdings in Roper Technologies, Inc. (NYSE:ROP) Wedmont Private Capital Boosts Holdings in Analog Devices, Inc. (NASDAQ:ADI) "
}