{
    "title": "The Single Best \"Magnificent Seven\" Stock to Buy Right Now, According to \nWall Street",
    "date": "3/12/2024",
    "url": "https://www.fool.com/investing/2024/03/12/the-best-magnificent-seven-stock-buy-now-wall-st/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The Magnificent Seven is a group of seven megacap companies collectively worth about $13 trillion, which is roughly equivalent to the combined value of the stock markets in Japan and China. To provide additional context, the Magnificent Seven account for about one-quarter of the S&P 500 (^GSPC 0.11%) and one-half of the Nasdaq Composite (^IXIC -0.12%) by weight. Detailed below are the median price targets set by Wall Street analysts for the Magnificent Seven. Alphabet: $165 per share (20% upside). Amazon: $205 per share (16% upside). Apple: $200 per share (18% upside). Meta Platforms: $525 per share (2% upside). Microsoft: $465 per share (14% upside). Nvidia: $870 per share (5% downside). Tesla (TSLA -2.25%): $220 per share (25% upside). Wall Street sees upside in six of the Magnificent Seven, Nvidia being the only exception. But Tesla's implied upside of 25% (at the time of writing) makes it the single-best Magnificent Seven stock to buy now, according to analysts. Tesla delivered 1.8 million electric vehicles in 2023, up 38% from 2022. But the company cut prices throughout the year to compensate for weak demand caused by rising interest rates. That stunted growth and reduced margins. In the fourth quarter, revenue rose just 3% to $25.1 billion; operating margin fell nearly 800 basis points; and non-GAAP net income dropped 39% to $2.5 billion. The chart below provides more detail on Q4 revenue growth across the automotive, energy, and services segments. Note: The Automotive segment includes revenue from new vehicles, full self-driving software, and internet connectivity. The Energy segment includes revenue from solar energy systems and batteries. And the Services segment includes revenue from used vehicles, paid charging, insurance, and non-warranty maintenance. The investment thesis for Tesla centers on its leadership in battery-electric vehicles -- not only in terms of sales, but also manufacturing technology -- and its opportunities with adjacent software and services, especially those that relate to autonomous vehicles. Tesla accounted for 19.1% of battery-electric vehicle sales last year, up from 18.2% in 2022. That puts the company about 260 basis points ahead of its closest competitor, Chinese automaker BYD. There are several reasons for that success, including brand authority and its status as a first mover, but manufacturing prowess truly sets Tesla apart. The company controls costs through factory automation and continuous innovation, such as large castings that reduce the number of parts per vehicle, which makes assembly less labor intensive. Tesla also produces battery packs (the most expensive part of an electric vehicle) at a lower cost than its peers, and that cost leadership is expected to persist through the end of the decade, according to Cairn Energy Research Advisors. Those advantages were overshadowed by economic challenges that caused margins to contract last year, and the situation may not improve this year. Tesla plans to invest in its next-generation (low-cost) vehicle platform in preparation for production in 2025. But the company has earned industry-leading operating margins in the past, and it could do so again in the future. Tesla will build its next-generation vehicle using a new manufacturing system that should cut production costs in half and reduce its factory footprint by 40%, according to management. That should boost margins while also enabling Tesla to build a cheaper electric car, which will extend its addressable market. With that in mind, Grand View Research expects electric vehicle sales to grow at 15% annually through 2030. Tesla has a substantial opportunity in software and services, especially where full self-driving (FSD) software is concerned. The company already sells FSD subscriptions to customers in certain geographies, but it also plans to monetize the technology through licensing deals with other automakers and robotaxi (autonomous ride-sharing) services in the future. The autonomous ride-sharing timeline is vague, but CEO Elon Musk has said robotaxi production could begin in 2024. In any case, Tesla is well positioned to be a leader in autonomous-vehicle technology given its data advantage. Specifically, with more camera-equipped vehicles on the road, it has more driving data than its peers. That hints at FSD being superior to other autonomous-vehicle platforms because data is a limiting factor in training machine learning models. Ultimately, Musk thinks FSD software and autonomous ride-sharing could push gross margins to 70%, up from 18% last year. Finally, Tesla also has monetization opportunities with Dojo, a supercomputer purpose-built for training artificial intelligence (AI) vision systems like FSD. Dojo reportedly offers sixfold better performance than graphics processing units (GPU) alternatives, meaning it should help the company achieve full autonomy more quickly. As Tesla makes progress with FSD, it may build the cachet required to sell AI cloud services to other companies. With that in mind, Grand View Research expects the autonomous vehicle market to grow at 22% annually through 2030. Wall Street expects Tesla to grow sales at 16% annually over the next five years, but that leaves room for upside if adjacent products like FSD software and autonomous ride-sharing services become significant revenue streams. Adam Jonas at Morgan Stanley sees that as a distinct possibility, and he believes sales could increase at 19% annually over the next seven years. In either case, the current valuation of 6.4 times sales is reasonable, though it would be more reasonable if Jonas is correct. So, investors who think Tesla can generate meaningful revenue outside its core automotive business should consider buying a small position in the stock right now. But investors who lack confidence in that narrative should steer clear. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Amazon, Nvidia, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, BYD, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}