{
    "title": "Tesla Falls On China Production Cut As Deliveries Miss Looms",
    "date": "3/22/2024",
    "url": "https://www.investors.com/news/tesla-stock-china-production-cuts/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Tesla (TSLA) reportedly has reduced production at its Shanghai factory amid slowing EV demand in the world's largest auto market. The move to cut production in China also comes as the global EV giant is heading towards a likely first-quarter delivery miss and has announced vehicle prices will begin to increase. Tesla stock fell Friday. Tesla is reducing production at the China plant to five days a week from 6.5 days, according to Bloomberg, citing sources. The output cuts started earlier in March and could continue through April, Bloomberg reported Friday. The move comes amid slowing EV growth in China and with Tesla's Shanghai facility already not producing at full capacity. Tesla observers have repeatedly said in recent weeks that global inventory appears high. Earlier this week, local media reported Tesla will slightly raise China list prices on Model Y vehicles starting on April 1, following similar plans in the U.S. and Europe. Tesla is also offering discounts between $1,000-$1,500 in China on inventory Model Y vehicles. Inventory discounts are more significant in the U.S. and Europe. Raising list prices could chill future demand, especially in China, while rivals are rolling out new or refreshed models at a rapid pace, usually with aggressive pricing. The global EV company ended 2023 on a high in China. However, the EV dynamic in China has changed early in 2024. Tesla Chief Executive Elon Musk has also said China's EV companies are Tesla's main competition — with BYD (BYDDF), Nio (NIO), Li Auto (LI) and others all making inroads in the EV market. Tesla China delivered 60,365 in February, down around 19% compared to last year, according to according to the China Passenger Car Association (CPCA). Chinese New Year ran for two weeks in February, from Feb. 10-Feb. 24. Tesla deliveries of China-made vehicles in January and February totaled 131,812, down 6% compared to 2023. On Thursday, Li Auto slashed first-quarter delivery forecasts, implying March sales that are roughly half of what the Chinese EV maker predicted as recently as March 1. Cutting Shanghai production would be further confirmation of weakening demand not only in China, but in Europe and other key markets. Shanghai exports to Europe have waned over the past several months, while the Tesla Berlin factory is running well below capacity. Meanwhile, with the first quarter ending soon, Tesla appears to be heading for a delivery miss. Wall Street consensus currently still has Q1 deliveries of 481,000 units, according to FactSet, but many analysts have cut predictions in recent days. Tesla is expected to report Q1 deliveries in early April. TSLA shares dropped more than 1% to 170.83 during market action Friday. Tesla stock dropped 1.6% to 172.82 Thursday. Tesla gained 4.4% on the week, booking its first weekly advance in three weeks. Last week, Tesla stock dropped 6.7% to 163.57, hitting new 2024 lows and levels not seen since May 2023. TSLA is down around 14% in March and the biggest loser on the S&P 500 index so far in 2024. UBS last week cut its Tesla stock price target to 165, from 225, and maintained a neutral rating on the shares. UBS lowered its Q1 delivery forecast to 432,000 units, from its previous 466,000 view. The firm also cut full-year deliveries to 1.96 million units, from 2.02 million previously. With 2023 in the rearview mirror, analyst consensus now has 2024 Tesla earnings below 2023's level. That signals another year of earnings declines for this growth stock. Wall Street expects Tesla earnings per share of just $2.96 a share in 2024, according to FactSet. That would be a around a 5% decline vs. last year's $3.12. Morgan Stanley Tesla bull Adam Jonas recently issued an investor note in which he cut his Tesla 2024 earnings projections by 25%, saying that the EV giant could \"potentially\" lose money this year. Jonas slashed his Tesla price target to 320, down from 345, but maintained an overweight rating on the shares. Jonas also whittled down his Tesla 2024 EPS projections to $1.51. His previous view was $2.04 per share. The analyst sees auto gross profit margins sinking to 11.4% amid continued demand issues for EVs. The EV giant ranks eighth in the 35-member IBD Auto Manufacturers industry group. The stock has a 30 Composite Rating out of a best-possible 99. Tesla stock also has a 10 Relative Strength Rating and a 68 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla A Buy Or A Sell? Get Full Access To IBD Stock Lists And Ratings Learning How To Pick Great Stocks? Read Investor's Corner Is Rivian A Buy Right Now With The Cybertruck Hype? Futures: FedEx Soars, Tesla Skids On China Woes 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}