{
    "title": "Musk wants 25% voting control at Tesla before fulfilling AI goal",
    "date": "3/25/2024",
    "url": "https://sg.news.yahoo.com/musk-seeks-25-voting-share-013237828.html",
    "text": "By Chandni Shah and Hyunjoo Jin (Reuters) -Tesla CEO Elon Musk said he would be uncomfortable growing the automaker to be a leader in artificial intelligence and robotics without having at least 25% voting control of the company, nearly double his current stake. Musk said on Monday in a post on social media platform X, formerly known as Twitter, that unless he got stock in the world's most valuable automaker that was \"enough to be influential, but not so much that I can't be overturned,\" at Tesla, he would prefer to build products outside of the electric-vehicle manufacturer. Musk's warning about developing AI and robotics outside Tesla unless he gets more voting control could infringe on his duties as CEO, governance experts and analysts said. He has long touted Tesla's partially automated \"Full Self-Driving\" software and its prototype humanoid robots, but the electric-vehicle maker generates most of its revenue from its automotive business. He also promoted Tesla's Dojo supercomputer to train AI models, which Morgan Stanley analyst Adam Jonas said in September could boost its market value by almost $600 billion by helping to speed up its foray into robotaxis and software services. Tesla's shares inched up 0.5% on Tuesday, but have fallen by more than 11% since the start of the month. Musk, the world's richest person, currently owns around 13% of Tesla stock after selling billions of dollars of shares in 2022 partly to help finance his $44 billion purchase of Twitter. In a separate post on X, he said he would be fine with a dual-class share structure to achieve his goal of getting 25% voting control, but was told it was impossible after Tesla's initial public offering. \"It's weird that a crazy multi-class share structure like Meta has, which gives the next 20+ generations of Zuckerbergs control, is fine pre-IPO, but even a reasonable dual-class is not allowed post-IPO,\" he said, referring to the Facebook parent's founder Mark Zuckerberg. Companies with dual-class structures have two or more types of shares with different voting rights — usually one with greater voting rights for founders or early investors and another for other shareholders with less voting power. Tesla did not respond to a request for comment. Musk currently faces a lawsuit over his compensation package. Tesla shareholder Richard Tornetta sued Musk and the board in 2018 and hopes to prove the co-founder used his dominance over Tesla's board to obtain an outsized compensation package that did not require him to work at the EV maker full-time. Musk said on X there was no \"feud\" with the board over his new compensation package and said the pending verdict was holding back the discussions. (Reporting by Chandni Shah and Akash Sriram in Bengaluru and Hyunjoo Jin in San Francisco; Editing by Subhranshu Sahu, Jamie Freed and Shounak Dasgupta) Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order.  Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" Abby Hensel officially tied the knot in 2021, it has been revealed \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  This food habit is linked to a specific type of dementia. My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22.  Surveillance footage captures the harrowing moment a wild boar viciously attacks a 70-year-old man in his front yard in Guangyuan, China, on March 24. The man sustains severe spinal injuries while defending himself against the enraged animal's assault. Manar Mahmoud Muhammad Qasem admitted assault on woman in filmed interrogation Liverpool could land Ruben Amorim for as little as £12.8 million after Xabi Alonso confirmed he would not be succeeding Jurgen Klopp.  Devastating glide bombs have been a major threat to Ukraine's forces, and they can only be beaten by shooting down planes before they're released. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. There is a growing understanding across the Western allies that Ukraine is losing the ground war against Russia, and by summer could face defeat.  Russia is pounding front lines with artillery, rocket and drone fire — and at over five times the rate the Ukrainian army can reply.  Volodymyr Zelensky’s troops are exhausted — after sustaining in some sectors a heavier concentration of incoming artillery than at the Somme in 1916, or the Normandy Bocage after D-Day in 1944. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” A Russian fighter jet crashed into the sea off the Crimean port of Sevastopol on Thursday, the regional governor has said. The post Lian Hup Heng: Underrated atas cafe-style tarts & cake loaves for $3.80, hidden within a hawker centre appeared first on SETHLUI.com. Nordegren has moved on and built a life that focuses on her six kids  Premier League ball boys and girls have been ordered to stop throwing the ball back to players during matches, amid concerns that the “multi-ball” system is giving home teams an unfair advantage. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. Princess Eugenie and Princess Beatrice reportedly want to become working royals and are upset about King Charles snubbing them. "
}