{
    "title": "Lawyers who successfully argued against Musk's package seek Tesla stock as \nfees",
    "date": "3/3/2024",
    "url": "https://www.hindustantimes.com/business/lawyers-who-successfully-argued-against-musks-56-billion-package-seek-tesla-stock-worth-as-fees-101709446960899.html",
    "text": "Subscribe Now! Get features like Lawyers who successfully argued that Elon Musk's $55.8 billion package as Tesla CEO was ‘illegal,’ have now asked the presiding judge to award them more than 29 million (2.9 crore) company shares worth $5.6 billion as 'legal fees.' The request was filed in a Delaware court on Friday, and will be heard by judge Kathleen McCormick, who rejected Tesla's pay package for Musk – designed in 2018 – on grounds that the process was ‘flawed’ and the price ‘unfair.’ In their appeal, the attorneys for Richard Tornetta, the Tesla investor who challenged the package, explained their ‘unusual’ request and why they prefer stock over cash. “We are prepared to eat our cooking. This structure has the benefit of linking the award directly to the benefit created, and avoids taking even 1% from the Tesla balance sheet to pay fees. It is also tax-deductible by Tesla,” their filing stated. As Tornetta, their client, fought the case on behalf of the shareholders, about 267 million (26.7 crore) shares will be returned to the world's second-largest electric vehicle manufacturer because of the investor's win, according to the filing. Responding to the lawyers' demand, Musk posted on X, the social network formerly known as Twitter he acquired in October 2022: “The lawyers who did nothing but damage Tesla want $6 billion. Criminal.\" If approved, the $5.6 billion amount would apparently be far and away the largest such award. Also, the case involved the largest compensation award ever to an executive. Once Chief Judge McCormick gives her final judgment in the case, the billionaire, under Delaware laws, will have 30 days to decide whether to appeal her ruling or not.   Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}