{
    "title": "Elon Musk says Tesla can't make enough Powerwall storage batteries to meet \ndemand because of the chip shortage",
    "date": "3/20/2024",
    "url": "https://www.aol.com/elon-musk-says-tesla-cant-093500222.html",
    "text": "For premium support please call: Elon Musk said Tuesday that demand for Tesla's Powerwall battery was around 80,000 units. But the company will only be able make 35,000 this quarter at most, he said. Musk blamed the global chip shortage. See more stories on Insider's business page. Elon Musk said in court on Tuesday that the global chip shortage was stopping Tesla fulfilling orders for its home-storage battery, the Powerwall. Musk said customer demand was for about 80,000 Powerwalls, but that the company would only be able to produce between 30,000 and 35,000 this quarter in the \"best case,\" per CNBC. Musk blamed the global chip shortage, which he said in May has caused \"insane difficulties\" for Tesla's automotive business. Tesla said in April it would only sell its solar energy systems together with a Powerwall battery. Read more: Tesla and real-estate giant Brookfield are building a neighborhood in Austin full of renewable-energy tech Musk appeared in the Delaware Court of Chancery as the defendant in a case brought by a group of Tesla shareholders. The shareholders claim Tesla's acquisition of solar panel company SolarCity in 2016 amounted to a bailout. SolarCity was founded by Musk's cousins, and Musk had a 22% stake in the company when Tesla acquired it. SolarCity became Tesla Energy, Tesla's internal solar energy unit. On Monday, Musk said he did not exert any influence over Tesla's board, and reiterated that the deal was a stock-for-stock transaction that didn't benefit him financially. It was always part of Tesla's plan to move beyond electric-vehicle production into clean-energy solutions, he said. During testimony on Monday, Musk also said Tesla Energy's progress had been slowed by the company's focus on getting its Model 3 car to market, then by the pandemic. Do you work at Tesla Energy or are you a Tesla Energy customer? Contact this reporter at ihamilton@insider.com or iahamilton@protonmail.com. If you are an employee always use a non-work email. Read the original article on Business Insider Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}