{
    "title": "Tesla Has Started Advertising On Facebook And Instagram",
    "date": "3/27/2024",
    "url": "https://www.carscoops.com/2024/03/tesla-has-started-advertising-on-facebook-and-instagram/",
    "text": "The company is highlighting the Model Y's competitive MSRP in a recent ad posted on Instagram Tesla chief executive Elon Musk has long been vehemently opposed to the idea of traditional advertising. His anti-advertising stance has saved the company billions of dollars and for much of the last decade, it has been viewed as a masterstroke by many. Rather than paying for advertising, Tesla relies on the cult following of Musk, his supporters, and Tesla owners to promote their vehicles to their social circles. However, there are indications of a shift in this approach. The company returned to Facebook earlier this week having deleted its official page on the platform at the height of the Cambridge Analytica scandal in 2018. It has returned in a big way and has started running paid advertisements on the social media site. It appears that both Musk and Tesla must now believe that they need to start investing in advertising if they want to continue to grow sales. Watch: Tesla Embraces Advertising With First-Ever YouTube Spot Over the past few years, manufacturers of electric vehicles have been able to rely on first adopters to buy their vehicles. Now, most of these first adopters have their flashy new EVs and Tesla and its rivals need to convince the rest of the population that buying a new EV is a smart move. Running ads on Facebook will help to spread Tesla’s message and in theory, should help drive sales. BREAKING: Tesla has officially started paid advertisements on Instagram for the first time.Instagram has over 2 billion monthly active users, or ~25% of the global population. pic.twitter.com/j0z1oCfqNP Facebook isn’t the only Meta-owned social media network that Tesla is now advertising on. Earlier this week, Tesla launched a campaign on Instagram. The short clip promotes the Model Y’s $36,490 MSRP after the federal tax credit, shows the inside of the firm’s Texas Gigafactory, and promotes it as the ‘#1 Most American Made Car.’ Tesla is also running ads on TikTok and YouTube. Tesla’s shift towards traditional advertising coincides with a slump in demand for electric vehicles (EVs), adversely impacting its sales and those of its rivals. This downturn has led to Tesla’s share price plummeting from over $240 at the beginning of the year to around $180, marking it as the worst-performing stock in the S&P 500 for 2024, as reported by Quartz . Follow Carscoops on \n                                Google News "
}