{
    "title": "Forget Tesla: This EV Stock Is Poised to Zoom",
    "date": "3/5/2024",
    "url": "https://www.fool.ca/2024/03/05/forget-tesla-this-ev-stock-is-poised-to-zoom/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Tesla (NASDAQ:TSLA) stock has been the one to beat in EV stocks, but now that might be changing with more competition on the market. Image source: Getty Images If you even think of electric vehicles (EV), it’s likely the first word that pops into your mind is Tesla (NASDAQ:TSLA). I can’t blame you. Tesla stock has soared thanks to its investment in EVs, but it’s also experienced volatility from the investment as well. Just recently, shares plunged over 11% this week (yes, as in Monday and Tuesday), as the company reported a shipments slump, as we see new price cuts in China. Look, I’m not going to lie. Tesla stock does look like a strong long-term investment when it comes to EV stock. However, that depends entirely on the valuation. And when it comes to Tesla stock, it is high in terms of share price. Tesla stock currently trades at a significant premium compared to other automakers and even other EV stocks. And in a rapidly expanding EV market, this is likely to continue to drop. Established automakers are now in the space, as well as new startups — not to mention competition overseas. What’s more, Tesla stock’s profit margins have come under pressure from rising costs and price cuts simply to maintain its competition. This has raised concerns about future profitability. Finally, there’s Elon Musk. The company is so tied to the public image of Musk that his actions as chief executive officer can affect the stock price — positively, but certainly negatively as well. In fact, shares are nearing their 52-week low. And I would continue to hold off until there is some positive news about EV stocks and Tesla stock as well before jumping back in even at those levels. That all being said, there are other EV stocks that I would still consider. After all, there is a reason Tesla stock has done so well. And that’s because more competition means more interest in EV stocks and EVs in general. There is high-growth potential in the space, driven by factors like environmental concerns, decreasing battery costs, and increasing consumer demand. It’s now seen as a disruptive technology with the potential to revolutionize the transportation industry. This comes from continued innovation and diversification in the field. And more companies mean there is less risk being invested. And honestly, don’t downplay the environmental impact. This also goes in hand with government investment as well. This can benefit you as a consumer as well as an investor. As for another investment, if I’m getting into EV stocks, I’m going a touch off the radar. Instead of Tesla stock, I’d consider a company such as NFI Group (TSX:NFI). NFI stock is far cheaper, trading at just $11.50 as of writing. Yet it’s highly valuable, trading at 11.12 times earnings over the last year. However, during fourth-quarter earnings and 2023 results, the company reported a net loss for both. This has raised concerns about future profitability, with a lot of competition of course from other EV stocks. Even so, there are some benefits to be had. For instance, NFI stock announced that the battery they use is has been found to be the most efficient electric battery for its double-decker busses in the United Kingdom. Further, it ordered 12 more double-decker buses to climb on deck. It’s now a leader in the electric and low-floor bus market around the world. Its diversified products and focus on innovation have also led to strong performance in the past. Again, you can’t ignore that value. So, with shares actually up a whopping 25% in the last year and more to come, NFI stock looks like a great option — especially when compared to a risky company like Tesla stock. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 15, 2024 | Joey Frenette Shopify (TSX:SHOP) stock has been pulling back of late, opening up a window for dip buyers. Read more » March 15, 2024 | Amy Legate-Wolfe These growth stocks have already proven their worth this year, but are solid investments for long-term holders as well. Read more » March 15, 2024 | Amy Legate-Wolfe Nvidia (NASDAQ:NVDA) stock has surged in share price, but so has this stock, with a far lower share price to… Read more » March 15, 2024 | Brian Paradza, CFA Unveiling the Code: Should you Buy, Hold, or Sell Constellation Software (TSX:CSU) stock at current levels? Read more » March 15, 2024 | Nicholas Dobroruka Growth investors should have these two tech stocks high up on their watch lists. Read more » March 14, 2024 | Karen Thomas, MSc, CFA Well Health stock has been hit, but the company remains on a path of record-breaking revenues as it approaches positive… Read more » March 14, 2024 | Amy Legate-Wolfe CSU stock (TSX:CSU) may be the priciest stock on the TSX today, but there is a very good reason for… Read more » March 13, 2024 | Amy Legate-Wolfe CSU stock (TSX:CSU) has surged in the last year, yet even if growth slows by half, you could create immense… Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. © 2024 The Motley Fool Canada, ULC. All rights reserved. "
}