{
    "title": "NFL player buying a Tesla Cybertruck for $100K premium is stopped by his \nadviser",
    "date": "3/16/2024",
    "url": "https://www.marketwatch.com/story/nfl-player-buying-a-tesla-cybertruck-for-100-000-over-asking-is-intercepted-by-his-financial-adviser-3c0f2c15",
    "text": "San Francisco 49ers safety Ji’Ayir Brown, who intercepted a pass from Patrick Mahomes during Super Bowl LVIII, was just intercepted himself — by his financial adviser, who stopped him from buying a Tesla Cybertruck at a 130% markup. Brown went into a New Jersey electric-vehicle dealership to buy a Tesla Cybertruck, and after taking a test drive, he sat down with one of the managers to negotiate a price. The two haggled over amounts between $200,000 and $230,000 before Brown decided to call his financial adviser. Tesla’s website is currently selling the Cybertruck for $60,000 to $100,000, depending on the model. “It’s not in the cards right now,” Brown told the car dealer, relaying the words of his adviser — not even for the lower range of the prices the two were negotiating. Brown added that his adviser is “the guy I trust most.” Brown’s visit was documented on TikTok, where it has been viewed over 2.4 million times. Brown, 24, is currently signed to a four-year contract with the 49ers worth $5.3 million. He received a signing bonus of $924,224 for that contract. And he — along with other 49ers players — received a $263,000 bonus for their 2024 postseason run that ended with the team losing to the Kansas City Chiefs in the Super Bowl, according to the NFL Players Association’s collective-bargaining agreement. See also: Who gets bigger bonuses — a losing Super Bowl team or the average Wall Street employee? Beyond the run-of-the-mill pitfalls of buying a new car, the price tag of the vehicle jumped out at many commenters on social media. Why was this car dealer selling it for 130% more than Tesla’s website? “There’s no supply. There’s nothing out there,” George Saliba, the owner of J&S AutoHaus and the dealer who negotiated with Brown in the video, told MarketWatch. “People are keeping them and paying 100K, or flipping them. … This is like the biggest-delivery vehicle of our lifetimes. There’s nothing ever going to be bigger than this.” See also: Tesla’s stock selloff is ‘way overdone’ as EV demand stabilizes, analyst says Because of the limited supply, some people who received their Cybertruck in the initial wave of production have resold the vehicle for a big profit. One Cybertruck sold at auction for $244,000 in February, and two more recently sold for $195,500 and $189,000 at a Dallas auction. Saliba said people willing to pay more than the prices listed on Tesla’s \n        TSLA,\n        -2.25%\n       website for a Cybertruck are basically paying to get the vehicle early. “I think it’s going to be seven months until we are there,” Saliba said about the Cybertrucks becoming more readily available. “We are going into the spring season, which is the hottest season in the car business.” Saliba’s dealership, which went viral on TikTok earlier this month after supplying famed tech reviewer Marques Brownlee with a Fisker vehicle that he called the “worst car” he’s ever reviewed, has two Cybertrucks listed on its website, both for above $199,000. Another thing people interested in Tesla’s Cybertruck may be considering is the possibility of future delays in production. “Originally [Tesla was] expecting deliveries to be in 2021, and obviously there were some delays with COVID,” Amber Fairbanks, portfolio manager at Impax Asset Management, told MarketWatch. “I think the bigger issue is that this is a very difficult truck to make. It’s kind of like they are selling a prototype. They were never meant to be mass marketed. I think [Tesla CEO Elon] Musk sold the prototype, and now they have to make it in mass quantities.” She continued: “If you want the car right away, you might pay up. People who want those cars are willing to.” It’s not known when the Cybertruck will be widely available. Tesla did not respond to MarketWatch’s request for comment. Tesla has attempted to curb reselling of its vehicles by adding language into purchase agreements in which consumers agree to not sell the car for at least one year or face penalties. “You agree that in the event you breach this provision, or Tesla has reasonable belief that you are about to breach this provision, Tesla may seek injunctive relief to prevent the transfer of title of the vehicle or demand liquidated damages from you in the amount of $50,000 or the value received as consideration for the sale or transfer, whichever is greater,” the clause says. “Tesla may also refuse to sell you any future vehicles.” See also: Tesla’s stock extends selloff as Wells Fargo joins the bear camp The viral video comes as Tesla’s autopilot and other driver-assistance systems received poor ratings from a car-insurance group. Shares of Tesla Inc. are down 2.06% during Wednesday morning trading and are down 29.93% so far in 2024. Some markets have seen a big bump in newly built homes, which is affecting supply-and-demand dynamics. Weston Blasi is a reporter. You can follow him on Twitter @WestonBlasi. Weston Blasi is a reporter. You can follow him on Twitter @WestonBlasi. Visit a quote page and your recently viewed tickers will be displayed here. "
}