{
    "title": "This EV Stock Could Be Supercharged for 2024. Hint: It's Not Tesla.",
    "date": "1/22/2024",
    "url": "https://www.fool.com/investing/2024/01/22/this-ev-stock-could-be-supercharged-for-2024-hint/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More When it comes to electric vehicles (EVs), companies such as Tesla or Rivian Automotive probably come to mind. The advent of EVs was a major breakthrough for the sustainability movement. But as these new vehicles begin to gain traction, one concern seems to linger. EVs present an interesting alternative to traditional motor vehicles, but one of the biggest drawbacks of going fully electric revolves around the batteries in these cars. Range for EVs is a major complaint among prospective buyers, followed by a lack of charging stations depending on your location. One company that appears to be making strides in the battery space is QuantumScape (QS 1.12%). Let's dig into what sets QuantumScape apart from the competition, and assess if now is a good opportunity to scoop up shares in this EV stock. QuantumScape is developing a new type of battery for EVs. More specifically, the company's solid-state lithium-metal battery is considered to be a potential upgrade to traditional lithium-ion battery technology. QuantumScape's solid-state batteries are focused on increasing cell energy density and reducing charge time. As such, solid-state batteries can theoretically improve the range of EVs. This dynamic has garnered interest from a number of vehicle manufacturers including Volkswagen, which is an investor in the company. Image source: Getty Images. One of the most important things investors should understand about QuantumScape is that the company is still in the development stage. QuantumScape has not yet generated any revenue, and piling expenses are taking a toll on the company's cash position.  QS Total Operating Expenses (Quarterly) data by YCharts While the company believes that it has sufficient funding on the balance sheet until 2026, I see a number of challenges ahead. Hefty research and development (R&D) costs are often associated with early-stage companies. Moreover, even if QuantumScape's battery technology becomes mainstream, the company will still need to be able to fulfill production orders at scale. As investors have seen with Tesla and Rivian, scaling EV businesses is both a timely and costly endeavor. As of the time of this article, QuantumScape boasts a $3.4 billion market cap. While it's quite difficult to appropriately value a pre-revenue business, QuantumScape appears a bit disconnected from reality. Although the company's batteries just passed a major milestone test with Volkswagen, it still has a lot to prove before commercialization. Furthermore, QuantumScape is far from the only company exploring solid-state batteries. Many car manufacturers in Europe and Asia are also looking at the technology for their own EV efforts. QuantumScape is an interesting company, but I question how investible it is right now. With no tangible sales, a high burn rate, and intense competition, it's hard to justify buying in at a multibillion-dollar valuation. Investors who are interested in the EV movement and its various applications may want to keep an eye on QuantumScape. However, I'd caution against buying shares until the company demonstrates a clear, long-term path forward. For now, it may be best to treat the business of solid-state batteries and QuantumScape's stock with some speculation. Adam Spatacco has positions in Tesla. The Motley Fool has positions in and recommends Tesla and Volkswagen Ag. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}