{
    "title": "Tesla stock price hits eight-month low after earnings",
    "date": "1/26/2024",
    "url": "https://www.ig.com/uk/news-and-trade-ideas/tesla-stock-price-hits-eight-month-low-after-earnings-240126",
    "text": "Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money.\n\n Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money. WHY IG? GET TO KNOW US TRADING THE FINANCIAL MARKETS IMPORTANT INFO SHARES AND ETFS KEY MARKETS MORE OPPORTUNITIES EXTENDED HOURS OUR PLATFORM AND FEATURES THIRD-PARTY PLATFORMS START EXPLORING NEWS AND ANALYSIS LEARN TO TRADE View more search results ​​Tesla’s stock has fallen further after a poorly-received earnings report this week, with a gloomy outlook contributing to the bearish turn in price. ​Tesla shares experienced a significant decline on Thursday, reaching their lowest point in eight months. The drop in share price was largely attributed to disappointment surrounding the company's latest earnings report, which led to a wave of selling. ​In its fourth-quarter (Q4) earnings update released on Tuesday, Tesla reported $25.2 billion in sales and earnings per share (EPS) of $0.71. These figures fell short of average analyst estimates of $25.6 billion and $0.73 respectively, according to FactSet. ​One of the key factors contributing to the decline in profits was Tesla's decision to implement price cuts on its cars. This move resulted in a significant decrease in profit margins, with the company's gross margin during the Q4 standing at 17.6%, the lowest since 2019 and down over 600 basis points (bp) from the previous year. ​Tesla's profits for the last quarter dropped by 40% compared to the same period in 2022, while revenue only experienced a modest 3% year-over-year growth. ​For the full year of 2023, Tesla reported EPS of vague warning of \"notably lower\" output in 2024. This lack of clear guidance from CEO Elon Musk and the company raised further doubts and criticism. ​The Tesla share price has resumed its long-term downtrend which began in November 2021 and is now trading at levels last seen in May 2023 with the March and April 2023 lows at $163.91 to $152.37 being eyed. ​The fact that a daily chart, and it being Friday, also a weekly chart close will most likely be made below the October 2023 trough at $194.07 is technically bearish. ​Resistance now comes in at the late-October 2023 low at $194.07 and also at Thursday’s $206.77 to $193.00 price gap. ​Only a currently unexpected bullish reversal and rise above the last reaction high on the daily candlestick chart – a daily high which is higher than that of the preceding and following day – would lead technical analysts to question their bearish outlook. This was made on Monday at $217.80.  This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. See full non-independent research disclaimer and quarterly summary.  Go long or short on thousands of international stocks with spread bets and CFDs. Try a risk-free trade in your demo account, and see whether you’re on to something. Don’t miss your chance – upgrade to a live account to take advantage. Don’t miss your chance. Log in to take advantage while conditions prevail. Prices above are subject to our website terms and agreements. Prices are indicative only. All share prices are delayed by at least 15 minutes. Prices above are subject to our website terms and agreements. Prices are indicative only. All shares prices are delayed by at least 15 mins.  Get the week’s market-moving news sent directly to your inbox every Sunday. The Week Ahead gives you a full calendar of upcoming economic events, as well as commentary from our expert analysts on the key markets to watch.  For more info on how we might use your data, see our privacy notice and access policy and privacy webpage. Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of spread betting and CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Forex Indices Shares Options Other markets Spread betting CFD trading Share dealing Web platform Mobile trading MetaTrader 4 ProRealTime Compare features The Week Ahead News and trade ideas Strategy and planning Contact us  IG | Sitemap | Terms and agreements | Privacy | IG Community | Cookies | Investors | Modern slavery act | Vulnerability Follow us online: Spread bets and CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 69% of retail investor accounts lose money when trading spread bets and CFDs with this provider. You should consider whether you understand how spread bets and CFDs work, and whether you can afford to take the high risk of losing your money. Professional clients can lose more than they deposit. All trading involves risk.\n\nThe value of shares, ETFs and ETCs bought through a share dealing account, a stocks and shares ISA or a SIPP can fall as well as rise, which could mean getting back less than you originally put in. Past performance is no guarantee of future results.\n\nCFD accounts provided by IG Markets Ltd, spread betting provided by IG Index Ltd and share dealing and stocks and shares ISA accounts provided by IG Trading and Investments Ltd. IG is a trading name of IG Markets Ltd (a company registered in England and Wales under number 04008957), IG Index Ltd (a company registered in England and Wales under number 01190902) and IG Trading and Investments Ltd (a company registered in England and Wales under number 11628764). Registered address at Cannon Bridge House, 25 Dowgate Hill, London EC4R 2YA. IG Markets Ltd (Register number 195355), IG Index Ltd (Register number 114059) and IG Trading and Investments Ltd (Register number 944492) are authorised and regulated by the Financial Conduct Authority.\n\nThe information on this site is not directed at residents of the United States, Belgium or any particular country outside the UK and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. Careers | Marketing partnership "
}