{
    "title": "Viewers question if video of Tesla robot folding a shirt is real",
    "date": "1/15/2024",
    "url": "https://www.businessinsider.com/reactions-tesla-robot-folding-shirt-question-video-real-2024-1",
    "text": "       Elon Musk admitted that a video showing Tesla's Optimus robot folding a shirt is \"not yet\" possible, leaving online observers to wonder how the video was created at all. In a short video posted Monday to X, formerly known as Twitter, the Tesla robot stands at a table, slowly folding a black shirt, seemingly without assistance. Musk simply said of the video, \"Optimus folds a shirt.\" About 30 minutes later, he followed up that post saying what appeared on screen was not quite as it seemed. Optimus folds a shirt pic.twitter.com/3F5o3jVLq1 \"Important note: Optimus cannot yet do this autonomously, but certainly will be able to do this fully autonomously and in an arbitrary environment (won't require a fixed table with box that has only one shirt).\" Musk did not give a timeline for this future capability.Musk has shared videos of Tesla's Optimus robot in the past performing tasks like yoga stretches, squats and picking up an egg. He unveiled the robot in 2021, announcing it would use the same AI systems that power Tesla's self-driving cars. Related stories But this time, users on X and Threads, Meta's new social media rival to X, were quick to pick apart the video, with many accusing Musk and Tesla of essentially faking the action shown. Marques Brownlee, a popular YouTuber who often focuses on tech, asked Musk to specify whether what was shown was a live video or not. \"This is a video, not CG?\" Brownlee asked, referring to the possibility the video was computer-generated. Musk did not reply. A user on Threads argued there was indeed evidence of computer generation, posting a slow-motion version of the video that appeared to show the shirt the robot folds moving at times on its own. \"Did Tesla hire the claymation team from Wallace & Gromit?\" the user asked. Several other users noted that, in the far right of the video, part of a gloved hand can be seen coming briefly in and out of frame, which appears to mimic the Tesla robot's movements. \"It's just operated remotely, not autonomous. Basically the exact same way remote surgical 'robots' have worked for decades,\" another user on Threads noted. Robotic-assisted surgery, wherein doctors use robotic arms they control to carry out certain procedures, has been around for decades. Nevertheless, many Musk fans chimed in on X to support the billionaire in his robotic endeavor. The podcaster Lex Friedman, who has hosted conversations with Musk, replied to the post with \"Amazing work.\"  Read next Jump to "
}