{
    "title": "Tesla Keeps Cutting EV Prices In 2024. Wall Street Is Worried.",
    "date": "1/17/2024",
    "url": "https://www.investors.com/news/tesla-stock-ev-giant-keeps-cutting-prices-in-2024-wall-street-worried/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Tesla (TSLA) is continuing its strategy of offering vehicle discounts and slashing prices early in 2024 as the EV giant attempts to shore up demand. The latest round of price cuts in Europe Tuesday night put the focus squarely on Tesla margins and potential 2024 profit struggles with fourth-quarter and full-year earnings looming. Tesla stock fell Wednesday. So far in January, Tesla stock has retreated more than 13%, falling below key levels of support, as analysts await news on auto gross profit margins, excluding regulatory credits, and watch to see if vehicle pricing has stabilized. However, Tesla has continued cutting prices early in 2024, deciding in January to trim China vehicle prices on the Model 3 and two Model Y variants and then on Tuesday slashing Model Y prices in many European countries. The European price cuts come even with Tesla Berlin set to suspend production for two weeks, starting Jan. 29. On Jan 17, Gary Black, the managing partner of the Future Fund, posted on X that based on the January price cuts he was revising 2024 earnings estimates to $3.75 per share, down from $3.90 per share. Black added that Tesla management \"still does not see that cutting configurator prices and inventory discounts by the same amount is value destructive.\" \"In essence, TSLA is training its customers to wait for a deal,\" Black wrote. Tesla stock fell 2% to 215.55 Wednesday during market action. On Tuesday, TSLA shook off early losses, angling 0.5% higher at the close to 219.91. Tesla stock is below its moving averages following four straight weekly declines. To maintain sales momentum in 2023, Tesla aggressively cut vehicle prices and offered discounts throughout the year. Auto gross margins, which peaked at 30% in Q4 2021 amid industry chip shortages, have plunged well below 20%. Tesla bulls in the latter half of 2023 repeatedly predicted that Tesla's price cuts were ending and that auto gross margins had bottomed. With Tesla reporting Q4 earnings and revenue next week, closing out 2023, analysts are still focused on vehicle pricing and margins in 2024. Bernstein analyst Toni Sacconaghi wrote in early January that auto gross profit margins \"are a key question\" going into Q4 earnings. Sacconaghi models 15.7% auto gross profit margins for the fourth quarter but that they could drop lower given the impact of price cuts in September and October as well as significant discounting of inventory models in Q4. Barclays analyst Dan Levy on Wednesday lowered the firm's price target on Tesla stock to 250, down from 260, and kept an equal weight rating on the shares. Levy told investors the central theme for Tesla in 2024 is that it faces volume pressure in a demand constrained environment. Barclays view is that 2024 will be the first time in Tesla's history that volume will likely be more a function of demand than of the company's production capacity. Levy predicts Tesla delivering 1.97 million units in 2024. On Jan. 2, Tesla reported that deliveries in the fourth quarter exceeded Wall Street predictions, with the global EV giant selling a record-setting number of vehicles and hitting full-year expectations. However, reaction among analysts was muted. The EV giant reports full-year and fourth-quarter earnings and revenue on Jan. 24. Wall Street forecasts EPS falling 39% to 73 cents with revenue increasing 5% to $25.61 billion in Q4. Analysts expects 17.1% auto gross profit margins, excluding regulatory credits, according to FactSet. For 2023, analysts predict earnings dipping 25% to $3.07 per share and sales of $97.46 billion, up 20% compared to 2022. Analysts' Q4 profit estimates came down 17% in the last three months of 2023. Meanwhile, looking to 2024, Wall Street expects earnings to remain below 2022 levels. Analysts predict 2024 EPS of $3.72 and revenue totaling $117.03 billion. Wall Street's 2024 profit forecast is down 34% compared to its $5.65 per share view in Jan. 2023. Analyst consensus has auto gross profit margins growing in Q1 2024, hitting 18.8%. Tesla stock has retreated more than 13% in January. TSLA shares tumbled 7.8% to 218.89 last week, plunging below the 50-day and 200-day lines. Tesla stock is in an awkward double-bottom base with a 278.98 buy point according to MarketSmith analysis. The relative strength line, which tracks a stock's performance vs. the S&P 500, is at its lowest level since late May, according to MarketSmith. In 2023, Tesla doubled, easily outperforming the broader S&P 500 index. Tesla stock ranks fifth in the 35 member IBD Auto Manufacturers industry group. The stock has a 68 Composite Rating out of a best-possible 99. Tesla stock also has a 67 Relative Strength Rating and an 88 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla Stock A Buy Or A Sell? Stocks Near A Buy Zone Learning How To Pick Great Stocks? Read Investor's Corner MarketSmith: Research, Charts, Data And Coaching All In One Place Is Rivian A Buy Right Now With The Cybertruck Hype? Tech Futures Rise On Taiwan Semi Forecast 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}