{
    "title": "Tesla’s pay increase for employees revealed in internal documents: report",
    "date": "2/12/2024",
    "url": "https://www.teslarati.com/tesla-pay-increase-employee-2024-leak/",
    "text": "Tesla’s pay increase for employees in all of its gigafactories and offices in the US was recently revealed in internal documents. The pay increase differs for each state with a Tesla Gigafactory or office because it is based on the cost of living in each area. As such, Austin, Texas, and Sparks, Nevada, are receiving the lowest pay in Tesla’s new payment scheme. Meanwhile, Tesla workers in Fremont and Palo Alto, California, receive the highest pay. According to internal documents, Tesla increased factory workers’ pay from a minimum of $22 to $39 per hour. Tesla factory workers are divided into seven levels, and employees in leadership positions are divided into two levels. Below is a chart from Business Insider depicting each level and region. Workers can move between levels every six months based on performance and Tesla’s overall results. They may also qualify for a ‘Cyber Wallet’ bonus every six months at the end of performance periods. Performance periods run from January to June and July to December. Last month, Tesla announced plans to implement a pay increase in all of its factories in the United States, which took effect on January 8, 2024. Tesla’s employee pay increase comes as the United Auto Workers Union (UAW) turns its sights on all-electric car manufacturers. Last year, the UAW successfully struck negotiations with the big Detroit 3: Ford, General Motors, and Stellantis. Tesla has had a long history with unions, and it extends to its factories outside the United States. In Europe, Tesla is currently dealing with an ongoing union-organized strike in Sweden. In a Form 10-K report, Tesla reported having an employee headcount of 140,473 worldwide as of December 31, 2023. The company shared that Tesla’s competitive edge is its ability to attract and retain high-quality workers. “We have created an environment that fosters growth opportunities, and as of this report, nearly two-thirds (65%) of our managers were promoted from an internal, non-manager position, and 43% of our management employees have been with Tesla for more than five years. Tesla’s growth of 35% over the past two years has offered internal career development to our employees [and] the ability to make a meaningful contribution to a sustainable future. “We [can] retain our employees, in part, not only because employees can enjoy ownership in Tesla through stock (of which 89% have been given the opportunity to), but because we also provide them with excellent health benefits such as free counseling, paid parental leave, paid time off and zero-premium medical plan options that are made available on the first day of employment,” wrote Tesla in its Form 10-K report. If you have any tips, contact me at maria@teslarati.com or via X @Writer_01001101. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Copyright © TESLARATI. All rights reserved. "
}