{
    "title": "A salute and a cigarette: Elon Musk reacts to report that Apple's 10-year \nEV project is dead without selling a single car ...",
    "date": "2/29/2024",
    "url": "https://au.finance.yahoo.com/news/salute-cigarette-elon-musk-reacts-163600352.html",
    "text": "The automotive industry is notoriously challenging, so much so that even a behemoth with a market capitalization in the trillions of dollars has reportedly opted to abandon its ambitions in the sector. Apple is shutting down its electric vehicle (EV) project, according to Bloomberg, citing sources familiar with the decision. It would mark the conclusion of a decade-long endeavor. Commercial real estate has beaten the stock market for 25 years — but only the super rich could buy in. Here's how even ordinary investors can become the landlord of Walmart, Whole Foods or Kroger Inflation is still white-hot — use these 3 'real assets' to protect your wealth today, no matter what the US Fed does or says Anything can happen in 2024. Try these 5 easy money hacks to help you make and save thousands of dollars in the new year (they will only take seconds) The news caught the eye of Tesla CEO Elon Musk, who reacted on X (formerly known as Twitter) with a saluting emoji followed by a cigarette emoji. In a subsequent post, Musk remarked: “The natural state of a car company is dead.” The abrupt end to Apple’s EV project could spell good news for the existing players in the market. Here’s a look at two EV companies that Wall Street finds particularly attractive — plus a Warren Buffett EV investment that’s beating Tesla in one key metric. When people think of EV stocks, Tesla is usually the first one to come to mind. In 2023, the company achieved a significant milestone by delivering 1,808,581 EVs, which represents a 38% increase from 2022. In the U.S., Tesla’s dominance in the EV market is particularly evident. Data from Kelly Blue Book indicates that 55% of the EVs purchased by Americans in 2023 were Tesla products, highlighting the brand's strong foothold and consumer preference in the domestic market. However, as one of the market's most dynamic mega-cap names, Tesla's shares have experienced considerable volatility. They doubled in value in 2023 but have seen a decline of 18% so far in 2024. Wedbush analyst Dan Ives sees a revival on the horizon. The analyst has placed a price target of $315 on Tesla, implying a potential upside north of 50%. Read more: Rich young Americans have lost confidence in the stock market — and are betting on these 3 assets instead. Get in now for strong long-term tailwinds Given that Ford's best seller is the F-Series of pickup trucks, the company isn’t considered a pure-play EV stock. But the automaker has made significant strides in electrifying its lineup. In November 2019, Ford unveiled the Mustang Mach-E, a five-door electric compact SUV. This model hit the market in December 2020 and clinched the 2021 North American SUV of the Year Award. Moreover, Ford launched the all-electric F-150 Lightning pickup in April 2022, marking another significant step in its EV journey. In its latest earnings report, Ford highlighted: “Sales volumes of the F-150 Lightning pickup and Mustang Mach-E SUV both were up year-over-year and respectively the top-selling electric pickup and No. 3 most popular EV of any type in the U.S. for 2023.” Morgan Stanley analyst Adam Jonas has estimated a price target of $16 on Ford — around 30% above where the stock sits today. Chinese EV manufacturer BYD has been a part of investing legend Warren Buffett's portfolio for more than a decade. In 2008, Berkshire Hathaway acquired 225 million shares of BYD for $232 million, a move that proved to be highly lucrative. By the end of 2020, as stated in Berkshire’s shareholder letter, their stake was valued at approximately $5.9 billion. Although Buffett later began reducing his stake in BYD, an October 2023 stock exchange filing reported on by Reuters revealed that Berkshire still held a sizable 7.98% stake in the company. In the fourth quarter of 2023, BYD’s EV sales reached 526,409 vehicles, overtaking Tesla's deliveries of 484,507 EVs, according to Reuters, and displacing it as the top EV manufacturer globally. The Chinese company's success has been attributed to various factors, including its broad lineup with inexpensive models, price cuts, its battery-manufacturing capability, and the Chinese government's support of the country's EV sector. BYD's shares are not listed in the U.S., but they are traded over-the-counter, so American investors who want to buy the stock would need to choose a broker that supports trading them. Here's how you can invest in rental properties without the responsibility of being a landlord 'The biggest crash in history': Robert Kiyosaki warns that millions of 401(k)s and IRAs will be 'toast' — here's what he likes for protection 'It's not taxed at all': Warren Buffett shares the 'best investment' you can make when battling inflation This article provides information only and should not be construed as advice. It is provided without warranty of any kind. This food habit is linked to a specific type of dementia. Abby Hensel officially tied the knot in 2021, it has been revealed 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida Harry Enten ran the numbers on Trump's dismal fundraising so far.  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Benny Larkin and daughter Taylor Larkin, 14, were boating down Dora Creek, New South Wales, Australia, when they broke down and were approached by a fuming kayaker. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show.  MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president. The not-so-happy campers were stunned by the unexpected guest at their beachside campsite. The concerned shopper raised the alarm with staff at the store. Now, a 'full product inspection' is underway. Trade 24 hours a day on the world's most popular platform. The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The person who wrote on the road has been called a \"top bloke\" by motorists. Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent.  ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ Footage shows Dylan Edwards moved out of the way. Find out more here.  Despite referee Gerard Sutton labelling the collision \"incidental\", Souths superstar Latrell Mitchell has been charged for dangerous contact on Josh Addo-Carr. The ugly incident involving the AFL veteran has sparked debate. More here. An anonymous motorist shared the location to warn others. And it is not the first time motorists have complained about the speed camera set-up in this exact location. "
}