{
    "title": "Tesla (TSLA) Declined as its Core Automotive Segment Remained Under Pressure",
    "date": "2/28/2024",
    "url": "https://www.insidermonkey.com/blog/tesla-tsla-declined-as-its-core-automotive-segment-remained-under-pressure-1266192/",
    "text": "Baron Funds, an investment management company, released its “Baron Partners Fund” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. The fund was up 8.39% (institutional Shares) in the fourth quarter, trailing the Fund’s primary benchmark, the Russell Midcap Growth Index’s 14.55%, and the S&P 500 Index’s 11.69% returns. The Morningstar Large Growth Category Average (the Peer Group) increased 13.83% during the period. In addition, please check the fund’s top five holdings to know its best picks in 2023. Baron Partners Fund featured stocks like Tesla, Inc. (NASDAQ:TSLA) in its Q4 2023 investor letter. Headquartered in Austin, Texas, Tesla, Inc. (NASDAQ:TSLA) designs, develops, manufactures, and sells fully electric vehicles and energy generation and storage systems. On February 27, 2024, Tesla, Inc. (NASDAQ:TSLA) stock closed at $199.73 per share. One-month return of Tesla, Inc. (NASDAQ:TSLA) was 6.64%, and its shares lost 1.50% of their value over the last 52 weeks. Tesla, Inc. (NASDAQ:TSLA) has a market capitalization of $636.098 billion. Baron Partners Fund stated the following regarding Tesla, Inc. (NASDAQ:TSLA) in its fourth quarter 2023 investor letter: “Tesla, Inc. (NASDAQ:TSLA) designs, manufactures, and sells electric vehicles, related software and components, and solar and energy storage products. Tesla’s stock declined slightly in the period because the core automotive segment remained under pressure. A complex macroeconomic environment, higher interest rates, a two-week factory shutdown, and Tesla’s car price reductions throughout the year pressured its near-term growth and margin profile. Nonetheless, Tesla continues to generate sufficient gross profit to support robust product development. Tesla also started to deliver its highly anticipated Cybertruck, its first pickup truck. There has been tremendous consumer interest in the truck and new technologies within the vehicle and its manufacturing lines. Tesla’s refreshed Model 3 also seems to be generating strong demand while improving unit-level economics. We anticipate a new lower priced vehicle being introduced next year to address a much larger market segment. Finally, investors expect Tesla to benefit from its investment in AI through development of autonomous driving technology Dojo (an AI training computer), Autobidder (an automated energy trading platform), and Humanoid (a human-like robot).”  Tesla, Inc. (NASDAQ:TSLA) is not on our list of 30 Most Popular Stocks Among Hedge Funds. At the end of the fourth quarter, Tesla, Inc. (NASDAQ:TSLA) was held by 82 hedge fund portfolios, up from 81 in the previous quarter, according to our database. We discussed Tesla, Inc. (NASDAQ:TSLA) in another article and shared the list of best green stocks to invest in 2024. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors. Suggested Articles: Disclosure: None. This article is originally published at Insider Monkey. NASDAQ:TSLAYahoo FinanceDaily Newsletter Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}