{
    "title": "US auto safety agency upgrades probe into Tesla power steering loss",
    "date": "2/3/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/transport-logistics/us-auto-safety-agency-upgrades-probe-tesla-power-steering",
    "text": "US SAFETY regulators have upgraded their probe into Tesla vehicles over power steering loss to an engineering analysis – a required step before the agency could demand a potential recall. The National Highway Traffic Safety Administration (NHTSA) on Friday (Feb 2) said the investigation covers about 334,000 Model 3 and Model Y vehicles from the 2023 model year. The agency’s upgraded probe follows a December Reuters investigation that found tens of thousands of Tesla owners have experienced premature failures of suspension or steering parts over at least seven years, citing Tesla documents and interviews with customers and former employees. Some drivers reported harrowing tales of sudden power steering outages at speeds that nearly caused accidents. The Tesla documents showed that the automaker sought to blame drivers for frequent failures of suspension and steering parts it has long known were defective. Tesla did not immediately respond to a request for comment on the NHTSA’s upgraded investigation. The NHTSA, which had opened a preliminary evaluation in July into loss of steering control in 280,000 Tesla Model 3 and Y vehicles after 12 drivers reported problems, said it has now identified a total of 2,388 complaints. Some Tesla owners reported an inability to turn the steering wheel while others reported an increase in required effort. Start and end each day with the latest news stories and analyses delivered straight to your inbox. The agency said it had linked one crash to the investigation in which a driver couldn’t complete a right-hand turn at an intersection and struck a vehicle. Tesla and NHTSA jointly inspected the vehicle. Some drivers told NHTSA that the steering issues continued until the power-steering rack was replaced. NHTSA said the probe will examine the conditions leading to and resulting from the steering rack failures. It remained unclear exactly what parts might need recalling or replacing to prevent the steering outages. Tesla has addressed some other issues with remote software fixes. The automaker could face a much more expensive recall if NHTSA requires repairs or replacements of physical parts. Tesla has had nine recalls in the US for steering and suspension issues since 2018, NHTSA records show. Most affected a relatively small number of vehicles. The largest, in 2018, involved replacing steering-rack bolts on more than 70,000 Model S vehicles because of the risk that corrosion could cause a loss of power steering. NHTSA said it is aware of over 50 vehicles allegedly towed as a result of the condition. “A portion of drivers described their steering begin to feel ‘notchy’ or ‘clicky’ either prior to or just after the incident,” NHTSA said. NHTSA’s move comes on the same day Tesla said it was recalling 2.2 million electric vehicles – nearly every one it has sold in the US – because small font sizes on warning lights increased the risk of a crash. No crashes or injuries have been reported. Tesla began releasing an over-the-air software update on Jan 23, free of charge, to fix the issue, the regulator said. The software update will increase the font size of the visual warning indicators for the brake, park and antilock brake system (ABS). Just two months ago, Tesla recalled 2.03 million vehicles in the US to install new safeguards in its Autopilot advanced driver-assistance system. Consumer Reports has said that the new Tesla safeguards are insufficient. “We’re in the process of evaluating the remedy,” acting NHTSA Administrator Sophie Shulman told Reuters last month. Tesla has been under scrutiny for its autonomous driving aid that is intended to enable cars to steer, accelerate and brake automatically within their lane. The latest recall includes vehicles across Tesla’s various models, including the Model S, Model X, 2017-2023 Model 3, Model Y and 2024 Cybertruck vehicles, the NHTSA said. Tesla’s Cybertruck started receiving a software update to fix the issue for the units in production, the report added. REUTERS BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}