{
    "title": "Tesla Has Made $9B in Regulatory Credit Revenue from Other Automakers",
    "date": "2/9/2024",
    "url": "https://driveteslacanada.ca/news/tesla-has-made-9b-in-regulatory-credit-revenue-from-other-automakers/",
    "text": "Tesla continues to benefit from its production of electric vehicles. From 2009, the company has already received almost $9 billion in regulatory credit revenue from other automakers. Tesla continues to profit from automakers around the world that fail to meet emissions standards. The company generated $1.79 billion in regulatory credit revenue last year, according to its annual 10-K report. That brings Tesla’s total revenue since 2009 to nearly $9 billion, according to BNN Bloomberg calculations. Tesla earns tradable credits in the operation of its business under various regulations related to zero-emission vehicles (ZEVs), greenhouse gas, fuel economy, and clean fuel. The company sells these credits to other regulated entities who can use the credits to comply with emission standards and other regulatory requirements. Tesla’s revenue from automotive regulatory credits is directly related to its new vehicle production, sales, and pricing negotiated with its customers. The company monetizes them proactively as new vehicles are sold based on standing arrangements with buyers of such credits, typically as close as possible to the production and delivery of the vehicle or changes in regulation impacting the credits. Selling regulatory credits has been a great business for Tesla so far. The company incurs virtually no additional costs when obtaining credits, so sales represent almost pure profit. Tesla treats this type of revenue as temporary as automakers plan to increase production of electric vehicles in the coming years, so it does not rely heavily on it. However, it appears that selling regulatory credits will still generate revenue for Tesla. Some automakers have slowed down their EV programs or paused development of new EVs. At the same time, countries around the world continue to tighten their requirements. Europe has set stricter vehicle emissions targets starting next year. The UK has adopted a mandate for zero-emission vehicles starting this year. Automakers including Volkswagen and General Motors have failed to meet their electric vehicle goals and have delayed or canceled investments in electric vehicle production. In recent years, VW and GM—as well as Honda Motor and Jaguar Land Rover—have needed help meeting emissions standards. Tesla approved to deploy adaptive headlight feature to Model S and Model X in Europe Tesla tries new pricing strategy in the US, announcing temporary Model Y price cut Lucid has announced significant updates to its 2024 Lucid Air lineup. The changes include lower pricing, changes to customization options, while also discontinuing a number of variants. All of the prices announced by Lucid today […] According to reporting by Electrek, Tesla is working to shift their retail strategy away from ‘showrooms in fancy malls’. Instead, Tesla is focusing on cheaper locations, remote orders and delivery centres. As Tesla is not […] Rivian started delivering the R1T electric pickup truck last year. The American company has now begun fulfilling pre-orders for its second EV, the R1S SUV, as reported on Rivian Forum. The first delivery to a non-employee […] Enter your email address to subscribe to Drive Tesla and receive notifications of new articles by email. Email Address Subscribe "
}