{
    "title": "Gene Munster: Thanks to his Twitter purchase, Elon Musk’s xAI will rival \nTesla and SpaceX as his greatest source of wealth creation",
    "date": "2/22/2024",
    "url": "https://macdailynews.com/2024/02/22/gene-munster-thanks-to-his-twitter-purchase-elon-musks-xai-will-rival-tesla-and-spacex-as-his-greatest-source-of-wealth-creation/",
    "text": "Update font size. Reset Elon Musk\nLongtime tech analyst, Deepwater Assest Management’s Gene Munster, says that Gene Munster: Elon Musk’s xAI will rival Tesla and SpaceX as his greatest source of wealth creation with a decade, thanks to his purchase of Twitter. Gene Munster via X:\n ‎ It’s getting more clear. @elonmusk is 80% genius, 20% master of good luck. In a decade, his purchase of Twitter will power #XAI to rival $TSLA and #SpaceX as his greatest source of wealth creation. The reason is Twitter’s data is powerful (best source of real time intention), and he’ll use the data to train xAI to be a top three Foundation Model. Those models should be valued in the hundreds of billions of dollars.  Bloomberg estimates his current net worth at around $210B. ‎\nMacDailyNews Take: Generative AI is only as good as what it’s trained on – Garbage In, Garbage Out – so, Twitter becomes a tremendous asset (much more so than a mostly ad-supported, trying-to-sell-subscriptions social network) simply for its wealth of data thanks to a continuous stream of free speech inputted for free from myriad, uncensored sources. Apple, too, thanks to its more than 2.2 billion active devices, could also be a source of very valuable data upon which to train AI.\n ‎\nPlease help support MacDailyNews. Click or tap here to support our independent tech blog. Thank you! Support MacDailyNews at no extra cost to you by using this link to shop at Amazon. With Twitter as its source, it’s guaranteed garbage out. I trust the guy who is worth 200 billion and was willing to buy Twitter for billions for this data stream over the loser brigades I trust the guy who advocates for true-free-speech, in contrast to the previous that collaborated with the govt to present ONLY speech that fit with their narrative.  Besides, if the article pans out, he bought a dying ship that will not only survive, but prevail.  Culture = better.  Biz = prosperous. Tell us you don’t know how X works without telling us you don’t know how X works. Typical libturd stupidity on display Reminder: Liberal + shit for brains = libturd DOJ: Biden is too senile to prosecute for corruption and treason Liburds: It’s OK the let the lying, corrupt, racist, pedophile dementia patient continue as a puppet in the White House. Having a dementia patient running the government shows us just how little we need the government and how fucking stupid libturds are. ======== Libturd stupidity has caused:\n-Lying, corrupt, racist, pedophile, dementia patient and whore installed in the White House\n–complete unquailed VP who is unable to form a single sentence\n-two completely unqualified judges on the Supreme Court place there because of their race and sex instead of qualifications.\n-Burning cities\n-Occupy movement\n-Doubled gas prices\n-Gas pipeline shut down\n-US emergency oil stockpiles drop to lowest level since 1983\n-Unaffordable healthcare insurance\n-Legalization of marijuana\n-Baby killing\n-Wants to ban gas stoves to save children but has no problem killing unborn children\n-Destroyed economy\n-Crashed stock market\n-Upcoming recession\n-Highest inflation in 40 years\n-Weaponized IRS\n-Destroyed school system\n-Open border crisis\n-Illegal aliens getting drivers licenses\n-Illegal aliens getting free medical insurance\n-Illegal aliens getting tax-payer money\n– National Guard pay delayed after congress celebrates itself for spending $1.7 Trillion\n-Trading a useless, athlete for a notorious arms dealer (Merchant of Death), while leaving behind a USMC veteran, because she is an anti-American, black lezbo.\n-Releasing a notorious arms dealer (Merchant of Death) while trying to deprive Americans the right to defend themselves with gun control so we can protect ourselves from violent libturds\n-Red flag laws\n-Voter fraud enabling\n-No voter ID\n-Illegals allow to vote\n-Illegals given drivers licenses\n-Labeling all non-libturds as domestic terrorists\n-Labeling all non-libturds as racist\n-“Extremists” used to be real terrorists, now it people who want to secure the border or keep pornography out of elementary schools\n-Electric car mandates during electric crisis\n-Woke bullshit\n-“Identify as” bullshit\n-“Inclusion” but only what libturds want to include\n-Kneeling for National Anthem\n-Woke hirings preferred over actual competence\n-Obese, mentally ill person installed as head of health\n-Mentally ill, genderfluid ‘puppy’ thief installed at Department of Energy\n-Jill Biden gives biological male “Women of Courage” award\n-320 genders\n-It/that, them/they, and WTF pronouns\n-Misgendering bullshit\n-Epstein client list hidden\n-Russia collusion bullshit\n-Destruction of free speech\n-Transgender perversion forced on children\n-Drag queen story hours\n-Boys in the girls’ bathrooms.\n-Tampon dispensers in the men’s room\n-Boys in girls’ sports\n-Mentally ill man pretending to be a woman on a beer can\n-Mentally ill man being a model for women’s underwear-\n-Cancel culture in the name of “tolerance”\n-Not OK for a child to pretend to be an Indian for a game, but OK for a man to pretend to be a woman in real life\n-Men can get pregnant\n-Record underemployment\n-Defund police\n-Soft on crime policies\n-Zero bail laws\n-Record high crime\n-Obese, ugly men winning female beauty pageants\n-Food shortages\n-Corruption of Legislators\n-Corruption of Judges\n-Corrupt FBI\n-Corrupt CIA\n-Corrupt media\n-Corrupt social media\n-Acceptance of Socialism and rejection of Capitalism\n-Election and reelection of incredibly stupid, mentally unfit politicians: AOC, racist Omar, We have to pass it to find out what in it, Pelosi, Guam will tip over Hank Johnson, brain damaged Fetterman, Dementia Joe—just to name a few.\n-Ukraine gets: $200 billion, Congress gets: 41% pay increase, Taliban gets: $85 billion, Iran gets: $200 billion, American get: $7 eggs, $4 gas, 50% increase on electricity, free crack pipes, open\nborders, fentanyl crisis, toxic spills -The list goes on and on and on and on and on and on and on and on and on and… And you are so fucking stupid that you think you are the smart ones! You want to start a revolution, but you can’t even start a lawnmower. The next civil war will be fought between Americans and libturds. One side has 300 million firearms and trillions of rounds of ammunition, the other has strap-on dildos and toilet plungers. Fuck Joe Biden. Fuck libturds PS DOWNVOTING THIS DOES NOT MAKE IT LESS TRUE, IT JUST MAKES YOU MORE STUPID Dude, your post makes us all more stupider. You just proved yet again that you are too fucking stupid to know how fucking stupid you are. Thanks for playing, dudette. disposableidentity, do you remember how much better this country was when people as stupid as you were locked away in mental institutions? Elon needs to ensure that xAI is woke free or fail miserably like Google Gemini. This site uses Akismet to reduce spam. Learn how your comment data is processed. “Ted Lasso” star and writer Brett Goldstein is set to appear in a guest star role in “Shrinking” Season 2 at Apple TV+… Apple’s M3 Ultra chip may be designed as a unique standalone chip, rather than two M3 Max chips joined together as in the M1 Ultra and… Alphabet subsidiary Google’s Android website has added a new landing page for Google Messages which touts that RCS on Apple’s iPhone… Sunshine is launching a new AI product, Shine. The product offers a photo-sharing app and an events website. Co-founder Marissa Mayer tells… Apple filed a lawsuit earlier this month against former software engineer Andrew Aude, alleging he leaked info about products he hated… Enter your email address to follow MacDailyNews and receive notifications of new posts by email. Email Address Follow :-) "
}