{
    "title": "This Won't Help Elon Musk or Tesla's Stock Price",
    "date": "2/16/2024",
    "url": "https://moneymorning.com/2024/02/16/this-wont-help-elon-musk-or-teslas-stock-price/",
    "text": "By Chris Johnson,  Quantitative Specialist, Money Morning • February 16, 2024 It’s been a rough couple of months for Elon Musk and his flagship company, Tesla (TSLA). A bad earnings report… a judgement regarding his compensation that went against him… rumors from Tesla’s Board about drug use. And now, the CEO of GM (GM) joins Ford (F)’s CEO in telling the market that Tesla is all but dead. This morning’s comments come from Jim Farley, who is urging Wall Street to forget about Tesla as the future of the auto industry. His comments come two weeks after Mary Barra suggested that Ford’s renewed push into hybrid vehicles would weaken Tesla. Let’s clear something up right here. Tesla isn’t going out of business. We all know that. Historically, you’ve lost money if you tried to short Tesla stock. But things have changed, and those Tesla shares are set to go lower over the next few months as the company tries to get things back on the right track. What is going to happen is that Tesla is going to need to make some changes to begin competing against a growing number of companies that are coming for their market share. The company will soon see several activist investors knocking on the door of Tesla’s board room. That will be the first sign that positive changes are coming to put Tesla back on track. The latest ruling on Elon’s pay has cracked the door for a number of these activists to start working on access to the board to effect some change, but Mr. Musk has been very pointed in his efforts to ensure his “voice” is not diluted. How does all this jockeying for position affect the stock? A few weeks ago, we talked about my warning that shares were heading to $180. They hit that target and have now seen a “dead cat bounce” take them back to $200. This is the battleground for stocks. A break back below $200 will target $150, which is the site of the stock’s 2023 lows. This is where I start becoming interested in the stock as a long-term buyer. (Click to enlarge) Until then, I remain a bull on Ford as the company is moving quickly to start operating in Tesla’s market with their newish Hybrid vehicles in 2024. If you’ve been waiting for an opportunity to buy Tesla at lower prices, you can afford to be patient for now. Elon Musk’s tendencies are to cause a “flash” in the company pan after an earnings quarter like Tesla posted last month, but the market has caught-up with his P.T.-Barnum-styled tactics and will want more than announcements and “flare” before the real recovery begins. By submitting your email address, you will receive a free subscription to Money Morning and occasional special offers from us and our affiliates. You can unsubscribe at any time and we encourage you to read more about our Privacy Policy. About the Author Chris Johnson (“CJ”), a seasoned equity and options analyst with nearly 30 years of experience, is celebrated for his quantitative expertise in quantifying investors’ sentiment to navigate Wall Street with a deeply rooted technical and contrarian trading style. … Read full bio Money Morning gives you access to a team of market experts with more than 250 years of combined investing experience – for free. Our experts – who have appeared on FOXBusiness, CNBC, NPR, and BloombergTV – deliver daily investing tips and stock picks, provide analysis with actions to take, and answer your biggest market questions. Our goal is to help our millions of e-newsletter subscribers and Moneymorning.com visitors become smarter, more confident investors. © 2024 Money Morning All Rights Reserved. Protected by copyright of the United States and international treaties. Any reproduction, copying, or redistribution (electronic or otherwise, including the world wide web), of content from this webpage, in whole or in part, is strictly prohibited without the express written permission of Money Morning. Address: 1125 N Charles St. | Baltimore, MD, 21201 | USA | Phone: 888.384.8339 | Disclaimer | Sitemap | Privacy Policy | Whitelist Us | Do Not Sell or Share My Personal Information "
}