{
    "title": "Tesla's board needs to keep Elon Musk's buy in: Analyst",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/video/teslas-board-needs-keep-elon-024608158.html",
    "text": "Oppenheimer Managing Director and Senior Research Analyst Colin Rusch joined Yahoo Finance Live to discuss Tesla's (TSLA) stock drop amid turmoil surrounding CEO Elon Musk's conduct and pay package. Rusch says he tries not to focus on the \"noise about Elon's personal life,\" but instead on Tesla's technology performance and position. However, he notes higher inflation \"coupled with\" EV concerns has caused \"natural growing pains\" in a transitional space. While Musk brought \"ambition and vision\" to Tesla, Rusch says the company is attracting \"top talent\" to tackle complex engineering challenges. Though Musk does \"set the agenda,\" Rusch emphasizes Tesla is not dependent on \"a single person.\" When it comes to questions about the board's independence, Rusch says it's \"hard to say\" whether it's independent enough. Rusch argues that it's \"critical\" that the board keep Musk's \"attention and buy in to the organization.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith JULIE HYMAN: Let's talk about Tesla once again. Those shares sliding today. And top-trending ticker on Yahoo Finance, German software firm SAP reportedly will no longer get electric cars from the automaker. Piper Sandler cutting its stock price target on lower delivery expectations this year. And really, there is the backdrop here and sort of the changing sentiment around Tesla. The stock is down more than 20%, really more than 25% to start the year, with issues and questions around Elon Musk's leadership. For more on the future of Tesla and its CEO, we're bringing in Colin Rusch, Oppenheimer Managing Director and Senior Research Analyst. Colin, we've had this discussion before. And here we are again as we get more press. Last week, of course, a Delaware court throwing out Musk's pay package. Stories in the Wall Street Journal over the weekend questioning the independence of the board and the pressure that they reportedly feel to do drugs with Elon Musk. I mean, as somebody who follows this stock, what do you even make of all of that? COLIN RUSCH: you know, we try not to make too much of it. There's been a lot of noise about Elon's personal life. And we really try to focus on what's happening with the company from a technology perspective, a product perspective, and the broader market. And the backdrop that you refer to I think is challenging. We have higher rates, you know, persisting here. And we saw that sentiment today coupled with some noise around some of the fundamentals on EVs. And I think the disruption of the auto market is going through the difficult phase. It's easy to get through some early adopters and get some real momentum. But now, we're like fundamentally changing from internal combustion engines into electrified powertrains. And that's a much harder process to go through. And we think this is just a natural growing pains of a market that's very much in transition. JOSH LIPTON: And let me get your take on this. Listen, I get it, as a financial analyst, you're focused on the business. And you know this business and this C-suite as well as anybody. One question I did have though regarding these headlines that dropped on Elon Musk, and I do-- you know, I think it's a question investors have is there is this view out there, Colin, that Tesla is Musk and Musk is Tesla. That he is simply just unlike a lot of CEOs, that he is just foundational to where this company is and where it is headed. What's your take on that? COLIN RUSCH: Yeah, I think there's a lot of truth to that. I mean, one of the things that he's brought to the table for this organization is just ambition and, you know, and vision. And that's still I think remains the case. But the bench strength of the organization is exceptional. We continue to see this as an organization that's attracting the top talent from a technology perspective and, really, working on some of the most challenging, interesting problems in the world for engineers. And I think that's a compelling value proposition for a lot of executives and a lot of engineers that are coming out of school or want a new challenge in their careers. You know, and so that I think is an important piece of this is that this is not a single person driving this organization. But he does set the agenda. And he does have the authority to push people very, very hard to move towards doing difficult things and changing markets and changing the technology landscape. So he is an important figure, not only for the organization, but for these end markets. And I think his viability as a CEO is important. And so these pay packages, I think, are ultimately pretty critical to keep him engaged and keep the organization focused on the things that shareholders want and having his buy in to that. JULIE HYMAN: Do you think that the Board of Tesla is independent enough? COLIN RUSCH: That's hard to say. In all honesty, you know, the board has been very much bought into Elon as a leader. And how they keep that buy-in for him on a personal basis is a little unclear to me. These reports in various papers around what happens in his personal life and how those relationships get managed, it's hard to double check the truth on those things. And they could be hearsay. They could be one-offs. And there's also just a lot of noise around Elon himself just as a personality. And so that independence I think has been a very-- been a very gentle line that everyone's watching here. But I think keeping his attention and buying into the organization is something that's critical. And how they do that is a little unsure. JULIE HYMAN: What's the difference between buy-in and blackmail? You know, like what's where's the line between-- you know what I mean? Like you have-- like, you're competing-- he's got all these different business entities. Oh, we have to give him this enormous pay package, so he doesn't take his attention to something else or take some of the technology from Tesla to something else. I mean, I don't know. Does that make-- COLIN RUSCH: I mean, Blackmail is a pretty aggressive term here, right? I mean, leverage and negotiations and relationship management are something-- you know, my clear sense is that this organization is his baby and his core focus and is critical to all the things that he does. And so for him to wander off from an attention perspective seems unrealistic to me. You know, I think the pay package and the alignment of interest remains, I think, critical. But I think if Elon stepped away from Tesla, like it would be as damaging to him as it would be to the organization. JOSH LIPTON: Colin, I want to get you out of here on this. Right now, you rate the stock at perform. Colin, what would you need to see to get more bullish on Tesla? COLIN RUSCH: We really need to see margins bottom out here. We need to see them slow down any sort of price declines so that the margins start moving higher and what we've seen in other markets, whether it's solar LEDs, even in batteries, is that the going through the rationalization and the disruption of those markets can be really challenging from a price perspective and a margin perspective. And I think as when you feed the competitive landscape evolve, what I want to see with Tesla is really some real stable gross margin, so we can see growth from there. The second thing that we really want to see is evolution of the FSD technology and real adoption. We're still going through a pretty fluid environment around the regulatory backdrop. And as we get clarity on that, I think we'll have a better sense of how well this technology performs and their ability to monetize it. What we heard from them last quarter is that they went through a full re-architecture of the software, which is substantial. And that will take time to settle in and what the benefits of that will become clearer over the next several quarters or a couple of years. But we want to see all of that technology get implemented and really a more stable subscription base for the company to really drive some that recurring. JULIE HYMAN: Colin, it's great to catch up with you as always on Tesla. Thank you. Appreciate it. COLIN RUSCH: Thank you. Related Quotes "
}