{
    "title": "Elon Musk's Tesla board needs 'new blood' to move to Texas, expert says",
    "date": "2/21/2024",
    "url": "https://qz.com/elon-musk-tesla-board-delaware-texas-1851275483",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters After a Delaware judge shot down Elon Musk’s $56 billion compensation plan late last month, the Tesla CEO said his EV company would “immediately” move to hold a shareholder vote on reincorporating the automaker in Texas. But three weeks later, Tesla appears no closer to leaving Delaware — and with good reason. The central argument of the shareholder lawsuit filed against Tesla in Delaware’s Court of Chancery was that the electric vehicle maker’s board of directors is too close to Musk. Judge Kathaleen McCormick, who presided over the case, voided his performance-based compensation plan because of a lack of transparency from the company’s board. “Musk operates as if free of board oversight,” the judge said in her ruling. That decision, legally speaking, leaves Tesla’s board in a sticky situation,  Case Western Reserve University School of Law professor Anat Alon-Beck told Yahoo Finance. Without new independent directors, a shareholder vote on Tesla’s reincorporation could be nixed over the same type of claims that invalidated Musk’s compensation deal, she said. “The first thing is they need to appoint new directors,” Alon-Beck said. “You need new blood.” The board’s chair, Robyn Denholm, has faced growing scrutiny since McCormick’s decision. The judge described Denholm’s approach to her oversight obligations as “lackadaisical.” Adding to Tesla’s worries are reports showing Musk’s sway over the board, including pushing members to consume drugs with him. The Wall Street Journal reported earlier this year that Musk — who has been locked in a close race with Jeff Bezos and Bernard Arnault for the title of richest person in the world — is an occasional user of cocaine, ecstasy, LSD, and mushrooms, among other drugs. Musk has denied that. “They really need to get rid of three or four board members and replace them with truly independent board members that have no financial ties to Elon,” Tesla shareholder Ross Gerber told CNBC earlier this month. “It’s going to be very hard for the company to move forward with the current board.” Despite Tesla’s lack of public movement toward reincorporating in Texas, another of Musk’s companies has already done so. Musk announced last week that SpaceX, his aerospace company, had officially moved to Texas. “SpaceX has moved its state of incorporation from Delaware to Texas!,” Musk wrote in a post on X, the social media platform he owns. “If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible.” Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}