{
    "title": "'I really need to be paid': Tesla canceled large pie order at last minute, \nsmall business owner says",
    "date": "2/23/2024",
    "url": "https://news.yahoo.com/really-paid-tesla-canceled-large-235230793.html",
    "text": "SAN JOSE, Calif. (KRON) – A small business owner in Northern California says her pie shop is out thousands of dollars after Tesla unexpectedly canceled an order for thousands of mini pies. Voahangy Rasetarinera owns Giving Pies​ in San Jose’s Willow Glen neighborhood. Each pie is carefully assembled by hand in small batches. Despite that, the bakery has managed to put together orders for large corporations, like Apple, Google and Intuit. On Valentine’s Day, the bakery got a last-minute order request from Tesla – 2,000 pies, half to be delivered on Tuesday, the other half on Thursday. Rasetarinera said she agreed. But then the waiting game began for Tesla to pay. Reward offered to catch Gilroy homicide victim’s killer After not hearing from her contact, Rasetarinera says she reached out again and sent the invoice multiple times to multiple people. Finally, at 9 p.m. Thursday night, she got a call from Tesla. The company apologized for the delayed payment and asked to double the order to 4,000 pies. “So I contacted my staff and they’re like ‘Yes, we can work on Saturday, on Sunday, on Monday. We can get it done. No problem,’” Rasetarinera recalls. She says she sent Tesla a revised invoice and still did not receive a payment. She contacted them multiple times and finally got a response by text. “Sorry to bother you again, but I’m a small business. I don’t have the luxury of infinite resources so I really need to be paid so I can secure my staff. I received a message back that was like ‘Hey, so sorry, I don’t think we’re going to need this order anymore,’” Rasetarinera said. Rasetarinera had turned down other orders and already purchased resources like ingredients, boxes and stickers. After she posted about it on social media, she says Tesla saw it and reached out. “They said they wanted to make it right by me and they offered for me to do two events on March 6 and 7, but I’m still waiting for confirmation,”  she said. “If they want to make it right, I’m going to give them the opportunity to make it right.” KRON4 reached out to Tesla for comment, but as of Thursday night, they have not responded. For the latest news, weather, sports, and streaming video, head to PIX11. "
}