{
    "title": "PINS, AFRM, NET, CLSK, TSLA: Top 5 Trending Stocks Today - Affirm Holdings \n(NASDAQ:AFRM)",
    "date": "2/8/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37024088/pinterest-affirm-holdings-cloudflare-cleanspark-tesla-why-these-5-stocks-are-on-investors-radars",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW U.S. stocks ended Thursday in positive territory with the Dow Jones Industrial Average up 0.1% at 38,726.33 and the S&P 500 edging higher by 0.06% to 4,997.71. The Nasdaq rose 0.2% to 15,793.72 for the day. These are the top stocks that gained the attention of retail traders and investors throughout the day: Pinterest Inc PINS closed down 0.27% at $40.72, with an intraday high of $41.27 and a low of $40.15. The company reported fourth-quarter revenue of $981 million, a 12% increase year-over-year but slightly below the consensus estimate of $989.53 million. Pinterest’s adjusted earnings per share reached 53 cents, surpassing analyst expectations of 51 cents. Global monthly active users surged to an all-time high of 498 million, up 11% year-over-year. Affirm Holdings Inc AFRM saw an increase of 10.33%, closing at $49.22. The stock reached a high of $49.74 and a low of $45.02 during the day. Affirm reported fiscal second-quarter revenue increased 48% year-over-year to $591.1 million, beating the consensus estimate. The company reported a loss of 54 cents per share, better than analyst estimates for a loss of 72 cents per share. Cloudflare Inc NET ended the day up 8.35%, at $90.31, after hitting a high of $91.08 and a low of $82.90. Cloudflare reported fourth-quarter revenue of $362.47 million, beating estimates, with earnings per share at 15 cents. Revenues were up 32% on a year-over-year basis, with significant progress in the public sector and growth in Cloudflare One. CleanSpark, Inc. CLSK experienced a surge of 12.78%, closing at $10.50. The stock’s high for the day was $10.54, with a low of $9.53. CleanSpark announced the acquisition of three turnkey Bitcoin BTC/USD mining facilities in Mississippi, expecting to close the purchase within 21 days. CleanSpark mined 577 bitcoin in January, with shares gaining more than 20% over the past five days. Tesla Inc TSLA saw a modest increase of 1.06%, closing at $189.56. The stock reached a high of $191.62 and a low of $185.58 during the day. An analyst outlined plans for improving sentiment around the stock, including a potential move of incorporation from Delaware to Texas, aiming to resolve uncertainties and bolster its market position. Photo by Pixels Hunter on Shutterstock Prepare for the day's trading with top premarket movers and news by Benzinga. Engineered by Benzinga Neuro, Edited by \nShivdeep Dhaliwal The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}