{
    "title": "A Tesla Cybertruck was resold for more than twice its price",
    "date": "3/20/2024",
    "url": "https://ca.news.yahoo.com/tesla-cybertruck-resold-more-twice-161353577.html",
    "text": "A Cybertruck that was priced by Tesla at $102,000 was resold for $244,500 on Wednesday. Tesla has a $50,000 resale clause for its Foundation series Cybertruck. GiveMeTheVin owner said he's had dozens of Cybertruck owners reach out looking to sell their trucks. Cybertruck owners have already begun flipping their electric pickup trucks and some have turned a hefty profit. A Foundation series Cybertruck was sold at an auction for $244,500 on Wednesday — over $130,000 more than its sticker price. The vehicle was bought by a Porsche dealer in a wholesale auction on Cox Automotive's Manheim auction platform in Dallas, Texas. It's unclear what the dealership plans to do with the vehicle, and a spokesperson for Porsche of South Orlando declined to comment on the sale. Elon Musk poked fun at Porsche during the Cybertruck's delivery event earlier this year when he showed a video of the Cybertruck appearing to best a Porsche 911 in a race, while also towing a Porsche 911. John Clay Wolfe, owner and founder of the car-selling site Give Me The Vin, said his company bought the Cybertruck for $200,000 on Monday from a reservation holder and had previously resold a different Cybertruck directly to a dealer for $220,000. Since Tesla started deliveries of the Cybertruck on November 30, Give Me The Vin has received dozens of offers from Cybertruck owners, Wolfe said. But, many prospective sellers have been wary of Tesla's $50,000 resale clause. \"We've had people accept our offer and then just completely flake out,\" Wolfe said. \"They start second-guessing the fine, they worry they might get black-balled by Tesla. There's some real fear there.\" Last year, Tesla added a $50,000 resale fee to its Cybertruck order terms and conditions sheet, but deleted the clause in the sales agreement a few days later. The carmaker later added the clause to the order agreement for reservation-holders looking to buy its Foundation series version of the truck, saying that those who attempted to resell the vehicle within a year of purchase would face a $50,000 penalty or pay \"the value received as consideration for the sale or transfer, whichever is greater.\" Wolfe said he's gotten more reach-outs from Cybertruck owners since pictures from the auction started circulating on social media. Wolfe said his company typically tries to keep its sales relatively private, but decided to post a video from the auction after people began posting screenshots from the auction online. View this post on Instagram A post shared by The John Clay Wolfe Show (@johnclaywolfeshow) \"At the end of the day, all we did is make his product more desirable and worth more money,\" Wolfe said, adding that GiveMeTheVin was also one of the first to resell the Humer EV and Rolls Royce Spectre when they came out. It's not the first time Tesla owners have attempted to flip their cars. In 2022, some Tesla owners made up to $7,000 reselling their EVs. However, the resale market has been difficult for Tesla owners in recent years due to the company's recent series of price cuts. Do you own a Tesla or have insight to share reach out to the reporter via a non-work email and device at gkay@insider.com Read the original article on Business Insider While different people have different needs for their cars -- some might want family-friendly vehicles while others may want sporty, fun rides -- everyone has the same basic metrics for satisfaction.... Buying a car can feel like walking through a minefield of shady sales tactics. Some deceitful dealerships have long employed a bag of tricks to nickel-and-dime consumers out of their hard-earned cash.... 褪黑激素已經使用了幾十年，因為它能夠幫助人們更快入睡並保持更長的睡眠時間。 現在，一種新的高品質褪黑激素正在展現出更大的前景。 Hybrids offer some of the best fuel economy you can get in a vehicle. This means more savings for you. Even if the initial sticker price is higher than what you'd find with a gas-powered car, the fuel... Passengers traveling on a Boeing jet from San Francisco to Paris made an emergency stop in Denver Thursday after the crew reported an engine problem. The largest crane on the East Coast will soon try to lift the treacherous, colossal wreckage that has hampered search crews from finding victims of this week’s catastrophic Baltimore bridge collapse.  BALTIMORE (AP) — A crane that can lift 1,000 tons, described as one of the largest on the Eastern Seaboard, appeared near the site of a collapsed highway bridge in Baltimore as crews prepared Friday to begin clearing wreckage that has stymied the search for four workers missing and presumed dead and blocked ships from entering or leaving the city's vital port. Maryland Gov. Wes Moore called the Francis Scott Key Bridge's collapse following a freighter collision an “economic catastrophe\" and desc Seven people were taken to a New York hospital for observation after experiencing severe turbulence on a United Airlines flight, according to a local EMS chief. A dog who escaped while being loaded onto a plane in North Carolina was reunited with his owner after an extensive search.  DETROIT (AP) — U.S. auto safety regulators are investigating complaints that more than 540,000 Ford pickup trucks can abruptly downshift to a lower gear and increase the risk of a crash. The National Highway Traffic Safety Administration says in documents posted on its website Friday that it opened the investigation this week after receiving 86 consumer complaints about the problem with the trucks' automatic transmissions. Investigation documents say the probe covers F-150s from the 2014 model y MONTREAL — Quebec's police watchdog says it is investigating the deaths of two men in Montreal who were fleeing from police when their vehicle struck a tree Thursday morning. The crash northeast of downtown happened shortly after two nearby drive-by shootings, which injured one man. The watchdog agency, the Bureau des enquêtes indépendantes, said a Montreal police officer was responding to a 911 call reporting gunshots and dangerous driving shortly after 5:30 a.m. \"The officer reportedly spotted Forty-five people were injured, five of them critically, when a train crashed into the side of a bus at a rail crossing in northwestern Cambodia Friday, police said.  Gen. Sar Theng, the police chief for Pursat province, said the crash in Krakor district occurred around 11 a.m. when the bus attempted to cross the tracks even though the oncoming train had loudly sounded its horn as it approached.  Sar Theng said there used to be a barrier at the crossing but it had broken and had not yet been replaced.  Though not the biggest New York International Auto Show, there were still some exciting reveals and even a surprise or two. We pick the best of show. William Li — the CEO of Chinese EV company Nio and often called the Elon Musk of China — grew up on a dairy farm before becoming an entrepreneur. The once-hot hatchback is now a complete dog…  Stealing an EV comes with some unique risks. The “black swan” allision between the container ship MV Dali and the Francis Scott Key Bridge in Baltimore on Tuesday has prompted questions about global shipping processes and emphasizes the need for better maritime infrastructure, writes Salvatore R. Mercogliano. The EPA’s new pollution rules for heavy-duty vehicles push the industry toward zero-emission technology.  Volkswagen built the first example of the original Golf on March 29, 1974, and the company has made about 37 million units of the Golf since. After a yearlong closure, a bridge over the Puyallup River reopened in 2019 with a sturdy new span and a brand new name. It even won a national award. But today, the Fishing Wars Memorial Bridge is closed again after federal officials raised concerns about a vintage section of the nearly century-old bridge that carried about 15,000 vehicles a day. It has no timetable to reopen because the city of Tacoma, Washington, first must raise millions of dollars to clean and inspect it. “It’s frustrating A motorcycle accident on Sunday afternoon left one person dead and another in critical condition. The single-vehicle crash occurred on Highway 16, near the truck scales about one kilometer east of the Tete Jaune junction. According to the North District of the B.C. RCMP, Valemount RCMP responded to the crash at 4:16 p.m. Of the two passengers on the motorcycle, one was pronounced dead at the scene while the other was rushed to the hospital. An investigation into the crash is ongoing and a cause "
}