{
    "title": "Tesla solar panels will power $12.75M Nevada home",
    "date": "3/19/2024",
    "url": "https://www.reviewjournal.com/business/energy/tesla-solar-panels-will-power-12-75m-nevada-home-3019729/",
    "text": "The multimillion-dollar home will feature a “Batcave” style garage in addition to the Tesla solar roof system, the listing agent said. A luxury home in Northern Nevada is installing Tesla’s solar roof system to help provide power. The 7,100-square-foot residence with five bedrooms and six bathrooms is located in the Clear Creek Tahoe community just south of Carson City in Douglas County. The price tag for the home is $12.75 million. The Tesla solar roof system is made up of tiles that capture energy from the sun and batteries that can store the energy obtained during the day for use at night. Having batteries to store excess solar energy is ideal for most homeowners, said Omri Suissa, the CEO of Whisper Homes, the developer of the house. “When you come back home, you use a lot of appliances at the same time, and this is when the batteries are really helpful,” Suissa said. “During the day, the tiles charge the batteries, and then when you come home at night, there is no more sun, so those batteries are helping with the energy.” The solar roof system can provide about 15.9 kilowatts of energy, which covers typical energy uses, but the home probably would still need to be connected to the grid for heavy energy use or if solar energy isn’t abundant on a given day, Suissa said. Roofing for the system costs over $200,000 to install but could provide some savings in the long run, as it can be eligible for around $70,000 in tax credits. The size of the home and its Tesla solar roof system aren’t the only things justifying the $12.75 million price tag. It also has a subterranean “Batcave” six-car garage, said the listing agent, Mike Dunn of Chase International Luxury Real Estate. He also said the home has a pool and hot tub, a home office, two master suites, a game room that can be turned into a golf simulator and an outdoor kitchen. Suissa said this isn’t the first house where Whisper Homes has installed a Tesla solar roof system, but it is the first spec house the company has developed with this system. Whisper decided to place this Tesla roof system on the home because it is committed to making its homes energy-efficient and sustainable, he said. Construction of the home is expected to be finished by the end of the year. If someone is interested in buying the house now, there is still enough time to have input on the finishing touches, Suissa said. Contact Sean Hemmersmeier at shemmersmeier@reviewjournal.com. Follow @seanhemmers34 on X. Because of federal investments in building charging stations across the country, a cross-Nevada road trip could become more feasible in the right electric vehicle. Nevada Assemblyman Howard Watts and two green energy experts are calling on a federal agency to update energy codes for the construction of new apartments and homes across the country. The agency needs more time to evaluate impacts to the sage-grouse, which relies on the distinct sagebrush habitat. Southwest Gas says it will continue to decrease its fuel cost rates, but it doesn’t mean all rates in a customer’s bill will decrease in 2024. Even as the PUC approved $1.5 billion for Sierra Solar, the commission put guardrails on the project, which NV Energy has said it would develop itself instead of relying on a third party. The massive Greenlink Nevada transmission project is coming in over budget and could cost $2.9 billion to develop as construction costs have increased in recent years. The average Southwest Gas bill for January rose 50 percent from a year earlier. The utility says several factors are to blame. NV Energy customers will be paying for the utility’s employee bonuses, despite concerns raised by the state consumer advocate that the level of bonuses are higher than what was earned. A joint request from Station Casinos and NV Energy asking for lower energy rates lists some projects can could be constructed next. Cold temperatures are keeping gasoline prices low this week, but West Coast drivers could could see gas prices tick upward sooner rather than later. Las Vegas News Raiders News Las Vegas Sphere Oakland A's Move Las Vegas Casinos Las Vegas Crime Las Vegas Shows Sports Betting F1 Las Vegas Las Vegas Restaurants Lake Mead Las Vegas Weather Copyright © 2019 Las Vegas Review-Journal, Inc. | Privacy Policy | Terms of Service Powered by WordPress.com VIP "
}