{
    "title": "Tesla's Supercharger Network Continues to Secure Partnerships, But \nCompetition Is Coming",
    "date": "3/1/2024",
    "url": "https://finance.yahoo.com/news/teslas-supercharger-network-continues-secure-153125077.html",
    "text": "It's no secret that Tesla Inc. is the cream of the electric vehicle (EV) industry crop. And that doesn't just hold true with its vehicles. The company is also known for its growing Supercharger network. While Tesla continues to secure partnerships for the future, there are a handful of startups looking to disrupt the industry. For example, Dunamis Charge is addressing affordability and accessibility barriers to EV adoption in urban communities. The startup and others are playing catchup, but with a niche approach, there's plenty of market share to go around. BP plc is making significant strides in the electric vehicle charging sector with a $100 million purchase of Supercharger hardware from Tesla. The groundbreaking deal marks the first instance of Tesla’s DC fast-charging equipment being acquired for use in a third-party charging network. The purchase is intended for BP’s EV charging business BP Pulse, which is investing up to $1 billion to develop a nationwide charging network by 2030. The Tesla Superchargers, capable of charging at up to 250kW, are equipped with a Magic Dock connector. This allows compatibility with the standardized North American Charging Standard (NACS) plug from Tesla and a CCS Combo attachment that supports most other EV models. BP Pulse’s expansion plans include installing these chargers starting in 2024 across various locations, such as TravelCenters of America, Thorntons, Ampm, Amoco as well as third-party locations like Hertz rental car sites. Key cities like Houston, Phoenix, Los Angeles, Chicago and Washington, D.C., are slated for the initial rollout. With over 27,000 charging stalls already installed, BP Pulse aims to increase this number to over 100,000 globally by 2030. In a related development, Ford Motor Co. announced plans to incorporate more of Tesla’s Superchargers into its electric-vehicle charging network, exceeding previous forecasts. Ford will add over 15,000 Tesla Superchargers to its network, an increase from an earlier projection of 12,000. This expansion is part of Ford’s strategy to grow its BlueOval Charge Network in North America by 25%, bringing the total to over 106,000 chargers. Ford’s integration of the chargers is seen as a positive move for EV owners, who have long considered the availability of charging stations a major barrier to EV adoption. Ford has also partnered with three new charging providers — Francis Energy, Blink Charging and Red E Charge — in the U.S. and Canada, adding over 10,000 new chargers, including more than 550 new DC fast chargers, to its network. Ford’s collaboration with Tesla to allow access to its extensive Supercharger network signifies a major milestone in the EV industry. The partnership, formalized months ago, also makes Ford the first major automaker to adopt Tesla’s proprietary charging standard. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article Tesla's Supercharger Network Continues to Secure Partnerships, But Competition Is Coming originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}