{
    "title": null,
    "date": "3/9/2024",
    "url": "https://www.hindustantimes.com/business/elon-musks-40-billion-wealth-wiped-off-in-the-beginning-of-2024-101709965469400.html",
    "text": "Subscribe Now! Get features like Elon Musk's net worth has tanked by almost $40 billion this year, according to Bloomberg Billionaire's Index. The Tesla chief executive and X (formerly Twitter) owner is now worth $189 billion. He is currently in third spot, behind Louis Vuitton boss Bernard Arnault and Amazon's Jeff Bezos. Earlier this week, Bezos had overtaken Elon Musk, but he was later replaced by Arnault. While the Louis Vuitton chief is worth $197 billion, Bezos is worth $196 billion. The decline in Musk's wealth is due to Tesla's falling share price, which is down by 29 per cent this year so far, Business Insider reported. A majority of Musk's wealth comes from his 21 per cent stake in Tesla. Social media platform Twitter, which was renamed as X following Musk's takeover in 2022, has proved to be a big headache for him. It has struggled to retain advertisers amid controversies ever since 2022. In another development, Musk said X will launch a smart TV app for Amazon and Samsung users to make long form videos available on smart TVs, Reuters reported.\"Coming soon,\" Musk said in a brief response on X to a user's posting that the platform's long-form videos could be watched directly on smart TVs. Earlier, a Fortune report had stated that the app could look similar to the TV app offered by Google's Youtube. It cited an unidentified source as saying Musk was set on competing with YouTube. ALSO READ: Elon Musk's X has over a million jobs listings: Check if there's one for you He has been forging partnerships with the likes of former Fox commentator Tucker Carlson and former CNN anchor Don Lemon in a bid to make X a video first platform. ALSO READ: Elon Musk says X could soon receive payment licenses in New York, CaliforniaLive-streaming platform Twitch, the encrypted messaging app Signal, and the social media forum Reddit are among some of the other services that Musk aims to compete with, a Fortune report had stated.(With Reuters inputs) Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}