{
    "title": "Tesla stops accepting Fisker Ocean on trade-ins",
    "date": "3/27/2024",
    "url": "https://driveteslacanada.ca/news/tesla-stops-accepting-fisker-ocean-on-trade-ins/",
    "text": "Fisker Ocean SUV owners that were hoping to get trade-in their electric vehicle (EV) are out of luck. Tesla is no longer accepting Ocean SUVs when customers are trading in a vehicle on their purchase, as the company seeks to protect itself against accepting a quickly depreciating asset. Fisker’s troubles have been well documented. After a disappointing 2023 when the automaker produced more than twice as many vehicles as it sold, was hit with multiple investigations by the National Highway Traffic Safety Administration (NHTSA), and more, Fisker sounded the alarm bells earlier this month warning investors it may soon go out of business without additional funding. The company then quickly hired bankruptcy experts and halted all production, sending its stock plummeting on the New York Stock Exchange (NYSE). Hopes were raised however when it was revealed Fisker was in talks with a major automaker, which turned out to be Nissan, for a potential partnership, but those negotiations fell through without a deal being reached. Then yesterday Fisker slashed prices on the Ocean SUV by as much as 39%, lowering the starting price to just US$24,999. That moves appears to have been the straw that broke the proverbial camel’s back, at least for Tesla. In a notice sent to employees on Wednesday, a copy of which was obtained by Drive Tesla, the automaker says it is immediately suspending acceptance of Fisker Ocean trade-ins, but left the door open to the possibility they may change their minds in the future. “This is due to significant market uncertainty on Fisker Ocean vehicles that disrupted the expected value of these vehicles. We are closely monitoring available market data and will provide an update on next steps as soon as market stability returns and accurate information becomes available,” Tesla explained in the note. It is hard to see how Fisker can work itself out of this predicament. The automaker was already losing a substantial amount of money on each car it was able to sell, but that amount has increased even further with yesterday’s equally substantial price cuts. All of the uncertainty around Fisker will make it difficult for them to find customers willing to pay any price for a car from a company that may soon go out of business. Polestar 4 Pricing for Canada and US announced, starts at C$64,900/US$56,300 Ford slashes F-150 Lightning workforce amid cooling demand Founder and Editor-in-chief of Drive Tesla Canada | Darryn@DriveTeslaCanada.ca Have a Tesla tip? Email tips@driveteslacanada.ca, or DM us on Twitter @DriveTeslaca General Motors (GM) held their first ever EV day yesterday, as it tries to reinvent itself an electric vehicle (EV) automaker that can compete with the industry leader, Tesla. As expected, GM tried to woo […] Just one week after they first arrived in Halifax, the Volkswagen (VW) ID.4 has officially arrived at dealerships in Canada. VW Canada tells Drive Tesla the first customer ID.4 vehicles will be found in dealerships […] Tesla recently launched a new and upgraded Model 3 built at Giga Shanghai, announcing the refresh design on September 1. According to a new report, the factory could also soon begin production of a new […] Enter your email address to subscribe to Drive Tesla and receive notifications of new articles by email. Email Address Subscribe "
}