{
    "title": "Tesla drivers lose US class action bid in battery range cases",
    "date": "3/7/2024",
    "url": "https://finance.yahoo.com/news/tesla-drivers-lose-us-class-224957243.html",
    "text": "By Mike Scarcella (Reuters) - Tesla owners who accused it of falsely advertising estimated driving ranges for its electric vehicles must pursue their claims in individual arbitrations rather than banding together in proposed class action lawsuits, a federal judge ruled. U.S. District Judge Yvonne Gonzalez Rogers in Oakland, California said on Thursday the drivers had agreed to an arbitration provision for resolving disputes with the automaker when they bought their vehicles. The plaintiffs accused Tesla of fraudulently inducing consumers to buy its cars by overstating how far they can travel on a single charge. The pair of lawsuits also alleged that Tesla, led by billionaire CEO Elon Musk, misrepresented the driving range on vehicle dashboards. A Reuters special report in July revealed that Tesla had created a secret team to suppress drivers' complaints about driving range. Both lawsuits cited the special report. Tesla and lawyers for the company did not immediately respond to requests for comment. Tesla has called the claims in the lawsuits \"unmeritorious.\" Attorneys for the plaintiffs in the two cases either declined to comment or did not immediately respond to a request for one. Rogers' order did not address the merits of the drivers' claims. She did not dismiss the lawsuits and said she could eventually issue an injunction against Tesla if the drivers successfully arbitrated their claims under California's unfair competition law and other provisions. The drivers' attorneys had called Tesla's effort to compel individual arbitration an \"effort to avoid classwide liability for its deceptive conduct.\" Tesla lowered driving-range estimates across its EVs in January, as a new U.S. government vehicle-testing regulation was implemented to ensure automakers accurately reflect real-world performance. (Reporting by Mike Scarcella; Editing by David Bario and Jamie Freed) Related Quotes "
}