{
    "title": "Nvidia becomes Tesla’s successor as market flips from electric vehicles to \nartificial intelligence",
    "date": "3/4/2024",
    "url": "https://www.mercurynews.com/2024/03/04/nvidia-becomes-teslas-successor-as-market-flips-from-ev-to-ai/",
    "text": "Today's e-Edition Get Morning Report and other email newsletters  Get Morning Report and other email newsletters Today's e-Edition Trending: By Esha Dey and Jeran Wittenstein | Bloomberg Nvidia Corp.’s rise is captivating the stock market and driving the S&P 500 Index to new highs. But it also raises cautionary reminders of another investor darling that soared on dreams of a technological transformation, only to tumble back to earth when those hopes turned to disappointment. Related Articles\nBusiness |  \n\n\t\t\tApple announces its annual developers conference is set for June 10\t\t\n\n\nBusiness |  \n\n\t\t\tAt GDC 2024, tech companies offer a glimpse of AI-powered characters\t\t\n\n\nBusiness |  \n\n\t\t\tSaratoga contracts with AI company to increase transparency\t\t\n\n\nBusiness |  \n\n\t\t\tAfter Walnut Creek police arrested an AI employee in online child sex sting, he allegedly claimed he thought it was a bot\t\t\n\n\nBusiness |  \n\n\t\t\tNvidia, San Jose mayor embrace startups at tech titan’s AI gathering\t\t\n\nThat stock belongs to Tesla Inc., which sparked its own mania in 2017 as investors bet that electric vehicles were going to take over the world. Back then, Elon Musk’s company was a phenomenon as it blew past established carmakers like General Motors Co. and Ford Motor Co. in market capitalization to become America’s biggest auto manufacturer. Some analysts were looking beyond the industry and calling it “the next Apple Inc.” Now, Tesla shares are down more than 50% from their 2021 peak, and other EV stocks that raced higher with it are shadows of their former selves. All of which should be sobering for Nvidia investors who see the stock as a limitless bet on an AI future. The company’s shares have added 66% this year after more than tripling in 2023. “We have seen time and again that when investors fall in love with the idea of the technology innovation du jour, logic takes a back seat” Adam Sarhan, founder and CEO of 50 Park Investments, said in an interview. “And when emotion takes over, sky is the limit.” Betting On Growth There are plenty of differences between Nvidia and Tesla, from the products they make to the personalities of the men that run the companies. But the parallels are striking. Nvidia’s rise from niche chipmaker to one of the biggest companies in the world is based on the premise that its phenomenal sales growth over the past year has staying power. Tesla’s big breakout rally, which occurred in 2020 and put its valuation well over $1.2 trillion, was pinned on the assumption that EVs would be adopted widely and quickly, and that it would be the company to dominate that market. But reality has interrupted that story. Demand for EVs is slowing as the wave of enthusiastic first adopters have already bought, and more price-conscious, change-averse consumers are taking longer than expected to convert to a new technology. As a result, Tesla is down 31% from its recent high last July and is one of the biggest percentage decliners in the Nasdaq 100 Index this year. “There’s all this potential about the driverless car, the cybertruck and the stock is getting hit. Why? They are losing market share and they are losing margins. In the tech world that is the kiss of death,” said Sameer Bhasin, principal at Value Point Capital. For Nvidia, it’s too early in the hype cycle for any signs of a slowdown. The Santa Clara, California-based company has delivered blow-out results for four consecutive quarters, fueled by what appears to be insatiable demand for its chips used to train large language models that power AI applications like OpenAI’s ChatGPT. After more than tripling last year, the stock in 2024 is again the best performer in the S&P 500 Index, with a 66% advance. Its market value of more than $2 trillion trails only two US companies — Apple Inc. and Microsoft Corp. The talk of broad-based use of AI across industries and businesses brings to mind the excitement around the internet and the years leading into the dot-com bubble. But unlike that era, when internet companies were being valued on new metrics like “clicks” while bleeding cash, Nvidia is pumping out massive profits. Net income jumped more than 500% to nearly $30 billion last year and is projected to double in the current year, according to data compiled by Bloomberg. Risks Are Lurking Those big profits and sales, along with the company’s ability to continually beat estimates, has helped keep a lid on valuation metrics. Still, Nvidia has the highest price-to-sales ratio in the S&P 500 at 18. Currently, the semiconductor manufacturer has a sizable lead in the types of graphics chips that excel at crunching large amounts of data used in AI models. But its competitors are eager to grab a piece of that market. Advanced Micro Devices Inc. recently released a line of accelerators, and even Nvidia’s customers like Microsoft Corp. are racing to develop chips. “If you really believe in this AI frenzy, you can visualize a future 10 years from now where AI is embedded in a lot of places, and you need these massive systems running chips that can only be delivered by Nvidia,” said Sameer Bhasin, principal at Value Point Capital. “Even if there’s a perception of a pause in buying, the stock will get hit.” None of this is meant to dismiss the disruptive power of electric cars or AI. But it does raise the question of whether investors are paying for a future growth that may never arrive. Take a market darling of the dot-com era, Cisco Systems Inc.. It is still a successful company, but investors who bought the stock around its peak and held on are still waiting to recoup their losses — 24 years later. “The bubble exists because the underlying idea is real,” said Cole Wilcox, CEO and portfolio manager at Longboard Asset Management. “But just because the general macro wave is real, it doesn’t mean that all of these ventures are going to turn out to be good investments. You will have to be able to separate the winners from the losers.” More stories like this are available on bloomberg.com ©2024 Bloomberg L.P. Copyright © 2024 MediaNews Group "
}