{
    "title": "Columnist Calls Elon Musk A 'Mediocre White Man'",
    "date": "3/22/2024",
    "url": "https://www.outkick.com/analysis/columnist-calls-elon-musk-a-mediocre-white-man",
    "text": "Elon Musk may have started Tesla, the most successful electric car manufacturer. He may also have started SpaceX, a company dedicated to space exploration and travel, perhaps the single most difficult type of company to build. He also may have bought one of the world's most important social media platforms because he was concerned about the rapidly encroaching scourge of politically motivated censorship. But none of that is impressive enough to matter to far-left columnists, because Elon Musk is white. Musk was recently interviewed by Don Lemon, an interview during which Lemon was frequently embarrassed by an inability to understand Musk's arguments. As a result of the interview, Musk canceled a potential partnership between X and Lemon, no surprise considering the contents of the interview and Lemon's outrageous demands. READ: Don Lemon Demanded $5M, $8M Salary, Tesla Cybertruck, X Equity From Elon Musk For extremist columnist Michael Harriot though, the disastrous Lemon side of the interview was actually a triumph. Because Elon Musk covered conversation topics that \"white people like.\" In an article entitled \"Don Lemon interviewed a mediocre white man,\" Harriot engaged in some predictable racism, bewildering lack of awareness, and his usual disconnect from reality. \"During the intermittently contentious conversation, the two covered a wide range of topics, from ketamine use to having breakfast with Donald Trump,\" Harriot wrote. \"In other words, stuff white people like,\" he continued. The horror! BERLIN, GERMANY - SpaceX owner and Tesla CEO Elon Musk arrives on the red carpet for the Axel Springer Award 2020 on December 01, 2020.  (Photo by Britta Pedersen-Pool/Getty Images) Harriot's chief complaint about Musk was that he came across as a \"self-assured white boy,\" who believes \"white nonsense.\" \"Thankfully, theGrio watched it so you don’t have to. The entire interview could’ve been titled ‘Elon Musk’s New Clothes,' seeing that the emperor of X was exposed as just another self-assured white boy echoing the same white nonsense espoused by Joe Rogan’s followers on white Twitter,\" Harriot wrote. In a jaw-dropping feat of reality denial, Harriot continued by saying that Lemon was right and Musk was wrong about everything. \"Don Lemon did a good job holding Musk’s feet to the fire, but the biggest takeaway from Lemon-Musk was that the know-it-all right-winger was wrong about… well, almost everything.\" Harriot defended the indefensible practice of counting illegal immigrants in the U.S. Census, ignoring that Musk correctly identified that it can impact political representation thanks to blue states being given more apportionment than they otherwise would have. This isn't even up for debate, it was discussed in 2020 by the Pew Research Center. Don't tell Harriot that though, because it would make Don Lemon look worse than he already does. The broader issue is his laughable characterization of Musk as a \"mediocre white man,\" a label which would be grounds for immediate firing were it used to describe someone of a different race. Musk's companies and their associated innovations have inarguably changed the world. But because he's white and not part of the far-left, Harriot believes he should be inaccurately labeled. It's an embarrassing column, but then again, given the rampant, destructive failures of progressive politics, embarrassing may be an upgrade. You are agreeing to OutKick's Terms of Use and Privacy Policy, but don't worry we don't spam. DISCLAIMER: This site is 100% for entertainment purposes only and does not involve real money betting. Gambling related content is not intended for anyone under the age of 21. If you or someone you know has a gambling problem and wants help, call 1-800-GAMBLER. "
}