{
    "title": "Tesla gets tagged with once-unthinkable analyst prediction: Sales will fall",
    "date": "3/17/2024",
    "url": "https://www.autoblog.com/2024/03/17/tesla-gets-tagged-with-once-unthinkable-analyst-prediction-sales-will-fall/",
    "text": "Tesla Inc. is no longer a red-hot growth stock. CEO Elon Musk has said as much. But even by that new standard — with growth forecasts on Wall Street sinking rapidly — the grim sales prediction from a key Tesla analyst last week was still shocking. There’ll be zero growth in sales volumes for the electric-vehicle maker this year, Wells Fargo’s Colin Langan said. And in 2025, it’ll be worse yet: Volumes will drop. Shares of the company reacted appropriately, dropping 4.5% to close at a 10-month low of $169.5 on Wednesday. The stock has now fallen 32% this year, missing out on a broader rally that has pushed the S&P 500 Index up 8.3%. The reason is clear: Tesla’s ability to grow at the furious pace that its expensive valuation promises is no longer a guarantee. The company still trades at a multiple that is significantly higher than other mega-cap high-fliers, yet the pace of expansion in its revenue and profit have slowed markedly since last year. “Right now, the market is voting and telling us that it believes Tesla does not currently deserve that high valuation,” Adam Sarhan, founder and CEO of 50 Park Investments, said in an interview. “For now, the sellers are in control and the market needs a bullish catalyst to get excited about.”  Wall Street has been ringing the alarm bell loudly on Tesla since the beginning of March, after disappointing numbers from China, data from European countries and a production disruption at its factory near Berlin pointed to first-quarter deliveries missing analysts’ average expectations. Musk’s response — lowering prices to boost demand — is losing its edge as well. Wells Fargo’s Langan was the latest to note that the company’s growth in its core markets has moderated, as he downgraded the stock to the equivalent of a sell rating on Wednesday. The EV-maker is now a “growth company with no growth,” Langan wrote in a note to clients. He highlighted that sales volumes rose only 3% in the second half of 2023 from the first half, while prices fell 5%. Tesla has cut prices in China repeatedly since late 2022, sparking an international price war. The troubles for Tesla and EVs more broadly started emerging in mid-October, when Musk’s company first warned about a slowdown in demand. But sentiment worsened further in early January after Tesla said its growth will be “notably lower” this year. Other automakers, EV suppliers and even rental-car companies joined in with similarly cautious comments. While the weakness in EV demand spells trouble for all car companies, as a pure-play EV company with an eye-wateringly high valuation, Tesla shares have taken a serious hit.  Tesla’s steep slide this year has wiped off more than $245 billion from the company’s market value, and pushed it off the list of the 10 biggest companies on the S&P 500. It has also cost Musk his “world’s richest man” status — he is now placed third, behind Bernard Arnault and Jeff Bezos. Despite the decline, the stock still trades at around 55 times its forward earnings, compared to the average of about 31 for the Bloomberg Magnificent 7 Price Return Index. “While an EV and battery technology leader, Tesla screens poorly relative to Mag 7 peers,” Wells Fargo’s Langan said, noting the valuation discrepancy. The analyst lowered his 2024 profit estimate for the company to $2 a share from $2.40. That compares to analysts’ average expectation of $3.03 a share for the year, according to data compiled by Bloomberg. “For the longest time, Tesla has been heavily invested in one of the market’s favorite narratives, the electrification of the world’s car fleet,” said David Wagner, portfolio manager at Aptus Capital Advisors. “Now, the market’s favorite narrative is artificial Intelligence and ESG has taken a bit of a back seat, thus the historical valuation premium may no longer be warranted, especially as future revenue growth and margin have slowed.”  Toyota teases the 2025 4Runner 2025 Volkswagen ID. Buzz GTX is one wooly Bulli Nissan considering Xterra revival; 'it's got to be authentic' 2024 Ford Mustang Mach-E reportedly gets another price adjustment to keep it competitive 2025 Honda Pilot Review: Well-rounded three-row SUV adds Black Edition Six-pack of identical Ford Pinto Wagons for sale, in case you were looking    Please enter a display name Please sign in to leave a comment. "
}