{
    "title": "Govt to not tailor policies for individual company or its interests: Piyush \nGoyal on Tesla entering India",
    "date": "3/10/2024",
    "url": "https://www.businesstoday.in/india/story/govt-to-not-tailor-policies-for-individual-company-or-its-interests-piyush-goyal-on-tesla-entering-india-420829-2024-03-10",
    "text": "Feedback India won't alter its policies to accommodate US electric vehicle (EV) manufacturer Tesla, according to Commerce and Industry Minister Piyush Goyal. The country's laws and tariff rules are designed to attract EV makers globally to establish a base in the world's fastest-growing economy, the union minister mentioned. Tesla has been lobbying for an initial tariff concession to balance 70% customs duty for cars priced below $40,000 and 100% for higher-value cars. The US-based EV giant made this concession a prerequisite to building a factory in India. High tariffs on motor vehicles, aiming to stimulate local production, have also been a longstanding problem for foreign car manufacturers. However, India is focused on creating policies that will lure all EV makers to set up operations in the country. \"We are working on several initiatives where we are having inter-ministerial (consultations) and a dialogue with the stakeholders, with potential investors from across the world from Europe, from the United States, from the Far East, from Japan, from Korea. So we have significant engagements going on across the world,\" Goyal said in an interview with news agency PTI. He further emphasised that the Indian government will not tailor its policies for one particular company or its interests. \"Government does not tailor policy for any one individual company or its interests. Everybody is free to make their demands. But that does not mean that the government will necessarily take a decision (based on) what you demand,\" he said. The Indian factory would be Tesla's sixth vehicle plant. Cars imported as completely built units (CBUs) are subjected to customs duty ranging from 60% to 100%, based on engine size and cost. Tesla Inc's CEO Elon Musk met Prime Minister Narendra Modi last year in New York, expressing plans to visit India in 2024. Minister Goyal emphasized that the EV sector could significantly strengthen the country's macro economy. India has been promoting itself as an alternate investment destination for US companies amidst rising tensions between Beijing and Washington. To appeal to EV manufacturers, the government has introduced production-linked incentive schemes for advanced chemistry cell manufacturing and component production. Last year, Minister Goyal visited Tesla's manufacturing facility in Fremont, California. The company bought goods worth about $1 billion in 2022. The government has also introduced production-linked incentives (PLI) schemes for advanced chemistry cell (ACC) battery storage and the auto, auto-components and drone industries. The rapidly growing EV market in India is attracting global attention. Meanwhile, Tesla is reportedly close to entering the Indian market as the central government finalises its policy to extend concessional import duty. The government is considering offering concessional import duty on electric cars exceeding ₹30 lakh ($36,000) for 2-3 years. This move is expected to boost employment and reduce EV prices in India. The import duty reduction may be in exchange for bank guarantees from Tesla for constructing an EV manufacturing plant in India. Domestic EV manufacturers like Mahindra and Mahindra, Tata and Ola Electric have raised concerns about an unfair advantage towards Tesla. They have urged for a level playing field and a boost in manufacturing within India. (With PTI inputs) Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}