{
    "title": "Elon Musk's $56 billion Tesla pay package has been tossed out by the court",
    "date": "1/31/2024",
    "url": "https://ca.finance.yahoo.com/news/elon-musks-56-billion-tesla-pay-package-has-been-tossed-out-by-the-court-074235803.html",
    "text": "In 2018, Tesla awarded Elon Musk a $56 billion pay package that helped propel him to the top of world's richest lists. Now, a judge in Delaware has rendered the deal between the company and the CEO to be invalid and called the compensation an \"unfathomable sum\" that's unfair to shareholders. As initially seen and reported by Chancery Daily on Threads, the court of Chancery in Delaware has released its decision on the lawsuit filed by Richard Tornetta. The Tesla shareholder accused the automaker of breaching its fiduciary duty by approving a package that unjustly enriches its chief executive. Judge Kathaleen McCormick wrote in the decision that Musk \"enjoyed thick ties\" with the directors who were in charge of negotiating his pay package on behalf of Tesla, which means there \"was no meaningful negotiation over any of the terms of the plan.\" The judge also talked about how Musk owned 21.9 percent of the automaker when the package was negotiated. That gave him \"every incentive to push Tesla to levels of transformative growth,\" because he stood to gain $10 billion for every $50 billion in market capitalization increase. \"Swept up by the rhetoric of 'all upside,' or perhaps starry eyed by Musk’s superstar appeal, the board never asked the $55.8 billion question: Was the plan even necessary for Tesla to retain Musk and achieve its goals?\" the judge wrote in the court document. As The Washington Post notes, she ruled that Tornetta is entitled to a \"rescission\" and has ordered Tesla and its shareholders to carry out her decision and undo the deal. Musk's camp, however, can still appeal her ruling. Musk has sold some of his Tesla stocks to help pay for his acquisition of Twitter, now X, from the time his pay package was approved. At the moment, he owns around 13 percent of Tesla, though he recently said that he wants 25 percent control over the company before he's comfortable growing it to be a leader in AI and robotics. In response to the court's decision, Musk tweeted: \"Never incorporate your company in the state of Delaware.\" He also posted a poll asking followers whether Tesla should change its state of incorporation to Texas, where its physical headquarters are located. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. Trade 24 hours a day on the world's most popular platform. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o  They soft-launched their relationship at the supermodel's cookbook event in Miami. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company.  The president mocked his campaign rival for doing the one thing he claimed he wouldn’t have time for. How bad was the reaction online? Well, no one is telling Trump to give up her day job as RNC co-chair. \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" "
}