{
    "title": "Zacks Investment Ideas feature highlights: Netflix, Tesla, PACCAR, Stride \nand Seagate Technology",
    "date": "1/29/2024",
    "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-140000341.html",
    "text": "Chicago, IL – January 29, 2024 – Today, Zacks Investment Ideas feature highlights Netflix NFLX, Tesla TSLA, PACCAR PCAR, Stride LRN and Seagate Technology STX. Quarterly results from Netflix and Tesla highlighted this week's busy earnings lineup but quite a few lesser-known names would end up providing eye-catching earnings reports. Here is a short list of three companies that are standing out after blowing past earnings expectations and making their stocks worthy of investors' consideration at the moment. PACCAR While Tesla slightly missed its fourth quarter top and bottom line expectations and provided weaker sales guidance, Paccar is an auto company that shined this week. The heavy-duty truck manufacturer posted Q4 earnings of $2.70 per share on Tuesday which topped the Zacks Consensus of $2.20 a share by 23%. Notably, quarterly sales of $8.59 billion topped estimates by 5%. The strong Q4 results helped Paccar round out a record year for annual revenue at $35.13 billion and net income of $5.05 billion or $9.61 per share. Paccar has now surpassed earnings expectations for nine consecutive quarters and currently sports a Zacks Rank #1 (Strong Buy) with an overall \"A\" VGM Zacks Style Scores grade for the combination of Value, Growth, and Momentum. Stride Also sporting a Zacks Rank #1 (Strong Buy), premiere education services company Stride continues to impress as a provider of virtual and blended learning. Stride offers curriculums and programs from K-12 and to adults seeking workforce skills as well. Reporting its fiscal second quarter results on Tuesday, Stride's Q2 EPS of $1.54 beat estimates by 15% and spiked 19% from $1.19 a share in the prior-year quarter. Second-quarter sales of $504.87 million slightly topped estimates of $503.79 million and rose 10% year over year. Stride has now beaten earnings expectations for five consecutive quarters and has posted a very impressive average earnings surprise of 45.24% in its last four quarterly reports. Seagate Technology Data storage and infrastructure solutions provider Seagate Technology reassuringly surpassed its fiscal second quarter bottom line expectations on Wednesday and is starting to reconfirm the return of its lucrative earnings potential. Seagate posted a surprising profit with Q2 EPS at $0.12 a share compared to estimates that called for an adjusted loss of -0.07 a share. This was despite sales of $1.55 billion slightly missing estimates of roughly $1.56 billion. Still, Seagate's stock sports a Zacks Rank #2 (Buy) as its projected earnings rebound is starting to look more likely with EPS expected to soar 73% this year and then skyrocket and expand another 1,254% in FY25 to $4.47 per share. Following their favorable quarterly results earnings estimate revisions are likely to trend higher for Paccar, Stride, and Seagate Technology making them three stand-out stocks to buy at the moment. Furthermore, these companies should be viable investments for 2024 and beyond. Why Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Netflix, Inc. (NFLX) : Free Stock Analysis Report Seagate Technology Holdings PLC (STX) : Free Stock Analysis Report PACCAR Inc. (PCAR) : Free Stock Analysis Report Tesla, Inc. (TSLA) : Free Stock Analysis Report Stride, Inc. (LRN) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}