{
    "title": "Tesla (TSLA) Q4 and FY 2023 earnings call: How analysts are reacting",
    "date": "1/25/2024",
    "url": "https://www.teslarati.com/tesla-tsla-stock-q4-and-fy-2023-earnings-call-wall-street-reaction/",
    "text": "Tesla (NASDAQ:TSLA) took a steep dive on the heels of the company’s Q4 and FY 2023 earnings call, dropping over 9% as of writing. With the company stating that volume growth would be tempered this year due to its focus on the next-generation platform and executives being quite vague about its guidance for 2024, analysts, including some TSLA bulls, are not happy. Tesla actually had a record 2023, with vehicle sales growing nearly 40% year-over-year in 2023 to over 1.8 million units worldwide. Wall Street currently expects Tesla to post about 2.1 to 2.2 million vehicle sales for 2024, which would translate to a growth of about 20%. This number seems conservative and attainable enough, but Tesla simply maintained that its volume growth would be substantially lower than 2023’s ~40%. Wedbush analyst Dan Ives shared his sentiments about Tesla’s earnings call, in a post on X. Ives described the call, which provided some high-level long-term views on the company, as another “train wreck” conference call. Following the earnings call, Ives adjusted his price target for Tesla from $350 to $315 per share, though he also noted that Wedbush remains bullish on the company. Great to join @bsurveillance discussing another train wreck conf call in our view from Tesla and Musk lacking margin outlook and firm guidance for 24. Remain bullish for long term EV/AI vision but near term headwinds @lisaabramowicz1 @FerroTV @annmarie @BloombergTV https://t.co/E40CMG2Mg0 “We were dead wrong expecting Musk and team to step up like adults in the room on the call and give a strategic and financial overview of the ongoing price cuts, margin structure, and fluctuating demand. Instead, we got a high-level Tesla long-term view with another train wreck conference call,” Ives noted. RBC analyst Tom Narayan also maintained his “Buy” rating on Tesla, though he lowered his price target from $300 to $297 per share. “We leave our delivery estimates unchanged after the vague guide, but lower our car gross margin expectations on less robust cost down opportunity,” he noted in a report. Narayan also pointed out that Tesla’s next-generation vehicle platform is still “many quarters away” from impacting the company’s numbers. New $TSLA report from Adam Jonas: 5 thoughts post earnings call“We reiterate our OW $TSLA rating ($345 price target) which offers over 80% upside from current levels which we believe is compelling in proportion to the investment level within our US auto coverage.” pic.twitter.com/TdZ2cLavdc Morgan Stanley’s Adam Jonas, for his part, pointed out that Tesla almost did not provide any guidance during the call. He also observed that there were no “AI rabbits” pulled out of Tesla’s hat during the call, which was highlighted by Musk’s conservative comments about Dojo. Despite this, Morgan Stanley opted to maintain its “Overweight” rating and $345 price target on Tesla, with a bear case PT of $100 and a bull case PT of $500 per share. While the sentiments surrounding Tesla’s Q4 and FY 2023 earnings call seem generally negative, some analysts opted to take a more optimistic stance on the company. Canaccord lowered its price target for Tesla from $267 to $234 per share, though the firm also noted that it is time for investors to be patient about the company. The firm noted that it remains bullish about Tesla’s long-term prospects. NEWS: Canaccord Genuity has lowered its $TSLA price target to $234 (from $267), maintains a BUY rating.They put out a good note: “It’s time to be patient. The next-generation vehicle, FSD upgrades, margin improvement, and Optimus will likely bring an acceleration in revenue… “It’s time to be patient. The next-generation vehicle, FSD upgrades, margin improvement, and Optimus will likely bring an acceleration in revenue growth. But not this year — 2024 will be subdued; probably a trough, but still relatively slow (we model ~18% y\\y revenue growth). Growth curves are seldom smooth, and Tesla is no different. “We are still quite bullish on Tesla’s long-term growth prospects. We think EVs will replace ICE vehicles despite recent countervailing narratives. We see vehicle autonomy as one of the highest value-creating technologies to be deployed. Ever. And Tesla, with its razor/ razorblade approach, is a leader in this real-world AI. We think Tesla is Apple on steroids as it focuses on manufacturing and a higher level of vertical integration. Tesla is THE sustainability behemoth, in our opinion,” the firm noted. The critical metric, auto gross margins ex credits, came in at 17%, compared to the Street at 17.3%. I was expecting 16.7%. While this missed the Street, it marks the end of four consecutive quarters of margin decline, up from 16.3% in the Sep-23.Over this is a positive. Longtime Tesla bull Gene Munster of Deepwater Asset Management also pointed out that Tesla’s auto gross margins for the past quarter ended a streak of dropping margins. “The critical metric, auto gross margins ex credits, came in at 17%, compared to the Street at 17.3%. I was expecting 16.7%. While this missed the Street, it marks the end of four consecutive quarters of margin decline, up from 16.3% in the Sep-23. Over, this is a positive,” Munster wrote on X. Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}