{
    "title": "Traders Betting on Tesla Rebound Pile Into Leveraged ETF Options",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/news/traders-betting-tesla-rebound-pile-191518290.html",
    "text": "(Bloomberg) -- Tesla Inc.’s slide to the lowest level since May attracted a wave of bullish option buying not in the stock itself, but with an exchange traded fund that offers more leverage. Most Read from Bloomberg A 99% Bond Wipeout Hands Hedge Funds a Harsh Lesson on China Ukraine’s Army Chief Replaced After Rift With Zelenskiy New York City Is Considering a Laundry Pods Crackdown Einhorn Says Markets ‘Fundamentally Broken’ By Passive, Quant Investing McKinsey Places 3,000 Staffers on Review as Economies Slow Investors flocked to a call option in Direxion Daily TSLA Bull 1.5X Shares ETF (ticker TSLL), an exchange-traded fund that seeks to replicate 150% of Tesla’s performance — buying contracts that would benefit from a roughly 45% rally in the automaker by January 2025. According to Chris Murphy, co-head of derivative strategy at Susquehanna International Group, the trader may have targeted the ETF — as opposed to options tied to Tesla shares — in order to take advantage of the fund’s added leverage. Tesla shares slumped as much as 6.9% Monday to the lowest level since May after Handelsblatt reported the German IT giant SAP is removing the electric-vehicle maker from the list of its car suppliers. The EV maker has slipped more than 4% over the past year, trailing other megacap companies. By comparison, Meta Platforms is up 147% over the same period. The option — a Jan. 17 $12.73 call — traded in small blocks throughout the morning, with the ETF trading around $8.50. By 1:12 p.m. in New York, the contract had changed hands 63,000 times — pushing the total call volume to nearly eight times greater than the average over the past month. The 6.3 million shares that represents would be more than one-third of the fund’s 15-day average volume. Most Read from Bloomberg Businessweek OpenAI’s Secret Weapon Is Sam Altman’s 33-Year-Old Lieutenant How Jack Dorsey’s Plan to Get Elon Musk to Save Twitter Went South Inside a Private Jet Club Where Everything Went Wrong The Story Elon Musk Doesn’t Want to Talk About A Tiny Fund Takes a Big Short on Corporate Debt Maturity Wall ©2024 Bloomberg L.P. Related Quotes "
}