{
    "title": "Can Tesla's Cybertruck Dethrone Ford's F-150 As America's Favorite Pickup \nTruck? Here's What Experts And",
    "date": "2/19/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37199054/can-teslas-cybertruck-dethrone-fords-f-150-as-americas-favorite-pickup-truck-heres-",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Last year, something remarkable happened in the global automobile industry. For the first time in history, an electric vehicle became the best-selling car worldwide. The honor went to Tesla Inc.’s TSLA Model Y, a mid-size SUV that entered production just four years ago. Currently, Tesla’s latest buzz surrounds a category of vehicles increasingly favored over sedans in America: pickup trucks. In this arena, 120-year-old Ford Motor Co F has reigned supreme for over four decades with its F-Series lineup, which includes workhorse models and high-end trims, notably the legendary F-150, now available in an electric version. Given Tesla’s track record of shattering records, can the company replicate the Model Y’s success with its hulking Cybertruck and unseat Ford’s F-150 as America’s favorite pickup? Benzinga spoke to experts, industry insiders, truck owners and prospective customers to get an idea. Brian Holiday has been a salesman at various Ford dealerships in the automaker’s home state of Michigan for nearly 15 years. Now 69, he works at Pat Milliken Ford in Detroit’s northwestern suburb of West Bloomfield and has a fair pulse on the F-150’s enduring demand. “I mean, it's been the number one truck for 47 years in a row. It's a great truck, you know. It's a multipurpose vehicle that anybody from a young person to an old person can drive it, and enjoy it,” he said. Xander, a 17-year-old F-150 owner from Illinois who preferred to go only by his first name, conformed to this theory. “It’s a 10-year-old truck and nothing's wrong with it. I’ve been worse to the truck than it’s been to me.” He said he chose it mainly because his “entire family drives Fords,” adding that the storage, stereo, and “pretty decent gas mileage” were especially likeable features. On the other hand, the Cybertruck has quickly amassed a fan following despite polarizing views about its radically unconventional design and a few mishaps during its unveiling in 2019. See Also: Best Electric Vehicle Stocks Chris Hale (last name changed on request), a music industry professional in his forties from Los Angeles, got a foundation series Cybertruck in the last week of January. “I love driving it, it gets so much attention,” he said. Steve Evans (last name changed on request), a 45-year-old “C-level executive” who also lives in Los Angeles and got his foundation series Cybertruck after a four-year wait, said his experience “has been fantastic.” “I chose the Cybertruck because it is so unique in its design and feels like you are truly making a purchase of a car that takes a big step into the future. There is nothing else like it for automobile consumers today,” Evans said. While both Cybertruck owners acknowledged Ford’s legacy, they took pride in their Tesla vehicles being very “American” (the Cybertruck has a U.S./Canadian parts content of 65%). However, they expressed doubts about Cybertruck outselling the F-150 anytime soon. “Right now it's very expensive and extremely high interest rates make it unaffordable,” said Hale, while Evans believes the long-term pricing will be in Tesla’s favor. Tesla and Ford did not respond to Benzinga’s requests for comment. Many prospective Cybertruck buyers seem to stay on the sidelines precisely because of the price tag. Even the man behind making General Motors' best-selling trucks thinks so. “I don’t consider the Cybertruck affordable because the AWD model starts at $76,000,” said Andrew B, a 40-year-old audio-video engineer from Long Beach, California, who currently drives a Hyundai Elantra. “Both trucks [Cybertruck and F-150 Lightning] just don’t have enough range (under load) to justify the cost to me.” Kevin Chan, 46, an instructional designer from LA, said he currently owns a Tesla Model 3 and does not personally prefer trucks. But when asked to pick between the Cybertruck and F-150 Lightning, he said: “Tough one … I'm not a fan of the Cybertruck body — no curves, all angles. I'd probably go with the [Toyota] RAV if I had to get a truck EV.  It probably has the most acceptable look for me compared to the rest.” Range anxiety with EVs, in general, is another significant concern. Holiday noted that Ford customers primarily experience this fear during long trips, while daily commuting typically poses no issue for most. Currently, the Cybertruck offers a maximum range of 340 miles without a range extender, which increases to 470 miles with it. In comparison, the F-150 Lightning, rated as the top electric truck by Edmunds this year, achieves a range of 345 miles on a single charge. However, these figures are dwarfed by the traditional gas-powered F-150, which boasts an impressive 700 miles on a full tank. Mark Schirmer, director for Industry Insights & Corporate Communications at market intelligence provider Cox Automotive, expects the Cybertruck to be popular only with Tesla enthusiasts and exotic vehicle buyers. “By design, the Cybertruck is not a vehicle with a mass market appeal like the Ford F-Series,” he said. Tesla CEO Elon Musk, who pushed for the futuristic pickup because he thought Ford trucks looked boring, admitted last year that his company “dug our own grave” with the Cybertruck and ramping it up would take longer than other models due to “manufacturing complexity.” But he also said demand is “so far off the hook that you can’t even see the hook.” Musk expects to sell 250,000-500,000 Cybertrucks annually at full capacity. That still falls massively behind Ford’s F-Series production numbers. \"What many people don't recognize about the F-150 is the sheer volume of production and the size of the distribution channel,” Schirmer said. “The simple fact that Ford has two production systems working full time [in Michigan and Missouri] and nearly 3,000 channels selling the product helps illustrate what it takes to do big volume.\" \"Tesla does not come close to that, with only one factory currently in place [Giga Texas] and building Cybertruck part-time, and less than 250 distribution outlets in the U.S. Physically, grabbing more market share than the F-150 is impossible for Tesla at this point,\" he added. Some are a bit more optimistic. Sawyer Merritt, a Tesla investor and influencer, believes the Cybertruck outselling the F-150 is “a tall order, but doable long term.” “It will require great execution on Tesla’s part. Tesla will also need to drive down prices long-term to reach a larger part of the market, but with 2 million pre-orders it makes sense to keep prices high for now,” Merritt said. “Lastly, Tesla will need to educate more people on the benefits of owning an EV, and the unique aspect of their vehicles.” Tesla sells its cars directly to customers, foregoing the dealership model that legacy automakers like Ford have long relied on, thereby making life harder for itself in numerous states with strict restrictions against its approach. “We have the dealer infrastructure in place which is a plus. I think that's an important advantage we have over Tesla,” said Holiday. “But that hasn't stopped them from selling their vehicles so far, you know.” But even as average EV prices move closer to that of combustion engine cars, consumer preference seems to lean towards familiar brands, as evidenced by Cox Automotive’s research showing the F-150 Lightning as a top consideration among EV trucks. Even Dwayne “The Rock” Johnson, who “drives only Ford trucks,” was unaware that Tesla made a pickup truck until podcaster Joe Rogan told him. Ford CEO Jim Farley initially dismissed the Cybertruck as “a cool high-end product” designed for “Silicon Valley people” while saying Ford’s focus is on making trucks for “real people who do real work.” The legacy automaker, however, has scaled back on its electric ambitions, citing unfavorable market conditions. But Farley has teased a second-generation full-size electric pickup, calling the project \"a once-in-a-lifetime opportunity to revolutionize America’s truck.” “The EV pickup truck segment will certainly be growing in the next decade, and certainly, Tesla's influence in the segment will be felt,” Schirmer said, adding that vehicles with broad appeal and affordable pricing like the Model Y sell better than those targeting niche markets with higher price points. “Tesla has a wonderful reputation. They've taken the time over the last few years to achieve that reputation, of a desirable vehicle. The styling is … unique, I'll say that,” Holiday said of the Cybertruck. “It's not for everybody, it's not your traditional pickup truck. As far as how well it functions and works for people, whether they want to make that their vehicle of choice or go for a more traditional style, is what we'll have to wait and see what the market does.” Check out more of Benzinga's Future Of Mobility coverage by following this link. Read Next: Elon Musk Says Tesla Will Never Make A Concept Car ‘That Doesn’t Become Reality’ Image made via photos on Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}