{
    "title": "Elon vows Tesla will 'make things good' with San Jose bakery",
    "date": "2/23/2024",
    "url": "https://www.ktvu.com/news/elon-musk-tesla-pie-order-san-jose-bakery",
    "text": "Share After learning that Tesla backed out of a deal with a San Jose pie shop at the last minute, leaving the business owner out of thousands of dollars, Elon Musk said he would make amends. SAN JOSE, Calif. - After learning that Tesla backed out of a deal with a San Jose pie shop at the last minute, leaving the business owner out of thousands of dollars, Elon Musk said he would make amends. \"Just hearing about this. Will make things good with the bakery. People should always be able to count on Tesla trying its best,\" Musk said on X in response to a post about the canceled order. Musk did not specify how he would address the matter with The Giving Pies, a small Black-owned bakery. Though Tesla has resubmitted an order of 3,200 pies for two events next month, bakery owner Voahanguy Rasetarinera said on Friday. Rasetarinera said that since her social media post went viral by criticizing Tesla for abruptly canceling a $6,000 order for 2,000 pies, her bakery has received an overflow of community support. Related The owner of the Black-owned business posted a message on social media saying Tesla contacted her to order 2,000 of these pies for about $6,000. Dr. Eric Yokota, owner of nearby Yokota DDS, made sure to visit the bakery. \"Being in a small business myself, it really kind of hit close to home,\" said Yokota. Rasetarinera said that following the viral story, Tesla first offered to purchase the pies and tour their factory, but she had yet to receive payment. The company later placed another order. However, Rasetarinera said her focus has shifted to other customers like Yokota and the San Jose Sharks, who bought $500 worth of pies after hearing her story. \"We are the brand of San Jose of the city of San Jose and the San Jose area. We take that very seriously and when somebody is in need, we want to be able to jump in and support that,\" said Chris Shay, San Jose Sharks CEO of Government Affairs. The owner of a San Jose dessert store says Tesla ordered thousands of pies and then backed out of the deal. After posting about it on social media, she now says the community and people from across the country are stepping up to support the business. Rasetarinera noted that her small business has been selling out of pies daily since the Tesla saga with orders pouring in from across the country. \"It’s not even 11 a.m. and we are out of pies,\" she said, adding that there had been a nonstop flow of customers since opening at 7 a.m. on Friday. Customer Rosalie Adragna had visited the bakery twice in one day. \"I came this morning to bring a bunch of pies to my work. They only had savory. The savory were delicious. So I’m back now that she’s restocked on some fruit pies,\" said Adragna. Jay Johnson said the delicious sweets warm the soul. \"It’s like your grandmother made at-home baked goods. It’s like that good, no disrespect to grandma,\" said Johnson. All the news you need to know, every day By clicking Sign Up, I confirmthat I have read and agreeto the Privacy Policy and Terms of Service.  This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX Television Stations "
}