{
    "title": "Elon Musk makes it known he hasn't been to therapy",
    "date": "2/29/2024",
    "url": "https://ca.movies.yahoo.com/elon-musk-makes-known-hasnt-201338393.html",
    "text": " Elon Musk has repeatedly said that his gravestone will read \"Never Went to Therapy.\" Musk has criticized psychologists, suggesting they are profit-driven and politically-motivated. Despite rejecting therapy, Musk has candidly spoken about his own mental health in the past. Elon Musk doesn't see a therapist and he wants you to know about it. The billionaire Tesla cofounder wrote in a post on X, formerly Twitter, on Wednesday: \"Put 'Never Went to Therapy' on my gravestone.\" It's not the first time Musk has brushed off therapy — or discussed his hypothetical grave marker. In the past two months, on January 8 and January 29, he posted some variation of the same line, urging future stonemasons to make it clear the SpaceX CEO never sought mental health counseling. The January 29 post was in response to a video of German filmmaker Werner Herzog, who said that psychoanalysis was \"one of the \"greatest stupidities, the greatest mistakes of the 20th century.\" \"Explaining every dark little corner that we have in our soul is a very unhealthy and stupid and dangerous thing,\" said Herzog, known for films like \"Aguirre, the Wrath of God\" and \"Grizzly Man.\" Meanwhile, Musk's January 8 post also suggested that his future tombstone reflect his status as the inventor of the \"car fart.\" Musk has railed against mental health professionals, arguing that friends are \"far better\" support for emotional issues. \"The incentive structure is to keep you hooked, never 'cured,'\" Musk said. \"Be especially wary of therapists in expensive neighborhoods — their true loyalty is to their landlord, not you.\" Musk has frankly discussed his own mental health in the past, including on an infamous episode of The Joe Rogan Experience podcast, where he said that social media can be seriously harmful to self-worth and emotional well-being. \"Some of the happiest seeming people [are] actually some of the saddest people in reality,\" he said on the podcast. He was pressed on his mental health in an interview with the New York Times at its DealBook Summit last year, where — after a long silence — he said, \"I wish we were on like a psychiatrist's couch here or something.\" \"It just feels like there's just a rage of horses in my mind, constantly,\" he said. He said those \"demons of the mind\" can be \"harnessed to productive ends,\" but added, \"that doesn't mean that once in a while they don't, you know... go wrong.\" He also mentioned having an \"existential crisis\" at a young age and that he contemplated suicide. \"What's the meaning of life?\" he said he once thought. \"Isn't it all pointless? Why not just commit suicide? Why exist?\" According to a Wall Street Journal report, Musk has previously used microdoses of ketamine to treat depression — a treatment that he endorsed on X. He has also written that hard drugs like psychedelics and ecstasy should be taken seriously because of the \"real difference\" they can make in mental health treatment, \"especially for extreme depression and PTSD.\" Musk did not return a request for comment before publication. Read the original article on Business Insider Money can't buy you happiness, but what about working with a financial advisor? “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by …  The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences. Follow all the action from Stamford Bridge I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” The Blues sit 11th in the Premier League table heading into the match SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x … Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag  In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story. Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action.  Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset. ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset. 2024 Subaru Crosstrek Review, Pricing, and Specs St Michael and All Angels Church in Tirley was \"marooned\" by water in January. The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics.  April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off A Dyson-rivaling hair dryer for just $30, a rare markdown on classic Levis and an Emeril-approved air fryer for $100-plus off await. In recent weeks, \"The View\" moderator Whoopi Goldberg has opened up about her use of the weight loss drug Mounjaro, a Type 2 Diabetes medication. "
}