{
    "title": "Musk pushes forward on transfer of legal home for SpaceX from Delaware, to \nTexas",
    "date": "2/16/2024",
    "url": "https://english.elpais.com/economy-and-business/2024-02-15/musk-pushes-forward-on-transfer-of-legal-home-for-spacex-from-delaware-to-texas.html",
    "text": "Elon Musk is looking to move the legal home of SpaceX to Texas from Delaware after a judge in that state voided the billionaire’s $55.8 billion Tesla pay package. A certificate of conversion for Space Exploration Technologies Corp. was filed to reincorporate in Texas from Delaware, which became effective on Wednesday. “SpaceX has moved its state of incorporation from Delaware to Texas! If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible,” Musk said in a post on X, formerly known as Twitter. The change by SpaceX comes just days after Musk’s brain implant company Neuralink moved its legal corporate home from Delaware to Nevada. Musk is a co-founder of the privately held Neuralink. Most corporations set up legal shop in Delaware because state law is typically favorable to corporations and experts say the change could backfire. Last month Delaware Chancellor Kathaleen St. Jude McCormick invalidated the pay package that Tesla established for Musk in 2018, ruling that the process was “flawed” and the price “unfair.” In her ruling, she called the package “the largest potential compensation opportunity ever observed in public markets by multiple orders of magnitude.” McCormick determined that Tesla’s board lacked independence from Musk. His lawyers said the package needed to be rich to give Musk an incentive not to leave — a line of reasoning the judge shot down. McCormick’s ruling came five years after shareholders filed a lawsuit accusing Musk and Tesla directors of breaching their duties and arguing that the pay package was a product of sham negotiations with directors who were not independent of him. The defense countered that the pay plan was fairly negotiated by a compensation committee whose members were independent and had lofty performance milestones. McCormick’s ruling bumped Musk out of the top spot on the Forbes list of wealthiest people. Musk previously wrote on X that shareholders of Austin-based Tesla would be asked to consider moving that company’s corporate registration to Texas. Sign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition Suscríbete y lee sin límites "
}