{
    "title": "Elon Musk Engages With Racial IQ Content On X While Facing Drug \nAllegations, Tesla Stock Turmoil - Tesla",
    "date": "2/26/2024",
    "url": "https://www.benzinga.com/general/education/24/02/37288311/elon-musk-engages-with-racial-iq-content-on-x-while-facing-drug-allegations-tesla-stock-turmoil",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW While most CEOs avoid wading into social topics or political issues, Tesla Inc TSLA CEO Elon Musk has not shied away from voicing his opinion. In addition to weighing in on the hot-button issue of immigration, in recent months, Musk has replied to and engaged with accounts that post about racial IQ gaps and other data related to race. Will Stancil, a metro policy researcher, pointed out that Musk has had frequent interactions with an account named @eyeslasho. The anonymous account has dozens of posts about IQ test scores by racial group, crime rates by race and more. Musk has replied to the account about 20 times, all in the last few months, according to X’s advanced search. Musk’s replies include exclamation points, “Well said” and more. “Race gaps in IQ exist (scientific consensus), IQ at an individual level has predictive validity for important outcomes (100s of supporting studies), only 16% of group diff researchers believe gaps contain no genetic influence,” @eyeslasho posted two weeks ago. However, scientists who study genetics disagree with the claim that genetics are the determining factor in IQ or intelligence. Sasha Gusev, a statistical geneticist at Harvard Med School, outlines data that shows that IQ scores and intelligence appear to be less influenced by genetics as research improves and more data is considered. “So we've gone from 51% to 20% to 14% as the field has learned how to apply these methods more precisely and address confounding,” Gusev said in a thread about the data related to genetics and IQ scores. Also Read: Elon Musk Responds After Bakery Owner Says Tesla Ordered 4,000 Mini Pies And Then Cancelled The Order Without Paying, Causing $16K Loss A few months ago, @eyeslasho posted about Black-on-white murder rates being higher than white-on-black murder rates. Musk replied with a simple exclamation point to the post, amplifying the post’s reach to Musk’s large audience on X.com. Musk has also come under recent fire for multiple reports regarding his illegal drug use. Some of the reports even allege that board members, including Larry Ellison, urged Musk to travel to Hawaii to do a “dry out” from his drug usage. Other friends encouraged Musk to attend some sort of rehab, according to The Wall Street Journal. Tesla’s board of directors has also been silent regarding Musk’s $55 billion compensation package, which was shot down by a Delaware court last month. Ross Gerber, a fund manager, called out Tesla’s board of directors on CNBC earlier this month and argued that some should be replaced with independent members who do not have financial ties to Musk. Other investors, like hedge funder, Tom Hearden, also spoke out against Tesla’s leadership. “ZERO response from the $TSLA BOD and Chairman regarding multiple published accounts of the CEO's drug use, the Delaware case, or reporting of board member's conflicts and drug use with the CEO,” Hearden posted on X. “It certainly bolsters the case that it's an impotent and beholden board.” Price Action: Tesla’s board is under scrutiny as the company’s stock has struggled throughout the last few months. While the overall stock market is hitting new all-time highs, Tesla’s stock is down more than 50% from its all-time highs. The S&P 500 ETF Trust SPY is up more than 4% since the start of 2024. Tesla’s stock is down almost 20% in that same time frame. Now Read: Carvana Stock Trades Like 'An AI Darling,' Short Seller Says: But 'Paint Will Eventually Peel Off' Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}