{
    "title": "Don Lemon taunts Elon Musk and teases their blockbuster interview on X as \nnew details emerge over doomed show",
    "date": "3/17/2024",
    "url": "https://www.dailymail.co.uk/news/article-13206163/Don-Lemon-taunts-Elon-Musk-teases-blockbuster-interview-X-new-details-emerge-doomed-deal-TV-host-demanded-free-Tesla-Cybertruck-8M-salary-stake-company.html",
    "text": "By James Gordon For Dailymail.com Published:  04:40 GMT, 17 March 2024   |  Updated:  04:41 GMT, 17 March 2024  121 View  comments  Former CNN anchor Don Lemon has taken to X taunting Elon Musk, all whilst promoting his upcoming interview with the X owner just a day after he was ridiculed for allegedly coming to him with a list of demands before the partnership with the platform fell apart. 'Every time @elonmusk tweets, a subscriber gets his wings. Tune in Monday,' Lemon wrote in a self-publicizing post which included the barb Musk had fired the previous day. On Friday night, Musk compared Lemon to the greedy Veruca Salt character from Charlie and the Chocolate Factory who screams, 'I want it now!' 'Don “Veruca Salt” Lemon', Musk tweeted as Lemon's alleged demands were laid bare. They included a Tesla Cybertruck, an $8 million salary, an equity stake in X together with a $5 million upfront payment on top. Former CNN anchor Don Lemon taunted X owner Elon Musk while promoting his upcoming interview after being ridiculed for unmet demands On Friday, Musk compared the former CNN anchor to a spoiled child from Charlie and the Chocolate Factory after it was revealed the TV host had an alleged series of demands before his new show streamed on X Musk likened Don Lemon to spoiled child Veruca Salt from Charlie and the Chocolate Factory The blowing up of Lemon's plans makes life difficult for X Chief Executive Linda Yaccarino who has been attempting to steer the platform away from simply being an echo chamber of Musk's own opinions and as a right-wing partisan tool. Lemon's involvement would have been key example of Musk's X demonstrating it is capable of being a welcoming home to other voices from across the spectrum and living up to ideals that Musk has oft touted, that X is a ' digital town square'. Officials at X stated there was no 'final or signed agreement with Don Lemon or 'The Don Lemon Show'' But a spokesperson at United Talent Agency (UTA) which represents Lemon, has poured cold water on the claims describing it as 'absolute, complete utter nonsense without an iota of truth to it.' Lemon is also alleged to have demanded a flight on a private jet flight together with a suite for him and his fiancé, according to the New York Post. In addition Lemon allegedly asked for X to pay for a day of drinking and massages. Lemon's list of demands went on and are alleged to have included executive assistants plus a budget for the marketing of his new show of up to $15 million. he blowing up of Lemon's plans makes life difficult for X Chief Executive Linda Yaccarino, seen right, who has been attempting to steer the platform away from simply being an echo chamber of Musk's own opinions and as a right-wing partisan tool Yaccarino eagerly welcomed Don Lemon to the X platform in January of this year Lemon is alleged to have requested a free Tesla Cybertruck in return for having his show on X After Tucker Carlson moved to X following his firing from Fox News, Musk himself said he hoped more would join from the left. 'I hope that many others, particularly from the left, also choose to be content creators on this platform,' Musk is quoted as saying. Indeed, Musk began courting Lemon for almost a year - as far back as last spring as he tweeted at him directly following his CNN firing. Yaccarino is also believed to have been instrumental in landing him on the platform. 'Have you considered doing your show on this platform? Maybe worth a try. Audience is much bigger,' Musk tweeted at Lemon last May. Later he tried to attract other left-wing broadcasters tweeting publicly: 'It’d be great to have @maddow, @donlemon & others on the left put their shows on this platform. No exclusivity or legal docs required! You will receive our full support. The digital town square is for all.' But the scuppering of the partnership, seemingly on a whim, may give pause for thought for thought to future tie-ups between X and other potential collaborators and advertisers as Yaccarino is left with the task of trying to assure brands that X can be trusted. Lemon was due to partner with Musk's X before things turned sour after the journalist questioned him about the rise in hate speech on his app and his alleged drug use. After Tucker Carlson moved to X following his firing from Fox News , in a May 2023 tweet Musk himself said he hoped more would join from the left Musk began courting Lemon for almost a year - as far back as last spring as this tweet shows In June of last year, Musk tried to attract other left-wing broadcaster tweeting publicly in an attempt to lure them over to the X platform Linda Yaccarino, CEO of X had been making concerted efforts to attract advertisers to the platform, but Musk's cancelling of his partnership with Don Lemon may now detract from that Lemon slammed the decision to have his show axed by Musk as an attack on his free speech. Musk countered by insisting Lemon would still be free to share his show on the platform without censorship, adding that 'we reserve the right to make decisions about our business partnerships.' The partnership wasn't a simply posting of Lemon's interviews which might appear on other platforms such as Facebook and YouTube, but the anchor would also have been producing content exclusive to X, such as short video clips and bonus material, together with a boosting of posts, thereby giving him a massive audience. Tucker Carlson, by way of example, regularly receives upwards of 5 million viewers to his X videos - far more than ever viewed his live Fox News broadcasts. It was clear that something was amiss when two days before his sit down interview, Musk appeared at a Morgan Stanley San Francisco conference when he was asked for his thoughts on Yaccarino's efforts to attract advertisers to the platform. 'I don’t really pay a lot of attention,' Musk replied. It was clear that something was amiss when Musk asked for his thoughts on Yaccarino's efforts to attract advertisers to the platform. 'I don’t really pay a lot of attention,' Musk replied By the time the pair sat down for the interview, the air was tense, yet Musk still agreed to participate despite Lemon's extravagant demands. 'Don, the only reason I’m doing this interview is because you’re on the X platform and you asked for it, Otherwise, I would not do this interview,' Musk told him. 'We had a good conversation. Clearly he felt differently,' Lemon said in a scathing statement, in which he said that he had entered an agreement to stream all of his shows on Musk's platform before the rug was pulled. 'His commitment to a global town square where all questions can be asked and all ideas can be shared seems not to include questions of him from people like me.' 'He never was my boss,' Lemon added during an interview on CNN on Wednesday. 'They never had any editorial control of the show. The only reason I was doing it is because of distribution. I wanted…my work to be seen by the biggest number of people.' Lemon appeared on The View on Friday to plug the forthcoming show, which is still going ahead through other platforms, where was consoled about the cancellation Don Lemon  revealed Elon Musk dished to him about his private chats with Donald Trump before the 'tense' interview resulted in the Tesla billionaire deciding to ax his show On Friday, Lemon set out to promote his show while suggesting Musk made a mistake by shelving any planned partnership Lemon released his own statement on the termination of his partnership between Musk and himself The journalist's new series, 'The Don Lemon Show', had entered into an agreement with X to promote the show, which would have seen him share in revenue from ads. After Lemon claimed that Musk was undercutting his free speech, the platform's business account clarified that he can still share his program, but 'after careful consideration, X decided not to enter into a commercial partnership with the show.' Lemon said that despite the show being cancelled, he will still air the interview with Musk, which covered a wide range of topics 'from SpaceX to the presidential election.' 'This will be just the first of many episodes of The Don Lemon Show,' he added. The interview is set to air on YouTube on March 18. 'While Elon goes back on his word, I will be doubling down on my commitment to free speech and I cannot wait to get started.' In response, Musk said that he decided to axe his partnership with the show after finding Lemon's approach was 'basically just CNN, but on social media.' 'And, instead of it being the real Don Lemon, it was really just Jeff Zucker talking through Don, so lacked authenticity,' he said. A source told The Post that Musk was 'underwhelmed' at the end of the show, and canned it after 'realizing how bad it was.' 'Don was underwhelming, unprepared and dull,' the insider continued. Although Swisher claimed they clashed over questions about Musk's alleged drug use, the source claimed Lemon failed to ask any interesting or edgy questions. 'He didn’t ask Musk about (ex-girlfriend) Amber Heard. Elon probably would have liked it,' they added. 'He was unpolished. He didn’t have producers in his ear. Jeff Zucker used to be in his ear and he would repeat back everything he was told,' they said, noting that Lemon had only a barebones crew that included his fiancé. Another former CNN anchor, Brian Stelter, also waded into the argument on X, claiming a source told him the interview was 'like a bad first date.' Lemon was ousted from CNN in April 2023 following 17 years with the company, after he sparked backlash with several controversial remarks, including branding Nikki Haley 'past her prime.' Lemon is alleged to have demanded a flight to Las Vegas on a private jet flight together with a suite for him and his fiancé, Tim Malone, pictured together here last April Lemon was ousted from CNN in April 2023 following 17 years with the company, after he sparked backlash with several controversial remarks, including branding Nikki Haley 'past her prime.' He also faced allegations from female co-workers who claimed that he had a history of misogynistic behavior, which he denied. The X show was intended to be a comeback for Lemon, and he was slated to tape three 30-minute episodes per week. He was recruited for a slate of shows, with deals also recently handed to Tulsi Gabbard and sports host Jim Rome. It was reported in January that Lemon entered an exclusive publishing deal with X, which has now seemingly halted monetization he would have received. He countered that he will now be sharing his content on YouTube. After releasing his statement, Lemon took to X to release a video of himself walking through New York, where he claimed Musk was 'so upset' about their interview. 'This does not change anything about the show, except for my relationship with Elon and X,' he said. 'I know that many of you were not happy that I was doing this in the first place, and you told me so. 'I just want you to know that I did this deal because not only do I believe in free speech, but I believed that this was my best possible chance for the work that I'm doing to reach the largest amount of people.' On Friday, Lemon appeared on The View to the forthcoming show, which is still going ahead through other platforms. He was consoled about the cancellation by the panel 'I think getting fired by Elon Musk is something you should wear as a badge of honor,' host Ana Navarro told him. Despite the rift, Lemon revealed he was able to glean some more information about Musk's relationship with Donald Trump which has been in the spotlight following reports the two billionaires had met. Musk reneged on the multimillion-dollar deal hours after the sit-down, where Lemon asked him about hate speech on Twitter and his personal drug use Lemon is alleged to have requested a Tesla Cybertruck, an $8 million salary, an equity stake in X together with a $5 million upfront payment on top 'Did he show his hand on whether he would support Trump?' Host Alyssa Griffin asked. 'He did talk about the meeting, why he went down, the context and the venue were in and he did talk to me about what the former president did have to say,' Lemon replied. Musk met with Trump in Palm Beach, Florida, fueling speculation he could be about to provide a much-needed cash injection into the presidential hopeful's campaign. Scant details have been released about the meeting, although Musk publicly came out to deny he would be endorsing any candidate shortly after. The South African CEO invited Lemon to bring his show to X after the former CNN host was dumped by the network on April 2023 after allegations of misogyny. But Musk reneged on the multimillion-dollar deal hours after the sit-down, where Lemon asked him about hate speech on Twitter and his drug use. In one clip played on The View, Lemon asked Musk about X users and hate speech including the 'great replacement theory' which Musk himself has amplified. The 'Great Replacement Theory' preaches that white European populations are being demographically and culturally replaced by non-white peoples - especially from Muslim countries. Speculation was ignited that Musk could be backing Trump after the two met in Florida. Pictured: President Donald Trump talks with Tesla and SpaceX CEO Elon Musk at the White House Feb. 3, 2017 But the billionaire was unimpressed and refused to answer the question directly, telling Lemon he did not have to agree to the interview. 'I don't have to answer questions from reporters. Don the only reason I'm doing this interview is because you're on the X platform and you asked for it. I'm criticized constantly I could care less.' The exchange prompted The View co-host Joy Behar to brand Musk a 'snowflake' and to ask Lemon if he knew what he was getting into with the controversial billionaire. 'There's an old saying in the south, you knew I was a snake when you picked me up. I'm not saying he is a snake, but it is relative to this situation I went into it with my eyes open. 'Truly I went into it with the best of intentions. I am an independent regardless of what people think, Elon Musk thinks I'm on the left, I am an independent. 'I believe in free speech. I believe people have the right to say whatever they want to say but you suffer the consequences for it. 'Twitter or X is one of the biggest information platforms in the world so why cede that to extremists? I wanted to get on their and fight it out so that everybody could have a voice.' Lemon revealed he was able to glean some more information about Musk's relationship with Donald Trump which has been in the spotlight following reports the two had met In the clips that have surfaced from Lemon's encounter with Musk, which Lemon described as 'tense at moments,' the pair covered a wide-range of topics, including Musk's use of drugs, his lack of support for Joe Biden and issues over moderation at X. CNN aired footage showing Lemon asking Musk about his recreational use of horse tranquilizer ketamine. The Tesla founder's use of the drug has been widely reported on and he himself has admitted to taking it. 'The reason I mentioned ketamine with prescription on the X platform is because I thought: 'Maybe this is something that could help other people.' That's why I mentioned it. 'Obviously I'm not a doctor but I would say that if someone has depression issues, they should consider talking to their doctor about ketamine.' Journalist Kara Swisher tweeted after news of Lemon's show being cancelled that she had warned him that it would happen, as she branded Musk 'the adult toddler.' She claimed that Musk's angry response came after he was asked 'questions about his ketamine use', an issue raised in a New Yorker article last year that claimed his use of the drug has 'escalated.' Citing those close to him, the article alleged that 'the drug, alongside his isolation and his increasingly embattled relationship with the press, might contribute to his tendency to make chaotic and impulsive statements and decisions.' Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}