{
    "title": "Tesla electric car factory expansion plan sparks treetop protest near \nBerlin, Germany.",
    "date": "3/3/2024",
    "url": "https://www.bbc.com/news/av/world-europe-68464382",
    "text": "Environmentalists in Germany have occupied part of a forest expected to be cleared if an expansion of Tesla's electric car factory near Berlin goes ahead. Scores of activists from across the country have built tree houses in the protest camp. Some locals have also voiced their opposition to the carmaker's plans, joining protesters in the forest. The BBC’s Russia editor Steve Rosenberg takes a look at what the papers are saying – and showing. One of the suspects was arrested on a road south of Moscow Pavel and his wife were attending a concert in Moscow when gunmen opened fire, killing dozens of people. A BBC documentary follows soldiers on their mission to protect Ukraine’s second largest city, Kharkiv. Russia has charged four men it says attacked a Moscow concert hall and killed at least 137 people. All were charged with committing an act of terrorism. The competition for waiters and waitresses began in 1914, but has not been held since 2011 due to lack of sponsors. UN Secretary General Antonio Guterres makes renewed call for a humanitarian ceasefire. More than a hundred people were killed in a packed concert venue in Moscow after gunmen opened fire. Moscow's state governor is shown the fire ravaged venue by rescue workers searching the location of Friday's attack. The BBC's Steve Rosenberg visits the Moscow concert hall where more than 100 were people were killed. A woman races to escape Crocus City Hall, where gunmen killed at least 60 people. BBC Verify examines video taken by those caught up in the attack on the Crocus City Hall theatre outside Moscow. Footage shows people taking cover inside the venue as multiple shots are heard. Footage shows gunmen in the lobby of a concert hall near the Russian capital Moscow. Large areas of Ukraine are suffering blackouts after Russian missiles targeted energy infrastructure. Video shows burning debris falling from the sky, as people take shelter in subway stations. Caolan McConville will be among 300 athletes at the Special Olympics Ireland Winter Games. Leo Varadkar announces that he is stepping down as taoiseach (Irish prime minister). Riot police kept demonstrators apart as Isaac Herzog attended the opening of a Holocaust museum in Amsterdam. The climbers got stuck 2,300m (7,500ft) up Monte Mondolè on Saturday. Copyright 2024 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.  "
}