{
    "title": "TESLA INC Trade Ideas — GETTEX:TL0 — TradingView",
    "date": "3/24/2024",
    "url": "https://www.tradingview.com/symbols/GETTEX-TL0/ideas/page-392/",
    "text": "TSLA: bearish trend of the previous day bullish entry only above (895.00) if they take entry below yesterday's closing price they would be entering the buy zone.\n\nTSLA: we only enter to sell below (840.00) always wait for confirmation, one more thing you should only use volume and price action are the best indicators Following the trend, I'd buy Tesla if breaks the latest high\n\nStop Loss - Below the latest low\n\n1st Target - R/R = 1,00 - 1/3 Position\n2nd Target - R/R = 2,00 - 1/3 Position\n3rd Target - R/R = 3,00 - 1/3 Position Price is near sell entry level of 923.38 in line with 100% Fibonacci projection and 78.6% Fibonacci retracement . Price can potentially dip to the take profit level of 794. 05 in line with 50% Fibonacci retracement . Our bearish bias is supported by the Ichimoku cloud indicator as price is trading below it. Alternatively, if prices continue to rally, it can go to... Price is near sell entry level of 923.38 in line with 100% Fibonacci projection and 78.6% Fibonacci retracement. Price can potentially dip to the take profit level of 794.05 in line with 50% Fibonacci retracement. Our bearish bias is supported by the Ichimoku cloud indicator as price is trading below it. Alternatively, if prices continue to rally, it can go to the... The deal to buy Tesla shares after confirming the penetration of the downtrend The deal to buy Tesla shares after confirming the penetration of the downtrend If you can get back above 884 with confirmation id consider that my confirmation on an extremely bullish continuation. Arguable whether or not the D point is actually your confirmation low after initially testing the .786 as the PCZ, of if we will get another test of the lows to confirm the .886.  One thing is clear, thats the bottom. \n\nHolding 819 would be ideal,... We´ve had  a solid bullish movement since Feb 24th, but are currently facing a very strong resistance at $885, and the 4-hour candles are giving us some short-term bearish indications. \n\nI would only go long after a healthy pullback or after a break and retest of $885.\n\nAt current levels, I´d only trade short scalps. Hello traders,\n\nas we can see, Tesla bounced rapidly up from the 0.78 fib and also the 0.61 fib is holding. keep patient and take your profits step by step ! TSLA: bearish entry in the area of (890.00) taking profits in the area of the previous day's low (853.78) Short the Ponzi back to $600\n\nNot even Burry could out-trade Elon Prices are on bearish momentum and abiding to our descending trendline resistance. We see the potential for a sell entry at 887.16 in line with 78.6% Fibonacci retracement towards our Take profit at 790.98 in line with 38.2% Fibonacci retracement and 100% Fibonacci projection. Our bearish bias are further supported by prices are trading below our Ichimoku cloud... TSLA: bullish trend of the day falling slightly, we only entered to buy above (895.00) higher we have sell zone (945.00) (925.00)\n \nTSLA: we only enter to sell below (845.00) possible rebound zone in the MV 200 daily chart. in case of a break in ka MV 200 our bearish entry should be (840.00) but first we must wait for it to retest D1 CHART. DOWNTREND\nIf you think my analyzes are successful and meaningful, please contribute by commenting and liking. The trendlines on chart make it clear.  Price broke white support line and came back up to retest it at shorter orange line.  Longer orange line creates a downtrending support based on price dips.   I expect that TSLA will start another move lower as it is in a channel for now and should return to lower line.  RSI will confirm if it stays below 50. The PEAD projected a Bullish outlook for $TSLA after a Negative Under reaction following its earnings release placing the stock in drift D with an expected accuracy of 90%. tesla just made a break out so we buy the market in short small correction to check the wave count. just for fun. randomly going through charts. for educational purposes only. Not for trade. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @youngtraderwealth @tradingauto6 @rok_trader @johndollery @jamurai82 @forex.alex @cryptoplayhouse @Tom Killick @andyoh6666 @jackentrepreneur @Trading_Jazz @ketoryfx @Onlnternet @scott.trades @udcovers @mytradingsetup @mytradingsetup @mikeoreaofficial Whatever the trade "
}