{
    "title": "Cathie Wood's Ark Continues Tesla Stock Buying Spree, Acquires Over $14M \nWorth Of Shares Amid Dip - ARK N",
    "date": "3/28/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/37999880/cathie-woods-ark-continues-tesla-stock-buying-spree-acquires-over-14m-worth-of-shares-amid-dip",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW On Thursday, Cathie Wood-led Ark Invest purchased a substantial number of shares in Tesla Inc. TSLA, despite the electric vehicle giant’s recent dip in stock price. The TSLA Trade Ark Invest’s ETFs, ARK Innovation ETF ARKK and ARK Next Generation Internet ETF ARKW, purchased 65,514 and 14,437 shares of Tesla respectively. This move comes after Tesla’s stock price had tumbled nearly 2.25%. The value of the Tesla shares bought by Ark Invest on Thursday is estimated to be around $14 million, calculated from the closing price of $175.79. This move continues Ark’s trend of increasing its bet on Tesla. Just earlier in the week, Ark had bought Tesla shares worth $28.21 million, as the stock rebounded and outperformed the broader market. Ark Invest’s Tasha Keeney estimated a $28 trillion opportunity in AI’s financial impact, particularly highlighting Tesla and drone technology. Keeney projected a rise in equity market capitalization linked to innovation, reaching $220 trillion by the decade’s end, with a focus on disruptive technologies like Tesla’s advancements in autonomous vehicles. See Also: Bitcoin, Ethereum Take A Breather While Dogecoin Spike Pushes Crypto Market Cap Above $2.6 Trillion — Analyst Sees BTC Hitting $80K Before Next Halving Other Key Trades: ARKK also sold 15,693 shares of Coinbase Global Inc COIN through ARKK and ARKW. The trade was calculated to be worth $4.16 million. Coinbase shares closed 3.28% higher at $265.12. Ark Invest’s ARKF fund bought shares of Roblox Corp RBLX and sold shares of Robinhood Markets Inc HOOD. The ARKG fund purchased shares of Twist Bioscience Corp TWST and shares of Personalis Inc PSNL. The ARKQ fund sold shares of UiPath Inc PATH and bought shares of Kratos Defense & Security KTOS. Read Next: ‘You’re About To Get A Sale’ On Nvidia: Jim Cramer Shares Insight On Buying During Pullbacks Engineered by Benzinga Neuro, Edited by \nShivdeep Dhaliwal The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}