{
    "title": "Elon Musk Companies Hold Billions in Bitcoin: Will They Sell Again?",
    "date": "3/8/2024",
    "url": "https://www.ccn.com/news/elon-musk-companies-hold-billions-bitcoin-will-they-sell-again/",
    "text": "Musk's Tesla BTC holdings increased | Credit: Steve Jennings/Getty Images for TechCrunch Key Takeaways The crypto community is once again buzzing about Tesla’s Bitcoin holdings  following the addition of a wallet tracking feature to Arkham Intelligence’s dashboard. Speculation abounds, with some users suggesting that Tesla may be acquiring Bitcoin, potentially unveiling details during its upcoming earnings call , while others ponder the possibility of an accounting discrepancy. As of the latest update, Tesla’s Bitcoin holdings have increased  to approximately 11,509 BTC. This marks a significant uptick of 1,789 BTC from the 9,720 BTC disclosed in its previous earnings announcement. Elon Musk’s company made a substantial investment in Bitcoin, purchasing $1.5 billion  of the cryptocurrency in February 2021 during the height of the previous market surge. Additionally, the company has revealed intentions to accept Bitcoin as payment for its vehicles. Be it as it may, Tesla’s foray into Bitcoin adoption experienced a brief tenure . It initially sold roughly 10% of its Bitcoin holdings in March 2021. By the second quarter of 2022, the electric vehicle giant had divested approximately 75% of its Bitcoin investments. Here’s a concise timeline detailing Tesla’s interactions with Bitcoin. Elon Musk’s relationship with Bitcoin has been a rollercoaster. In 2021, he showcased a bullish outlook on BTC, revealing Tesla’s strategy to hold Bitcoin in on-chain wallets. Yet, mere weeks after this announcement, Musk reversed his decision to accept Bitcoin as payment for Tesla vehicles, attributing the change to environmental worries surrounding the energy-intensive process of Bitcoin mining. On Twitter, there’s speculation among users regarding the recent increase in Tesla’s Bitcoin holdings. One user pondered  whether Tesla has recommenced buying Bitcoin, or if the alteration in numbers could be attributed to an accounting mistake. More likely that previous estimated holdings were off tbh pic.twitter.com/omakgeFp7c — Googly (👀,🫡) (@0xG00gly) March 7, 2024  Another user proposed  that Tesla might have initiated Bitcoin purchases following their last earnings announcement, speculating these acquisitions would be disclosed in the upcoming financial report. If @ArkhamIntel  on-chain tracking is accurate, Tesla has acquired an additional 1,789 BTC since the last earnings announcement, and is likely to announce this at the next earnings – @Tesla  used to reveal its Bitcoin holdings through earnings,2021 – sold 4,320 BTC2022 – sold… https://t.co/6eclXo3TxG — Definalist (@definalist) March 7, 2024  As of March 8, neither Tesla nor Elon Musk have made official statements concerning whether the company is actively purchasing BTC again. Elon Musk’s venture, SpaceX, has added Bitcoin to its balance sheet, following a suggestion from MicroStrategy co-founder and executive chairman Michael Saylor . This move places SpaceX alongside Tesla in Musk’s portfolio of companies that hold Bitcoin. MicroStrategy itself is a major player in the Bitcoin space, with 193,000 BTC in its holdings, making it the world’s largest institutional investor in Bitcoin. Whatever sins this platform may have, being boring is not one of them — Elon Musk (@elonmusk) July 17, 2023  At the Bitcoin Atlantis conference  on March 1, during a panel discussion, Saylor advocated for a bright future for Bitcoin. He highlighted the potential of AI and exchange-traded funds to kickstart a decade-long “gold rush” for Bitcoin, signaling an optimistic outlook for the cryptocurrency’s future. "
}