{
    "title": null,
    "date": "3/9/2024",
    "url": "https://www.ndtv.com/business-news/elon-musk-loses-40-billion-net-worth-in-2024-tesla-shares-shed-29-5206174",
    "text": "Elon Musk owns a 21 per cent stake in Tesla. (File) Tech billionaire Elon Musk has lost $40 billion of his net worth this year - the steepest fall reported in the top 10 rich list during this period. Once the richest man in the world, Musk now occupies the third spot with a net worth of $189 billion, showed Bloomberg Billionaire Index on Saturday. Louis Vuitton's Bernard Arnault is currently at the top with a $201 billion net worth. Amazon founder Jeff Bezos is behind him with $198 billion. Bezos had overtaken Musk to become the richest man earlier this week, but he was later replaced by Arnault.  Musk owns a 21 per cent stake in Tesla, which contributes to a major chunk of his wealth. However, the falling share prices of Tesla have impacted his net worth. Tesla has shed over 29% of its net value so far this year. The carmaker reported disappointing sales in China earlier this week and its factory near Berlin halted production after it was hit by an act of sabotage, which has impacted its share prices. It is also down about 50% from its 2021 peak. The recent setbacks for Musk also include a court order striking down his $55 billion pay package at Tesla. PromotedListen to the latest songs, only on JioSaavn.com Musk, who also owns microblogging platform X, is followed by Facebook founder Mark Zuckerberg with his net value pegged at $182 billion. At 53%, Zuckerberg also reported the highest gains in his net value this year. Among the Indians, Adani Group's Gautam Adani reported the highest gains during this period (18.2%). He occupies the 13th spot on the rich list with a net worth of $103 billion, according to the Bloomberg Billionaire Index. Track Latest News Live on NDTV.com and get news updates from India  and around the world. Watch Live News: Follow Us: ................................ Advertisement ................................ "
}