{
    "title": "Can Tesla's Charging Network Supercharge Its Stock?",
    "date": "3/16/2024",
    "url": "https://www.fool.com/investing/2024/03/16/can-its-charging-network-supercharge-tesla-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Tesla's (TSLA -2.25%) Supercharger network has grown to nearly 2,000 locations in the U.S. and comprises nearly 22,000 chargers. The total rises to around 50,000 if counting charging stations outside the U.S. The American Automobile Association cited the lack of convenient charging options as a reason many consumers do not want electric vehicles (EVs). Hence, the fact that the network is popular among Tesla owners is encouraging. And several legacy auto manufacturers have partnered with the company to stimulate sales of their EVs. Such an approach is new for the auto industry, as owners of petroleum-powered vehicles buy fuel from oil companies. And other companies have established competing charging stations. Thus, investors should ask whether the network helps Tesla's shareholders. The direct financial effects of Tesla's Supercharger network are not publicly available since the company does not offer revenue numbers for it. Results are published indirectly under the \"services and other\" category, which made up $8.3 billion of Tesla's $97 billion in revenue in 2023. But that also includes revenue from used vehicles sales, servicing, body-shop work, auto parts, insurance, and Tesla merchandise. Moreover, Tesla buyers might receive free use of the Supercharging network for a limited time -- or the entire ownership period, in a few cases. So it is difficult to estimate how much of a direct revenue driver this program is for the company. The company's financials might say a lot about investor priorities. They tend to focus on vehicle sales, which made up more than $78 billion (80%) of Tesla's revenue in 2023. The company has cut vehicle prices to increase sales and stay ahead of the competition. Some investors have soured on the stock amid falling gross margins, which dropped from 29% in 2022 to 19% in 2023. And firms such as Cathie Wood's Ark Invest believe the future of Tesla lies in selling subscription services for its self-driving technology, which has prompted Ark to issue a $2,000 share-price target by 2027. Ark did not mention Supercharging in this study, indicating it is not a priority for the investment group. However, reliable charging is undoubtedly crucial to all Tesla owners. Apartment dwellers might rely exclusively on such networks, and even those who can charge at home need the Superchargers for road trips. Tesla's performance in this area seems to bode well. A study by J.D. Power indicated that its Superchargers ranked highest for consumer satisfaction among DC fast chargers. It also noted a dramatic drop in customer satisfaction when Tesla owners used non-Tesla chargers. Thus, investors should assume the network plays a crucial role in keeping its owners satisfied with their ownership experience. The effects of Supercharging on Tesla stock appear more indirectly. The fact that the company doesn't break out revenue numbers indicates that Tesla sees charging revenue as a secondary source at best. Moreover, the automaker's self-driving technology bears no direct relationship to Supercharging. Nonetheless, a lack of reliable charging options is a significant impediment to EV ownership, and anything Tesla can do to mitigate concerns is a positive for its sales. Ultimately, investors should not buy the stock because of Supercharging, but they should make sure it adds Superchargers and maintains the quality of this network. Will Healy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}