{
    "title": "Musk's Tesla package was voided by a judge. Other CEO pay is probably safe: \nExperts",
    "date": "3/7/2024",
    "url": "https://www.businessinsider.com/elon-musk-compensation-package-tesla-executive-pay-corporate-governance-experts-2024-3",
    "text": "       A Delaware judge recently ruled that Elon Musk should not get a $55 billion compensation package for his work at Tesla despite his contributions to the company. The case itself was a rare instance in which a shareholder disputes a CEO's pay. It's even more unusual that a court in Delaware — notorious for its corporate-friendly legal system — chose to intervene. So now that Musk's compensation has to be renegotiated, will other executives kiss their massive bonuses, stock options, and paychecks, goodbye? Probably not. Corporate law and securities fraud experts told Business Insider that the ruling's impact may be limited given that the case with Musk and the circumstances around his compensation package were highly unique. \"I think this is a very notable case, and it perhaps expresses a willingness to scrutinize executive compensation arrangements, but I'm not sure that we will see all that many cases like this,\" James Park, a securities fraud expert and law professor at the University of California, Los Angeles, told Business Insider. The size of Musk's payout was an unusual aspect of the case, which Chancellor Kathaleen McCormick determined was excessive. Related stories Park said there is no precedent in the history of CEO compensation packages that compares to Musk's contract, which may have made the arrangement \"more difficult to defend,\" he said. The unique package was structured so that the size of Musk's stock options was determined by Tesla's market evaluation. The more Tesla was worth, the higher Musk's compensation would get. \"Most public companies — I don't think they would really believe that they could double, triple, quadruple in size,\" Park said. Musk has railed against the decision, declaring on X, his social media platform, that businesses should incorporate their companies elsewhere. Tesla has not yet said if it would appeal the decision to the Delaware Supreme Court. But the arrangement itself may not have been the final blow to Musk's payout. Ann Lipton, corporate law expert and law professor at Tulane University, told BI that critical to McCormick's ruling was her finding that the Tesla board of directors who greenlighted the contract had \"extremely close ties to Musk.\" There has always been scrutiny around the board's relationships with the CEO and conversations around good corporate governance. Still, the case with Musk was \"more than just, 'They traveled in the same circles,'\" Lipton said. Tesla's eight-person board includes some of Musk's close friends and his brother Kimbal. Musk's attorneys and a spokesperson for Tesla did not immediately respond to a request for comment from Business Insider. \"The level of closeness here and the level of deference to him when negotiating his package, ostensibly being at an arm's length, was simply far beyond the norm of what we might call structural bias,\" Lipton said. \"This is simply on a different level.\" When asked if Musk's case will establish an important legal precedent for executive pay, Lipton said, \"Not even a little,\" emphasizing that Tesla was a \"highly unusual situation.\" \"I don't know whether individual CEOs are panicking or taking Elon Musk as a role model, thinking, 'Well, if he doesn't like Delaware, then I have to move out of Delaware,'\" Lipton said. \"But I know, from a legal perspective, this really isn't that to other CEOs who simply abide by decades of what we consider to be good corporate governance — which is that you don't have your pay package negotiated by your very bestest friend.\" Read next Jump to "
}