{
    "title": "Before Purchasing a Tesla in the Future, You Must Experience a Self-Driving \nTest Ride | Globe Echo",
    "date": "3/26/2024",
    "url": "https://globeecho.com/before-purchasing-a-tesla-in-the-future-you-must-experience-a-self-driving-test-ride/",
    "text": "Elon Musk, the CEO of Tesla, recently sent a memo to Tesla employees instructing them to “install and activate” the company’s Full Self-Driving (FSD) software for each new customer. This memo also required staff to give North American customers a “short test ride” after activating a free month trial that will now come with each new car in the US. Even though this new process may slow down delivery, Musk emphasized that it is a “hard requirement.” Tesla employees are also now required to give demos to customers who receive vehicles back from service in order to showcase the capabilities of the FSD technology. The move to more directly market Tesla’s autonomous car technology to customers comes amid increased scrutiny over the company’s safety practices. Tesla has faced criticism for over-promising what its autonomous technology can do, potentially putting customers and others in danger. The company sells two technologies, Autopilot and FSD, with FSD offering more advanced features such as following a pre-mapped path and stopping at traffic lights. However, drivers are still expected to be ready to take control of the vehicle at any time. Two years ago, California’s Department of Motor Vehicles accused Tesla of false advertising for its Autopilot and FSD features, stating that active supervision from the driver is required. A criminal investigation was also launched by the Department of Justice after multiple crashes involving Autopilot software. In response to safety concerns, Tesla announced a voluntary recall of over 2 million vehicles for a software fix aimed at ensuring drivers pay attention to the road even when Autopilot is engaged. Despite these challenges, Tesla and Musk have maintained that their data shows Autopilot and FSD are safe. With the push towards FSD, Tesla aims to expand the usage of its autonomous technology and potentially gather more data to improve its systems. Musk has previously stated that FSD could enable Tesla owners to turn their cars into robotaxis, allowing them to earn money when they are not using their vehicles. Additionally, Musk has hinted at the release of Tesla’s own robotaxis in the near future. By promoting FSD and showcasing its capabilities to customers, Tesla hopes to demonstrate the value and safety of its autonomous technology in the competitive automotive market. Get the latest creative news from FooBar about art, design and business.   By signing up, you agree to the our terms and our Privacy Policy agreement. Type above and press Enter to search. Press Esc to cancel. Login to your account below. "
}