{
    "title": "Elon Musk speaks out on Tesla's unprecedented sales goal: 'It will be a \nvery hard climb'",
    "date": "3/10/2024",
    "url": "https://www.thecooldown.com/green-business/tesla-2030-sales-elon-musk-vehicles/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. \"The show will be worth the price of admission.\" Photo Credit: Getty Images Elon Musk still wants Tesla to sell 20 million vehicles in a single year by 2030 — and he appears to believe the goal is difficult but not impossible. In order to hit its goal of 20 million vehicles sold in 2030, Tesla will have to expand its sales output by more than 10 times its 2023 levels, according to Teslarati. The company sold about 1.8 million vehicles last year, as Automotive News reported — and it was only able to hit that number because its Model Y was the highest-selling vehicle in the entire world, as JATO Dynamics data indicated. On social media, Musk said the goal is achievable but that it will be a tough challenge. \"It will be a very hard climb to 10X output. Doable, but it is an immense amount of work,\" he wrote on X, formerly known as Twitter. One factor that could help Tesla hit its intended mark is its forthcoming more affordable car, which has been named Redwood. The new model may be as inexpensive as $25,000 — much cheaper than the company's current cheapest vehicle, the Model 3, which costs around $39,000 before incentives. \"Our current schedule shows that we will start production towards the end of 2025,\" Musk said of the Redwood, per Reuters. The electric vehicle automaker also has plans to develop a self-driving robotaxi alongside the Redwood, which could further boost Tesla's sales. And, of course, Tesla's new Cybertruck aims to shake up the pickup market with its boxy, futuristic design. It's another example of the automaker's attempt to expand its reach by diversifying its vehicle offerings, which should help it compete with gas-guzzling car manufacturers. Despite these factors, Teslarati readers shared their skepticism about the 20 million vehicle goal in the comments section. \"With 41% growth every year for seven years, 1,808,581 in 2023 would rise to 20,038,802 in 2030. Can Tesla achieve 41% growth for seven years? The show will be worth the price of admission,\" one user wrote. \"Despite the big brains and long hours behind this scale-up plan, there will be unknown problems and constraints outside their control such as Macro economics, supply chain and geopolitical tensions,\" another user noted. \"If Tesla really aims at selling 10m+ vehicles by 2030, Project Redwood must just be the tip of the iceberg. Tesla will have to launch at least two new models each year from now to 2030 or bet the farm on the FSD and the Robotaxi,\" a third user commented. Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}