{
    "title": "Explained: How does new EV policy pave road for Elon Musk's Tesla in India?",
    "date": "3/15/2024",
    "url": "https://www.hindustantimes.com/car-bike/explained-how-does-new-ev-policy-pave-road-for-elon-musks-tesla-in-india-101710499547739.html",
    "text": "Subscribe Now! Get features like Centre on Friday approved a new policy for electric vehicles which offers duty concessions on imported cars to companies that invest at least USD 500 million to set up manufacturing units in India. ALSO READ- Swapping: A solution for India’s e-mobility • The foreign companies must invest a minimum of $500 million or approximately ₹4,150 crore in investment and manufacturing facilities within three years under the policy, to avail the concession on import tax, the government said in a statement. • Duty concessions on the total imported EVs are capped at the investment made or ₹6,484 crore (equivalent to the incentive under the PLI scheme), whichever is lower. • If the investment exceeds USD 800 million, a maximum of 40,000 EV imports will be allowed for five years at a lower tax of 15 per cent on cars costing $35,000 and above, not exceeding 8,000 per year. Carryover of unused annual import limits is permitted. • The company's investment commitment must be supported by a bank guarantee, substituting the forgone customs duty. • Failure to meet the domestic value addition (DVA) and minimum investment criteria outlined in the scheme guidelines will result in the invocation of the bank guarantee, as stated in the announcement. The policy's reduction in import tax rates is a significant victory for Tesla, something the company has been lobbying for extensively, with its chief, Elon Musk, questioning these taxes as “among the highest in the world”. Despite years of attempts to enter India, Tesla faced roadblocks from New Delhi, which demanded a commitment to local manufacturing. Over recent months, Tesla representatives visited India frequently, and CEO Elon Musk even met Prime Minister Narendra Modi last year. At present, cars imported as completely built units (CBUs) attract customs duty ranging from 60 per cent to 100 per cent, depending on their cost. Tesla's cheapest vehicle, the Model 3, starts at $38,990 in New York above the floor price in the policy, according to the carmaker's website. Recently, commerce and industry minister Piyush Goyal said that India will not tailor its policies to suit US EV maker Tesla, and its laws and tariff rules will be formulated to attract all-electric vehicle manufacturers from across the world to set up a base in the world's fastest-growing economy. ALSO READ- Will Centre change rules to suit Elon Musk's EV maker Tesla? Union minister Piyush Goyal replies According to the statement, the new EV policy \"will provide Indian consumers access to the latest technology, boost the Make in India initiative, strengthen the EV ecosystem by promoting healthy competition among EV players, leading to high volume of production, economies of scale, lower cost of production, reduce imports of crude oil, lower trade deficit, reduce air pollution, particularly in cities, and will have a positive impact on health and environment\". The policy aims to draw investments from reputed global electric vehicle manufacturers into the e-vehicle sector, it added. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}