{
    "title": "Analysis-Could the $6 billion legal fee in Musk's Tesla pay case be \nreasonable?",
    "date": "3/6/2024",
    "url": "https://whbl.com/2024/03/05/analysis-could-the-6-billion-legal-fee-in-musks-tesla-pay-case-be-reasonable/",
    "text": "By Tom Hals WILMINGTON, Delaware (Reuters) –     The lawyers who successfully voided Elon Musk’s $56 billion Tesla pay package as excessive admitted their request for a $6 billion fee is “unprecedented,” but by some measures, it might be cheap. The fee request, like Musk’s pay package targeted in the case, defies easy comparisons. A judge in Delaware in the coming weeks will be asked to decide if it is reasonable and meets various legal requirements. The fee implies an hourly rate of $288,888 for the work that each of the 37 lawyers, associates and paralegals spent on the case, according to documents filed in the Court of Chancery in Delaware. By comparison, top-flight corporate attorneys bill $2,000 an hour and associates with several years under their belt at the biggest white-shoe law firms make around $288,000 – a year. At that $2,000 an hour rate, the total time put in by the shareholders’ legal team – some 19,500 hours – would amount to about $39 million, a far cry from $6 billion. In addition to its size, the fee is unusual in that the legal team is seeking to be paid by taking part of what Musk is giving up, the Tesla stock in his pay package. They are seeking 29 million of the 266 million shares of Tesla stock the company is receiving as a result of the ruling. They argue the fee will cost Tesla nothing. The shareholder’s legal team comprised three law firms, Bernstein Litowitz Berger & Grossmann and Friedman Oster & Tejtel, both based in New York, and Andrews & Springer of Wilmington. The legal team declined to comment beyond what was in their court filing, according to an email from Greg Varallo of Bernstein. Typically in shareholder lawsuits like the one Richard Tornetta filed in 2018 over Musk’s pay, the legal team works for free and hopes to get a cut of any eventual settlement or judgment. The record for a fee in a shareholder lawsuit is the $688 million awarded in 2008 for the lawyers who represented Enron shareholders, according to Stanford Law School. The securities fraud case stemmed from the commodities trader’s hidden debts that led to its bankruptcy. Judges do not look at the sheer size of the fee alone, but even by other measures the Musk case fee tops Enron. The Enron fee represented 9.5% of the settlement of $7.2 billion, also a record. By comparison, the lawyers in the Musk case said their fee request equaled 11% of the stock Musk would be returning to Tesla. Federal judges tend to award lower percentages as a  settlement grows in size, especially in cases that top $1 billion. EXCEPTIONS But there are exceptions, and those exceptions looks like the Musk case. In 2016, a federal judge awarded an unusually high fee of 25%, or $422 million, of a $1.6 billion settlement in a securities lawsuit against the consumer finance company Household International for concealing its poor lending practices. That case lasted 14 years and, like the Musk case, involved a rarity in shareholder litigation, a trial. The court said the years of work and risk justified the fee. Fortunately for the shareholder’s legal team in the Musk case, it was litigated in Delaware state court, which takes into account factors such as a legal team’s efforts and the complexity of the case in assessing fees. Delaware’s approach was highlighted in a 2011 ruling approving a fee of $304 million for a legal team in a case that challenged a deal by Southern Copper Corp that was found to improperly benefit its controlling shareholder, Grupo Mexico. Delaware judge Leo Strine was confronted with a request for a then-unprecedented fee that came to $35,000 an hour, which the defendants argued would “destabilize” the legal system. Strine said it provided a healthy incentive and approved the fee, which worked out to 15% of the $2 billion judgment. Delaware’s approach may be about to change. The Delaware Supreme Court is weighing an appeal of a fee that worked out to 27% of a $1 billion settlement in 2022 involving Dell Technologies. The company was sued in a class action case over a 2018 stock conversion related to Dell’s stake in VMware. In May, the court will hear oral arguments, and two groups of law professors have weighed in with opposing amicus briefs — one arguing Delaware encourages shareholder lawyers to shoot for the biggest settlements, and the other arguing fee percentages should fall as recoveries grow. “Scholars have spent many lifetimes trying to figure out the best way for clients to pay their lawyers,” said the brief from law professors including Brian Fitzpatrick of Vanderbilt Law School, who argued in favor of the 27% fee. “But, with respect, we think that is a fool’s errand.” (Reporting by Tom Hals in Wilmington, Delaware; Editing by Bill Berkrot) You must be logged in to post a comment. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}