{
    "title": "Tesla Just Delivered a Record Number of Electric Vehicles, but That Isn't \nthe Best Reason to Buy the Stock",
    "date": "1/5/2024",
    "url": "https://www.fool.com/investing/2024/01/05/tesla-delivered-record-electric-vehicles-buy-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Tesla (TSLA -2.25%) is coming off a record year in 2023 for electric vehicle (EV) production, deliveries, and revenue. Its stock, however, still trades 39% below its all-time high. In the fourth quarter (ended Dec. 31), Tesla lost its prestigious position as the world's largest EV company by sales after being overtaken by China-based BYD. Plus, there seems to be a shrinking probability that Tesla can live up to CEO Elon Musk's ambitious growth targets in the coming years. If that winds up being the case, Tesla shares might be too expensive right now despite trading below their best-ever levels. But the company is working on other technologies that could eventually drive its growth forward, and they might be better reasons for investors to buy the stock. Image source: Tesla. Economic conditions have been challenging around the world for the last 18 months. The U.S. Federal Reserve raised interest rates at the fastest pace in its history between March 2022 and August 2023, in a fight against outsized inflation. Consumers tightened their belts to better deal with the elevated cost of living, which pressured demand for big-ticket items like cars. Tesla entered last year expecting to sell 1.8 million cars. As 2023 progressed, the company not only faced economic headwinds, but it also saw rising competition from other EV producers like BYD, as well as legacy automakers like Ford Motor Company and General Motors. As a result, Tesla slashed its vehicle prices by 20% on average in the 12 months leading up to August 2023 in order to remain on track to meet its sales target. The move dented Tesla's gross profit margin, which has routinely been the highest in the industry. In the third quarter of 2023, margins fell to 17.9% from 25.1% the prior-year period. On the plus side, the price cuts helped stifle some competitive threats; both Ford and General Motors postponed or canceled billions of dollars' worth of EV spending initiatives in 2023. Ford currently loses $36,000 on each EV it produces and competing with Tesla on price will lead to mounting losses in the short term. However, both Ford and General Motors cited falling demand for EVs in general as a reason for pulling back from the industry, and that could be a warning sign for Tesla. Here's the good news: Tesla delivered a record 1,808,581 cars to customers in 2023, which is a sign its initiatives to spur demand were successful. It was slightly above the company's forecast of 1.8 million, and it amounted to growth of 38% compared to 2022. However, Elon Musk wants to increase production by 50% per year for the foreseeable future. He believes the company can operate 12 gigafactories by 2030 (up from five today), with an annual manufacturing capacity of 20 million EVs. But with deliveries rising well below 50%, it's very unlikely Tesla will hit Musk's target within the next seven years.  Delivery growth could slow down even further in 2024. Early estimates from Wall Street suggest Tesla will deliver 2.2 million cars this year, representing an increase of just 21% compared to its 2023 result. Musk will likely provide an official forecast in the company's upcoming Q4 earnings report due later this month. To make matters worse, the aforementioned price cuts are set to bring Tesla's official 2023 earnings per share down by 22% to $3.15. That gives the stock a price-to-earnings (P/E) ratio of 77.8, which is more than double the 30.1 P/E ratio of the Nasdaq-100 technology index. Wall Street believes Tesla's earnings will return to growth this year, potentially coming in at $3.80. However, unless Tesla share prices fall dramatically from here, that would still result in an elevated P/E ratio of 64.7 at the end of 2024. Tesla stock might be expensive by traditional metrics today, but that doesn't mean investors shouldn't buy it. See, the company is a leading developer of fully autonomous self-driving software, which could be a game changer for its economics. Software can be developed once and sold an unlimited number of times, so it carries a high gross profit margin. The software will be sold to Tesla owners on a subscription basis, but Musk is also considering licensing it to other automakers. Plus, he wants to build an autonomous ride-hailing network (like Uber, but without human drivers), which could become another high-margin revenue stream. Finally, Tesla intends to launch a purpose-made autonomous robotaxi vehicle, and it could come as soon as this year. By 2027, Cathie Wood's Ark Investment Management believes autonomous technologies could propel Tesla's share price to $2,000, which would be an 816% increase from where it trades today. That level of growth is very ambitious given Tesla's self-driving software is still in the beta testing phase with no official release date, but it's likely the direction the company is headed over the longer term. Buying Tesla stock today is probably the wrong move for short-term investors, but those with a time horizon of 10 years or more could eventually be sitting pretty. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends BYD, Tesla, and Uber Technologies. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}