{
    "title": "Hertz is selling Teslas for as little as $21,000, as it offloads the pricey \nEVs from its rental fleet",
    "date": "1/12/2024",
    "url": "https://www.cbsnews.com/news/tesla-cars-used-hertz-discount-ev-fleet/",
    "text": "Watch CBS News By\n                  Elizabeth Napolitano Updated on:  January 12, 2024 / 12:28 PM EST\n          / MoneyWatch Tesla fans may soon be able to snap up one of the company's famously pricey cars for roughly 39% off from Hertz. The rental car company has listed 607 ex-rental Teslas, including many smaller Model 3s cars, on its used car sales page. The cars range in price from $21,557 for a 2021 Model 3 to $40,886 for a 2022 Model Y. New Tesla Vehicles begin at $35,090, Tesla's website shows. Hertz plans to sell 20,000 electric vehicles (EVs) as it winds down its push to convert a sizable portion of its rental fleet to EVs, the company Thursday said in a regulatory filing, citing the high repair costs required to maintain the vehicles. Tesla vehicles have become increasingly affordable as more EVs hit the used car market, potentially making the cars more accessible to a wider range of drivers, a report from EV battery research company Recurrent Auto shows. The average listing price of a used Tesla Model 3 car has fallen below $30,000 for 2017 to 2019 vehicles. Customers who buy a used EV are eligible for a $4,000 tax credit. Used EV sales are expected to increase 40% in 2024 from the year prior, according to Recurrent Auto. Elizabeth Napolitano is a freelance reporter at CBS MoneyWatch, where she covers business and technology news. She also writes for CoinDesk. Before joining CBS, she interned at NBC News' BizTech Unit and worked on The Associated Press' web scraping team. First published on January 12, 2024 / 10:26 AM EST © 2024 CBS Interactive Inc. All Rights Reserved. Copyright ©2024 CBS Interactive Inc. All rights reserved. Quotes delayed at least 15 minutes. Market data provided by ICE Data Services. ICE Limitations. Powered and implemented by FactSet. News provided by The Associated Press. Legal Statement. "
}