{
    "title": "1 Top Artificial Intelligence (AI) Stock to Buy Before It Soars 46%, \nAccording to This Wall Street Analyst",
    "date": "1/1/2024",
    "url": "https://www.fool.com/investing/2024/01/01/1-top-artificial-intelligence-ai-stock-to-buy-befo/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The larger an object, the more force is needed to move it. And with a market cap of $800 billion, moving Tesla (TSLA -2.25%) requires a lot of force. Over the coming years, the company will need to generate significant value to maintain its stock's upward momentum. And in the mind of Morgan Stanley analyst Adam Jonas, this could come from its investments in artificial intelligence (AI) and self-driving technology. Jonas recently reiterated an \"overweight\" buy rating on Tesla stock and a 12-month price target of $380, representing a gain of 46% from its current price. The analyst believes Tesla's potential to become a diversified technology company overshadows near-term headwinds in its automotive operations. Let's dig deeper into what the future may hold. Self-driving cars have been described as the \"mother of all AI projects\" because of the complexity of dealing with so much real-time and unpredictable data. Making the concept work may require a hypothetical form of AI called artificial general intelligence (AGI), which allows software to think and learn at the same level as a human. And as a front-runner in the race for full self-driving, Tesla may have a head start in developing a much more transformational technology. For Jonas, Tesla's edge centers around Dojo, a supercomputer it is building to train machine learning and full self-driving models. Dojo processes vast amounts of driving data generated by Tesla vehicles in real-world scenarios. And perhaps more importantly, it is using this data to develop computer vision -- a possible precursor to AGI, with use cases in many other industries like robotics, healthcare, and security. As the tech develops, Jonas believes Tesla could eventually start generating significant revenue from software sales and licensing, representing the next leg of its growth story. While Jonas' projections sound plausible, they rely on many assumptions. The biggest one is that Tesla will succeed in full self-driving anytime soon, which is far from guaranteed. The second is that other companies will be asleep at the wheel and not offer meaningful competition to its computer vision software. But even if Tesla's results fall below the analyst's lofty projections, investors can still bet on the company's many other growth drivers. Image source: Getty Images. While Tesla's core automotive business is under near-term pressure, challenges like high interest rates look set to ease over the coming years, lifting demand for new cars. Further, management's pledge to halve costs on Tesla's next-generation vehicles is beginning to show fruit. According to CEO Elon Musk, Tesla is working on a $25,000 car called the Model 2, which could arrive in 2025. This follows a Reuters report that the company plans to build a 25,000-euro ($26,863) car for the EU market at its factory in Berlin, Germany. Cheaper cars could help Tesla achieve its long-term goal of becoming a mass-market automaker and help make up for declining margins with higher production volume. Going into 2024, Tesla is no longer the screaming buy that it was at the beginning of 2023. With a forward price-to-earnings (P/E) multiple of 74, the company is once again a tough sell for value-oriented investors. That said, Tesla has a track record of proving the naysayers wrong and justifying its premium price tag. Jonas' bullish commentary highlights Tesla's potential to become more than just an electric automaker. And shareholders could be richly rewarded if it achieves even a fraction of his lofty vision. For me, the stock is still a buy or an optimistic hold until more data becomes available.  Will Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}