{
    "title": "Forget Tesla, This EV Stock Is Poised for an Incredible Run",
    "date": "1/20/2024",
    "url": "https://www.fool.com/investing/2024/01/20/forget-tesla-ev-stock-poised-for-run-rivian/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More There's no argument that Tesla (TSLA -2.25%) tops the list in any discussion of electric vehicles. It also gets name-dropped regularly when it comes to a discussion of growth stocks sitting in long-term investment portfolios. After all, the company is approaching a trillion-dollar valuation, and shares have already appreciated over 13,600% since Tesla went public. But it doesn't hurt to look for the next big thing in an industry with decades of growth ahead. Recent business developments could make Tesla's younger rival, Rivian (RIVN -0.36%), that future winner. Admittedly, the stock currently trades down roughly 90% from its high. However, the company's brightening future could soon win over Wall Street and send the stock soaring. Here is what you need to know. Challenging Tesla head-on is a tall task (as companies like Ford Motor Company and General Motors are finding out). Rivian is a relatively new EV manufacturer that has a few models out. Its light-duty pickup truck (R1T) and SUV (R1S) get most of the attention. They compete with Tesla's Cybertruck and Models X and Y. However, Rivian's first significant business win came from partnering with e-commerce giant Amazon to produce electric commercial vans. Rivian has produced about 10,000 vans for Amazon's fleet, and there is an agreement in place for Rivian to produce 100,000 in total for Amazon by 2030. This delivery van production partnership was initially exclusive to Amazon, but Rivian announced last fall that it was ready to start offering its EV commercial van to the broader market. Telecom giant AT&T announced in December that it had placed orders for the van and would begin incorporating them into its fleet this year. This is exciting for two reasons. First, Rivian now has access to a corporate customer base largely seeking ways to offset carbon emissions, and fleet-heavy companies could look to Rivian's vans to achieve that. Second, Tesla is all over the broader vehicle market, but it does not have a commercial van yet and hasn't announced one. This is a clear niche that Rivian can fill as it works to grow its manufacturing volume and strive toward profitability. Operating the factories that build cars and trucks costs a ton of money. Every vehicle company faces a significant obstacle: building enough units to cover those costs and still have a leftover profit. So far, Rivian is consistently burning cash on its factories, but you can see that quarterly losses began improving in Q2. If you annualized its Q3 cash burn, that's $4 billion in cash losses. Rivian has more than $9 billion in cash on its balance sheet, so it has enough money to fund its business for two years at that rate. Ideally, losses will continue to shrink as Rivian produces more units.  RIVN Free Cash Flow (Quarterly) data by YCharts As long as Rivian's financials continue improving, it should reach a point where Wall Street sees the stock in a new light. While free cash flow doesn't technically equal bottom-line profits, producing cash flow shows a business is sustainable and could give investors much more confidence in Rivian's future. The stock is still down roughly 90% from its former high in late 2021. The market was quite bubbly then, so investors shouldn't expect a new high anytime soon. However, that doesn't mean shares don't show promise. You can see below that Rivian's price-to-sales ratio is near its lowest point since the company went public. That's because Rivian's grown its business over the past few years while shares have continued falling. Today, Rivian's valuation is less than half of Tesla's. That may be deserved given Rivian's lack of profits, but it has arguably more growth potential because it's a fraction of Tesla's size. Remember, small numbers grow more easily than huge numbers.  RIVN PS Ratio data by YCharts Here is why the stock could soar: Rivian's stock is being treated like a company burning cash. That treatment is deserved ... for now. Assuming Rivian's growth continues, and its commercial van is an excellent opportunity for that, cash losses should continue shrinking. If Wall Street recognizes that Rivian is on a firm path to making money, the market could boost the stock's valuation. Add in the naturally occurring revenue growth that will take place in the background over the coming quarters, and the combination could produce outsized investment returns as Rivian becomes a more popular name in investor circles. Rivian is far less proven than Tesla, but sometimes, going against the grain is how you find the best investment ideas. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon and Tesla. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}