{
    "title": "Elon Musk’s Tesla can apply for battery PLI sops: Heavy Industries Ministry",
    "date": "2/9/2024",
    "url": "https://m.economictimes.com/industry/renewables/elon-musks-tesla-can-apply-for-battery-pli-sops-heavy-industries-ministry/articleshow/107558281.cms",
    "text": "Download The Economic Times News App to get Daily Market Updates & Live Business News. Download The Economic Times News App to get Daily Market Updates & Live Business News.  Falling Adani Group stocks keep MFs away. Will Sandeep Tandon’s contra bet work? Was Dalal Street underestimating the potential of Maruti’s first EV? Tata Motors boards Chennai express, reaches Hyundai’s doorstep with an INR9,000 crore plant The missing link: How criminals teamed up with bank employees to orchestrate cyber frauds. Nifty financial service index stocks: Are headwinds slowing down? Is all the bad news and views priced in ? 4 stocks from the natural gas sector for contrarian trade. Trending Now Hot on Web In Case you missed it Top Calculators Top Story Listing Top Slideshow Top Searched Companies Top Commodities Top Prime Articles Top Definitions Top Market Pages Top Videos Private Companies Follow us on: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin. Log In/Connect with: Will be displayed Will not be displayed Will be displayed Worry not. You’re just a step away. It seems like you're already an ETPrime member with Login using your ET Prime credentials to enjoy all member benefits Log out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits. Exclusive Economic Times Stories, Editorials & Expert opinion across 20+ sectors Stock analysis. Market Research. Industry Trends on 4000+ Stocks ​Get 1 Year Complimentary Subscription of TOI+ worth Rs.799/-​ Stories you might be interested in "
}