{
    "title": "For these reasons, Wall Street is turning its back on Tesla",
    "date": "3/30/2024",
    "url": "https://www.breakinglatest.news/business/for-these-reasons-wall-street-is-turning-its-back-on-tesla/",
    "text": " Teslas CEO Elon Musk. Antonio Masiello/Getty Images Tesla shares have fallen nearly 30 percent so far this year and have been downgraded by several Wall Street firms. Wells Fargo, Wedbush Securities and Bernstein were the latest companies to withdraw their forecasts for the electric car maker. They justify this with disappointing deliveries, lower demand and conflicts in company management. This is a machine translation of an article from our US colleagues at Business Insider. It was automatically translated and checked by a real editor. While stock market indices continue to hit a series of record highs this year, 2024 has not been so kind to Tesla. In less than three months, the electric car manufacturer lost almost 30 percent, losing more than $230 billion (€213 billion) in value. At the close of trading on Thursday, the share price was 175.79 US dollars (162.90 euros). Below are the three companies that lowered their price targets for Tesla and their reasons: Read too Tesla shares could fall another 33 percent because of one thing missing, analysts say Tesla has become a “growth company without growth,” Wells Fargo analysts wrote two weeks ago, downgrading the company to “underweight” and lowering the price target from $200 to $125 (from 185 to 115 euros) per share. Strategists warned of a slowdown in demand for electric vehicles this year, which could force Tesla to make further price cuts on its products. Lower prices and recent delivery disappointments bode poorly for Tesla’s earnings per share, which Wells Fargo says will come in 32 percent below estimates this year. The Model 2’s impending launch is unlikely to reassure investors, as its more affordable pricing means low profitability, in addition to its “rushed timing,” Wells Fargo said. Still, analysts praised some of Tesla’s approaches, such as so-called unboxed production methods that reduce costs. Wells Fargo is also bullish on Tesla’s autonomous driving and Dojo supercomputer, if the company can make those technologies a reality. Read too From smartphone manufacturer to car manufacturer: Xiaomi is bringing its own electric car onto the market Wedbush Securities is still optimistic about Tesla, but lowered its price target from $315 to $300 (from €290 to €278) per share. However, the company continues to maintain an “Outperform” rating for the manufacturer and points to corrective measures that could be helpful if applied. In a note Thursday, analysts led by Dan Ives called Tesla’s first quarter a “nightmare” and cited declining shipments to China as the main cause of the weaker performance; It is now unlikely that Tesla will reach the estimated 2.1 million deliveries this year, Wedbush said. Delivery problems, such as a factory fire in Berlin, made the problematic quarter even worse, Ives wrote. At the same time, he noted that investors are becoming impatient with the company’s management. The reasons he cited included CEO Elon Musk’s plan to move AI projects outside of Tesla and a legal dispute over salary payments in Delaware. “We believe the Tesla narrative is as negative as we have seen in recent years with Musk/Tesla being attacked by the bears from all directions,” Ives wrote. “But unlike other times, it is justified now as growth has been sluggish and margins are showing pressure, with China being a nightmare.” Ives remains confident that Tesla’s autonomous driving and Autopilot technologies will support the company’s valuations. Read too I drove a BYD electric car – Tesla can dress warmly Bernstein lowered the price target for Tesla from $150 to $120 (from 139 to 111 euros) per share and reiterated the “underperform” rating in a note published on Tuesday. The electric car maker will see tepid growth in both 2024 and 2025, according to analysts led by Toni Sacconaghi. Bernstein cut Tesla’s production forecasts for both years as slowing adoption of electric vehicles in Europe and the U.S. dampens consumer appetite for the company’s products. Demand in China is also weak, said Bernstein. Given its growth prospects, Tesla’s high stock valuations are difficult to justify, analysts write. The company trades at a huge premium to other automakers, even though its profit margins are comparable to competitors. Tesla’s fully self-driving car could fetch $40 (37 euros) per share, Bernstein said, but noted that pricing would be competitive because Tesla is not the only company pursuing autonomous driving. The company is already working in the areas of robotics, artificial intelligence and robot taxis. Read the original article in English here.     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}