{
    "title": "Xiaomi takes aim at Tesla in Chinese auto market with $29,870 electric car",
    "date": "3/29/2024",
    "url": "https://www.dtnext.in/news/business/xiaomi-takes-aim-at-tesla-in-chinese-auto-market-with-29870-electric-car-777077",
    "text": "MORE Xiaomi's first electric vehicle SU7 that is displayed outside the avenue for the car's launch event BEIJING: Chinese smartphone maker Xiaomi launched a sporty electric car on Thursday with styling cues drawn from Porsche and priced below Tesla's (TSLA.O), opens new tab Model 3, highlighting the stiff competition from new entrants in an already crowded EV market in China. During the two hour-long event, Xiaomi CEO and founder Lei Jun told a packed room whose attendees included the bosses of Chinese EV makers Nio and Xpeng that the standard SU7 EV model will be priced at 215,900 yuan ($29,872.02), while the Pro and Max versions will cost 245,900 yuan and 299,900 yuan respectively. \"It's 30,000 (yuan) cheaper than the Model 3,\" he said. Tesla's Model 3 starts at 245,900 yuan in China. He also said many of the capabilities of the SU7, which has drawn comparisons with Porsche's Taycan and Panamera models, surpassed that of Tesla's and Porsche's. For example, its minimum range of 700 km beat Tesla Model 3's 567km, Lei said. The launch fulfils the ambition of Xiaomi's founder, who announced the company's foray into EVs in 2021 and pledged to invest $10 billion in its auto business as \"the last major entrepreneurship project\" of his life. The company formed a manufacturing partnership with state-owned automaker BAIC Group and first showcased the SU7 - short for Speed Ultra 7 - sedan, in December. The company, best known for its smartphones and a wide range of affordable appliances, started taking orders for the SU7 from 10 p.m. Beijing time (1400 GMT) and said it received 50,000 orders within the first 27 minutes. Deliveries for the Standard and Max models will start in late April, and the Pro models will follow by the end of May. Lei also said that the shift from electronics to car manufacturing had not been easy. \"In the three years of developing this car, my biggest realization is that making cars is extremely difficult. Even a giant like Apple gave up on it,\" Lei said. \"So today, every person who is still persevering in making cars is a hero of our time.” The SU7 will go on sale in 211 stores across 39 Chinese cities by end of this year, he added. Xiaomi has not said whether it has any plans to sell the car abroad. PRICE WAR Analysts have been split on whether Xiaomi's car project will succeed. Some say it is a natural extension for the company, whose rice cookers, air purifiers and other electronics are ubiquitous in Chinese homes. But the SU7 marks a departure from the company's image as an affordable brand. \"Can (Chinese consumers) take that leap psychologically from mass-market, cool, inexpensive consumer products and home products to premium EV?\" said Tu Le, founder of consultancy Sino Auto Insights. In addition, the car goes on sale during a difficult time for China's auto market. \"The current market environment is quite challenging for newcomers with the top 10 players continuously expanding their market share,\" said Gavekal Dragonomics analyst Ernan Cui. \"If Xiaomi can't sell at scale in a short time, it's facing the risk of being a profit dragger for the company for longer.\" Working in Xiaomi's favour, however, is revenue generated by other businesses, said Le of Sino Auto Insights. Moreover, analysts say Xiaomi's smartphone expertise gives it an edge over traditional automakers when it comes to smart cockpits - a feature Chinese consumers prize. The SU7 uses the company's self-developed Hyper OS as the operating system that connects EV users to its other devices, including smartphones. ($1 = 7.2275 Chinese yuan renminbi)  © Copyright  | Powered by Hocalwire "
}