{
    "title": "Arkham has identified the Bitcoin addresses of Tesla and SpaceX",
    "date": "3/7/2024",
    "url": "https://en.cryptonomist.ch/2024/03/08/arkham-has-identified-tesla-and-spacex-addresses-with-almost-20000-bitcoin/",
    "text": "Arkham Intelligence has identified the addresses of Tesla and SpaceX companies containing nearly 20,000 bitcoins, worth 1.3 billion dollars at current prices. The blockchain analysis platform claims that the companies’ statements reflect the data on the chain. Summary On X, the blockchain analysis company, Arkham Intelligence, revealed that they have identified the addresses of Tesla and SpaceX containing almost 20,000 bitcoins. Specifically, this amounts to 19,794 BTC, with a value of over 1.3 billion dollars at current prices. The on-chain fund flows we’ve identified match financial statements from Tesla and SpaceX.Tesla purchased $1.5B of BTC in Jan 2021, and sold BTC on 2 occasions:Sold $272M BTC in Q1 2021Sold $936M BTC in Q2 2022Tesla allowed purchases of Teslas in Bitcoin between March 24… pic.twitter.com/d7xLcyPmT6 “BREAKING: TESLA AND SPACEX ARE NOW ON ARKHAM. Arkham has identified the BTC holdings of Tesla and SpaceX. We are the first to publicly identify these holdings on the chain. We believe that Tesla currently holds 11.51K BTC ($780M) across 68 addresses and SpaceX holds 8.29K BTC ($560M) across 28 addresses. The fund flows on the chain we identified correspond to the financial statements of Tesla and SpaceX. Tesla purchased $1.5 billion of BTC in January 2021 and sold BTC on 2 occasions: Sold $272M BTC in the 1st quarter of 2021, Sold $936 million of BTC in the second quarter of 2022. Tesla allowed the purchase of Tesla in Bitcoin between March 24 and May 12, 2021. Our Tesla Intel Exchange Bounty has revealed a Tesla car purchase linked to this broader group of Tesla holdings.” Basically, Arkham believes that Tesla currently holds 11,509 BTC across 68 addresses, worth 770.7 million dollars, and SpaceX holds 8,285 BTC across 28 addresses, worth 554.9 million dollars. Not only that, the blockchain company confirms that the data on the chain matches the financial statements of Elon Musk’s two companies. And indeed, Tesla would have purchased $1.5 billion worth of BTC in January 2021, selling only on two occasions: 1) $272 million in BTC in Q1 2021, and 2) $936 million in BTC in Q2 2022. Another significant piece of data refers to the period in which Tesla allowed the purchase of electric cars in BTC. Here too, Arkham confirms that the chain data corresponds to the statements made, in this case, by Tesla. It was March 2021, when Elon Musk published his tweet stating that from that moment it was possible to buy Tesla with bitcoin. Not only that, Musk claimed that the BTC received for the sale of Tesla cars would not be converted into fiat currency, but kept in bitcoin. Immediately after, in May 2021, Musk then had to suspend Tesla’s bitcoin payments due to the excessive consumption of fossil sources in Bitcoin mining. On this note, Arkham Intelligence confirms that between March 24 and May 12, 2021, the Tesla Intel Exchange Bounty revealed a purchase of Tesla cars linked to this broader group of Tesla holdings. As is now known, Elon Musk is also the owner of X, formerly Twitter. Here too, there has been a connection with Bitcoin (BTC). And indeed, at the beginning of January, while Bitcoin Spot ETFs were being approved in the USA, Elon Musk would have explicitly stated to be open to the idea of using Bitcoin on X. The statement came during a Space on X organized by Cathie Wood specifically on Bitcoin ETFs, which Musk also participated in. Anyway, Musk did not reveal too much and did not disclose what his idea referred to, but specified not wanting to use BTC as a means of payment. According to Musk, in fact, Bitcoin like gold, is not suitable for payments. Let's tell the future.\nThe most exclusive news on Bitcoin and cryptocurrencies, trading, fintech, and blockchain. Stay updated on all the news about cryptocurrencies and the entire world of blockchain. © 2023 The Crypto Economist SAGL. All rights reserved "
}