{
    "title": "Tesla (NASDAQ:TSLA) Given New $165.00 Price Target at UBS Group",
    "date": "3/15/2024",
    "url": "https://www.defenseworld.net/2024/03/16/tesla-nasdaqtsla-given-new-165-00-price-target-at-ubs-group.html",
    "text": "Posted by Defense World Staff on Mar 16th, 2024 Tesla (NASDAQ:TSLA – Get Free Report) had its price target dropped by stock analysts at UBS Group  from $225.00 to $165.00 in a report released on Thursday, BayStreet.CA reports. The brokerage presently has a “neutral” rating on the electric vehicle producer’s stock. UBS Group’s price objective would suggest a potential upside of 0.87% from the company’s previous close. A number of other brokerages have also recently issued reports on TSLA. Daiwa Capital Markets cut Tesla from an “outperform” rating to a “neutral” rating and dropped their price objective for the stock from $245.00 to $195.00 in a research note on Tuesday, February 6th. Wedbush  reiterated an “outperform” rating and set a $315.00 price objective on shares of Tesla in a research note on Wednesday, January 31st. Piper Sandler dropped their price objective on Tesla from $295.00 to $225.00 and set an “overweight” rating on the stock in a research note on Monday, February 5th. TD Cowen dropped their price objective on Tesla from $200.00 to $180.00 and set a “market perform” rating on the stock in a research note on Thursday, January 25th. Finally, Mizuho dropped their price objective on Tesla from $310.00 to $270.00 and set a “buy” rating on the stock in a research note on Thursday, January 25th. Ten analysts have rated the stock with a sell rating, fourteen have assigned  a hold rating and nine have given a buy rating to the stock. According to data from MarketBeat, Tesla  has an average rating of “Hold” and an average price target of $213.04. Read Our Latest Analysis on TSLA NASDAQ:TSLA opened at $163.57 on Thursday. Tesla has a twelve month low of $152.37 and a twelve month high of $299.29. The company has a quick ratio of 1.25, a current ratio of 1.73 and a debt-to-equity ratio of 0.05. The business has a 50 day moving average price of $196.08 and a two-hundred day moving average price of $226.60. The company has a market cap of $520.94 billion, a P/E ratio of 37.95, a price-to-earnings-growth ratio of 3.81 and a beta of 2.41. Tesla (NASDAQ:TSLA – Get Free Report) last released its quarterly earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share for the quarter, missing analysts’ consensus estimates of $0.74 by ($0.03). Tesla had a return on equity of 16.62% and a net margin of 15.50%. The firm had revenue of $25.17 billion for the quarter, compared to analyst estimates of $25.64 billion. During the same period last year, the company earned $1.07 EPS. The company’s revenue was up 3.5% compared to the same quarter last year.  As a group, analysts expect that  Tesla will post 2.45 EPS for the current fiscal year. In other news, Director Robyn M. Denholm sold 93,705 shares of the stock in a transaction on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total transaction of $16,439,605.20. Following the sale, the director now directly owns 15,000 shares of the company’s stock, valued at approximately $2,631,600. The transaction was disclosed in a legal filing with the SEC, which is accessible through the SEC website. In other Tesla news, Director Robyn M. Denholm sold 93,705 shares of Tesla stock in a transaction that occurred on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total value of $16,439,605.20. Following the completion of the sale, the director now directly owns 15,000 shares in the company, valued at $2,631,600. The sale was disclosed in a filing with the SEC, which is available at the SEC website. Also, SVP Andrew D. Baglino sold 10,500 shares of Tesla stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $204.17, for a total value of $2,143,785.00. Following the completion of the sale, the senior vice president now owns 31,230 shares of the company’s stock, valued at $6,376,229.10. The disclosure for this sale can be found here. In the last three months, insiders have sold 198,598 shares of company stock valued at $36,952,434. 25.10% of the stock is owned by corporate insiders. Hedge funds and other institutional investors have recently modified their holdings of the company. Contravisory Investment Management Inc. purchased a new position in shares of  Tesla during the third quarter valued at approximately $25,000.  Wyrmwood Management LLC purchased a new position in shares of  Tesla during the fourth quarter valued at approximately $25,000.  Lam Group Inc. purchased a new position in  Tesla in the fourth quarter worth $25,000.  Halpern Financial Inc. boosted its position in  Tesla by 1,111.1% in the third quarter. Halpern Financial Inc. now owns 109 shares of the electric vehicle producer’s stock worth $27,000 after purchasing an additional 100 shares during the last quarter.  Finally, Alpha Paradigm Partners LLC purchased a new position in  Tesla in the third quarter worth $27,000. Institutional investors own  41.87% of the company’s stock. (Get Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.    Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter. Wells Fargo & Company Boosts SentinelOne (NYSE:S) Price Target to $28.00 Sirius XM (NASDAQ:SIRI) Coverage Initiated by Analysts at Guggenheim "
}