{
    "title": "Musk cashes out another $3.6 billion in Tesla stock",
    "date": "3/26/2024",
    "url": "https://ca.movies.yahoo.com/movies/elon-musk-sells-22-million-023158110.html",
    "text": "By Maria Ponnezhath and Hyunjoo Jin (Reuters) -Tesla boss Elon Musk disclosed another $3.6 billion in stock sales on Wednesday, taking his total near $40 billion this year and frustrating investors as the company's shares wallow at two-year lows. A U.S securities filing showed he unloaded 22 million shares in the world's most valuable carmaker over three days from Monday to Wednesday. The sale is the second big chunk of stock he has cashed out since his $44 billion purchase of Twitter in October, despite his repeated assurance in April that he was done selling Tesla shares. It isn't clear if the sales are related to the Twitter acquisition, but they are annoying investors who are upset by a perception he is diverting his focus and resources to Twitter ahead of Tesla. \"It doesn't put a lot of confidence in the business, or speak volumes for where his attention is at,\" said Tony Sycamore, an analyst at brokerage IG Markets, where Tesla is a popular stock among small-time investors. \"It's not a good situation. I've spoken to a lot of investors who have Tesla shares and they're absolutely furious at Elon.\" There was no immediate response to a Reuters request for comment from Tesla and from Musk emailed outside business hours. Musk's 13.4% stake in Tesla is down from about 17% a year ago, according to Refinitiv data. Tesla stock, which rose about 1% in early trading on Thursday, has halved this year, underperforming both automakers and the broader tech-heavy Nasdaq, which is down about 30% this year. The value of Musk's total selling over the past year comes to nearly $40 billion. \"It will start to be tiring for investors,\" said Tareck Horchani, head of prime brokerage dealing at Maybank Securities in Singapore. The latest share sale comes a month after Musk sold shares worth $4 billion in the days after he closed the Twitter deal. Tesla investor Ross Gerber, a strong supporter of Musk, said on Twitter that Tesla should announce a buy back \"to take advantage to (sic) the low share price Elon has created.\" SPREAD THIN Musk's fortune, mostly tied up in Tesla shares, has fallen with prices this year and he briefly lost his title as the world's richest person last week - according to Forbes - when he was overtaken by Louis Vuitton boss Bernard Arnault. Meanwhile, Twitter has seen advertisers flee amid worries about Musk's approach to policing tweets, hitting revenues and its ability to pay interest on the $13 billion debt that Musk took on for the deal. His controversial tweets also threaten to damage the brand and sales of Tesla cars, investors say. \"Investors are concerned about demand, pricing, auto-GMs (gross margins) and Twitter distraction/overhang/impact on Tesla brand,\" said RBC Capital Markets, slashing its price target by $100 to $225. Tesla is also facing macroeconomic headwinds that weigh on demand for its expensive cars. The company is offering discounts in the United States and China, two of its biggest markets, to boost demand. Musk said on Tuesday that \"Tesla will be great long-term, but doesn't control macroeconomic tides.\" (Reporting by Maria Ponnezhath in Bengaluru and Hyunjoo Jin in San Francisco; Additional reporting by Tiyashi Datta and Akash Sriram in Bengaluru; Writing and Additional reporting by Tom Westbrook in Singapore; Editing by Devika Syamnath, Raju Gopalakrishnan; Anil D'Silva and Saumyadeb Chakrabarty) Money can't buy you happiness, but what about working with a financial advisor? Hollie AdamsAccording to London’s Metropolitan Police and social media footage, a pedicab burst into flames directly in front of Buckingham Palace on Saturday, leaving behind only charred, melted remains. Explosion and fire outside Buck Palace! pic.twitter.com/nUWojD8Ji8— Michael Wright (@Michael_HiFi) March 30, 2024 In video of the incident on X, captioned “Explosion and fire outside Buck Palace,” the pedicab can be heard cracking and popping as it burns, emitting billowing clouds of black smok  “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by … The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences. Follow all the action from Stamford Bridge  I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. The Blues sit 11th in the Premier League table heading into the match SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x …  In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story.  Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action. Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset. ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said  If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset. St Michael and All Angels Church in Tirley was \"marooned\" by water in January. The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t  A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics. April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off A Dyson-rivaling hair dryer for just $30, a rare markdown on classic Levis and an Emeril-approved air fryer for $100-plus off await. "
}