{
    "title": "Raymond James Financial Services Advisors Inc. Buys 23,321 Shares of Tesla, \nInc. (NASDAQ:TSLA)",
    "date": "3/24/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsla-sec-filing-2024-03-24/",
    "text": "Raymond James Financial Services Advisors Inc. lifted its holdings in shares of Tesla, Inc. (NASDAQ:TSLA - Free Report) by 3.9% during the 4th quarter, according to its most recent disclosure with the SEC. The institutional investor owned 616,437 shares of the electric vehicle producer's stock after purchasing an additional 23,321 shares during the quarter. Raymond James Financial Services Advisors Inc.'s holdings in Tesla were worth $153,172,000 as of its most recent filing with the SEC. Several other hedge funds have also made changes to their positions in TSLA. MidWestOne Financial Group Inc. grew its holdings in shares of Tesla by 3.3% during the first quarter. MidWestOne Financial Group Inc. now owns 472 shares of the electric vehicle producer's stock worth $509,000 after buying an additional 15 shares in the last quarter. City State Bank grew its holdings in shares of Tesla by 3.3% during the third quarter. City State Bank now owns 1,260 shares of the electric vehicle producer's stock worth $315,000 after buying an additional 40 shares in the last quarter. Marcum Wealth LLC grew its holdings in shares of Tesla by 0.6% during the third quarter. Marcum Wealth LLC now owns 7,393 shares of the electric vehicle producer's stock worth $1,850,000 after buying an additional 41 shares in the last quarter. Linscomb & Williams Inc. grew its holdings in shares of Tesla by 3.5% during the first quarter. Linscomb & Williams Inc. now owns 1,233 shares of the electric vehicle producer's stock worth $1,329,000 after buying an additional 42 shares in the last quarter. Finally, Investors Research Corp grew its holdings in shares of Tesla by 5.5% during the second quarter. Investors Research Corp now owns 801 shares of the electric vehicle producer's stock worth $210,000 after buying an additional 42 shares in the last quarter. Institutional investors and hedge funds own 41.87% of the company's stock. A number of equities research analysts recently issued reports on TSLA shares. Edward Jones downgraded shares of Tesla from a \"buy\" rating to a \"hold\" rating in a report on Friday, January 26th. Piper Sandler lowered their target price on shares of Tesla from $295.00 to $225.00 and set an \"overweight\" rating for the company in a report on Monday, February 5th. Wells Fargo & Company downgraded shares of Tesla from an \"equal weight\" rating to an \"underweight\" rating and lowered their target price for the company from $200.00 to $125.00 in a report on Wednesday, March 13th. China Renaissance began coverage on shares of Tesla in a research report on Monday, February 26th. They set a \"hold\" rating on the stock. Finally, Oppenheimer reaffirmed a \"market perform\" rating on shares of Tesla in a research report on Tuesday, January 2nd. Ten analysts have rated the stock with a sell rating, fourteen have issued a hold rating and nine have assigned a buy rating to the stock. Based on data from MarketBeat, Tesla currently has a consensus rating of \"Hold\" and an average target price of $211.93. View Our Latest Stock Report on Tesla In other Tesla news, SVP Andrew D. Baglino sold 10,500 shares of the company's stock in a transaction dated Thursday, February 29th. The shares were sold at an average price of $204.17, for a total transaction of $2,143,785.00. Following the completion of the sale, the senior vice president now directly owns 31,230 shares of the company's stock, valued at $6,376,229.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this link. In other Tesla news, SVP Andrew D. Baglino sold 10,500 shares of the company's stock in a transaction dated Thursday, February 29th. The shares were sold at an average price of $204.17, for a total transaction of $2,143,785.00. Following the completion of the sale, the senior vice president now directly owns 31,230 shares of the company's stock, valued at $6,376,229.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this link. Also, SVP Xiaotong Zhu sold 687 shares of the company's stock in a transaction dated Wednesday, March 6th. The shares were sold at an average price of $177.11, for a total transaction of $121,674.57. Following the sale, the senior vice president now directly owns 63,171 shares of the company's stock, valued at $11,188,215.81. The disclosure for this sale can be found here. In the last three months, insiders sold 198,598 shares of company stock valued at $36,952,434. 25.10% of the stock is owned by insiders. TSLA stock traded down $1.99 during trading on Friday, hitting $170.83. The company had a trading volume of 75,580,637 shares, compared to its average volume of 98,103,592. The firm has a market capitalization of $544.06 billion, a price-to-earnings ratio of 39.64, a P/E/G ratio of 3.84 and a beta of 2.41. The business has a 50 day moving average of $190.26 and a 200 day moving average of $223.41. Tesla, Inc. has a fifty-two week low of $152.37 and a fifty-two week high of $299.29. The company has a current ratio of 1.73, a quick ratio of 1.25 and a debt-to-equity ratio of 0.05. Tesla (NASDAQ:TSLA - Get Free Report) last issued its quarterly earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share for the quarter, missing analysts' consensus estimates of $0.74 by ($0.03). Tesla had a net margin of 15.50% and a return on equity of 16.62%. The business had revenue of $25.17 billion during the quarter, compared to analyst estimates of $25.64 billion. During the same period in the previous year, the company posted $1.07 earnings per share. Tesla's revenue was up 3.5% compared to the same quarter last year. As a group, research analysts predict that Tesla, Inc. will post 2.45 earnings per share for the current year. Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.Recommended StoriesFive stocks we like better than TeslaInvesting in Commodities: What Are They? How to Invest in ThemNvidia's AI Tech Part of Novo Nordisk's New Supercomputer What Investors Must Know About Over-the-Counter (OTC) StocksMarketBeat Week in Review – 3/18 – 3/22Compound Interest and Why It Matters When InvestingKB Home: Building on Strong Foundations During Volatile Times  Before you consider Tesla, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list. While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering where to start (or end) with AI stocks? These 10 simple stocks can help investors build long-term wealth as artificial intelligence continues to grow into the future. If the last year of price cuts and sluggish sales weren’t enough to tip off the market to the fact the EV bubble has burst, Tesla’s NASDAQ: TSLA Q4 results and outlook for 2024 should do it. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}