{
    "title": "Tesla: Being Between 2 Major Growth Waves Creates Opportunity For Investors \n(TSLA)",
    "date": "3/23/2024",
    "url": "https://seekingalpha.com/article/4680117-tesla-being-between-two-major-growth-waves-creates-opportunity-for-investors-rating-upgrade",
    "text": "jetcityimage  jetcityimage Tesla (NASDAQ:TSLA) has had a very difficult year so far. Since the middle of 2023, the company has seen its share price fall almost 45% from the peak in July of 2023. Data by YCharts Today, in this article, I will share where I think Tesla is today, whether the current valuation justifies where it is currently at, and whether I am buying the stock today. I have written extensively on Tesla on Seeking Alpha, which can be found here. In my earlier article, I was neutral on Tesla as I expected growth to slow and there are clear near-term headwinds that have not been priced in. In today’s article, I will highlight why I think it is starting to look attractive for Tesla after the share price is now reflecting the slower growth and difficult market environment. To understand more about how Tesla's business is faring fundamentally today, the best place to look at is its latest 4Q23 results. The first thing I would point out is the general top-line growth has been softer than expected. Deliveries for the 4Q23 quarter came in at 484,507, up 20%, but growing at a slower rate after the huge growth we have seen earlier in 2021 and 2022. Quarterly deliveries for Tesla (Author generated) Quarterly deliveries for Tesla (Author generated) The next problem then is that while deliveries grew 20% from the prior year, total revenues continued to slow, growing just 3% from the prior year, as price cuts are weighing in on revenue, and also on gross profits. Tesla reported 4Q23 total revenues of $25.2 billion, which was up 3.5% on a year-on-year basis. This was softer than expected, falling behind market consensus expectations by 2%. Automotive revenues came in at $21.6 billion, 1% below consensus. For a company like Tesla trading at more than 50x 2024 P/E, the 3% revenue growth is certainly concerning for investors and starts to cast doubts about whether the company's valuation is justified. Quarterly revenue growth (Author generated) Quarterly revenue growth (Author generated) As mentioned above, the price cuts we have seen has resulted in compression in both gross margins and operating margins. Gross profit came in at $4.4 billion or 17.6% gross margin, which also fell short of consensus expectations of 17.8% gross margin. Automotive gross profit margin excluding credits was 17.2%, higher than consensus expectations of 16.8%. Operating profit on a GAAP basis was largely in-line with consensus, coming in at $2.1 billion at 8.2% operating margin. Quarterly margin progression of Tesla (Author generated) Quarterly margin progression of Tesla (Author generated) Adjusted EPS came in at $0.71, 3% below consensus, while free cash flows came in at $2.1 billion, up 45% on a year-on-year basis. I think the bottom line here is that Tesla is hurting from the price cuts, which has not only caused margins to deteriorate, but also has not been particularly effective in driving demand and revenue growth. The biggest problem here is if the environment continues to stay the same for a longer period of time. There is certainly downside risk to volume because there has been a diminishing effect from the price cuts and with that, lower volumes mean revisions to the downside. With majority of its revenues coming from the automotive segment, interest rates have a huge impact on the Tesla business. As such, I am of the opinion that the weakness we have seen in Tesla stock price in recent months is more to do with the interest rate environment taking its toll on the automotive sector, rather than the deterioration of fundamentals of the company. Even CEO Elon Musk mentioned this when asked about the margin expectations for 2024, and that demand remains strong despite the lower affordability today:  We don't know. We don't have a crystal ball, so it's difficult for us to predict this with precision. If the interest rates come down quickly, I think margins will be good. And if they don't come down quickly, they won't be that good. It's always important to remember that the vast majority of people buying a car is about the monthly payment. It's not that people don't want. We have lots of people who want to buy our car but simply cannot afford it. And as interest rates drop and that monthly payment drops, then they're able to afford it and they buy the car. It's pretty straightforward and there are no tricks around to get around this. That said, Tesla is not exactly idling by while the high interest rate environment bites. While free cash flows in the 4Q23 quarter was strong at $2.1 billion and growing 45% on a year-on-year basis, this was achieved with one of the highest capital expenditures on record for Tesla. Financials summary (Tesla) Financials summary (Tesla) This record level of spending in capital expenditures and R&D in the past few quarters implies that Tesla is investing heavily in future projects and growth potential even as it continues to drive strong free cash flows. Of course, with free cash flow growth this strong, it also gives Tesla the room to increase this capital expenditure spend to drive potential future growth in the outer years. Again, management shared in the 4Q23 quarter that Tesla is \"currently between two major growth waves\". As such, Elon Musk and the management team is focused on the next major growth pillar and executing well. These includes its next-generation vehicle, energy storage, full self-driving (\"FSD\") and other projects. Now, I think management is trying to manage expectations here, by saying that we are in between two major growth waves implies that we will see somewhat flatter growth in the near-term. Again, this is supported by the fact that Tesla guided that in 2024, its vehicle growth rate \"may be notably lower than the growth rate achieved in 2023\". The problem here is how should the market quantify \"notably\" in this case, because the market consensus right now is 20% growth in units in 2024, compared to the 38% growth in units we saw in 2023. This lower unit growth rate is because Tesla works towards launching the next-generation vehicle, the Model 2, at Gigafactory Texas. The next question would be, when will this next-generation vehicle be launched? I think even Tesla and the management team is uncertain about the exact timing here, but they are targeting to start production in the second half of 2025. Even with this target for production, CEO Elon Musk commented that it should be taken with a grain of salt and that he is often optimistic. Of course, the current target for production for the second half of 2025 is based on the current schedule, but the ramp looks to be difficult. This is because it involves new manufacturing procedures, new manufacturing technology, and would require the engineers at Giga Texas to be living on the line to ensure this challenging production ramp goes as smoothly as possible. I am of the opinion that this next-generation vehicle production and ramp is one of huge significance because this ensures that Tesla is ahead of competitors in terms of manufacturing technology, costs and with this level of innovation, further separates Tesla from the rest. My thoughts are that there will be deliveries in 2025, but a small amount of maybe around 120k, while most of the ramp and growth in unit volumes should come in 2026. However, the issue for Tesla is that in the meantime, before the production of the next-generation vehicle platform, there will be more competition in the key Chinese market, rhetoric that there is slowing EV adoption, and the high interest rate environment may pose near-term challenges for Tesla. That said, without an actual unit volume growth guidance for 2024, this may imply that Tesla may reduce cutting prices in 2024 given it does not have a volume number it needs to hit. FSD is another area in which Tesla is investing in today that could drive huge growth and valuation improvement in the future. While the Tesla stock price has been struggling and the automotive market remains challenging, the chart below which shows the cumulative miles driven with FSD Beta tells a different story. Cumulative miles driven with FSD Beta (Tesla) Cumulative miles driven with FSD Beta (Tesla) Again, I think this is another example of how Tesla continues to invest in its business and improve its underlying business, which may not be reflective in the stock price today, but likely to benefit shareholders in the long-term. We can see that since early 2023, the cumulative miles driven with FSD Beta has reached an inflection point and has been growing at a faster exponential rate since, and this trend continued in the fourth quarter of 2023. That said, on the business front, the lack of new FSD licensing developments is not a positive for Tesla, but of course, a positive for other ADAS suppliers in the market. It does seem CEO Elon Musk remains very confident in FSD and that he continues to see a case for CEOs of other automotive companies to be interested in FSD. Interestingly, he said that while they currently do not believe it is quite real yet, Elon Musk thinks that it will become obvious in 2024. Perhaps he is seeing some significant improvement in FSD this year, but I think the fact that the cumulative miles driven with FSD Beta has reached an inflection point suggests something. Along the lines of FSD, Dojo is meant to be a resource to help improve FSD and hedge its options here with the large numbers of Nvidia GPUs Tesla is buying. Tesla is taking a dual path here with both Nvidia and Dojo, but in the recent earnings call, CEO Elon Musk seemed to want to manage expectations about Dojo, calling Dojo a \"long shot\". But of course, in my opinion, this long shot is worth taking because it has a very large payoff, despite the high risk or low probability of investing in Dojo. With price cuts causing the average selling price to come down, Tesla has done a good job in reducing the cost of goods sold per vehicle, but that has not been enough to stem the decline in the quarterly gross profit per unit as the price cuts continued to come in. Quarterly unit economics (Author generated) Quarterly unit economics (Author generated) In the 4Q23 quarter, the negative impacts of lower average selling prices for its vehicles and cost of Cybertruck production ramp was offset by the lower cost per vehicle, lower rate material costs and logistics costs, and growth in vehicle deliveries. The near-term will likely be challenging for Tesla. Price cuts to drive demand and fend off competition may continue to hurt margins, while the success of the Cybertruck production ramp will help to gradually improve margins. Now, the key question now is whether I am buying Tesla stock given the current valuation? First, below, I summarize my 5-year financial forecast for Tesla. It assumes an 18% revenue CAGR, including the slump we are seeing in 2024. I also assume a pickup in 2026 as we will see the full year contribution of the launch of the next-generation vehicle, the Model 2. Second, the margin profile will likely continue to see improvements, although more muted from 2024 to 2026 given the ramp of the Cybertruck and Model 2, and I expect more margin expansion opportunities in 2027 and 2028. Summary of my 5-year forecasts for Tesla (Author generated) Summary of my 5-year forecasts for Tesla (Author generated) While the current 2024 P/E multiple of 54x P/E is relatively high, this is based on profits of 2024 which are rather muted. For the discounted cash flow model, my earlier assumptions were based on 40x terminal multiple and 13% cost of equity, which resulted in an intrinsic value of $205. I applied a 20% discount on this intrinsic value to derive an entry price of $164 to ensure more downside protection. However, the terminal multiple can be highly subjective for a company like Tesla and even more so five years from today. If I were to apply a 30x terminal multiple instead, the intrinsic value goes down to $171 and entry price goes to $137. Of course, buying at this entry price essentially guarantees a better downside protection but whether the stock will ever reach this level is also another thought for consideration. This implies buying Tesla at 42x 2024 P/E or 30x 2025 P/E, which could really be an attractive point of entry. I'll share more on my investment decision on Tesla in the conclusion section. As a reminder, in my earlier article, I applied a 60x 2024 P/E and 50x 2026 P/E for the 1-year and 3-year price targets. Again, applying 60x 2024 P/E and 50x 2026 P/E for the 1-year and 3-year price targets gets me to $198 and $294 respectively. 60x 2024 P/E is justified given the company's EPS has a low base effect now as a result of the cyclical downturn in 2024 and lower margins. 50x 2026 P/E is also justified if it can show that it can pivot back to EPS CAGR of 30%. Ultimately, these multiples are a function of what is the steady state multiple the market is willing to apply to Tesla. In a period where Tesla is in between two growth pillars, the multiple can vary quite significantly because the bears will focus on the fact that the multiple is not supported by the growth rates, but the bulls will focus on the long-term growth rates. I think we all know that the automotive sector is experiencing a cyclical downturn, and this hurts the electric vehicles players the most. Price cuts are not helping either, driving margins down further to squeeze out more growth from the market. We are indeed between two growth pillars and when we are in such a position, it can be uncomfortable for most investors because this is the period when the growth is not visible, but the company is investing in its business. If you ask me, within the automotive space, Tesla will likely emerge as a high-quality winner after this downturn, given that not many other companies can continue to generate the profits and cash flows that it can, while still investing in its business. One key thing to note about Tesla is that while it is an automotive player, it has best-in-class returns on equity and return on invested capital, which just highlights the quality company it is relative to other automakers. For reference, in 2023, BYD has a ROIC of 16%, Porsche has a ROIC of 15%, Volkswagen has a ROIC of 4% and Toyota has a ROIC of 3%. Tesla margins and ROE profile (Bloomberg) Tesla margins and ROE profile (Bloomberg) Am I buying Tesla at the current valuation? This is how I see it. The automotive sector and the electric vehicle sector are experiencing a cyclical downturn as a result of the macro conditions and high interest rate environment. This has resulted in a huge share price decline in all electric vehicle company stocks and thus, the sector and company sentiment is rather poor. Valuation of Tesla has certainly come down, as Tesla reached a peak of more than 200x P/E in 2022 and more than 90x P/E in 2023, which has since come down to a more reasonable 54x P/E. Now, here comes the part where there is still a debate because 54x P/E is more expensive than most of the other Magnificent Seven stocks like Nvidia (NVDA) and Apple (AAPL). At the same time, I think if you have been in tune with the Tesla story, you would also know that Tesla is in the early days of its growth story, so the market is willing to pay for that growth, as long as it still exists. For me, I think that the company looks attractive today. It does have the characteristics of a contrarian opportunity where sentiment is poor, the stock has been sold off significantly, there are increasingly more negative views about the growth trajectory of Tesla and the electric vehicle space. All that does imply that expectations are starting to come in rather low, and when things do turn around, we can expect multiple quarters of beats. The thing here is I do think Tesla is dependent on a rate cut and if that is not delivered in June, or is delayed even further, this could be detrimental to the stock. Another thing is that while sentiment of the company is poor, the overall market has been reaching all-time highs and market sentiment as a whole has been very euphoric. This means that when the market sentiment turns from very euphoric to very pessimistic, Tesla too will be brough down with the market. As such, when the momentum turns, it does imply there continues to be room for more downside from here. For now, I am making Tesla a 2% weight, which is a small position to relative where I would have wanted it to be, given what I have mentioned above. Given Tesla has reached my earlier entry price of $164, I will be adding to Tesla in a small way at these levels. If the company ever reaches the new entry price of $137, I will certainly be making it a much larger position. Outperforming the Market is focused on helping you outperform the market while having downside protection during volatile markets by providing you with comprehensive deep dive analysis articles, as well as access to The Barbell Portfolio. The Barbell Portfolio has outperformed the S&P 500 by 50% in the past year through owning high conviction growth, value and contrarian stocks. Apart from focusing on bottom-up fundamental research, we also provide you with intrinsic value, 1-year and 3-year price targets in The Price Target report. Join us for the 2-week free trial to get access to The Barbell Portfolio today! This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of TSLA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}