{
    "title": "Attorneys In Musk's Pay Case Seek Six Billion In Tesla Shares",
    "date": "3/2/2024",
    "url": "https://menafn.com/1107926950/Attorneys-In-Musks-Pay-Case-Seek-Six-Billion-In-Tesla-Shares",
    "text": "Forgot  Username or Password  Date (MENAFN- AzerNews)  Lawyers who represented shareholders and made void Tesla Inc.\nCEO Elon Musk's compensation plan valued at $56 billion have asked\non Friday to be paid in shares of the company worth almost $6\nbillion,  Azernews  reports, citing foreign\nmedia.\nThe lawyers on the winning side of the verdict asked for the\napproval of the record-breaking payment of $5.6 billion in Tesla\nstock in a filing with the Delaware Court of Chancery, stating that\nwhile such an award would be \"unprecedented\" the size of the award\nis in line \"because the value of the benefit to Tesla that\nplaintiff's counsel achieved was massive,\" the plaintiff's lead\nattorney Greg Varallo wrote.\nDelaware Chancery Court Chancellor Kathleen McCormick voided\nMusk's compensation plan in January, siding with Tesla shareholder\nRichard Tornetta who alleged that the Tesla board of directors\nbreached its fiduciary duties by awarding Musk with a $56 billion\ncompensation package.MENAFN03032024000195011045ID1107926950  The lawyers on the winning side of the verdict asked for the\napproval of the record-breaking payment of $5.6 billion in Tesla\nstock in a filing with the Delaware Court of Chancery, stating that\nwhile such an award would be \"unprecedented\" the size of the award\nis in line \"because the value of the benefit to Tesla that\nplaintiff's counsel achieved was massive,\" the plaintiff's lead\nattorney Greg Varallo wrote. Delaware Chancery Court Chancellor Kathleen McCormick voided\nMusk's compensation plan in January, siding with Tesla shareholder\nRichard Tornetta who alleged that the Tesla board of directors\nbreached its fiduciary duties by awarding Musk with a $56 billion\ncompensation package. MENAFN03032024000195011045ID1107926950 MENAFN03032024000195011045ID1107926950 Legal Disclaimer: MENAFN provides the information “as is” without warranty of any kind.  We do not accept any responsibility or liability for the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in this article.   If you have any complaints or copyright issues related to this article, kindly contact the provider above.  Tags Comments Category Date Daily(English)\r\n                                                \n\n\n\n\r\n                                                        Daily(Arabic)\r\n                                                \n\n\n\n\r\n                                                        All()  World and Middle East business and financial news, Stocks, Currencies, Market Data, Research, Weather and other data. Contact Us\r\n\t\t\t\t\t\t\t\t\t Click here Tel:\r\n\t\t\t\t\t\t\t\t\t+962 6 5690450 Copyright © 2000 MENAFN. All rights reserved. Design & Devleopment by MENAFN "
}