{
    "title": "Mitch McConnell's Sister-in-Law Angela Chao Called a Friend Before Her \nDeath in Tesla on Texas Ranch: Report",
    "date": "3/10/2024",
    "url": "https://ca.finance.yahoo.com/news/mitch-mcconnells-sister-law-angela-232023403.html",
    "text": "Chao, 50, was the CEO of dry bulk shipping company Foremost Group Tommaso Boddi/Getty Angela Chao, the late sister-in-law of Mitch McConnell, reportedly phoned a friend for help as her vehicle became submerged in a pond on her Blanco County, Texas, ranch last month. The 50-year-old sister-in-law of the Senate Minority Leader died in a car accident last month. The Blanco County Sheriff's Office said on Feb. 16 that Chao — who was the CEO of dry bulk shipping company Foremost Group — \"succumbed from being under the water\" and that a \"preliminary investigation has determined this to be an unfortunate accident,\" with the investigation ongoing, per NBC News. The Sheriff's Office then wrote in a letter to Texas Attorney General Ken Paxton, per NBC News, that it was \"not a typical accident\" and that the office is investigating it as \"a criminal matter until they have sufficient evidence to rule out criminal activity.\" “Releasing the reports, videos and other information prior to the completion of the investigation would interfere with the investigation and possible prosecution of this matter,” the Sheriff's Office reportedly wrote late last month. Now, a new report from The Wall Street Journal reveals details surrounding Chao's death after her Tesla was submerged in a pond on her Central Texas ranch, miles outside of Austin. As the outlet reports, Chao was driving a Tesla Model X SUV late at night on Feb. 10 when, during a three-point turn, she put the car in reverse instead of drive. The vehicle then reportedly went over an embankment and into a pond. The Blanco County Emergency Services and Blanco County Sheriff’s Office did not immediately respond to PEOPLE's request for comment and more information on Sunday. Related: Angela Chao, Business Executive and Sister-in-Law of Mitch McConnell, Dead in Car Accident at Age 50 Chao — who invited Harvard Business School friends to spend the holiday weekend with her at the ranch — headed back to the ranch's main house around 11:30 p.m. that night, per The Wall Street Journal. Citing interviews with those close to Chao, officials and law enforcement documents, the outlet reported that Chao called a friend in a panic moments after heading home as the vehicle began to sink into the water. During the following hours, first responders, the ranch manager and friends reportedly attempted to break windows and tried to find an escape hatch in the Tesla. One friend jumped into the pond, per the outlet. A Blanco County emergency unit arrived at 12:28 a.m., according to an incident report obtained by the outlet, and came 24 minutes after an initial call. One responder said the vehicle was completely submerged in water while some deputies stood on the car during the rescue attempt, according to The Wall Street Journal. A firefighter and an emergency services worker entered the water with rescue tools, as a dive team was not available at the time, per the outlet. A tow truck also arrived on the scene but did not have a cable long enough to retrieve the vehicle. A longer cable was eventually obtained. The outlet reports, citing someone at the scene, that one driver said they were worried about being electrocuted by the vehicle. The outlet also reports that Chao's vehicle was eventually pulled from the pond and hundreds of gallons of water rushed out, and that resuscitation efforts were unsuccessful. The Austin-American Statesman, which cited a report last month, noted that Chao was pulled out of the vehicle at 12:56 a.m., and EMS delivered \"advanced life support\" for 43 minutes. She was reportedly pronounced dead at the scene. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Last month, a statement shared by the Chao family remembered Angela as \"a brilliant woman, a charismatic and visionary leader and much-loved by all her sisters, our entire family and friends.\" \"As a daughter, sister, mother, aunt, wife and friend, she was unfailingly filial, thoughtful, kind and devoted,\" her father, Dr. James S.C. Chao, shared. \"These qualities were complemented by a spirited personality, exceptional intelligence, compassion for all and a wonderful sense of humor. She kept us laughing and smiling. She believed deeply that the true treasures in life are family, friends and helping others. Losing her at such a young age is something we never even imagined, and our entire family is devastated with grief.\" Elaine, Angela's older sister and McConnell's wife, was the U.S. Secretary of Labor under George W. Bush and the Secretary of Transportation under Donald Trump from 2017 to 2021. Weeks after Angela's death, McConnell announced he would vacate his leadership position as the U.S. Senate's longest-serving party leader. He still plans to remain in Congress through the end of his term, which expires in 2027. “As some of you may know, this has been a particularly difficult time for my family,\" McConnell said at the time. \"When you lose a loved one, particularly at a young age, there is a certain introspection that accompanies the grieving process. Perhaps it is God’s way of reminding you of your own life’s journey to reprioritize the impact on the world that we will all inevitably leave behind,\" he continued. For more People news, make sure to sign up for our newsletter! Read the original article on People. \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids  “Jennifer was a remarkable woman, strong, lovely, and incredibly talented,\" wrote the late actress' former costar and first husband, Tim Matheson BRISTOL, Tenn. (AP) — It was in the den that Karen Goodwin most strongly felt her son’s presence: On the coffee table were his ashes, inside a clock with its hands forever frozen at 12:35 a.m., the moment that a doctor had pronounced him dead. As Goodwin swept and dusted the room, she’d often find herself speaking to her son, a soothing one-way conversation that helped her keep his spirit alive. She’d tell him about his nephews and nieces shopping for backpacks for the new school year, or the la \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone  ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The mom of two posted adorable photos of her enjoying some downtime with her children on Instagram Friday  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Wedding season is nearing...and so is the drama. The couple followed the sun to the Caribbean island, where they've previously vacationed  NEUDORF, SASK. — RCMP say a man killed three family members and then himself in a rural Saskatchewan home on the weekend. A 67-year-old man and a 58-year-old woman, along with their 30-year-old son, were killed on the property near Neudorf, about 130 kilometres east of Regina, Mounties said in a news release Thursday. The fourth person found dead in the home, a 34-year-old man, died from self-inflicted injuries. RCMP said family have been updated on the investigation. Police did not publicly rel \"I wanted to be straightforward about it and got stood up for the date.\" The House Oversight Committee chair has been increasingly lashing out at reporters covering his impeachment inquiry against Joe Biden.  Jose Cuatro pleaded no contest to first degree murder and torture and faces 32 years to life in prison. Ursual Juarez pleaded no context to second-degree murder and torture and faces 22 years to life in prison. The architect and Edoardo separated in 2018, when their son Wolfie was one year old Coronation Street star Simon Gregson has discussed a possible new direction for Steve McDonald following his split from wife Tracy.  Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o Five months after their wedding was postponed due to a powerful hurricane, Wagmeister and Michael Sigall tied the knot in Mexico in front of 95 guests Since his campaign ended, DeSantis has barred homeless people from sleeping in public and prohibited kids from social media, among other things. "
}