{
    "title": "German Chancellor Olaf Scholz Calls Arson Attack On Tesla's Giga Berlin A \n'Terrorist Act,' Wants EV Giant",
    "date": "3/28/2024",
    "url": "https://www.benzinga.com/news/24/03/38001324/german-chancellor-olaf-scholz-calls-arson-attack-on-teslas-giga-berlin-a-terrorist-act-wants-ev-gian",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW German Chancellor Olaf Scholz supports the expansion of Tesla Inc.‘s TSLA Gigafactory in Berlin, despite ongoing protests by environmentalists and local citizens. What Happened: In an interview with the German newspaper Märkische Allgemeine, Scholz expressed his desire for Tesla to develop in Brandenburg like how Ford did in Cologne. He cited the Ford Cologne plant, which opened in 1931, as producing vehicles for the entire European market, expressing hope for a parallel trajectory for Tesla in Brandenburg. During the interview, Scholz also condemned the recent arson attack on the Tesla factory, labeling it a “terrorist act.” The arson, which occurred in early March, resulted in a power outage and halted production for about a week. The attack was claimed by a far-left activist organization known as the Vulkan Group. \"That was a terrorist act,\" said Scholz. \"Police and security authorities must do everything they can to identify the perpetrators and bring them to justice.” The chancellor also called for increased protection of vital facilities across Germany, including defenses against cyberattacks. Why It Matters: On Thursday, it was reported that Tesla CEO Elon Musk asked Brandenburg politicians that the arsonists be captured. Tesla’s gigafactory in Berlin is its only factory in Europe. As per the company’s 2023 annual report, the factory currently has an installed annual vehicle capacity of 375,000 Model Y vehicles. The company is currently looking to expand the plant to increase its capacity for battery production to 100-gigawatt hours and car production to 1 million units annually. Tesla representatives have largely discarded the protests against the factory’s proposed expansion claiming that they stem from misinformation. Tesla executive Rohan Patel said last month that the company will continue with its expansion efforts while also working with the community and stakeholders. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read More: Tesla CEO Elon Musk Says Many Movies Celebrate Lone Inventor’s ‘Eureka Moment’ But Ignore Manufacturing’s ‘Insane Pain’ Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}