{
    "title": "Tesla (NASDAQ:TSLA) Stock Price Up 0.3%",
    "date": "3/27/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsla-percent-advance-2024-03-27/",
    "text": "Tesla, Inc. (NASDAQ:TSLA - Get Free Report)'s share price rose 0.3% during mid-day trading on Wednesday . The company traded as high as $181.58 and last traded at $178.17. Approximately 33,457,066 shares traded hands during mid-day trading, a decline of 67% from the average daily volume of 102,249,883 shares. The stock had previously closed at $177.67. TSLA has been the topic of a number of research reports. Canaccord Genuity Group lowered their price objective on Tesla from $267.00 to $234.00 and set a \"buy\" rating on the stock in a research note on Thursday, January 25th. UBS Group lowered their price objective on Tesla from $225.00 to $165.00 and set a \"neutral\" rating on the stock in a research note on Thursday, March 14th. Wells Fargo & Company lowered Tesla from an \"equal weight\" rating to an \"underweight\" rating and reduced their target price for the company from $200.00 to $125.00 in a report on Wednesday, March 13th. The Goldman Sachs Group reduced their target price on Tesla from $220.00 to $190.00 and set a \"neutral\" rating for the company in a report on Monday, March 18th. Finally, Guggenheim lifted their target price on Tesla from $125.00 to $132.00 and gave the company a \"sell\" rating in a report on Friday, December 15th. Ten research analysts have rated the stock with a sell rating, fifteen have assigned a hold rating and eight have assigned a buy rating to the company. According to MarketBeat, Tesla currently has an average rating of \"Hold\" and an average target price of $207.04. View Our Latest Research Report on Tesla The company has a market capitalization of $572.72 billion, a PE ratio of 41.72, a PEG ratio of 3.90 and a beta of 2.41. The company has a 50 day moving average of $188.49 and a two-hundred day moving average of $222.36. The company has a debt-to-equity ratio of 0.05, a current ratio of 1.73 and a quick ratio of 1.25. Tesla (NASDAQ:TSLA - Get Free Report) last issued its quarterly earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share for the quarter, missing the consensus estimate of $0.74 by ($0.03). The firm had revenue of $25.17 billion during the quarter, compared to analysts' expectations of $25.64 billion. Tesla had a return on equity of 16.62% and a net margin of 15.50%. Tesla's revenue for the quarter was up 3.5% on a year-over-year basis. During the same period in the previous year, the company earned $1.07 earnings per share. As a group, equities research analysts predict that Tesla, Inc. will post 2.44 earnings per share for the current year. In other news, Director Robyn M. Denholm sold 93,705 shares of the stock in a transaction on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total value of $16,439,605.20. Following the sale, the director now directly owns 15,000 shares of the company's stock, valued at $2,631,600. The transaction was disclosed in a legal filing with the SEC, which is available at this hyperlink. In other Tesla news, Director Robyn M. Denholm sold 93,705 shares of the stock in a transaction dated Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total value of $16,439,605.20. Following the transaction, the director now owns 15,000 shares of the company's stock, valued at $2,631,600. The transaction was disclosed in a filing with the SEC, which can be accessed through this hyperlink. Also, SVP Xiaotong Zhu sold 687 shares of the stock in a transaction dated Wednesday, March 6th. The shares were sold at an average price of $177.11, for a total value of $121,674.57. Following the completion of the transaction, the senior vice president now directly owns 63,171 shares in the company, valued at approximately $11,188,215.81. The disclosure for this sale can be found here. Over the last three months, insiders have sold 198,598 shares of company stock valued at $36,952,434. Insiders own 20.90% of the company's stock. Several institutional investors have recently made changes to their positions in TSLA. HighPoint Advisor Group LLC bought a new stake in Tesla during the 4th quarter valued at approximately $23,306,000. Fairman Group LLC bought a new stake in Tesla during the 4th quarter valued at approximately $486,000. Healthcare of Ontario Pension Plan Trust Fund raised its stake in Tesla by 2,101.1% during the 4th quarter. Healthcare of Ontario Pension Plan Trust Fund now owns 1,469,190 shares of the electric vehicle producer's stock valued at $365,064,000 after purchasing an additional 1,402,443 shares during the period. Warren Street Wealth Advisors LLC raised its stake in Tesla by 3.1% during the 4th quarter. Warren Street Wealth Advisors LLC now owns 4,591 shares of the electric vehicle producer's stock valued at $1,141,000 after purchasing an additional 137 shares during the period. Finally, Accent Capital Management LLC bought a new stake in Tesla during the 4th quarter valued at approximately $70,000. Institutional investors own 66.20% of the company's stock. Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.Featured StoriesFive stocks we like better than Tesla3 REITs to Buy and Hold for the Long TermBest Bear Market Funds: Top 3 Investment Options to ConsiderStock Market Upgrades: What Are They?Is DraftKings A Good Bet Ahead of Q1 Earnings?How to Find Undervalued StocksMid-Cap Stocks to Outperform the Market This Cycle Before you consider Tesla, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list. While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Do you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio. If the last year of price cuts and sluggish sales weren’t enough to tip off the market to the fact the EV bubble has burst, Tesla’s NASDAQ: TSLA Q4 results and outlook for 2024 should do it. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}