{
    "title": "Tesla expects to spend over $10 billion on next-gen vehicles, AI products \nand other projects this year",
    "date": "1/30/2024",
    "url": "https://www.morningstar.com/news/marketwatch/2024013058/tesla-expects-to-spend-over-10-billion-on-next-gen-vehicles-ai-products-and-other-projects-this-year",
    "text": "By Ciara Linnane And the EV company expects capital expenditures to range from $8 billion to $10 billion over the next two fiscal years Tesla Inc. is expecting capital expenditure to exceed $10 billion in 2024 and to range from $8 billion to $10 billion for each of the following two fiscal years. The electric-vehicle maker (TSLA) made the disclosure in its 10-K annual report filing with the Securities and Exchange Commission published on Monday. The company is simultaneously ramping new products, building or expanding manufacturing facilities on three continents and piloting the development of new battery cell technologies, said the filing. It's also expanding the company's Supercharger network and investing in autonomy and other artificial intelligence-enabled training and products, it said. The company expects to meet its capex needs from cash flow from operations, which is supported by sales growth. \"Overall, we expect our ability to be self-funding to continue as long as macroeconomic factors support current trends in our sales. Tesla warned last week that it expects to grow more slowly this year as it focuses on its next-generation vehicle. It offered that guidance as it posted weaker-than-expected fourth-quarter earnings and gross margins that fell to 17.6% from 23.8% in the year-earlier period. In the letter to shareholders, Tesla reiterated that it expects that the Cybertruck ramp will be \"longer than other models given its manufacturing complexity.\" The next-generation vehicle, of which little is known, has been dubbed the Model 2. A question about whether the new EV would be launched by 2025 has been the top query on Tesla's investor-relations site. Analysts were unimpressed by the company's earnings call with Chief Executive Elon Musk. Wedbush's Daniel Ives, often effusively enthusiastic about the stock, didn't mince words when summarizing Tesla's earnings call, which he dubbed a \"train wreck.\" \"We were dead wrong expecting Musk and team to step up like adults in the room on the call and give a strategic and financial overview of the ongoing price cuts, margin structure, and fluctuating demand. ... [I]nstead we got a high level Tesla long-term view,\" Ives wrote. The analyst also had some choice words to describe the Tesla post-result conference calls since the departure of Chief Financial Officer Zach Kirkhorn last year. Without Kirkhorn, \"conference calls have been horror shows; returnto formal guidance and goal posts and make messaging changes on calls,\" Ives wrote. Tesla's stock has fallen 26% in the year to date, while the S&P 500 SPX has gained 2.5%. -Ciara Linnane This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 01-30-24 0722ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}