{
    "title": "Tesla blamed drivers for failures of parts it long knew were defective",
    "date": "1/3/2024",
    "url": "https://www.afr.com/technology/tesla-blamed-drivers-for-failures-of-parts-it-long-knew-were-defective-20231226-p5etok",
    "text": "Tens of thousands of customers told Tesla about a host of part failures. It blamed vehicle ‘abuse’, but documents show it had tracked chronic ‘flaws’ for years. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Shreyansh Jain was ecstatic in March when he picked up his first electric vehicle, a brand-new 2023 Tesla Model Y. He used a sizeable chunk of family savings to buy it with cash. “We were over the moon!” says Jain, an electronics engineer in Cambridge, England. His exuberance came to a “grinding halt” one day later, with 185 kilometres on the odometer. As he drove with his wife and three-year-old daughter, he suddenly lost steering control as he made a slow turn into their neighbourhood. The vehicle’s front-right suspension had collapsed, and parts of the car loudly scraped the road as it came to a stop. “They were absolutely petrified,” Jain says of his wife and daughter. “If we were on a 70-mile-per-hour highway, and this would have happened, that would have been catastrophic.” A 2020 Tesla Model 3 that was damaged in an April 2021 accident. The vehicle’s front wheel fell off while driving at 60 mph, according to a Tesla technician’s summary of the incident. Stat.vin The complex repair required nearly 40 hours of labour to rebuild the suspension and replace the steering column, among other fixes, according to a detailed repair estimate. The cost: more than $US14,000. Tesla refused to cover the repairs, blaming the accident on “prior” suspension damage. Jain is one of tens of thousands of Tesla owners who have experienced premature failures of suspension or steering parts, according to a Reuters review of thousands of Tesla documents. The chronic failures, many in relatively new vehicles, date back at least seven years and stretch across Tesla’s model lineup and across the globe, from China to the United States to Europe, according to the records and interviews with more than 20 customers and nine former Tesla managers or service technicians. Individual suspension or steering issues with Teslas have been discussed online and in news accounts for years. But the documents, which have not been previously reported, offer the most comprehensive view to date into the scope of the problems and how Tesla handled what its engineers have internally called part “flaws” and “failures”. The records and interviews reveal for the first time that the car maker has long known far more about the frequency and extent of the defects than it has disclosed to consumers and safety regulators. The documents, dated between 2016 and 2022, include repair reports from Tesla service centres globally; analyses and data reviews by engineers on parts with high failure rates; and memos sent to technicians globally, instructing them to tell consumers that broken parts on their cars were not faulty. Neither Tesla nor top executive Elon Musk responded to detailed questions for this article. Musk has acknowledged some build-quality problems with Teslas in the past, particularly the entry-level Model 3. But he also says his cars have no peer. “We make the best cars,” he said of Tesla at a New York Times event in November. “Whether you hate me, like me or are indifferent, do you want the best car, or do you not want the best car?” Tesla’s handling of suspension and steering complaints reflects a pattern across Musk’s corporate empire of dismissing concerns about safety or other harms raised by customers, workers and others as he rushes to roll out new products or expand sales, Reuters has found. A Reuters investigation in November documented at least 600 injuries at rocket-builder SpaceX, where employees described a culture of rushing dangerous projects with little regard for workers’ safety worries. Tesla records reveal persistent problems with low-tech suspension connections, such as upper and lower control arms, and fore and aft links. In July, the news agency revealed how Tesla had created a secret team to suppress thousands of customer complaints about poor driving range. The report, which found that Tesla rigged an algorithm to inflate its cars’ in-dash range estimates, sparked a federal investigation. Late last year, Reuters exposed how hurried experiments at Musk’s brain-chip start-up, Neuralink, resulted in the unnecessary suffering and deaths of laboratory animals, despite objections from workers seeking to protect them. Neither Musk nor any of his companies commented for these reports. But he recently lashed out at critics of his social-media company, X, formerly Twitter, which has seen its revenue and market value plummet since Musk bought the firm for $US44 billion about a year ago. At the live Times event, he went after advertisers who boycotted X over Musk’s endorsement of an antisemitic post on the social-media site. “Go f--k yourself,” the billionaire told companies who pulled their business. Unlike traditional carmakers, which use independent dealers to sell and repair vehicles, Tesla sells directly to customers and owns and operates a large portion of its service centres. That gives the carmaker extraordinarily detailed real-time visibility into parts failures, repairs and warranty claims, which Tesla engineers meticulously tracked and analysed for years, the company records show. Yet the company has denied some of the suspension and steering problems in statements to US regulators and the public – and, according to Tesla records, sought to shift some of the resulting repair costs to customers. Tesla has blamed frequent failures of several parts on Tesla owners, alleging they abused the cars, according to interviews with former service managers, company records and a 2020 Tesla letter to the US National Highway Traffic Safety Administration (NHTSA). In other cases, it charged customers with out-of-warranty cars to replace parts that Tesla engineers internally called flawed or that they knew had high failure rates. Engineers ordered repeated redesigns for several parts and discussed seeking money back from suppliers because of the defects. The records reveal persistent problems with low-tech suspension connections, such as upper and lower control arms, and fore and aft links. These parts are relatively inexpensive for Tesla and largely invisible to most consumers. But they play a critical role in safely connecting a car’s axle and wheels to its body and steering apparatus. Two more complex and expensive parts also frequently failed: half shafts – the left and right drive axles – and steering racks, which often needed replacing after sudden power-steering outages that some Tesla owners said nearly caused accidents. One driver said in an interview that his brand-new 2023 Model Y jerked to the right when the power-steering suddenly failed at speed, nearly putting the vehicle into a ditch. At least 11 drivers told Tesla a crash was caused by a failure in the suspension, steering or wheel assembly, company records show. Those accident claims, which have not been previously reported by the media, were recorded by Tesla staff between 2018 and 2021 and assigned to engineers or technicians for review. A Tesla sedan in autopilot mode crashed into a parked police car in May 2018, in Laguna Beach, California.  AP In April 2021, the owner of a 2020 Model 3 with less than 15,000 miles on the odometer, went to a Tesla repair centre in Brooklyn, New York, after an accident. The technician’s summary: “Front wheel fell off while driving on Autopilot at 60 mph,” referring to Tesla’s automated driving system. The wrecked car was sold, without the front wheel, in November 2021, auction records show. The following month, another owner of a 2020 Model X in Madrid reported a wheel falling off while driving, the records show. Neither driver is identified in the records, which also do not detail how Tesla responded. The suspension collapse in Jain’s car fortunately occurred at low speed. It was nonetheless shocking in a car he had owned for less than 24 hours. The carmaker told him the suspension collapse was caused by the separation of a lower control arm from the steering knuckle, which connects to the wheel assembly. Jain expected Tesla to cover the damage. A Tesla Service representative had texted Jain that an initial inspection found “no evidence of any external damage” that caused the incident and implied Tesla would pay for the repairs, according to a copy of the text Jain provided to Reuters. About a week later, Tesla sent Jain a letter denying responsibility, saying it had inspected the vehicle and determined that the cause was “a prior external influenced damage to the front-right suspension”. Jain says he was the only driver of the car during the one day he owned it and hadn’t had an accident before the suspension failure. “I was like, ‘Bloody hell, how can metal just snap like that when I know for sure the car has not hit anything?’” he says. The repair took about three months. Jain paid a deductible of about $US1250 to have the work covered by his insurance company, which after the claim hiked his rates sharply on another car he owned, he says. Fed up with the ordeal, Jain sold the repaired Tesla – for about $US10,000 less than the $US55,000 he paid for it. “I lost complete confidence in the car,” he says. The Tesla records reveal the company’s extensive knowledge of systemic suspension and steering problems, even as the company denied some of the same problems to regulators and customers who expected the company to pay for repairs. One especially problematic part was the aft link. A series of 2016 suspension failures in China bears striking similarities to the incident with Jain’s car seven years later. Some of Tesla’s earliest China customers told the carmaker that a front wheel had collapsed while turning at low speeds on its Model S luxury sports car, Tesla’s first mass-produced vehicle. The front aft link, an aluminium-alloy suspension arm, had snapped, Tesla engineers found, according to company records that documented half a dozen such incidents. Between 2016 and 2020, Tesla resolved about 400 complaints involving aft-link failures in China, according to a former Tesla employee with direct knowledge of the matter. The company fixed cars under warranty or by making so-called goodwill repairs for out-of-warranty vehicles, the former employee says. Tesla redesigned the part four times because the initial revisions did not fully fix the problem, the carmaker’s records show. “The collapse of the suspension is terrifying to the customer,” Riccardo Dong, a Tesla engineer then based in China, wrote in 2016 on the company’s troubleshooting platform. “Many owners are asking for a recall.” Dong did not respond to a request for comment. Tesla delayed a recall for four more years, until Chinese regulators pushed for one. China’s State Administration for Market Regulation, in a statement, cited a “risk of accidents” in extreme cases of the aft-link part failure. Yet the carmaker never recalled the part in the United States and Europe despite reports of frequent failures globally. Tesla told US regulators the failures were caused by “driver abuse”. The company also instructed service centres, in a February 2019 “talking points” memo, to use the same explanation with customers experiencing aft-link failures. They were told to blame “vehicle misuse”, such as “hitting a curb or other excessive strong impact”. Tesla uses the terms “abuse” and “misuse” in the conditions of its warranty contract language that allow it to decline claims for repairs or damage. Tesla employed this deny-and-delay strategy as its ballooning costs of warranty repairs threatened the company’s profitability at a critical juncture – when investors were scrutinising its long-term prospects. During the fourth quarter of 2018, Tesla paid nearly $US500 for repairs, on average, for every Tesla in operation at the time, service engineers were told in a series of memos. In total, an April 2019 memo noted, Tesla’s repair business lost $US263 million in the quarter because of the high volume of warranty and goodwill repairs. That was nearly double Tesla’s quarterly profit of $US139 million. I lost complete confidence in the car — Shreyansh Jain, who says the suspension on his 2023 Tesla collapsed the day after he bought it new. Some US customers with out-of-warranty cars paid more than $US1000 to repair aft links, and Tesla records show many European customers were frustrated at paying for replacements. Tesla’s basic US warranty lasts four years or 50,000 miles (80,000 kilometres), and coverage is similar in most other markets. Tesla has also fought in court to avoid making repairs to suspension parts, including control arm assembly components. It scored a recent victory in a prospective class-action lawsuit alleging Tesla was aware that Model S and X cars made from 2013 to 2018 had a “suspension defect”, yet refused to cover repair costs, even for vehicles still under warranty. A federal judge in California dismissed claims from one plaintiff in January 2023, ruling he had failed to show Tesla “knew or should have known” of an alleged defect in his car. The class-action lawsuit, however, didn’t cite the Tesla records Reuters reviewed for this article. The other two plaintiffs voluntarily dismissed their claims without prejudice, which could allow them to refile a similar case later. Tesla has had nine recalls in the United States for steering and suspension issues since 2018, NHTSA records show. Most affected a relatively small number of vehicles. The largest was in 2018, to replace steering-rack bolts on more than 70,000 Model S vehicles because of the risk that corrosion could cause a loss of power steering. Tesla engineers were still examining the aft-link failures as recently as 2022, company records show. In February of that year, one company data review noted that the multiple revisions to the part, over several years, had finally fixed all “major flaws”. Tesla vehicles line a parking lot at the company’s Fremont, California, factory. Tesla’s Tesla’s complaint rate is far higher than that of GM or  Toyota. AP Earlier, in April 2019, Netherlands-based Tesla product support engineer Ralf van Gestel presented findings on the aft-link issue in an analysis. He found Tesla had spent nearly $US4 million on suspension warranty repairs globally for models S and X over the previous 12 months. Aft-link failures, often on cars less than two years old, accounted for the largest portion, $1.3US million. In the 12 months before van Gestel’s analysis, Tesla had replaced about 11,000 of the parts, about two-thirds of them under warranty, the data collected by van Gestel showed. In September 2020, Tesla engineers in Europe examined the long history of aft-link failures. Valentin Oetliker, an engineer and company intern based in France, expressed alarm that the part had a “high failure rate” despite a redesign. In an analysis written for other engineers, he noted that many customers were dissatisfied at paying for the repairs in newer vehicles. At the time, about 5 per cent of the 12,858 Model S and Model X vehicles on the road in Tesla’s southern Europe and Middle East markets had needed repairs because of aft-link failures, according to a Reuters calculation of the data reported by Oetliker. Oetliker did not comment. That same month, in a September 3, 2020, letter to US regulators, Tesla denied there were any defects with the same aft links that its engineers had determined were flawed. It told NHTSA it would not recall the part for US customers, despite its recall of the same part the month before in China. The company told NHTSA it had voluntarily recalled the aft link and another suspension part under pressure from China regulators, even though it disagreed with their assessment, because fighting them presented a “heavy burden”. At the time, Tesla was looking to ramp up production at its newly built Shanghai Gigafactory, which would become the world’s most productive and profitable electric-vehicle plant. By contrast, Tesla took a firm stance with US regulators. “There is no defect in the subject components and no associated safety risk,” a senior Tesla lawyer wrote to NHTSA, again blaming owners: “The root cause of the issue is driver abuse.” The letter cited a drastically lower failure frequency than the 5 per cent failure rate for the aft link in the markets that Oetliker analysed. Addressing both aft links and the other part it recalled in China, a rear suspension upper link, Tesla told NHTSA: “The occurrence of such failures in China (approx. 0.1%) and elsewhere (less than 0.05%) remains exceedingly rare.” NHTSA has not ordered Tesla to take any action on the parts the company recalled in China. The agency has not explained why. The US safety regulator, however, has since 2020 been investigating a similar front suspension part known as a fore link, and its risk of breaking, in models S and X. The agency has said it received dozens of complaints about the part breaking, including several about failures happening at highway speeds. NHTSA confirmed to Reuters it was investigating the fore link. The agency also launched a probe into power-steering outages in July. NHTSA declined further comment on both inquiries. In July 2021, Henrietta Wooten, a retiree outside St Louis, was backing her 2015 Model S out of the driveway when she heard a “screeching noise” and a “big old thump”, she says. The wheel had collapsed after a break in the fore link that NHTSA is investigating. The repair cost her about $US980. In March, the agency asked Tesla for more information on fore-link failures, including any reports of fires related to the part breaking. Such a part failure could cause a fire if the battery, which is embedded in the floor of Tesla vehicles, scrapes the ground, says Michael Brooks, executive director at the Centre for Auto Safety, a consumer advocacy group. Suspension parts are critical for safety because a failure “pretty much means that your car is going to have some sort of loss of control and a much higher chance of a crash,” Brooks says. Tesla owners filed about 260 complaints with NHTSA over suspension and steering problems in 2023, compared to about 750 for General Motors and 230 for Toyota. That makes Tesla’s complaint rate far higher when considering the number of GM and Toyota vehicles on the road. GM has a 21 per cent share of US cars in operation; Toyota, 15 per cent. Tesla’s share: less than 1 per cent, according to data analytics firm Experian. When Tesla engineer van Gestel examined common suspension problems, he found control-arm failures had been the second-most expensive failure for the carmaker in the 12 months preceding April 2019. Control arms on the Model X had failed more than 3000 times during that period, despite a redesign of the part. The engineer found that front upper control arms in models S and X were prone to early failure, with most replacements happening within 2½ years of ownership, he said in a report for Tesla engineers. Van Gestel recommended “next steps”, including “improve quality” of the part and “charge back supplier” for the failures. The records do not make clear whether Tesla ever received any money back from suppliers. Van Gestel did not respond to a request for comment. The control-arm problem continued for years, across Tesla’s model lineup. The carmaker replaced front upper control arms on about 120,000 cars globally from January 2021 through March 2022, according to a Reuters analysis of repair records included in the Tesla documents. Most of the replacements came on the Model 3, Tesla’s least expensive vehicle. Many of the customer complaints were for noise. Tesla paid for most of the 120,000 vehicles repaired under warranty, but owners with older cars also paid for 31,000 repairs, the Reuters analysis showed. An upper control arm can cost about $US90 on a Model 3 and more than $US280 for a Model X, according to invoices provided by customers. That doesn’t include labour, which can run $US200 an hour or more for a Tesla technician. Such suspension defects are rare on relatively new cars, says David Friedman, former acting NHTSA administrator under the Obama administration. “You certainly shouldn’t be expecting suspensions to fail within the first few years of owning a vehicle,” Friedman says in an interview. Former service managers and technicians in Norway, the country with the most Teslas per capita, say they were inundated with angry customers complaining of early control-arm failures. They say that tension increased as the carmaker, starting in 2017, told service employees to push the cost of the frequent and repeated failures onto customers to cut warranty and goodwill repair costs. One manager says he was forced out after resisting the company’s push to blame customers for the failures of faulty control arms. “I said: ’Now, we have to quit talking bullshit,” he says. A service technician says he started in 2018 and quit a year later over the issue. “I wasn’t doing anything else than just constantly changing those control arms,” he says. One senior manager defended the company’s push to cut costs, saying some service managers were giving away repairs in Norway at a rate that would “bankrupt any company”. The problematic control arms and links were cheap and simple parts. But two more complex and expensive Tesla components – steering racks and axle half shafts – also frequently failed on newer vehicles. Trace Curry had a slew of problems with his 2016 Model X. After paying about $US110,000 for the vehicle, the Cincinnati surgeon had to replace the control arms twice, once under warranty and once at his own expense. Later, after the four-year warranty ran out, he paid about $US10,000 more out of pocket for suspension and drive-axle parts that failed, according to invoices Curry provided to Reuters. Tesla’s gigafactory in Shanghai  became the world’s most productive and profitable electric-vehicle plant. Bloomberg In 2018, Curry had to replace both front half shafts, the left and right drive axles that connect to the wheels, under warranty. Then he had to pay about $US1500 last year to replace both of them again. When suspension parts rust or wear out, the first symptom can be an annoying squeak, frustrating some Tesla drivers who paid six-figure sums for a luxury vehicle that promised whisper-quiet, breakneck acceleration. “It sounds like you’re driving a jalopy from the 1970s,” Curry says. “It defeats the purpose of the high speed if you’re afraid that your front wheels are going to fall off if you accelerate quickly.” Tesla tracked noise complaints on the new Model 3 in 2018 and 2019, company records show. Repair centres handled about 300 cases where owners who had half shafts or wheel hubs replaced reported a wide array of strange noises alerting them to the problem. The complaints included descriptions of “clicking”, “clunking”, a “whir”, a “loud bang” or a “womp-womp-womp” noise increasing with speed. In those 300 cases, Tesla tracked “days to failure”, the total number of days between the start of a vehicle’s new-car warranty and a repair. The average was about eight months. When the half shafts failed in Curry’s Model X, the SUV vibrated severely, especially under acceleration. He called the multiple replacements “insane” in a car that new: “Have you ever heard of anybody having to replace the axles when you didn’t have an accident?” Tesla engineers heard about it quite a lot, company records show. One repair analysis showed the company replaced nearly 66,000 half shafts between January 2021 and March 2022. Customers paid for about 10 per cent of those repairs. Lars Heykers, a senior technician in Belgium, wrote on a company messaging system in September 2021: “We have a car which already had the newest revision of the half shafts 6 weeks ago, and the same issue has returned. Is there another fix for this or just replace them again?” More than one engineer made a point of saying the issue had nothing to do with damage caused by customers. Engineer Anastasia Skolariki, who was troubleshooting repair problems and customer complaints for Tesla in Europe, wrote in May 2020 to other engineers and technicians that the problem was a design issue “and not abusive behaviour from the customer side.” The company needed to cover repairs for cars under warranty, she said, “no matter how many times the vehicle comes to Service with the same issue”. It tried to kill me — Jamie Minshall, describing a sudden power-steering outage in his Tesla Model Y Neither Heykers nor Skolariki responded to requests for comment. In 2019, a Tesla engineer in Shanghai flagged a failure on a brand-new Model S with 160 kilometres on it. The car’s rear left half shaft had broken into three pieces when the owner stepped on the accelerator; one of the pieces pierced the electric-drive unit that powers the car. Another problem seen in brand-new Teslas: sudden power-steering outages. In May, less than two months after buying his 2023 Model Y, Jamie Minshall felt it jerk suddenly to the right while driving outside Portland, Oregon. A dashboard error message popped up: “Steering assist reduced,” indicating a loss of power-steering. Losing the power function makes the steering wheel suddenly more difficult to turn. “Fortunately, I was able to hit the brakes quick enough and not go into the ditch, but, yeah, it was pretty terrifying,” says Minshall, who has raced cars as a hobby. “It tried to kill me.” In July, NHTSA began investigating power-steering outages in 2023 Model 3 and Model Y vehicles. Between late 2017 and early 2022, more than 400 Model 3 or Model Y owners told the carmaker about power-steering failures, according to a Reuters review of customer messages sent through Tesla’s service app. Some reported outages of other safety systems at the same time. The steering complaints accelerated in late 2021 and early 2022. One Tesla owner from Charlotte, North Carolina, who is not named in the Tesla records, reported to the carmaker on December 27, 2021: “Our Model Y started to buck” before power steering and stability control stopped working. Two weeks later, a Model Y driver near White Plains, New York, told service technicians: “I cannot drive the car. None of the power functions work.” When NHTSA started its investigation into power steering in late July, it did so on the basis of complaints from 12 drivers. Tesla had known of more than 30 times that number of complaints since 2017 on models 3 and Y, its records show. NHTSA declined to comment on whether Tesla had disclosed consumer complaints about power steering or safety incidents to the agency. Andrew Lundeen, of Santa Rosa, California, was driving his wife’s 2018 Model 3 in August when he rode over a speed bump and lost power steering. Lundeen says a Tesla service manager told him that a power-steering connector had corroded. The manager said the likely cause was a car wash, which he described as a known problem. Lundeen paid $US4400 to replace the steering rack and a wiring harness. “This is the only car that I’ve ever heard of where a car wash can damage the wiring,” Lundeen recalls telling the manager. Lundeen says he was so shocked by the manager’s frank explanation of Tesla’s part failures that he wrote it down: “All I can tell you,” the Tesla manager said, “is we’re not a 100-year-old company like GM and Ford. We haven’t worked all the bugs out yet.” Reuters Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}