{
    "title": "Judge strikes down Elon Musk's massive, multi-billion-dollar pay package",
    "date": "1/31/2024",
    "url": "https://saudigazette.com.sa/article/640059/World/America/Judge-strikes-down-Elon-Musks-massive-multi-billion-dollar-pay-package",
    "text": "NEW YORK — A Delaware state court judge has thrown out the 2018 pay package that helped to make Tesla CEO Elon Musk one of the richest people in the world.Delaware Chancery Court Chancellor Kathaleen McCormick, who oversaw the bench trial that concluded in November 2022, ruled Tuesday that Musk and the Tesla board “bore the burden of proving that the compensation plan was fair, and they failed to meet their burden.”The 303 million split-adjusted stock options that Musk had received as part of the package are worth $51 billion today, when calculated using Tuesday’s closing price, less the modest exercise price of $23.34 a share.The case was argued in Delaware, where Tesla and many other major US corporations are incorporated. While Musk did not have an immediate comment on the decision, he did tweet Tuesday, “Never incorporate your company in the state of Delaware.”Attorneys for the shareholders who brought the suit had argued that the package of stock options was excessive and that the directors on Tesla’s board were not truly independent and were too close to Musk to protect shareholders’ interests.They also argued that the financial targets the company had to hit for Musk to qualify for each of the 12 separate blocks, or “tranches,” of stock were not the “stretch performance goals” as the company told shareholders when seeking their approval of the package. Instead, they argued the milestones were essentially the same as the company’s internal growth projections that were being shared with banks and rating agencies.“We are enormously grateful for the court’s thorough and extraordinarily well-reasoned decision in turning back the Tesla board’s absurdly outsized pay package for Musk,” said a statement from Greg Varallo, one of the plaintiff’s attorneys in the case. He said Tesla investors will benefit from the decision by having the “dilution from this gargantuan pay package erased.”Attorneys for Musk and the Tesla board argued the pay package was approved by a shareholder vote. Excluding the votes owned by Musk and his brother, 73% of the shares voting in that election supported the pay package.They also argued that the shareholders had seen their Tesla shares massively increase in value since it was granted. The company’s market cap was valued at $54 billion at the time the pay package was approved. It had risen to $607 billion as of the close of trading Tuesday, a gain of more than 1,000%. The Tesla attorneys argued that Musk was a key to that rise in the company’s value and that the pay package was therefore reasonable compensation.The Tesla attorneys also argued that Musk, who does not receive a cash salary or bonus, would be uncompensated if the package was thrown out.But McCormick rejected the argument that Musk would be uncompensated if the package was thrown out, writing, “Musk’s preexisting equity stake provided him tens of billions of dollars for his efforts.”Musk recently said it is important that his stake in Tesla be increased, as a protection against outside investors getting control of the company.“I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control. Enough to be influential, but not so much that I can’t be overturned,” Musk wrote in a post on X. “Unless that is the case, I would prefer to build products outside of Tesla.”He said at that time the Tesla board was waiting for the court to make a decision in this case before it moved ahead with a new pay package.He owns about 13% of the company’s shares outright. With the options he has now lost, he would have controlled about 20.6% of the shares. He said he wanted to control at least 25% of the shares of the company.The decision can be appealed to the Delaware Supreme Court.Some investors and analysts have suggested it would be a good idea for Tesla to offer Musk a new pay package in order to keep him focused on Tesla’s success rather than distracted by his other interests.He is the CEO of SpaceX, a privately held space exploration company of which he is the primary shareholder, and he purchased Twitter in 2022, rebranding it X in 2023. He also has a company called the Boring Company that is developing ways to drill tunnels more cost effectively and an AI company called xAI, which he started last year. He is also the primary owner of Neuralink, which has been working toward using implants to connect the human brain to a computer.Robyn Denholm, the chair of Tesla’s board, testified that the pay package was all about keeping Musk focused on Tesla.“It was around motivating him to achieve things that were bold and audacious and him putting his time and energy into that as opposed to his other interests,” Denholm said in testimony in the case.“Quite honestly, I don’t know how much it costs to do any inter-planetary travel. It’s not a hobby of mine,” Denholm said in response to questioning about Musk’s uses for the money. — CNN NEW YORK — A Delaware state court judge has thrown out the 2018 pay package that helped to make Tesla CEO Elon Musk one of the richest people in the world.Delaware Chancery Court Chancellor Kathaleen McCormick, who oversaw the bench trial that concluded in November 2022, ruled Tuesday that Musk and the Tesla board “bore the burden of proving that the compensation plan was fair, and they failed to meet their burden.”The 303 million split-adjusted stock options that Musk had received as part of the package are worth $51 billion today, when calculated using Tuesday’s closing price, less the modest exercise price of $23.34 a share.The case was argued in Delaware, where Tesla and many other major US corporations are incorporated. While Musk did not have an immediate comment on the decision, he did tweet Tuesday, “Never incorporate your company in the state of Delaware.”Attorneys for the shareholders who brought the suit had argued that the package of stock options was excessive and that the directors on Tesla’s board were not truly independent and were too close to Musk to protect shareholders’ interests.They also argued that the financial targets the company had to hit for Musk to qualify for each of the 12 separate blocks, or “tranches,” of stock were not the “stretch performance goals” as the company told shareholders when seeking their approval of the package. Instead, they argued the milestones were essentially the same as the company’s internal growth projections that were being shared with banks and rating agencies.“We are enormously grateful for the court’s thorough and extraordinarily well-reasoned decision in turning back the Tesla board’s absurdly outsized pay package for Musk,” said a statement from Greg Varallo, one of the plaintiff’s attorneys in the case. He said Tesla investors will benefit from the decision by having the “dilution from this gargantuan pay package erased.”Attorneys for Musk and the Tesla board argued the pay package was approved by a shareholder vote. Excluding the votes owned by Musk and his brother, 73% of the shares voting in that election supported the pay package.They also argued that the shareholders had seen their Tesla shares massively increase in value since it was granted. The company’s market cap was valued at $54 billion at the time the pay package was approved. It had risen to $607 billion as of the close of trading Tuesday, a gain of more than 1,000%. The Tesla attorneys argued that Musk was a key to that rise in the company’s value and that the pay package was therefore reasonable compensation.The Tesla attorneys also argued that Musk, who does not receive a cash salary or bonus, would be uncompensated if the package was thrown out.But McCormick rejected the argument that Musk would be uncompensated if the package was thrown out, writing, “Musk’s preexisting equity stake provided him tens of billions of dollars for his efforts.”Musk recently said it is important that his stake in Tesla be increased, as a protection against outside investors getting control of the company.“I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control. Enough to be influential, but not so much that I can’t be overturned,” Musk wrote in a post on X. “Unless that is the case, I would prefer to build products outside of Tesla.”He said at that time the Tesla board was waiting for the court to make a decision in this case before it moved ahead with a new pay package.He owns about 13% of the company’s shares outright. With the options he has now lost, he would have controlled about 20.6% of the shares. He said he wanted to control at least 25% of the shares of the company.The decision can be appealed to the Delaware Supreme Court.Some investors and analysts have suggested it would be a good idea for Tesla to offer Musk a new pay package in order to keep him focused on Tesla’s success rather than distracted by his other interests.He is the CEO of SpaceX, a privately held space exploration company of which he is the primary shareholder, and he purchased Twitter in 2022, rebranding it X in 2023. He also has a company called the Boring Company that is developing ways to drill tunnels more cost effectively and an AI company called xAI, which he started last year. He is also the primary owner of Neuralink, which has been working toward using implants to connect the human brain to a computer.Robyn Denholm, the chair of Tesla’s board, testified that the pay package was all about keeping Musk focused on Tesla.“It was around motivating him to achieve things that were bold and audacious and him putting his time and energy into that as opposed to his other interests,” Denholm said in testimony in the case.“Quite honestly, I don’t know how much it costs to do any inter-planetary travel. It’s not a hobby of mine,” Denholm said in response to questioning about Musk’s uses for the money. — CNN "
}