{
    "title": "Tesla loses over $82 billion, stock plunges 12% in a single day after \n‘disastrous’ earnings call",
    "date": "1/26/2024",
    "url": "https://www.firstpost.com/tech/tesla-loses-over-82-billion-dollars-stock-plunges-12-per-cent-in-a-single-day-after-disastrous-earnings-call-13656932.html",
    "text": "In Tesla’s recent earnings call, Elon Musk made a few comments how the world needs to be wary of Chinese EV companies, whom he referred to as “the most competitive car companies in the world.” Following this, Tesla’s stock saw a plunge of 12%, wiping away $82 billion in market cap The stock value of Tesla saw a significant dip of just over 12% on Thursday following remarks by CEO Elon Musk highlighting the challenges posed by Chinese electric-car manufacturers, whom he referred to as “the most competitive car companies in the world.” During Tesla’s earnings call on Wednesday, Musk praised Chinese carmakers such as BYD, Geely, and SAIC, emphasizing their excellence and warning that, without trade barriers, they could potentially outshine most other global car companies. Musk’s remarks contributed to a substantial decrease in Tesla’s market capitalization, which plummeted by $82 billion on Thursday. In addition to Musk’s comments on the Chinese market, lower sales projections for 2024 and uncertainty regarding potential interest rate adjustments by the Federal Reserve further impacted Tesla’s market value. The stock traded around $182 on Thursday afternoon, marking a 27% decline year-to-date. Earlier this month, Tesla lost its position as the world’s largest electric vehicle (EV) maker to BYD, a Chinese carmaker backed by Warren Buffett. Despite implementing price cuts on its U.S. vehicles in the previous year to compete with lower-cost Chinese EVs, Tesla faced challenges in maintaining its leadership in the EV sector. The Biden administration has explored raising tariffs on Chinese EVs, with a current 25% tariff already applicable. Meanwhile, the European Commission is investigating Chinese automakers for potential tariff increases, citing concerns about state subsidies distorting the market. As Tesla contends with increased competition, the company is preparing to launch a lower-cost model to enter the affordable EV category dominated by Chinese companies. Musk announced that production of Tesla’s “next-generation” $25,000 electric vehicle is set to commence in mid-2025. While uncertainties surround Tesla’s future in the lower-cost EV sector, Musk indicated a willingness to collaborate with Chinese companies through licensing arrangements for self-driving technology and other innovations, albeit for a price. The $82 billion decline in Tesla’s market value on Thursday nearly exceeds the combined valuations of General Motors ($48 billion) and Ford ($45 billion) and equals about one-third of Toyota’s ($270 billion) market cap. As Tesla faces challenges meeting its volume and margin growth expectations, investors are left to assess whether the discounted stock price accurately reflects the downsized expectations. Despite the stock’s decline, Tesla’s price-to-earnings ratio remains high, with Musk proposing an equity award that could dilute current shareholders. This move raises concerns among investors about Musk’s vision for Tesla’s trajectory and the potential impact on shareholder returns. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}