{
    "title": "Tesla (TSLA) now the world’s third-most shorted stock: S3 Partners",
    "date": "1/18/2024",
    "url": "https://www.teslarati.com/tesla-tsla-no-longer-worlds-most-shorted-stock/",
    "text": "Tesla (NASDAQ:TSLA) is no longer the world’s most-shorted stock. As per data shared by S3 Partners LLC Managing Director of Predictive Analytics Ihor Dusaniwsky, Tesla’s short interest is now the third-most shorted stock in the market, behind tech giants Apple and Microsoft. Dusaniwsky shared some of S3 Partners’ data in a post on X, showing that about $18.51 billion worth of Tesla shares were held as short bets. In comparison, approximately $18.63 billion worth of Apple shares are shorted, and about $18.61 billion worth of Microsoft shares were held as short bets. $TSLA slips to third place in most shorted U.S. stock behind $AAPL and $MSFT @S3Partners @elonmusk pic.twitter.com/TGVR5XqESI While Tesla is no longer the world’s most shorted stock today, the company still maintained the highest short interest among its peers in the “Magnificent 7.” As noted in a Nasdaq report, 3.06% of TSLA stock’s float are shorted. Outside the Magnificent 7, other companies have an even higher short interest. General Motors is a good example, as 8.17% of the automaker’s float are shorted. Tesla is listed among a group of mega-cap companies dubbed as the “Magnificent 7.” The stocks in the group earned their name last year partly because of their ability to drive the market’s performance due to their heavy weighting in major stock indexes like the S&P 500 and the Nasdaq 100, as noted in a Bankrate report. To date, the Magnificent 7 includes Apple, Microsoft, Alphabet, Amazon, NVIDIA, Tesla, and Meta. Other stocks in the Magnificent 7 are also heavily shorted. Just like Apple, Microsoft, and Tesla, NVIDIA, Amazon, and Meta have shorted shares amounting to $14.26 billion, $11.79 billion, and $11.47 billion, respectively. Alphabet, while not among the top 10 shorted stocks in S3 Partners’ data, still has $6.28 billion in short bets. Tesla has always attracted a lot of attention from short-sellers, though their endeavors have not been successful so far. As per Dusaniwsky in a follow-up post on X, Tesla shorts lost $12.5 billion in 2023 and were down 64.64% on average short interest of $18.9 billion. Since 2010, Tesla shorts have lost about $61.9 billion, larger than the market cap of Ford ($44.53 billion) and General Motors ($47.96 billion) today. Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}