{
    "title": "Tesla, other EV stocks sell off, as delivery data spooks investors",
    "date": "1/2/2024",
    "url": "https://www.marketwatch.com/story/most-ev-stocks-sell-off-but-teslas-gains-after-delivery-data-8f258bd4",
    "text": "Shares of electric-vehicle makers traded lower Tuesday, as delivery data failed to spark investor interest following a stellar 2023 for the group. The Global X Autonomous & Electric Vehicles ETF \n        DRIV\n       dropped 1.8%, after soaring 24.2% in 2023. The ETF underperformed the S&P 500 index \n        SPX,\n       which slipped 0.6% on Tuesday. Meanwhile, Tesla Inc.’s stock \n        TSLA,\n        -2.25%\n       finished the day fractionally lower, after wobbling during regular trading hours. The “former” global EV leader said earlier that it delivered 484,507 EVs in the fourth quarter, up 19.5% from a year ago and above the FactSet consensus of 473,000. “This was an important quarter for Tesla to show strong deliveries with clear momentum into 2024 as demand has upticked since 3Q, based on all our global checks,” Wedbush analyst Dan Ives wrote in a note to clients. The stock saw some weakness earlier, as the data confirmed that Tesla ceded the EV delivery title to BYD Co. \n        BYDDY,\n        -1.63%\n1211,\n        -0.59%,\n       which is based in China. BYD reported on Sunday that it delivered 190,754 EVs in December, which brought the fourth-quarter total up to 526,409 EVs, or 8.6% above Tesla’s total. Read: Tesla is getting beat by China’s BYD on EV sales. But still, BYD’s U.S.-listed shares shed 2.8%, snapping a six-session win streak. Among other China-based EV makers, Nio Inc.’s stock \n        NIO,\n        -3.64%\n       took a 7.2% dive. The Shanghai-based company reported Monday morning that it delivered 50,045 vehicles during the fourth quarter. While that was up 25% from a year ago, it was down 9.7% from the 55,432 vehicles delivered in the third quarter. Among other China-based EV makers, shares of Li Auto Inc. \n        LI,\n        +0.33%\n       lost 7.6%, even after the Beijing-based EV maker said fourth-quarter deliveries of 131,805 was up 184.6% from a year ago, and 25.4% more than what it delivered in the third quarter. And Xpeng Inc.’s stock \n        XPEV,\n        -1.66%\n       slumped 3.8%, even after the Guangdong-based company delivered a quarterly record of 60,158 EVs in the fourth quarter, up 171% from a year ago and 50.4% more than the third quarter. Meanwhile, Rivian Automotive Inc.’s stock \n        RIVN,\n        -0.36%\n       tumbled 10.1% after the California-based EV maker said it delivered 13,972 EVs in the fourth quarter, up 73.4% from a year ago but 10.2% less than what it delivered the previous quarter. For 2023, Rivian delivered 50,122 EVs, up 146.5% from 2022 but below the FactSet consensus of 51,000. Elsewhere, shares of Fisker Inc. \n        FSR\n       were down 6.9%. Mullen Automotive Inc.’s stock \n        MULN,\n        +19.54%\n       was knocked 10% lower, while Nikola Corp. shares \n        NKLA,\n        +14.40%\n       fell 4.8%. Trading in General Electric’s power-generation spinoff began this week. The spinoff itself takes place on April 2. So far, trading has hewed pretty close to Wall Street estimates. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Visit a quote page and your recently viewed tickers will be displayed here. "
}