{
    "title": "Elon Musk Is 'Delusional' to Pursue a 25% Tesla Stake: Ross Gerber",
    "date": "1/25/2024",
    "url": "https://markets.businessinsider.com/news/stocks/elon-musk-tesla-ai-robotics-25-stake-investor-ross-gerber-2024-1",
    "text": "       Elon Musk is \"delusional\" to ask shareholders to give him a 25% stake in Tesla, according to a longtime investor. Ross Gerber, whose firm Gerber Kawasaki owns 400,000 shares in the EV maker, said Wednesday that he didn't agree with the world's richest man's recent assertion that he'd only make his company a leader in AI and robotics if he owned a quarter of all stock. \"Elon's pay package itself is worth $50 billion, which you would think would incentivize any human on earth,\" Gerber told Fox Business Thursday. \"When you look at his pay package plus his stake, it's closer to 20% of the stock, and he fully controls the board.\" \"What he's basically saying is 'I want you to give me $30 billion to $50 billion of compensation more for me to do my fiduciary responsibility to the company,\" he added. \"There's never been a more delusional CEO that I've ever invested with.\" Musk issued an ultimatum to shareholders like Gerber earlier this month when he said he was unwilling to grow Tesla's AI and robotics businesses without a bigger stake. He currently owns 13% of its shares. \"I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control,\" he wrote in a post on X. \"Enough to be influential, but not so much that I can't be overturned.\" This isn't the first time Gerber has criticized Musk in recent months. In November, he slammed the Tesla boss's decision for calling an antisemitic post on X the \"actual truth\". \"This isn't about me calling on him to step aside, he has stepped aside,\" Gerber told CNBC's \"Last Call.\" \"None of his actions are to benefit Tesla. He thinks in some weird world that what he says matters, but what he's really doing is destroying everything he built.\" Read next Indices Commodities Currencies Stocks Jump to "
}