{
    "title": "Tesla battery energy storage deployments reach new high in 2023",
    "date": "1/29/2024",
    "url": "https://etn.news/buzz/tesla-battery-energy-storage-2023-deployment-revenue-analysis",
    "text": "Customized Energy Solutions Tesla's energy storage business has posted an explosive growth in the year 2023, as indicated by the company's annual financial results released recently. Over the course of last year, Tesla has deployed battery energy storage to the tune of 14,724 MWh in global markets, according to the company, doubling the 6.5 GWh of battery storage deployments reported the previous year. Interestingly, the 2023 capacity additions are more than the combined figures of the years 2022, 2021, and 2020. In 2019, Tesla's storage deployment was just 1,651 MWh, which is just one-tenth of the 2023 figure, hinting at the explosive growth achieved by Tesla's battery storage division in recent times. To put the latest record in perspective, Tesla's 2023 battery storage volume amounts to about 150,000 EVs with 100 kWh battery packs. Yet, the storage volume is relatively small comparing to the company's EV battery production volume. Tesla's current product portfolio on battery energy storage includes utility-scale 'Megapacks' (over 3 MWh), 'Powerpack' for commercial installations (up to 232 kWh), and latest third-generation 'Powerwall 3' for domestic installations (13.5 kWh). In the latest analysts' call, the company CEO Elon Musk is said to have reiterated his long-standing claim that Tesla Energy is well positioned to grow at a faster rate than the automotive business. He has added that energy storage will be one of the key offerings to drive Tesla's \"next growth wave\", with Tesla Energy becoming the group's \"highest margin business\", according to news reports. Tesla's battery storage outlook for 2024 is on the positive aisle as well, as the company is gearing up its new 40 GWh gigafactory in Lathrop, California. To cater to the demands from the other side of the globe, Tesla's Shanghai facility with a potential 40 GWh is also expected to get ready by the second half of this year. This apart, rumors abound that the company may even announce a similar gigafactory in the European region as well in the coming years. It is clear that Tesla's strategic planning for battery storage are reaping benefits, with all trends suggesting healthy growth sustenance in the coming years. The brand is also featured in BloombergNEF's latest Energy Storage Tier 1 list of providers for BESS in global markets. That said, Tesla is acknowledging that the growth may not be all linear at all given time periods, expecting some \"volatility in deployments on a sequential basis\", resulting out of \"logistics and the global distribution of projects at any given time\". For instance, the company's Q4 2023 battery storage deployments has recorded a 30 percent dip as against the previous quarter.Revenue wise, Tesla Energy has posted $ 1.43 billion for the last quarter, with a cumulative $ 6.035 billion for the whole year of 2023. In 2022, the revenue was US$3.9 billion. The company's automotive business is said to have garnered $ 82.4 billion last year, highest among all verticals.Although the company doesn't reveal the revenue contributions of energy storage and solar PV divisions individually, it is said that Tesla's solar business is shrinking, with just 41 MW of deployments reported in the last quarter.Based on the explosive growth figures and dip in solar deployment, it can be inferred that battery storage is having an upper hand in the overall revenue of Tesla Energy at present. (With inputs from Energy-Storage.news and Insideevs.com)       "
}