{
    "title": "Forget Tesla: 2 Electric Vehicle Stocks to Buy Hand Over Fist Instead",
    "date": "1/16/2024",
    "url": "https://www.fool.ca/2024/01/16/forget-tesla-2-electric-vehicle-stocks-to-buy-hand-over-fist-instead/",
    "text": "To make the world smarter, happier, and richer. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom. Here’s why these two TSX electric vehicle stocks might outpace Tesla in the next few years. Image source: Getty Images Tesla (NASDAQ:TSLA) has created game-changing returns for shareholders, rising over 1,900% in the last 10 years. Valued at US$700 billion by market cap, Tesla is the largest electric vehicle (EV) company in the world. However, in the last two years, macro headwinds such as inflation and interest rate hikes have negatively impacted consumer spending, resulting in lower sales for Tesla. In fact, Tesla has reduced its vehicle prices several times to boost consumer demand, resulting in the erosion of its bottom line. While Tesla’s vehicle deliveries rose by 38% to 1.81 million in 2023, analysts expect its sales to grow by just 9% year over year to US$88.8 billion. Wall Street also expects adjusted earnings to narrow from US$4.07 per share in 2022 to US$2.87 per share in 2023. In addition to a sluggish macro environment, Tesla is wrestling with competition from new and legacy automobile manufacturers, including Byd, Ford, Nio, and General Motors. While Tesla’s revenue growth is decelerating, here are two Canadian EV stocks that are growing at a faster pace. Valued at a market cap of $1.64 billion, NFI Group (TSX:NFI) manufactures and sells buses in North America, the U.K., Europe and Asia Pacific. In the third quarter (Q3) of 2023, NFI experienced new order growth and improvements in vehicle deliveries and profit margins. Its aftermarket business delivered the third consecutive quarter of record-adjusted EBITDA (earnings before interest, tax, depreciation, and amortization) in the September quarter. NFI emphasized customer demand remains robust as it ended Q3 with an order backlog of $6.6 billion. Around 36% of the backlog, or $2.4 billion, is tied to zero-emission buses and coaches. As NFI continues to ramp up its production, it should benefit from economies of scale and higher profit margins. For instance, analysts expect NFI to increase sales from $2.8 billion in 2022 to $4.6 billion in 2024. Its profit margins are forecast to improve from a loss per share of $2.85 to earnings per share of $0.35 in this period. NFI recently completed its refinancing plan, generating gross proceeds of $444 million, and extended the maturity of senior credit facilities to April 2026. It ended Q3 with $170 million in total liquidity, up from $88 million in the previous quarter. Another battery-powered bus manufacturer is Lion Electric (TSX:LEV), which is valued at $563 million by market cap. In Q3 of 2023, Lion Electric almost doubled sales to US$80.3 million, up from US$41 million in the year-ago period. The rapid expansion of sales enabled Lion Electric to report a gross profit of US$5.4 million in Q3 compared to a gross loss of US$3.8 million last year. Lion Electric delivered 245 vehicles in Q3, up from 156 delivered in the year-ago period. It also narrowed the EBITDA loss from US$15.1 million to US$3.9 million in the last 12 months. Lion Electric ended Q3 with an order book of 2,232 battery-powered medium and heavy-duty urban vehicles, representing a total order value of US$525 million. Further, its order book includes 129 charging stations, representing a combined total order value of US$4 million. Analysts expect Lion Electric to increase sales from $190 million in 2022 to $663 million in 2024. Bay Street remains bullish and expects the TSX stock to surge 60% in the next 12 months. This article represents the opinion of the writer, who may disagree with the “official” recommendation position of a Motley Fool premium service or advisor. We’re Motley! Questioning an investing thesis — even one of our own — helps us all think critically about investing and make decisions that help us become smarter, happier, and richer, so we sometimes publish articles that may not be in line with recommendations, rankings or other content. March 30, 2024 |\n        Rajiv Nanjapla These three dividend stocks are excellent buys, given their discounted prices and high yields. Read more » March 30, 2024 |\n        Andrew Button You can transfer dividend income from stocks like Suncor Energy Inc (TSX:SU) to your spouse and enjoy tax savings that… Read more » March 30, 2024 |\n        Christopher Liew, CFA The CPP pegs the start retirement age at 65, but it's not necessarily the ideal option to start pension payments. Read more » March 30, 2024 |\n        Aditya Raghunath Here's why undervalued TSX energy stocks such as Secure Energy Services should be part of equity portfolio in 2024. Read more » March 29, 2024 |\n        Amy Legate-Wolfe The easiest way of creating passive income comes from from something you have to do anyway. Add in dividend income,… Read more » March 29, 2024 |\n        Joey Frenette Telus (TSX:T) and BCE (TSX:BCE) stocks are free-falling, and a bottom may still be far off. Read more » March 29, 2024 |\n        Chris MacDonald Here's why Shopify (TSX:SHOP) remains a top Canadian growth stock long-term investors should buy now and hold onto forever. Read more » March 29, 2024 |\n        Amy Legate-Wolfe This tax credit is one you've likely missed in the past but could provide you with thousands each year! So,… Read more » View All We're helping the world invest better. See our Foolish investing philosophy. Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people around the world achieve their financial goals through our investing services and financial advice. Our goal is to help every Canadian achieve financial freedom and make all levels of investors smarter, happier, and richer. From breaking news about what is happening in the stock market today, to retirement planning for tomorrow, we look forward to joining you on your journey to financial independence. ©  2024 The Motley Fool Canada, ULC. All rights reserved. "
}