{
    "title": "Tesla's Drive Hasn't Crashed At Rock-Bottom Yet (NASDAQ:TSLA)",
    "date": "2/8/2024",
    "url": "https://seekingalpha.com/article/4668542-tesla-drive-not-crashed-at-rock-bottom-yet",
    "text": "shaunl shaunl Beyond any doubt, one of the most controversial companies on the market today and certainly one of the most followed is electric vehicle manufacturer Tesla (NASDAQ:TSLA). Between the company's mission to popularize electric vehicles at a time when a shift to all things electric has both sides of the political aisle up in arms, to the company's top brass, Elon Musk, serving as a contentious executive that has become a mascot of sorts for the right, to a share price that has often been questioned because of underlying fundamentals, and other factors, the company is loved by many and hated by many. While all of these factors need to be taken into consideration when making an investment decision, what's most important is the fundamental data. For the most part, the picture has been encouraging for the business. Revenue and profits have risen nicely over the past three years. Cash flow data has been mixed, but mostly positive. Despite operating in an industry known for low margins, management has succeeded in keeping cash flows robust. And the company's balance sheet is about as healthy as they get. But all of this needs to be discussed in relation to the price that the market demands for shares. Contrary to the popular notion that stocks are efficiently priced or mostly efficiently priced, I am of the opinion that the market rarely is efficient, particularly in the short term. This mindset caused me, in June of last year, to rate Tesla a 'sell' because of how expensive the stock was and, although there were some positive developments at the time, they were not enough to justify anything other than a drop in the price of units. So far, that call has proven to be quite successful. While the S&P 500 is up 9.5%, shares of Tesla have seen downside of 26.8%. As much as I would love to be able to upgrade the stock following this decline, I share many of the same feelings now as I did then. In the long run, the company should do well for itself. But as things stand, prices are absurd. As I stated already, Tesla shares are down significantly since I last wrote about the company in June of 2023. But it's important to note the timing of this drop. Since this year began, shares are down a whopping 24.3%. And about 11.4% of the decline came after January 24th when management announced some financial data for the final quarter of the 2023 fiscal year. At first glance, it might seem peculiar that the market was unhappy with what management reported. Although revenue fell short of expectations by $596.8 million, earnings per share exceeded forecasts by $1.66. In addition to this, the company ended up producing 494,989 vehicles, with 484,507 deliveries. This allowed the company to hit 1.85 million units produced for the year and 1.81 million vehicles delivered. Management's forecast when results for 2022 were reported called for about 1.8 million units for 2023. Author - SEC EDGAR Data Author - SEC EDGAR Data As you can see in the chart above, Tesla has a solid track record of growing both its production and its deliveries. Obviously, these two go hand in hand. Over the past three completed fiscal years, the firm produced 4.15 million vehicles and achieved 4.06 million deliveries. While I am sure that some small number of these are no longer on the road because of car accidents and the like, the vast majority certainly are. Considering that there are an estimated 1.47 billion vehicles on the road globally, and around 300 million on the road in the US alone, Tesla still seems to have room to run in terms of growth potential. But that's the first thing that has investors truly concerned. When management announced financial results for the 2022 fiscal year, they were moderately detailed when it came to guidance. For instance, back then, management said that they believed that, for 2023, they would remain ahead of their long term 50% annualized growth rate from a production perspective. But that picture has now changed. Their current guidance for 2024 calls for vehicle volume growth that is 'notably lower' then what it was last year. In the investor call regarding the matter, Elon Musk mentioned that Chinese car manufacturers are the 'most competitive' players on the planet and that they are likely to see significant growth outside of China. In fact, absent trade restrictions placed on the country, he predicts that they will 'demolish' most other car companies on the planet. There are some others out there who remain optimistic about the future. Even management said that they believe that there is another phase of global expansion for what they call the 'next generation vehicle platform'. One suggestion provided by analysts at Deepwater Asset Management is that sales in 2024 might be impacted by something known as the Osborne Effect. In short, when consumers come to believe that a new, better offering for a company is coming out soon, they might delay purchase of that company's products until said offering is made available. The Model 3 is currently the main offering provided by Tesla. However, management did reveal not long ago that they are looking at introducing a cheaper vehicle in the $25,000 to $30,000 range. Obviously, whether or not this will play a role in the weakness of the business is speculative at this point. There is not enough data to support that claim, nor to reject it. It is certainly plausible and it would indicate that the future for the company might be bright from an operational standpoint. Tesla Tesla This wouldn't be terribly shocking. It would be different if the company had a massive market share. However, as the chart above illustrates, market share in the regions in which it operates is still quite small. In China, it is just shy of 2%. In the US and Canada, it is right up around 4%. But this is where we also start running into some other issues that might not bode well for the foreseeable future. You see, there was a time when Tesla was the Cadillac of electric vehicles. It was the electric vehicle that every enthusiast wanted. But those times are changing. Other car manufacturers are investing heavily into electric vehicles. And the results are showing. According to Car and Driver, the Tesla Model 3 is the only Tesla vehicle to make it on the list of best electric cars for 2024 and 2025. They currently have it ranked number four on the list. Now, to be clear, it is one of the cheaper ones on the list. But it's not the cheapest. U.S. News & World Report has its own list. According to it, the Tesla Model 3 ranks number three in the luxury electric vehicle market, while the Tesla Model S is number 10 on that same list. These are not bad showings by any means. But they do show that the era of Tesla dominance is over. Author - SEC EDGAR Data Author - SEC EDGAR Data The good news for shareholders is that the company has a robust balance sheet and strong cash flows. As you can see in the chart above, cash flows have been robust in recent years. The company also has cash that exceeds debt by $23.86 billion. That affords it a certain degree of flexibility. However, the company is also facing raft of issues. For instance, there is considerable uncertainty regarding Elon Musk. As news reported recently, a court struck down his $55 billion compensation package. It remains unclear what that means for his future at the company. In addition to this, his political rhetoric is undeniably controversial and risks alienating some consumers who would be likely to purchase electric vehicles moving forward. On top of this, vehicle sales seem to be slowing rather rapidly after a spike following an easing of supply chain constraints. For 2024, the US is supposed to see 15.7 million new vehicles sold. That's only 1.3% higher than the 15.5 million reported one year earlier. By comparison, growth from 2022 to 2023 was 11.6%, with the number of cars sold growing from 13.9 million to 15.3 million. In China, growth is expected to be around 3% this year. But that pales in comparison to the 12% rise seeing the year prior. Another issue to contend with involves the absence of unionization at Tesla. According to one source from September of 2023, Tesla pays an average of $45 an hour for labor, which is inclusive of hourly wages and benefits. By comparison, the big three auto manufacturers, Ford (F), General Motors (GM), and Stellantis (STLA), average around $66 per hour. The collective bargaining initiatives and strikes targeting the big three last year were largely seen as a positive for Tesla since any deal to come from those would further the gap in favor of Tesla. But the larger the company grows, the greater that pressure will become on that front. Add on top of this that unions and Denmark, Finland, Sweden, and Norway, are pushing heavily to force some degree of unionization, and this will remain an ever-present threat. Author - SEC EDGAR Data Author - SEC EDGAR Data If shares of the company were trading on the cheap, I could perhaps convince myself to be more optimistic. But that is, unfortunately, not the case. In the chart above, you can see how shares are priced relative to earnings, adjusted operating cash flow, and EBITDA, the latter of which involves the EV to EBITDA multiple. Although earnings improved from 2022 to 2023, cash flows weakened enough to make the stock significantly more expensive than if we were to assume a return to 2022 levels. And with growth now expected to be meaningfully lower than it was last year, and with the prospect of increased competition from places like China, I wouldn't be surprised to see 2024 results worsen as well. Conceptually speaking, I am a big fan of the shift to electric vehicles. However, there are other ways to play this opportunity. Although Tesla is often viewed as a great growth prospect, that growth comes at a very high price. Had shares of the business been trading on the cheap when all of this earnings news came out, the stock probably would not have tumbled like it did. But that's what happens when you buy shares of growth businesses, and they fail to achieve the expectations that the market has for them. Fast forward many years into the future, and I imagine that, operationally speaking, Tesla will be larger than it is today. But absent some miracle, I believe that financial performance between now and then will fall short of what the broader market will achieve. Because of that, and in spite of shares pulling back recently, I am keeping the company rated a 'sell'. Crude Value Insights is an exclusive community of investors who have a taste for oil and natural gas firms. Our main interest is on cash flow and the value and growth prospects that generate the strongest potential for investors. You get access to a 50+ stock model account, in-depth cash flow analyses of E&P firms, and a Live Chat where members can share their knowledge and experiences with one another. Sign up now and your first two weeks are free! This article was written by Daniel is an avid and active professional investor. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}