{
    "title": "Tesla recalling nearly 2.2M vehicles for software update to fix warning \nlights that are too small",
    "date": "2/3/2024",
    "url": "https://www.newindianexpress.com/business/2024/Feb/03/tesla-recalling-nearly-22m-vehicles-for-software-update-to-fix-warning-lights-that-are-too-small",
    "text": "DETROIT: Tesla is recalling nearly all of the vehicles it has sold in the US because some warning lights on the instrument panel are too small. The recall of nearly 2.2 million vehicles announced Friday by the National Highway Traffic Safety Administration is a sign of stepped-up scrutiny of the electric vehicle maker. The agency also said it has upgraded a 2023 investigation into Tesla steering problems to an engineering analysis, a step closer to a recall. Documents posted Friday by the agency say the warning light recall will be done with an online software update. It covers the 2012 through 2023 Model S, the 2016 through 2023 Model X, the 2017 through 2023 Model 3, the 2019 through 2024 Model Y and the 2024 Cybertruck. The agency says that the brake, park and antilock brake warning lights have a smaller font size than required by federal safety standards. That can make critical safety information hard to read, increasing the risk of a crash. Tesla has already started releasing the software update, and owners will be notified by letter starting March 30. NHTSA says it found the problem in a routine safety compliance audit on Jan. 8. Tesla has identified three warranty claims potentially related to the problem, but has no reports of crashes or injuries. Shares of Tesla Inc., which have been in a downward trend since July and slumped after the company’s fourth quarter earnings report last week, fell another 2.7% in early trading Friday to levels not seen since May of last year. In December, NHTSA pressured Tesla into recalling more than 2 million vehicles to update software and fix a defective system that’s supposed to ensure drivers are paying attention when using Autopilot. Documents said the update will increase warnings and alerts to drivers. The recall came after a two-year investigation by NHTSA into a series of crashes that happened while the Autopilot partially automated driving system was in use. Some were deadly. The agency says its investigation found Autopilot’s method of making sure that drivers are paying attention can be inadequate and can lead to “foreseeable misuse of the system.” The added controls and alerts will “further encourage the driver to adhere to their continuous driving responsibility,” the documents said. But safety experts said that, while the recall is a good step, it still makes the driver responsible and doesn’t fix the underlying problem that Autopilot isn’t reacting to stopped vehicles. They say that Tesla’s driver monitoring system that relies on detecting hands on the steering wheel doesn’t stop drivers from checking out. Tesla says on its website that its Autopilot and “Full Self-Driving” systems cannot drive the vehicles, and that human drivers must be ready to intervene at all times. In February of last year, NHTSA also pressed Tesla to recall nearly 363,000 vehicles with its “Full Self-Driving” system because it can misbehave around intersections and doesn’t always follow speed limits. The recall was part of part of a larger investigation into Tesla’s automated driving systems. It raised questions about CEO Elon Musk’s claims that he can prove to regulators that cars equipped with “Full Self-Driving” are safer than humans, and that humans almost never have to touch the controls. Musk at one point had promised that a fleet of autonomous robotaxis would be in use in 2020. The latest action appears to push that development further into the future. In addition, Tesla is recalling more than 1.6 million Model S, X, 3 and Y electric vehicles exported to China for problems with their automatic assisted steering and door latch controls. China’s State Administration for Market Regulation announced the recall in early January. It said Tesla Motors in Beijing and Shanghai would use remote upgrades to fix the problems. The recall is due to problems with the automatic steering assist function and applies to 1.6 million imported Tesla Model S, Model X, Model 3 and Model Ys. When the automatic steering function is engaged, drivers might misuse the combined driving function, increasing a risk of accidents, the notice said. The recall to fix the door unlock logic control for imported Model S and Model X EVs affects 7,538 vehicles made between Oct. 26, 2022 and Nov. 16, 2023. It is needed to prevent door latches from coming open during a collision. Tesla was the top seller of electric vehicles in the world last year, but China’s BYD beat the company in the fourth quarter. BYD is the leader in the booming China market. The steering investigation upgrade, also announced Friday in documents, covers more than 334,000 Tesla vehicles. The probe was opened in July of last year after the agency received a dozen complaints about loss of steering control in 2023 Model Y and 3 vehicles. Now the agency says it has 115 complaints, and it received another 2,176 after requesting information from the company. Agency documents say drivers are reporting loss of steering control, often accompanied by messages showing that power assisted steering has been reduced or disabled. Some complained of an inability to turn the steering wheel, while others said it required more effort. A message was left Friday seeking comment from Tesla. In one case a driver told NHTSA that they couldn’t complete a right turn and ran into another vehicle. The agency said there have been multiple allegations of Teslas blocking intersections or roadways. Over 50 vehicles had to be towed, according to the consumer complaints. Many of the complaints reported the problem happened between 5 mph and 35 mph. The highest reported speed that alleged an inability to turn was 75 mph, the documents said. The agency said it is looking into possible steering rack failures. Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest  Copyright - newindianexpress.com 2024. All rights reserved.  "
}