{
    "title": "Elon Musk says Tesla shareholders will vote ‘immediately’ on quitting \nDelaware for Texas",
    "date": "2/1/2024",
    "url": "https://www.cnn.com/2024/02/01/business/elon-musk-delaware-texas-hnk-intl/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Stung by a Delaware court ruling earlier this week that struck down his record Tesla pay package, Elon Musk says he is seeking shareholder approval to incorporate the company in Texas. Soon after Tuesday’s ruling about his 2018 salary package — worth about $51 billion at current stock prices — Musk put up a poll on X asking if Tesla (TSLA) should move its registration from Delaware to Texas, where it is already headquartered. Hours later, the Tesla CEO wrote that the “public vote is unequivocally in favor of Texas.” The poll results showed Texas had won the backing of more than 87% of about 1.1 million votes. Musk added he will now “immediately” seek shareholder approval to incorporate the electric carmaker in the southern state. Delaware is famously one of the world’s most welcoming places for companies of all kinds and sizes to incorporate for legal and tax purposes. Nearly 70% of Fortune 500 companies are incorporated there. Related article\nWho can rein in Elon Musk? Someone you’ve probably never heard of It is seen as a desirable place to seek approval for mergers and litigate disputes, and doesn’t levy sales tax or tax on profits from intellectual property. While Musk has not commented directly on the judgment on his pay package, he tweeted Tuesday: “Never incorporate your company in the state of Delaware.” “I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,” he said in another tweet. Attorneys for the Tesla shareholders who brought the suit had argued that the package of stock options was excessive and that the company’s directors were too close to Musk to protect their interests. The 303 million split-adjusted stock options that Musk had received as part of the package are worth $51 billion today, when calculated using Tuesday’s closing price, less the modest exercise price of $23.34 a share. Delaware Chancery Court Chancellor Kathaleen McCormick, who oversaw the bench trial that concluded in November 2022, ruled Tuesday that Musk and the Tesla board “bore the burden of proving that the compensation plan was fair, and they failed to meet their burden.” Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}