{
    "title": "Controversies surrounding Elon Musk have affected the electric car maker's \nreputation",
    "date": "2/22/2024",
    "url": "https://londonlovesbusiness.com/controversies-surrounding-elon-musk-have-affected-the-electric-car-makers-reputation/",
    "text": "Mercedes-Benz overtakes Tesla to regain its position as the world’s most valuable Automobiles brand, according to a new report from Brand Finance, the world’s leading brand valuation consultancy. Tesla’s drop to second position comes in the context of controversies surrounding Elon Musk which have affected the electric car maker’s reputation, impacting its brand value (down 12% to USD58.3 billion). Meanwhile, Mercedes-Benz’ brand value grew 1% to USD59.4 billion. Luxury sports car manufacturer, Ferrari, maintains a high brand strength with a score of 90.0/100, earning a AAA+ rating and solidifying its status as the world’s strongest automotive brand. Research conducted by Brand Finance underscores the brand’s robust familiarity, recommendation, and reputation metrics, while optimistic forecasts have further contributed to its increased brand value (up 43% to USD10.6 billion). Alex Haigh, Managing Director, Brand Finance, Asia Pacific said, “The decline in Tesla’s brand value is made all the more compelling against the backdrop of an automotive industry increasingly focused on electric vehicles, however, Tesla’s brand strength persists, a sign that the company’s core identity is resilient. “As other EV manufacturers, such as BYD and New Flyer, see considerable growth, Tesla’s enduring high levels of consumer familiarity and recommendation are likely to be pivotal for the company to stay competitive.” The Chinese auto sector continues to grow, fuelled by strong global EV interest which is driving investments and exports. BYD is China’s most valuable auto brand, with its brand value increasing by 20% to USD12.1 billion. While Chinese auto brands experienced fluctuations in brand value, brand strength is rising – Brand Finance research reveals that 19 out of the 22 Chinese brands featured in the 2024 Brand Finance Automobiles ranking improved in brand strength. New Flyer’s brand value has increased by three-and-a-half times its previous value (up 250%) to reach USD646 million. This follows burgeoning demand for electric vehicles in the public transport sector, New Flyer’s distinctive position in the EV bus market, and the steadfast support from the British and Canadian Governments in funding public transport initiatives involving EVs. Bosch’s is the most valuable and strongest Auto Components brand, with a valuation of USD14.6 billion. Brand Finance research shows it is excelling in metrics like ‘Brand I Admire’ and ‘Positive Contribution’, indicating growing respect for its brand and contributions. Updates in Familiarity and Consideration evaluations reinforce this recognition. The Ukrainian President has said that if the US do not provide military aid … The Prime Minister has vowed to cut red tape for businesses and boost apprenticeships and Rishi Sunak want the UK to be the “best place” in the world … While the high inflation rate of recent years is now falling, many employees will likely be feeling the squeeze on their wages for some time to come. Especially … ARTEX MTF, the exchange for art shares trading, is pleased to announce the successful first trading session. This first short session marked a historical shift in art investment … This Easter, BrewDog are offering a free kid’s meal with the purchase of an adult main, across all UK bars and pubs. Following the successful launch of Kids … Somewhere between conferences, meetings, and jetlag, you need to have a comfortable night’s rest on your business trip. Frequent flyers between Singapore and London will know these two … @2023 - All Right Reserved. The Ukrainian President has said that if the US do not provide military aid … The Prime Minister has vowed to cut red tape for businesses and boost apprenticeships and Rishi Sunak want the UK to be the “best place” in the world … While the high inflation rate of recent years is now falling, many employees will likely be feeling the squeeze on their wages for some time to come. Especially … ARTEX MTF, the exchange for art shares trading, is pleased to announce the successful first trading session. This first short session marked a historical shift in art investment … This Easter, BrewDog are offering a free kid’s meal with the purchase of an adult main, across all UK bars and pubs. Following the successful launch of Kids … Somewhere between conferences, meetings, and jetlag, you need to have a comfortable night’s rest on your business trip. Frequent flyers between Singapore and London will know these two … @2023 - All Right Reserved. [ms-form id=1] "
}