{
    "title": "IBIT ETF vs Tesla Stock: Better Buy Between BTC and TSLA?",
    "date": "2/15/2024",
    "url": "https://www.banklesstimes.com/news/2024/02/16/ibit-etf-vs-tesla-stock-better-buy-between-btc-and-tsla/",
    "text": "The iShares Bitcoin ETF (IBIT) and Tesla stock are two popular assets that people invest in globally. Tesla is the biggest company in the electric vehicle (EV) industry while Bitcoin is the biggest cryptocurrency in the world with a market cap of more than $1 trillion. The two are also highly controversial among investors, with analysts cautioning their valuations. Tesla is more valuable than companies like Toyota and Ford even though it sells fewer vehicles than them. Analysts and experts, including Warren Buffett, question the necessity of Bitcoin since it has no major use other than being an investment asset. This article compares IBIT ETF and Tesla. Since IBIT is fairly new, we will base it on Bitcoin, which has existed for over 15 years. The first thing to look at is the performance of Bitcoin and Tesla over time. As shown below, the two have been great performers over the years. Bitcoin has moved from almost zero 15 years ago to over $50,000 today. On the other hand, Tesla has surged from less than $10 in 2010 to over $200 today. It peaked at a split-adjusted point of $415 during the pandemic. If we include the all-time charts, Bitcoin wins by far. The same is true if we look at the five-year chart below. However, it is worth noting that past performance does not always indicate or signal future performance. The other thing to consider is their fundamentals. Tesla is going through a rough patch as competition rises globally. I believe that most of this competition is coming from China, a country that is well-known for its manufacturing prowess. China has over 100 EV companies, including BYD, Nio, Xpeng, and Li Auto. These are giant companies that are growing their market share at a fast pace. The challenge is that this competition will force Tesla and other companies to cut prices in a bid to gain market share. These price wars are already affecting margins. Sadly, we have been here before. For a long time, many countries had large steel producers until China showed up. It boosted production, which led to lower prices and closures in countries like the United States and the UK. The other challenge that Tesla investors should know is that it is highly associated with Elon Musk, who has a near cult following globally. In some cases, such a situation can be a risk, especially when something bad happens to him. Bitcoin (IBIT), on the other hand, has some strong fundamentals. Unlike Tesla, it has a limited supply cap. Only 21 Bitcoins will ever be produced. Over 19.62 million coins have already been mined while over 5 million of them have been lost forever. This means that there are only 1.38 million coins left and not all of them will be mined since difficulty is rising. Bitcoin’s supply in exchanges is also waning at a time when ETFs like IBIT are leading to more demand. Therefore, Bitcoin wins in this demand and supply issue. The only challenge with Bitcoin is that it does and will never pay a dividend and its returns will only be in the form of price appreciation. Tesla is expected to start paying a dividend in the next decade. IBIT or Bitcoin and Tesla have been great investments over time. However, looking forward, I believe that the IBIT ETF will be a better investment than Tesla. Tesla is facing way too many problems, which explains why Hertz is dumping thousands of them. Used Tesla prices are also crashing, making the new vehicles less attractive. Notably, most investors already own some Tesla shares since it is a big part of QQQ and SPY ETFs. Therefore, IBIT is a better asset as a way of diversifying your portfolio. "
}