{
    "title": "Elon Musk says Roadster is Tesla-SpaceX collab, may be 'mind-blowing'",
    "date": "2/28/2024",
    "url": "https://www.businessinsider.com/elon-musk-roadster-ev-design-revamp-tesla-spacex-collab-2024-2",
    "text": "       Elon Musk says the much-delayed Tesla Roadster has had a design overhaul. The billionaire announced the news in a post on X, referring to the car as a \"Tesla/SpaceX collab.\" \"Tonight, we radically increased the design goals for the new Tesla Roadster,\" Musk said. \"There will never be another car like this, if you could even call it a car. You will love the new Roadster more than your house.\" In a later post, the billionaire also claimed the car could go from zero to 60mph in less than a second, adding: \"And that is the least interesting part.\" Musk also responded to a query on X about whether the vehicle could \"fly a little\" with an \"eye\" emoji. Related stories Back in 2018 Musk posted this tweet: SpaceX option package for new Tesla Roadster will include ~10 small rocket thrusters arranged seamlessly around car. These rocket engines dramatically improve acceleration, top speed, braking & cornering. Maybe they will even allow a Tesla to fly … The original Roadster was Tesla's first vehicle with about 2,450 Roadsters made between 2008 and 2012 that started at about $100,000. The model is now considered an important piece of EV history. The revival was first announced six years ago, but its release date has already been pushed back several times from 2021-2023, with Musk partly attributing the delays to supply chain shortages. He often misses some of his more optimistic deadlines. He once acknowleged that his expectations could be unrealistic during a 2018 Tesla shareholders meeting. In 2021, Musk said the Roadster \"should ship in 2023.\" Now, the world's richest person says Tesla the production design is complete and will be unveiled \"end of year,\" with the company \"aiming to ship\" the car in 2025. \"I think it has a shot at being the most mind-blowing product demo of all time,\" Musk said in the Tuesday night post. Representatives for Tesla did not immediately respond to a request for comment from Business Insider, made outside normal working hours. Read next Jump to "
}