{
    "title": "Elon Musk’s Delaware court decision labeled “unAmerican” by ARKInvest’s \nCathie Wood",
    "date": "2/4/2024",
    "url": "https://www.teslarati.com/elon-musk-delaware-court-decision-unamercian/",
    "text": "ARK Invest Founder and CEO Cathie Wood called the Delaware court’s decision to void Elon Musk’s performance-based pay package “unAmerican.” “I believe the Delaware court decision, forcing Tesla to void the March 2018 vote on Elon Musk’s Performance-based pay package, is unAmerican, an assault on investor rights, and an insult to the Board of Directors of one of the most stunningly successful companies in US history,” posted Wood on X. Wood and Ark Invest’s General Counsel analyzed over 200 pages of the Delaware Court decision and concluded that its interpretations missed a lot of points. Judge Kathaleen McCormick from the Delaware Court of Chancery ruled that Musk’s 2018 pay package was unreasonable because of its “unfathomable sum.” I believe the Delaware court decision, forcing #Tesla to void the March 2018 vote on Elon Musk’s performance-based pay package, is un-American, an assault on investor rights, and an insult to the Board of Directors of one of the most stunningly successful companies in US history. “On behalf of our clients, ARKInvest voted for Elon Musk’s compensation, as did ~80% of shareholders. Nearly five years later, a Delaware judge has overruled the Board and shareholders, the latter [of] whom had the benefit of ample debate about the incentive plan’s probability,” added Wood to her post. Following the Delaware court’s decision regarding the 2018 pay package, Elon Musk posted a poll on X, asking the public if the company should change its state of incorporation to Texas. The company’s shareholders have also written to the Tesla Board of Directors, supporting a change in Tesla’s state of incorporation from Delaware to Texas. The letter also includes a request to explore options to keep Elon Musk’s 2018 pay package active and in place. Furthermore, the shareholders are asking the Board to design a new CEO compensation plan “along the lines of the 2018 Plan.” If you have any tips, contact me at maria@teslarati.com or via X @Writer_01001101. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Copyright © TESLARATI. All rights reserved. "
}