{
    "title": "Tesla repays bakery owner after controversially cancelling $16,000 order at \nthe last minute",
    "date": "2/27/2024",
    "url": "https://www.unilad.com/news/food-and-drink/tesla-repays-bakery-owner-last-minute-cancellation-632619-20240227",
    "text": "To make sure you never miss out on your favourite NEW stories, we're happy to send you some reminders Click 'OK' then 'Allow' to enable notifications Advert Emily Brown A bakery owner who lost out on thousands of dollars when a large order from Tesla was cancelled last minute has confirmed the car company has now repaid the cash she'd spent. Voahangy Rasetarinera, who owns the California business The Giving Pies, turned down requests for other orders after Tesla put in its last-minute order for 2,000 mini pies earlier this month. A couple of days later Tesla doubled the order to 4,000 pies - an order which would have cost approximately $16,000 - and prompted Rasetarinera to spend $2,000 on all the necessary ingredients to prepare to fulfil the order. Advert It was only when she reached out about payment for the invoice that Rasetarinera received a text message to say Tesla had decided to cancel its order. \"When you're a big corporation, $2,000 is pocket money, it's nothing,\" Resetarinera told ABC7, adding: \"But for us, it's a lot.\" The owner was gutted at having lost out on the money and took to social media to share her story. News of the cancelled order quickly got picked up by local media outlets as well as by members of the local community, who all rallied around The Giving Pies and rushed to the shop to give it some more business. Advert After Resetarinera's story began to spread, it caught the attention of Tesla and CEO Elon Musk, who took to X to respond to the news. \"Just hearing about this,\" Musk wrote. \"Will make things good with the bakery. People should always be able to count on Tesla trying its best.\" Just an hour after Rasetarinera spoke with ABC7 News about the cancelled order last Monday, Tesla repaid the $2,000 she had spent on ingredients for the company's order. Rasetarinera also revealed that someone had reached out to her to cater events in the coming weeks, but she had to decline the offer. \"I don't have any more crust - because everybody came to buy pies,\" Rasetarinera said. Advert \"We have so many events in March, we have PI Day, we have women's events, we also have Easter this year so it's all crazy. I really don't have any time for them.\" Though Rasetarinera turned down the offer to cater the events, the bakery owner said she'd be open to working with Tesla again in the future. \"I think that we're all humans, we all make mistakes, and they're trying to do good on their mistakes,\" she explained. \"So if they want to work with me, and they're not bitter about the whole experience - then yes, I would love to.\" Advert Rasetarinera has also expressed her appreciation to all the customers who placed orders after she shared her story, saying: \"It's so heartwarming, I'm so super grateful. \"I don't think I have any words to use to say how grateful I am.\" Topics: Tesla, Elon Musk, Social Media, Food and Drink, Money, US News Emily Brown is UNILAD Editorial Lead at LADbible Group. She first began delivering news when she was just 11 years old - with a paper route - before graduating with a BA Hons in English Language in the Media from Lancaster University. Emily joined UNILAD in 2018 to cover breaking news, trending stories and longer form features. She went on to become Community Desk Lead, commissioning and writing human interest stories from across the globe, before moving to the role of Editorial Lead. Emily now works alongside the UNILAD Editor to ensure the page delivers accurate, interesting and high quality content. Advert Advert Advert "
}