{
    "title": "Elon Musk steps in after California bakery jolted by cancelled Tesla order",
    "date": "2/24/2024",
    "url": "https://www.theguardian.com/technology/2024/feb/24/elon-musk-giving-pies-california-bakery-cancelled-tesla-order",
    "text": "A Tesla employee ordered 2,000 mini pies from San Jose’s Giving Pies, only to later cancel the $6,000 order from the small bakery Billionaire Elon Musk has promised to “make things good” with a California bakery after his company backed out of a pie order that cost the owner thousands of dollars. “Just hearing about this. Will make things good with the bakery,” Musk said on X (formerly Twitter) in response to a story about the cancelled order. Musk’s company Telsa ditched an order for 4,000 mini pies from Giving Pies, a Black-owned bakery in San Jose, in California’s South Bay area. Owner Voahangy Rasetarinera told KRON-TV that her bakery received a last-minute order for 2,000 pies from Tesla on Valentine’s Day – a $6,000 catch for the small business, KTVU reported. While Rasetarinera has previously worked on large catering orders with other tech companies, she said that she had to chase Tesla several times about payment for the order, money needed to secure ingredients and pay her staff. On Thursday evening, a Tesla representative named Laura contacted Rasetarinera and apologized about the delayed payment. Laura also upped the order to 4,000 pies, assuring Rasetarinera that money was not an issue. Rasetarinera said that she and her team had worked overtime to pull off the mega order. But Tesla never responded to several invoices sent from the pie company for payment. Instead, on Friday, Laura messaged Rasetarinera, letting her know that the order was no longer needed. Rasetarinera said in a post to Facebook that the casual cancellation “left me reeling, realizing the extent of the impact on my small business”. “I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry,” she added. Rasetarinera told KRON that the last-minute canceling of such a large order hurt her business. In order to fulfill Tesla’s order, Rasetarinera had to decline other catering gigs. Sign up to First Thing Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters after newsletter promotion “I’m a small business. I don’t have the luxury of infinite resources so I really need to be paid so I can secure my staff,” Rasetarinera said. A representative of Tesla later reached out to Rasetarinera and said that Laura was not authorized to approve payments, KGO-TV, an ABC affiliate, reported. As of Thursday, the company did not pay Rasetarinera for the pies but offered her a tour of the factory. But Musk’s post on Friday, in light of the viral story, may be a sign that the small business will soon be compensated for its hard work. “People should always be able to count on Tesla trying its best,” Musk said in the post to X. "
}