{
    "title": "Tesla in Germany: Locals vote against factory expansion plan",
    "date": "2/20/2024",
    "url": "https://www.dw.com/en/tesla-in-germany-locals-vote-against-factory-expansion-plan/a-68313010",
    "text": "Residents of Grünheide near Berlin have voted against expansion plans for the large Tesla facility there. But the vote is not binding and local authorities can still decide. Turnout was high, though, indicating interest. Locals living near the site of Tesla's large German factory in Grünheide have voted against plans to expand the facility in a non-binding public survey conducted by local authorities. Participation was high by the standards of such semi-formal citizen consultations. There were 3,499 votes against and 1,882 in favor, equating to a turnout of around 70% in the small settlement east of Berlin, fairly close to the border with Poland. The results were made public late on Tuesday by the local administration. The Tesla factory produces electric vehicles which have been seen as a solution to the carbon emitted by traditional forms of transport, but the facility has been subject to criticism from environmental groups since its construction. Tesla, owned by Elon Musk, is planning to build a rail freight depot and storage facilities and an on-site kindergarten for employees' children. It argues this will reduce burdens on other freight rail facilities and also allow it to recruit more. It says the extra warehouse space would also improve supply security. Recently the facility was forced to pause production as a result of shipping disruptions in the Red Sea caused by Houthi militants in Yemen. But the process would also lead to the felling of some 100 hectares (roughly 250 acres) of forest in the rural community of fewer than 8,000 residents near a nature conservation area. Opponents of the expansion also say part of the project will impact a water protection zone; Grünheide is nestled between two lakes. The \"Grünheide Citizens' Initiative\" that campaigned against the plans welcomed the results. \"The no is a historic victory for forest and water protection — not just in Grünheide, but for all of Brandenburg and Berlin,\" Manu Hoyer from the initiative said. Tesla did not immediately respond. The company's roughly 300-hectare facility is located to the southwest of the community, near a highway junction to the A10 autobahn. To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video The state of Brandenburg's Economy Minister Jörg Steinbach argued soon after the results were published that local authorities and the US electric carmaking giant should try to approach the result as an opportunity to fine-tune the plans. \"It shows that the scales tip considerably towards people's concerns and fears,\" Steinbach told German news agency DPA. \"Now it is important to find answers to the open questions. I see the result of this vote also as a motivation for the local authorities and for Tesla, to find conceptual solutions in the coming weeks and months for those concerns not yet assuaged.\" The Grünheide Tesla facility started production in 2022, later than originally scheduled. The company describes it as its first production base in Europe and \"our most modern, sustainable and efficient factory.\" msh/wmr (dpa, Reuters) While you're here: Every Tuesday, DW editors round up what is happening in German politics and society. You can sign up here for the weekly email newsletter Berlin Briefing. "
}