{
    "title": "Is Elon Musk a threat to Delaware's core business?",
    "date": "2/9/2024",
    "url": "https://san.com/cc/is-elon-musk-a-threat-to-delawares-core-business/",
    "text": "× Unbiased. Straight Facts.™ Close Menu Simone Del Rosario Business Correspondent Feb 9 By Simone Del Rosario (Business Correspondent), Brent Jabbour (Producer), Emma Stoltzfus (Editor), Heath Cary (Senior Motion Graphics Designer) After a Delaware judge struck down Elon Musk’s $56 billion Tesla compensation package, Musk put the state in his crosshairs with a series of posts encouraging companies to flee America’s corporate kingdom, as he hopes to do with Tesla. Given Musk’s influence, are his actions a real threat to Delaware? Download the SAN app today to stay up-to-date with Unbiased. Straight Facts™. Point phone camera here Around 2 million companies are incorporated in Delaware, including 68% of Fortune 500 companies. Incorporated businesses outnumber people in Delaware by a ratio of 2-to-1. “The business of this state is corporate regulation; a good chunk of our tax revenue comes from that. It’s in the state’s interest to get the answer right,” said Charles Elson, a leading authority on corporate governance and founding director of the Weinberg Center for Corporate Governance at the University of Delaware. The big reason so many companies choose to incorporate in Delaware is the Court of Chancery, Musk’s latest target. Never incorporate your company in the state of Delaware Elson said Chancellor Kathaleen McCormick’s decision to void Musk’s CEO pay package is unusual and surprising but not unfounded. “The judge’s concern was that the disclosure to the shareholders about this package was inadequate, that there are serious flaws she felt in the process, the independence of the directors, how the thing came together,” Elson said. “And she felt that had disclosure been more accurate, the shareholders may not have approved it.” In 2018, 73% of shareholders approved the CEO’s pay package, excluding votes by Musk and his family. After hitting set targets in the coming years, the deal’s value hit around $56 billion, which McCormick called “an unfathomable sum.” That’s roughly the market cap of all of Tesla back when shareholders first approved the compensation plan. Tesla’s market cap is now more than 10 times that. “Is it really, quote-unquote, a transfer of funds for services rendered? Or is it more of a gift?” Elson said. “The larger the amount becomes, the more questionable the compensation for services rendered becomes.” McCormick cited Musk’s extensive ties to members of Tesla’s board of directors in her decision, questioning the board’s independence. Then, the Wall Street Journal published an exposé on the money and drugs that tie Musk to some directors. Musk hit back at the newspaper, calling them liars and trash not fit to line a birdcage. He noted that he has passed every random drug test in the past three years as part of an agreement between NASA and SpaceX. After that one puff with Rogan, I agreed, at NASA’s request, to do 3 years of random drug testing.Not even trace quantities were found of any drugs or alcohol. @WSJ is not fit to line a parrot cage for bird 💩 Since his court defeat, Musk has not only vowed to incorporate Tesla in Texas with shareholder approval but has strongly encouraged other companies to leave Delaware as well. With 172 million followers on his platform X, it is realistic to question whether his influence will impact Delaware’s status as the country’s corporate paradise. “I think whether you win or lose in Delaware, you do get a fair shake,” Elson said. “[Musk] didn’t seem too upset with Delaware when he won the Solar City case a few years ago.” Learn more about our emails. Unsubscribe anytime. By entering your email, you agree to the Terms & Conditions and acknowledge the Privacy Policy. “The fundamental advantage is this judicial system and this body of very well-developed corporate law,” Elson said. The Delaware Court of Chancery dates back to 1792 but didn’t hit its corporate stride until more than a century later. In 1899, Delaware copied favorable business laws from New Jersey, which at the time was the country’s de facto corporate home. In 1913, future President Woodrow Wilson, then New Jersey’s governor, passed a series of laws perceived to be anti-business. In response, corporations fled across the river to Delaware, where they remain today. “North Dakota has a corporate statute that some say is more shareholder-friendly than Delaware; Nevada has a corporate statute that some say is a little more managerial-friendly than Delaware,” Elson explained. “But you still haven’t seen a flocking of companies to those jurisdictions because a statute can’t lay out every rule and regulation for corporate conduct. It has to really be interpreted by judges through a common law process.” In Delaware and its dedicated business court system lies a large body of precedent developed over many years, Elson said. “There are not that many situations here that haven’t come up before,” he added. But now Delaware is coming up against a CEO who happens to be one of the richest people in the world (Musk dropped to No. 2 on Forbes’ Billionaires List after his compensation package was voided). Now, Musk is looking to Texas for a fresh start. “I think it would be rather insulting to Texas judges to suggest that they would have done something differently had they found the same facts. You can’t go forum shopping, if you will, for a friendly judge, or if you do, it’s not the right thing to do,” Elson said. Musk eyeing Texas comes at an interesting time. Last year, Texas Gov. Greg Abbott signed a law to create specialty business courts to rival Delaware. But those courts won’t be in session until September 2024 at the earliest. Related Stories News clip: Some breaking news into us tonight, a Delaware judge voiding the Tesla CEO’s $56 billion dollar pay package. News clip: Elon Musk is saying that he’ll be moving Tesla’s incorporation to Texas after holding a poll on X. Simone Del Rosario: America’s richest CEO versus America’s corporate kingdom. Is Elon Musk a threat to Delaware? Charles Elson: He didn’t seem too upset with Delaware when he won the Solar City case a few years ago. Simone Del Rosario: Charles Elson is a leading authority on corporate governance, a lawyer and retired professor from University of Delaware. Elson said the recent decision by a Delaware judge to strike down Musk’s larger-than-life compensation package – Charles Elson: It’s more than the GNP of some countries. Simone Del Rosario: – is unusual but not unfounded. Charles Elson: The judge’s concern was that the disclosure to the shareholders about this package was inadequate, that there are serious flaws she felt in the process, the independence of the directors, how the thing came together. And she felt that obviously, had disclosure been more accurate, that the shareholders may not have approved it. Simone Del Rosario: In 2018, 73% of shareholders approved the CEO’s pay package, excluding votes by Musk and his family. After hitting set targets in the coming years, the deal’s value hit around $56 billion, which Delaware judge Kathaleen McCormick called “an unfathomable sum.” That’s roughly the market cap of all of Tesla back when shareholders first approved the compensation plan. Tesla’s market cap is now more than 10 times that. Charles Elson: Is it really, quote unquote, a transfer of funds for services rendered? Or is it more of a gift? And, you know, the larger the amount becomes, the more questionable the compensation for services rendered becomes. Simone Del Rosario: Musk’s relationship with the board is also in question. Not only did the judge find it to be a little too cozy, the Wall Street Journal then published an exposé on the money and drugs that tie Musk to some Tesla directors. Musk hit back at the newspaper, calling them liars, trash, not fit to line a birdcage. Noting he’s passed every random drug test the past three years. But this is Elon Musk. He runs multiple companies and he can manage multiple fights at the same time. And his fight with the state of Delaware is what we’ll focus on today, and whether the advice he’s giving and taking from his 171  million X followers will make an impact on the business of Delaware. Charles Elson: The business of this state is corporate regulation, a good chunk of our tax revenue comes from that. And the state, it’s in the state’s interest to get the answer right. I think whether you win or lose in Delaware, you do get a fair shake. Simone Del Rosario: Around 2 million businesses are incorporated in Delaware, including 68% of Fortune 500 companies. Yes, Delaware, where companies literally outnumber people 2-1. Wayne’s World clip: Hi, I’m in Delaware. Simone Del Rosario: And the big reason so many companies choose to incorporate in Delaware is the Court of Chancery, Musk’s latest target. Charles Elson: The fundamental advantage is really this judicial system, and this body of very well developed corporate law. Simone Del Rosario: The Delaware Court of Chancery dates back to 1792 but didn’t hit its corporate stride until more than a century later. In 1899, Delaware copied favorable business laws from New Jersey, which at the time was the country’s corporate paradise. In 1913, future President Woodrow Wilson, then New Jersey’s governor, passed a series of laws perceived to be anti-business. And corporations fled across the river to Delaware, where they remain today. Charles Elson: North Dakota has a corporate statute that some say is more shareholder friendly than Delaware, Nevada has a corporate statute that some say is a little more managerial friendly than Delaware. But you still haven’t seen a flocking of companies to those jurisdictions because a statute can’t lay out every rule and regulation for corporate conduct, it has to really be interpreted by judges through a common law process. Simone Del Rosario: Delaware , he says, has the expertise and the experience. Charles Elson: You have a large body of precedent that was developed over many years there not that many situations here that haven’t come up before. Simone Del Rosario: But now Delaware is coming up against a brash CEO who happens to be one of the richest people in the world. The ruling against Musk inspired the CEO’s desire to pull up stakes and incorporate in Texas, where Tesla is headquartered. The move requires a shareholder vote. And he’s also inspired his followers to follow suit, or at least say they will. Charles Elson: I think it would be rather insulting to Texas judges to suggest that they would have done something differently had they found the same facts. You can’t go forum shopping, if you will, for a friendly judge, or if you do, it’s not the right thing to do. Simone Del Rosario: Musk eyeing Texas comes at an interesting time. Last year, Texas Governor Greg Abbott signed a law to create specialty business courts to rival Delaware. But those courts won’t be in session until September 2024, at the earliest. Underreported stories from each side 16 sources | 13% from the left Getty Images 8 sources | 13% from the right Reuters Unbiased news. Directly to  your inbox. Free! Watch\n\t\t\t\t\t\t\t\t\t1:50 19 hrs ago Watch\n\t\t\t\t\t\t\t\t\t1:57 19 hrs ago Watch\n\t\t\t\t\t\t\t\t\t2:15 19 hrs ago Watch\n\t\t\t\t\t\t\t\t\t1:47 21 hrs ago 22 hrs ago Reuters 19 hrs ago Reuters 19 hrs ago AP Images 19 hrs ago Getty Images By entering your email, you agree to the Terms & Conditions and acknowledge the Privacy Policy. Certified Balanced Award by AllSides | Balanced Bias Rating by Ad Fontes Media Terms and Conditions | Privacy Policy | Copyright Policy | Cookie Settings © 2024 Straight Arrow News, LLC By entering your email, you agree to the Terms & Conditions and acknowledge the\n\t\t\t\tPrivacy Policy. Learn more about our emails. Unsubscribe anytime. By entering your email, you agree to the Terms & Conditions and acknowledge the\n\t\t\t\t\tPrivacy Policy. "
}