{
    "title": "Apple And Tesla On The Chopping Block?",
    "date": "2/26/2024",
    "url": "https://seekingalpha.com/article/4673431-apple-and-tesla-on-the-chopping-block",
    "text": "Two of the \"Magnificent Seven\" have rapidly slowing growth, which has us wondering \"Should Apple and Tesla be on the chopping block?\" baiajaku/iStock via Getty Images Two of the \"Magnificent Seven\" have rapidly slowing growth, which has us wondering \"Should Apple and Tesla be on the chopping block?\" baiajaku/iStock via Getty Images Brian Dress, CFA -- Director of Research, Investment Advisor. With the recent action and developments over the past few months, there is one conclusion that we can definitively state – U.S. stocks are in a bull market. There are any number of technical definitions of the term “bull market” and we will leave a link here if you are interested in the Wall Street definition of the term. But for our part, here at Left Brain, we look at a bull market as a time when stocks generally move higher and when stocks predictably move higher in reaction to positive news, whether it be company-specific or more macroeconomically-oriented. This current earnings season, which is quickly reaching its conclusion, has given us a great deal of evidence that, markets have reached a bullish condition. Between 2021-2023, many businesses delivered strong earnings, but it was never easily predictable how their stock prices would react to positive earnings releases. That is more indicative of a bear market. Though things did improve later in 2023 in this regard, the stock price reactions we have seen coming out of the most recent earnings season have been more predictable. In fact, we have seen a great number of very large stock moves higher in response to companies report earnings that beat expectations. Examples of this phenomenon this quarter include many of the market’s leading growth stocks: Meta Platforms (META), Netflix (NFLX), Uber Technologies (UBER), Chipotle Mexican Grill (CMG), just to name a few of the many companies that have delivered. What’s interesting is seeing stock price moves of 10%+ in very large cap companies, suggesting fresh buyers coming in and stock price analyst estimates that had been far too low in comparison to the fundamental improvements taking place at the individual company level. This week we saw similar moves out of other giants including Block (SQ) and Walmart (WMT), but most notable was the more than 15% 1-day gain from the world leader in Artificial Intelligence (\"AI\"), Nvidia (NVDA). NVDA is a company that we have praised profusely in this space over the last few years, particularly due to the grand vision of CEO Jensen Huang, the highest rated CEO in our 2019 CEO profiles series. NVDA’s Wednesday earnings report after market close was one of the mostly hotly anticipated releases in recent memory and the company delivered well beyond most analysts’ projections. For the 4th quarter of fiscal year 2024 (last year for NVDA), the company reported $22.1 billion in revenue, well in excess of the $20.5 billion predicted by Wall Street analysts and representing a 265% (!) year-over-year growth number. Nvidia’s data center business had revenues of $18.4 billion last quarter, which was a more than 400% increase from the prior-year quarter. Analysts’ lofty expectations over the last year have been unable to keep up with the realities of the AI explosion spearheaded by Nvidia’s Hopper GPU computing platform. Said CFO Colette Kress: “The world has reached the tipping point of new computing era. The $1 trillion installed base of data center infrastructure is rapidly transitioning from general purpose to accelerated computing.” In response to this better-than-expected earnings release, NVDA stock increased in value by more than 16% in Thursday’s trading session. This is the type of remarkable price action that we think is the hallmark of an emerging bull market. Though the NASDAQ Composite index has gained nearly 30% in value since its most recent low in late October, we think there is still plenty of space for stocks to gain in value. Companies involved in AI, cybersecurity, digital transformation, software, and a number of other key sectors continue to grow revenues and profits at a rapid pace. We would note also that the market’s upside performance has accelerated over the past month, despite the fact that interest rates have started creeping back higher. What we are witnessing in this market rally is a fundamental phenomenon, rather than driven by hopes and expectations that the Federal Reserve is likely to announce numerous interest rate cuts in the coming year. Not every large company has fared quite as well as META, NFLX, NVDA, and the like. We have seen two of the “Magnificent Seven” struggle coming out of their earnings releases this quarter, Apple Inc. (AAPL) and Tesla, Inc. (TSLA). The death knell for growth stocks is deceleration in revenue growth and that is in evidence for these two behemoths, based on their most recent results and in their business trends over the last two years. In today’s letter, we are putting the spotlight on these two businesses and bringing you into our thought process on why they may deserve to be on the chopping block for investors’ portfolios. In doing so, we will use these two examples to show you why we are such devotees to active management in our investment approach (in contrast to passive index investing). We will devote our entire letter this month to this topic, so no “Income Security of the Month” for February, but we did want to point out that interest rates have been creeping higher in recent weeks, so investors still holding cash that needs a home with a higher yield are in luck. Bankrate.com, Yahoo! Finance, NerdWallet.com, AnnuityAdvantage.com Bankrate.com, Yahoo! Finance, NerdWallet.com, AnnuityAdvantage.com As we put together the chart of various fixed-income security yields in the box here, we noticed that most of the listed interest rates ticked up anywhere between 0.05-0.3% over the last month. We still think now is the right time for investors to move cash into higher-yielding instruments and that interest rates will eventually begin falling in earnest. We think if you have cash still sitting in a no or low-yield checking account, you really ought to consider moving to one of these instruments or possibly into a stock market vehicle if you are more tolerant of volatility. Of course, everyone’s circumstances are different, so speak with a financial professional before making a move. With that all being said, let’s get into it! Those who follow us here at Left Brain will know that we are staunch evangelists for active investing: in other words, active and deliberative stock and bond selection. We think that active management, done right, has a wonderful opportunity to deliver value to an investor over time. The major caveat to that statement, of course, is “done right.” Selecting individual stocks is relatively costly, requiring an idea generation method built on a diligent research process. Put simply, it’s not for everybody. I’m sure there are many investors that have tried picking stocks on their own over the years in just a couple hours of work per week and have struggled to achieve strong performance. That is not an argument against active management, it’s an argument against hobbyist active management. The more pertinent and topical argument for passive management in recent years is that it works (well enough)! Over the last 15 years (since February 2009), the S&P 500 (SP500) has generated an average annual total return of just over 16%. And we understand – who can argue with success? A well-selected basket of stocks has the potential for eclipsing the returns of the broader market but, yes, also carries the risk of underperforming. For busy professionals with families and lives outside the business world, we can forgive investors for taking what appears to be the easy and cheapest route. However, we want to introduce you to what we think is a major vulnerability to index investing – concentration risk. Over the past decade, we have seen a self-fulfilling cycle take place: more investors are allocating money on a monthly basis to index funds, who, in turn, continue buying the largest cap stocks in ever-bigger proportions, leading to increased concentration over time. Take a look at the comparison of the largest 10 stocks in the S&P 500 compared from September 2020 to August 2023: Coinspeaker.com, Investopedia Coinspeaker.com, Investopedia (Please pardon me for less than stellar Microsoft Word skills in building this table!) What we can see here is that the index is becoming ever more top-heavy over time, with the top two stocks now comprising just under 14% of an investors’ portfolio if she owns just the S&P 500 in her portfolio. This is up from less than 12% in no more than 3 years! You can also see as you move down the chart that most of the corresponding rows (#3, #4, etc.) are larger than they were three years ago. Well, Brian, you may ask, “These are the strongest companies in the world, why should I worry?” That stance is understandable, as we look back to past results from Apple, Microsoft, Amazon, and the like, they continue to grow. There are two problems with this. First, the top 10 companies list changes dramatically over time. One only has to look back to 2012 to see when Exxon Mobil (XOM) was the world’s largest company and now is nowhere to be found in the top 10. But second, and more importantly, what happens to your portfolio when some of your largest positions start to be a drag? That second question we will now cover in more depth. Even if you are an active investor, odds are you own one or both of the following stocks, so stay tuned. We all know Apple (AAPL) and most of us are using one or more of their devices right now. I’m writing this week’s letter on an iMac. Apple shares have made so many millionaires worldwide that it is literally dizzying to consider the impact of this stock over the last two decades on portfolios around the world. But something is amiss at Apple and that is very worrying, considering the huge AAPL positions that many investors carry on their books. We love growth stocks but there is one thing that can be kryptonite for growth stocks – slowing growth. Take a look at the annual revenue growth numbers out of Apple over the past 8 years: Apple Annual Sales Growth by Fiscal Year ((Source: FactSet financial data and analytics)) Apple Annual Sales Growth by Fiscal Year ((Source: FactSet financial data and analytics)) On a raw sales basis, you can see that Apple’s yearly revenues haven’t even doubled in that 8-year time frame: Apple Annual Sales by Fiscal Year ( (Source: FactSet financial data and analytics)) Apple Annual Sales by Fiscal Year ( (Source: FactSet financial data and analytics)) This stands in stark contrast to the growth in Apple’s stock price, which has risen by more than 600% in the corresponding period. Granted, Apple once traded at a low price/earnings multiple (13.56 in September 2016) and a relatively low price/sales multiple (2.89 in September 2016) compared to now (29.96 and 7.78, respectively, at the end of December 2023). What has happened to Apple’s stock price over the last 8 years has been, in large part, due to multiple expansion, rather than due to sales or earnings growth. We find it curious that the stock would trade at a dramatically higher multiple, just as its growth rate has stalled over the same period. The contrast is even more stark when we look at 2023 performance. As the company had negative sales growth, the stock price increased by more than 40%! Something isn’t adding up here or, as the kids say these days, the “math isn’t mathing.” We think that the ever more intense move toward passive investing has something to do with this phenomenon, but we can only hazard a guess. With stalling sales growth in evidence, we find ourselves asking a simple question, “Given current business conditions, how does Apple double its market cap from its current level of $2.8 trillion to an eventual capitalization of $5.6 trillion?” We know that Apple is working in the Virtual Reality space, recently releasing the Vision Pro early in 2024. But what else is on the horizon? Granted, Apple likely trades on a higher multiple than before, due to more predictable revenue in the form of recurring services sales. However, iPhone sales constitute more than half of the company’s revenues and showed a negative growth rate of -2.4% in fiscal year 2023. The Services business was the only avenue of growth in the most recent year, showing an increase of 9.1% year-over-year. All of this is to say that, as holders of Apple shares, we are starting to question whether this belongs in portfolios, specifically for growth investors. We know that many investors sit on huge capital gains in this stock, complicating the decision in taxable brokerage accounts especially. With so many compelling growth stories in evidence, from AI to cybersecurity to FinTech to weight loss drugs (and many more), we think it may be time to consider other uses of investment capital. Herein lies the advantage of active portfolio management. If you are a passive indexer, you have no choice but to hold a large proportion of your investment capital in a stock like this. On the other hand, if you (or your investment professional) manage your portfolio actively, you at least have a chance to consider a new path. There is one more stock in the “Magnificent Seven” that has us worried – Tesla (TSLA). Since this is a smaller proportion of the S&P 500, this is less of a concern for passive investors than is AAPL, in our view, but this is another stock we know that is heavily owned. Tesla is interesting for many reasons, not the least of which is its CEO Elon Musk, who can’t help but make news (good and bad) on almost a daily basis. When we speak to investors about our thoughts on Tesla, we are often asked if our concern comes from his behavior on X (formerly Twitter) and the answer surprisingly is no, in this case. Rather, the problem in evidence here is rapidly slowing growth (and lower profitability). This case is slightly different than that of Apple, which is in chronic growth deceleration. Rather, growth has deteriorated quickly at Tesla, as we can see in the quarterly growth rates over the past two years: Tesla Sales Growth by Quarter ((Source: FactSet financial data and analytics)) Tesla Sales Growth by Quarter ((Source: FactSet financial data and analytics)) As we can see, Tesla sales were well over 20% for most of the last two years and often in excess of 40%. The fact that the last two quarters have seen single digit growth is quite troubling for investors. And that is reflected in the stock price, which fell more than 15% in the week following the earnings report on January 24. Higher interest rates are impacting Tesla’s sales negatively, according to the most recent earnings report. In conjunction with that issue, the average selling price of vehicles in the most recent quarter was significantly lower than in previous periods, reflecting a slowing demand environment. In fact, one anecdotal story is quite concerning for Tesla: citing the high cost of maintenance for its electric vehicle fleet (including Teslas), rental car giant Hertz just sold 20,000 of its electric vehicles, opting to replace them with gas-powered models. Said Musk on the earnings call, “Tesla is currently between two major growth waves. We're focused on making sure that our next growth wave, driven by the next-gen vehicle, energy storage, full self-driving, other projects, is executed as well as possible.” This is exactly the type of tone that chases growth investors from a hypergrowth stock like Tesla. Now we see a situation where the company will have to prove to investors that it is able to reaccelerate growth either through a new product line or an increase in demand for its products. Given that there is already a certain level of saturation of the marketplace (i.e., many of the consumers who have interest in EVs already have bought them, and those who haven’t are reluctant to do so), Tesla faces an uphill battle in the near to medium-term to turn things around. Further, profitability is under threat at Tesla. Gross margins (on a trailing 12-month basis) have fallen six straight quarters, from 27.1% in June 2022 to 18.25% in December of 2023. In many ways, Tesla is facing a similar problem that META did in 2022: they have been devoting a lot of capital to AI projects and next generation vehicles, to the detriment of the company’s overall profitability. Whether those capital expenditures will ultimately bear fruit is uncertain. What is certain, again, is that there are many areas of the market where there is less uncertainty and we would rather focus there rather than on a broken growth story like Tesla. I will close this section by saying we wouldn’t bet against Elon Musk and his ability to eventually right the ship: he’s done it before. We see things clearly now in the beginning of 2024: it appears that the U.S. stock market has turned bullish, driven specifically by the AI revolution. Early indications suggest that this explosion of innovation, still in its infancy, could be more dramatic even than the beginning of the Internet in the mid-1990s. What’s really exciting is that the companies driving things, like Nvidia, have strong revenues, cash flows, and even net profits, which stands in stark contrast to the boom nearly 30 years ago. At the same time, we think now is the right moment to take full stock of portfolios. Specifically, we think that as active portfolio managers, there are two major stocks that are in many portfolios that deserve consideration, as slowing growth is the kryptonite for growth stocks. As we see deceleration in those two stocks – AAPL and TSLA – we think holders of these shares would be smart to take a closer look at what they hold. Again, the advantage of active management is the ability to make moves like this. Passive indexers don’t have the same flexibility. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of NVDA, AAPL, TSLA, NFLX, UBER, SQ, CMG either through stock ownership, options, or other derivatives.   I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.DISCLAIMER: This report contains views and opinions which, by their very nature, are subject to uncertainty and involve inherent risks. Predictions or forecasts, described or implied, may prove to be wrong and are subject to change without notice. All expressions of opinion included herein are subject to change without notice. Predictions or forecasts described or implied are forward-looking statements based on certain assumptions which may prove to be wrong and/or other events which were not taken into account may occur. Any predictions, forecasts, outlooks, opinions, or assumptions should not be construed to be indicative of the actual events which will occur. Investing involves risk, including the possible loss of principal. The opinions and data in this report have been obtained from sources believed to be reliable; neither Left Brain nor its affiliates warrant the accuracy or completeness of such and accept no liability for any direct or consequential losses arising from its use. In addition, please note that Left Brain, including its principals, employees, agents, affiliates, and advisory clients, may have positions in one or more of the securities discussed in this communication. Please note that Left Brain, including its principals, employees, agents, affiliates, and advisory clients may take positions or effect transactions contrary to the views expressed in this communication based upon individual or firm circumstances. Any decision to effect transactions in the securities discussed within this communication should be balanced against the potential conflict of interest that Left Brain, its principals, employees, agents, affiliates, and advisory clients has by virtue of its investment in one or more of these securities.\n\nPast performance is not indicative of future performance. The price of securities can and will fluctuate, and any individual security may become worthless. A high or favorable rating, rating outlook, gauge, or similar opinion is not indicative of future performance, and no user should rely on any such rating, rating outlook, gauge, or similar opinion to predict performance or potential for return. Future performance may not equal projected or forecasted performance or potential for return. All ratings and related analysis, as well as data, statistics, analysis, and opinions contained herein are solely statements of opinion and are not statements of fact or recommendations to purchase, hold, or sell any security or make any other investment decisions.\n\nThis report may contain “forward-looking” information that is not purely historical in nature. Such information may include, among other things, projections, and forecasts. There is no guarantee that any forecasts made will materialize. Reliance upon information herein is at the sole discretion of the reader.\n\nTHE REPORT IS PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS WITHOUT REPRESENTATION OR WARRANTY OF ANY KIND. Left brain Wealth Management DISCLAIMS ALL EXPRESS AND IMPLIED WARRANTIES WITH RESPECT TO THE REPORT, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF ACCURACY, TIMELINESS, COMPLETENESS, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE.\n\nThe Report is current only as of the date set forth herein. Left Brain Wealth Management has no obligation to update the Report, or any material or content set forth herein. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}