{
    "title": "Tesla opens the gigafactory in Nevada to the Chinese company Catl",
    "date": "3/25/2024",
    "url": "https://www.breakinglatest.news/business/tesla-opens-the-gigafactory-in-nevada-to-the-chinese-company-catl/",
    "text": " Listen to the audio version of the article The world‘s leading manufacturer of automotive batteries, the Chinese giant Catl (acronym for Contemporary Amperex Technology Company), has confirmed that it is supplying machinery to Tesla’s Gigafactory 1 in the United States. New electrochemical solutions are being studied, which allow faster charging times. The car company led by Elon Musk (returning from a disastrous first quarter on the financial markets: -30%) is trying to contain the aggressiveness of its Chinese competitor BYD, which overtook it in the last quarter of last year and is launching a very harsh offensive on prices in China. Tesla is working on the launch of a model that costs less than 25 thousand dollars, intended for the mass market. Right at the plant in Reno, Nevada, Tesla plans to expand production. “There is always room for cost reduction, as long as the objective of the $25,000 car is clear,” declared yesterday Robin Zeng, 56, the billionaire president of the battery manufacturer – which at the end of 2023 held 37 % of market share ahead of BYD (16%) – in an interview with Bloomberg News in Hong Kong. “If it comes to robotaxis, we don’t have to worry about reducing costs per cell, since our batteries have a longer life cycle and therefore their average cost is actually lower.” Catl, whose market value has grown by 18% in this early part of 2024, can operate in the United States thanks to a model based on licensing and royalties. Thanks to this model, in fact, the Chinese hope to circumvent the barrier of the Inflation Reduction Act (IRA), the law approved in August 2022 to guarantee hundreds of billions of dollars in funding for the energy transition. As much as 370 billion just to ensure that the production and supply chain of electric vehicles is North American. So much so that subsidies of up to $7,500 per vehicle for the purchase of battery-powered cars cannot be granted to models whose batteries do not contain at least 60% of components (produced in North America) and critical minerals extracted or recycled in countries with free trade agreements. The percentage will rise to 100% from 2029. In February 2023, Ford concluded an agreement to license Catl technology. The aim is to produce batteries in a plant in Marshall, Michigan, owned by the Blue Oval. But in November the Dearborn manufacturer was harshly attacked by local representatives of the Republican Party, according to whom Catl is an arm of the government and the Communist Party , putting US interests at risk. The plant is expected to start production by the end of 2026. But the planned capacity, in times of bitter geopolitical tensions, has been almost halved and the employees to be hired have been reduced to 1,700 against the 2,500 of the project. The Ningde giant, however, continues ahead and plans to train Ford engineers in Fujian, China, or in Germany, where it has already launched its first European 14 GWh gigafactory. The second, in Hungary, will also be the most powerful on the continent (60 GWh) and will begin operations at the beginning of 2027. Catl, in fact, is acting across the board: it is in negotiations with numerous other car manufacturers, including in Europe. With Stellantis he opened discussions in November for the fourth continental gigafactory of the group born three years ago from PSA and FCA.     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}