{
    "title": "What’s behind Tesla’s stock rally? A short test drive.",
    "date": "3/26/2024",
    "url": "https://www.marketwatch.com/story/whats-behind-teslas-stock-rally-a-short-test-drive-77ca1e52",
    "text": "Tesla Inc. shares jumped 3% on Tuesday on hopes that a new sales tactic would appease regulators probing the EV maker’s driver-assistance system. Chief Executive Elon Musk has directed employees to take customers on a “short test ride” to familiarize the new Tesla \n        TSLA,\n        -2.25%\n       owners with Full Self Driving (FSD), Tesla’s suite of advanced driver-assistance systems (ADAS) for city driving. Tesla is also giving FSD for free for a month. That will slow down Tesla deliveries, but it’s a “hard requirement,” Musk said in a memo to employees leaked earlier this week. That free FSD trial is “an opportunity to sell more FSD software subscriptions, which we think is an extremely high-margin revenue stream and should raise consumer awareness of the proprietary offering and help distinguish Tesla from other brands,” CFRA analyst Garrett Nelson said. And, perhaps more importantly, the mandatory test drive “should help appease the concerns of regulators amid an ongoing NHTSA investigation into the technology.” Numerous probes from U.S. regulators and lawsuits revolve around FSD and Autopilot, Tesla’s ADAS for highway driving. Tesla charges $6,000 for what it calls “Enhanced  Autopilot,” and $12,000 for FSD. Tesla is expected to report its first-quarter deliveries, its proxy for sales, in early April. FactSet consensus calls for the sale of 471,000 EVs, which would compare with 423,000 EVs delivered in the first quarter of 2023. Other news helping Tesla stock on Tuesday include the disclosure that high-profile investor Cathie Wood’s Ark Invest funds bought more Tesla shares on Monday. Tesla has been a favorite investment for Wood for months. Tesla shares are up nearly 4% over the past week, though the stock has posted a 28% decline so far this year, which contrasts with gains of about 9% for the S&P 500 index \n        SPX\n       in the same period. In the past 12 months, Tesla stock is down nearly 6%, versus a 32% advance for the S&P 500. Trading in General Electric’s power-generation spinoff began this week. The spinoff itself takes place on April 2. So far, trading has hewed pretty close to Wall Street estimates. Claudia Assis is a San Francisco-based reporter for MarketWatch. Follow her on Twitter @ClaudiaAssisMW. Visit a quote page and your recently viewed tickers will be displayed here. "
}