{
    "title": "How to get hired at Tesla: interview process, tips",
    "date": "3/5/2024",
    "url": "https://www.businessinsider.com/how-to-get-hired-at-tesla-job-interview-process",
    "text": "       Millions of people are lining up to work for Tesla. The electric carmaker said it received more than 3.6 million applications in 2022. But engineers at Tesla say it's no small feat to land a role at Elon Musk's most well-known company. Tesla's hiring process for engineers can require as many as 9 interviews, a series of tests, and in some cases, a letter to Musk himself. Business Insider spoke with 10 current Tesla engineers about what it takes to work at the company. The employees spoke under the condition of anonymity to protect their employment, but their identities and roles at Tesla have been verified by BI. Several engineers said it took multiple attempts to land a role at the company, and the process could be laborious. Typically, applicants must start from the beginning of the process when applying for a new role externally. From start to finish, it can take up to six months to receive an offer letter. Tesla typically responds to a successful application by setting up an interview with a recruiter or a human-resources employee. Tesla engineers said they secured an initial interview by either sending their résumé into an application on Tesla's careers page, chatting with a Tesla representative at a networking event, or having a colleague pass along their résumé through the company's internal recommendation system. \"Sometimes it really is who you know at Tesla,\" one engineer who has worked at the company for six years said. \"It helps to go to a feeder college where a classmate can help recommend you for a role.\" Recruiters often sift through thousands of applications, giving interviews to a maximum of only 20 or so applicants, according to four engineers who've been involved in the hiring process. Only about half of those candidates would make it to the next step, they said. After the initial culture-fit interview — which includes traditional questions about why people want to work at Tesla and how they jibe with others — candidates who progress typically chat separately with a manager and at least one engineer from their prospective team. These interviews are more technical and sometimes include a take-home or live test. Related stories \"Tesla takes a no-bullshit approach,\" one engineer told BI. \"At other companies, you can sometimes get away with saying something to sound impressive. You can't do that at Tesla. If you don't know something, own up to it because they will always ask the follow-up questions.\" The next step in Tesla's hiring process includes a presentation and a series of rapid-fire interviews that can take anywhere from four to six hours. Applicants are typically told to present on a previous project for 15 to 30 minutes, followed by a Q&A session on the project. Tesla workers said it was best for early-career applicants to present on college group projects or personal ventures. Four to six engineers sit in on the presentation and later break off to interview the candidate on their own for about 30 minutes each. \"We try to leave it pretty open-ended because it's a good way to find red flags,\" an engineer who has been involved in the recruiting process said regarding the presentation prompt. \"We tell them not to present something confidential, and that's the biggest red flag if they present something like that. It's an easy no if we know they won't be trustworthy.\" Some Tesla engineers said they spent more than 40 hours preparing for the presentation over the course of several weeks. The panel can take place over Zoom or in person. It also includes a short break in the middle of the session to give panelists time to take lunch. \"You need to make sure you know the technical details of your project inside and out,\" one engineer said. \"It doesn't have to be the most complicated tech so long as you can talk about what you've done in great detail. You need to be able to tell them why you approached it the way you did and address other ways of accomplishing it as well.\" One engineer with knowledge of the process said that after the panel, the employees would meet to give a \"blind vote\" on the candidate, meaning the panelists all submit their scores at once. Candidates are scored on a scale of one to four. The engineer said that if a single panel member were to give the candidate a score of one and could back up their opinion, the individual's application would usually be rejected, while a score of a three or a four would be viewed as a sign of approval for the prospective hire. Two engineers said only about half the applicants who made it to the panel stage would be selected. Depending on the role, some applicants are offered the job after a successful panel interview. For higher-level positions, the candidates can go on to interview with director or VP-level employees. Three workers said some applicants were required to fill out a form that would be sent to a VP or director-level worker outlining three reasons they would be a good fit for Tesla. Some of the notes would even be passed onto Musk, the engineers said. Last year, the Tesla CEO said in an email to staff that he must approve all new hires. From start to finish, the entire process could take anywhere from one to six months, the engineers said. Seven engineers said Tesla had the most intensive application process they'd seen in the industry. \"Half the time, we miss out because we're too slow,\" an engineer with knowledge of the hiring process said. \"We know it, but it's set up in some ways to find the people who are so gung-ho they're willing to wait. They're people who'd probably get a higher base pay at a different company, but they have the opportunity to cash in on Tesla stock too.\" A Tesla spokesperson didn't respond to a request for comment. Do you work for Tesla or have insight to share? Reach out to the reporter from a non-work email and device at gkay@insider.com Read next Jump to "
}