{
    "title": "Tesla’s stock pressure builds as report suggests continued China demand woes",
    "date": "3/23/2024",
    "url": "https://www.marketwatch.com/story/teslas-stock-pressure-builds-as-report-suggests-continued-china-demand-woes-4692e532",
    "text": "The latest sign of demand issues for Tesla Inc? A reported production cutback in China. The company told workers at its Shanghai plant to reduce production of the Model 3 and Model Y cars, according to a Bloomberg News report from early Friday. Tesla shares \n        TSLA,\n        -2.25%\n       were off more than 3% in morning trading Friday. The company did not return a request for comment. Tesla has been dealing with a host of challenges lately, including stiffer competition globally and a cooling of electric-vehicle demand. Tesla has cut prices at various points in the past year in an attempt to stimulate demand. There have been downbeat signals from other players in the China EV market as well, with Li Auto Inc. \n        LI,\n        +0.33%\ncutting its first-quarter delivery forecast earlier this week. While most other members of the Magnificent Seven have gotten off to strong starts this year, Tesla has seen its stock falter. The shares were down 32% on a year-to-date basis through Thursday’s close, making them the worst performer in the S&P 500 so far in 2024. UBS analyst Joseph Spak noted earlier this month that Tesla’s forthcoming Model 2 could help it reaccelerate unit growth, but it would be a “late” arrival to the China market. In the meantime, the company faces “intense competition in China,” he said in a note to clients. The company generated $21.75 billion in revenue from China during 2023, making up 22.5% of its total. Investors will get an update on the state of Tesla’s business in early April, when the company typically provides its delivery and production numbers for the first quarter. Copper is an essential component for power infrastructure upgrades. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}