{
    "title": "Forget About the \"Magnificent Seven.\" Here's One Stock to Consider in 2024.",
    "date": "3/13/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA-Q/pressreleases/24760387/forget-about-the-magnificent-seven-heres-one-stock-to-consider-in-2024/",
    "text": "The \"Magnificent Seven\" is a group of tech stocks that delivered solid returns in 2023, propelling the S&P 500 index to greater heights. But just because these giants outperformed in 2023 does not guarantee the same in 2024. For example, Tesla stock has had a tough time in 2024, down close to one-third from its 2023 high. So just buying this group of stocks and hoping for the momentum to continue is not a sure thing. Fortunately, investors could consider other companies of similar business quality for their portfolio. Tencent Holdings Limited(OTC: TCEHY) is one of these companies. Here's a closer look at why that's the case. Image source: Getty Images Founded as a small messaging service company (QQ), Tencent has become a conglomerate with business interests spanning multiple industries including social networking, gaming, entertainment, fintech, cloud computing, and more. The core of Tencent's empire lies in WeChat, a social media networking and communication service that has evolved into a super app. With just a single app, Chinese citizens can communicate with their family and friends, carry out online payments, book online services, access public infrastructures like transportation, play online games, engage in e-commerce, and more. In addition to the wide range of services, another element of WeChat's dominance is its 1.3 billion user base, giving it a considerable network effect advantage. As these users rely on WeChat for most of their communication, they must use the app frequently (and the majority use it daily). As long as these users keep returning, Tencent is in a prime position to monetize them via advertising and other value-added services discussed above. Tencent's success is evident in its financials. Since its IPO in 2004, revenue and net profit have risen from 1.1 billion yuan and 447 million yuan in 2004 to 554.6 billion yuan and 115.6 billion yuan in 2022. Besides its wholly owned and operated businesses, Tencent owns stakes in leading tech companies worldwide. For example, it holds more than 10% of leading e-commerce companies like Pinduoduo and Sea Ltd, giving it access to the massive growth opportunities of the e-commerce tailwind. Tencent also owns (or used to hold) minority stakes in listed companies like Tesla, Snapchat, and Spotify, which also give the tech behemoth indirect access to the growth of these leading tech companies. In other words, investing in Tencent's stock is similar to owning partial interests in a diversified group of high-quality businesses in China and beyond. Tencent might have been the leading tech company in China, akin to the Magnificent Seven in the United States, but its valuation is nowhere near those of its peers. Tencent's stock trades at a price-to-earnings (P/E) ratio of 12.4. On the other hand, Magnificent Seven stocks Meta Platform and Alphabet trade at P/E ratios of 32.9 and 23.9, respectively. Tencent's stock is even cheaper if we consider the 811 billion yuan ($113 billion) in investments in listed and unlisted investees. Removing these investments from Tencent's valuation would lead to a lower P/E ratio. However, investors are pessimistic about Tencent's stock, and not without reason. On one level, investors have to deal with additional risks when investing in Chinese companies, which include political risks, low transparency, and cultural differences. For example, big tech companies like Tencent and Alibaba went through brutal regulatory crackdowns in recent years, one which many did not foresee in advance. And with the ongoing (and worsening) geopolitical tension between the U.S. and China, most investors don't have the risk appetite to invest in Chinese companies, even though some are among the best globally. However, for investors willing to accept these additional risks, Tencent's stock looks like a tremendous bargain at today's price point. It's rare to find a company of Tencent's quality. But to have the opportunity to buy it at its current valuation is almost unheard of. Still, buying Tencent's stock when the general investing public is shying away from it requires enormous courage and patience. And investors need to be comfortable with investing in Chinese companies. But for those willing to accept the uncertainty of investing in Tencent, buying the stock today looks like a smart move. Should you invest $1,000 in Tencent right now? Before you buy stock in Tencent, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Tencent wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Lawrence Nga has positions in Alibaba Group, PDD Holdings, and Sea Limited. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, Sea Limited, Spotify Technology, Tencent, and Tesla. The Motley Fool recommends Alibaba Group. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}