{
    "title": "Who is Elon Musk and what is his net worth?",
    "date": "3/24/2024",
    "url": "https://sg.news.yahoo.com/elon-musk-net-worth-171624541.html",
    "text": "It seems like not a day goes by without billionaire Elon Musk making headlines. The boss of X (formerly Twitter), Tesla and SpaceX is the world's richest person and uses his platform to make his views known on a vast array of topics. He has also charged ahead with human brain chip trials at his firm Neuralink, played with turning X into a super app and tried to play a bigger role in the fast-growing world of artificial intelligence, despite having warned it could lead to humanity's extinction. In late February 2024 he sued OpenAI and its chief executive Sam Altman, saying the firm he helped co-found had reneged on its non-profit, open source origins by hitching its wagon to Microsoft. Since bursting on to the Silicon Valley scene more than two decades ago, the 52-year-old serial entrepreneur has kept the public captivated with his business antics. Born in Pretoria, South Africa, Mr Musk showed his talents for entrepreneurship early, going door-to-door with his brother selling homemade chocolate Easter eggs and developing his first computer game at the age of 12. He has described his childhood as difficult, affected by his parents' divorce, bullying at school and his own difficulty picking up on social cues because of Asperger's Syndrome. At the earliest opportunity, he left home for college, moving to Canada and then the US, where he studied economics and physics at the University of Pennsylvania, an Ivy League college. In a 2010 essay for Marie Claire, his first wife, Justine Musk, a writer whom he met in college and married in 2000, wrote that even before making his millions Mr Musk was \"not a man who takes no for an answer\". \"The will to compete and dominate, that made him so successful in business, did not magically shut off when he came home,\" she recalled, adding that he told her while dancing at their wedding, \"I am the alpha in this relationship.\" After being accepted to a physics graduate degree programme at Stanford University, Mr Musk quickly dropped out and founded two technology start-ups during the \"dotcom boom\" of the 1990s. These included a web software firm and an online banking company that eventually became PayPal, which was sold to eBay in 2002 for $1.5bn. He ploughed his fortune into a new rocket company, SpaceX - which he aimed to make a cost-effective alternative to Nasa - and a new electric car company, Tesla, where he chaired the board until becoming chief executive in 2008. The two firms are credited with upending their industries, even as they sometimes veered close to financial collapse. More recent business ventures include his takeover of social media platform Twitter in October 2022. Since then he has dramatically reduced the size of its workforce including, controversially, cuts to teams responsible for keeping the platform safe; rebranded the company as X; and introduced new premium subscriptions so that the business does not rely on advertising alone for income. Mr Musk's long-term ambition is for X to become an \"everything app\" offering a range of services. However, so far the value of the firm has plunged from the $44bn he originally paid to just $19bn, according to reports. How the world's richest person bought Twitter He also has ambitions in the AI sector, being an early investor in ChatGPT's parent company, before parting ways and setting up his own company xAI in July, whose mission is \"to understand the true nature of the universe\". \"I'm never hugely convinced that he knows what he wants to do tomorrow,\" says journalist Chris Stokel-Walker. \"He very much leads by instinct.\" In a 2015 biography, author Ashlee Vance described Mr Musk as \"a confrontational know-it-all\" with an \"abundant ego\". But he also called him an awkward dancer and diffident public speaker. In the press, he's been dubbed both a mad genius and Twitter's biggest troll - known as much for his lofty ambitions as his petty fights, not to mention the more serious lawsuits he and his companies have faced from regulators, investors and others over issues such as racial discrimination and the trustworthiness of his claims. Divorced three times - twice from the same woman, British actress Talulah Riley - Mr Musk is frank about his faults. \"If you list my sins, I sound like the worst person on Earth,\" Mr Musk said in a TED interview last year. \"But if you put those against the things I've done right, it makes much more sense.\" All those contradictions appear to be part of Mr Musk's appeal - and it certainly hasn't stopped him amassing a fortune. Bloomberg ranks him as the world's richest person, estimating his net worth to be around $215bn (£170bn) as of 1 March 2024. That's based largely on the value of his shares in Tesla, of which he owns more than 13%. The company's stock soared in value - some say unreasonably - in 2020 as the firm's output increased and it started to deliver regular profits. The shares plunged at the end of 2022, with some blaming the distraction of the Twitter takeover for the fall, though they have since recovered ground. Mr Musk also champions digital currencies and has a hand in several other smaller companies, including tunnel-maker the Boring Company and experimental brain-computer start-up Neuralink. Mr Musk, who wears the mantle of a workaholic proudly, has often said he's not in business simply to make money - claims he repeated recently with regard to his Twitter takeover. \"Elon only gets involved with things if he feels that they're critically important for some reason... for the sake of society or humanity,\" says friend and Tesla investor Ross Gerber. Mr Musk, who became a US citizen in 2002, has resisted efforts to label his politics - calling himself \"half-Democrat, half-Republican\", \"politically moderate\" and \"independent\". That doesn't mean he's shied away from political debate. He has injected himself into some of the world's hottest geopolitical fights - suggesting that China should establish a \"special administrative zone\" in Taiwan, and proposing terms to resolve the war in Ukraine that were adamantly rejected by many of the country's top leaders. While Mr Musk provided his Starlink satellite internet service to Ukraine, he has also attracted criticism for refusing an emergency request from Kyiv to activate Starlink in Sevastopol, home to a major Russian navy port. In the US, he moved to Texas, complaining of California's regulations and high taxes; has clashed with union organisers; and, in the spring of 2020, decried coronavirus lockdowns as \"fascist\". He was one of the first business executives to part ways with former President Donald Trump, quitting a White House business council after Mr Trump withdrew the US from a global climate agreement. But he's also made it clear he's not a fan of President Joe Biden, whom he sees as snubbing Tesla while promoting electric vehicles. He has said that he sees his businesses as a form of philanthropy, because they are focused on solving major human issues, such as climate change in the case of Tesla. And despite his own interest in artificial intelligence, he has also been one of the most prominent figures worried about the supposed threat to humanity's future that super-intelligent AIs might pose. He has claimed that the rise of artificial intelligence, combined with a declining birth rate, could result in \"not enough people\" being in the world. Here, you can't accuse him of not doing his part. Mr Musk has had 11 children - six with his first wife, three with Canadian singer Grimes, and two with Shivon Zilis. Following the birth of his twins with Ms Zilis, he tweeted: \"Doing my best to help the underpopulation crisis.\" Additional reporting by Liv McMahon Galactic Drain Plug A team of astronomers has captured yet another incredible image of Sagittarius A* (Sgr A*), the supermassive black hole lurking at the center of our galaxy. The team used the Event Horizon Telescope (EHT), a massive telescope array that consists of a global network of radio telescopes, to capture the black hole […] DIY Meteor Shower In 2022, NASA intentionally smashed its Double Asteroid Redirection Test (DART) spacecraft into a tiny asteroid called Dimorphos, a landmark test to see whether we could divert potentially dangerous space rocks in the future. The literally groundbreaking collision proved powerful enough to knock Dimorphos off its trajectory, leaving a massive trail of boulders, loose […] Improve grammar, word choice, and sentence structure everywhere you work. Write better with Grammarly. A massive volcano may be hiding in plain sight on Mars, according to a report from two researchers that’s making waves in the planetary science community. Researchers have found fresh evidence that may connect the mysterious Denisovans to the early human species Homo longi The next machine to explore alien worlds may not roll, but slither. NASA is currently testing a snake-like robot that its engineers hope will one day be deployed into the oceans of Saturn's moon Enceladus, in search of possible signs of life in its frigid depths. Dubbed the Exobiology Extant Life Surveyor (EELS), the over […] 這只是一個簡單的一步方法，任何人現在都可以在家嘗試，但專家們對它促進新陳代謝和減少腹脹的能力讚不絕口。 Scientists fixed tags equipped with cameras onto tiger sharks so that they could view the ocean floor from a new perspective. What they saw was astounding. Tech Miracle In the wake of NASA's failed private Moon lander debacle, Japan's version is, somehow, alive and kicking. In a post on X-formerly-Twitter, the Japan Aerospace Exploration Agency (JAXA) confirmed that SLIM, an acronym for \"Smart Lander for Investigating Moon,\" is still alive and transmitting signals after it its incredible resurrection earlier this year. […] OpenAI’s founder Sam Altman has said that nuclear fusion is the ultimate solution to the AI energy puzzle, but this may just be a case of typical blue-sky thinking. 1年全日制英國課程。符合NMTSS資助，學費低至$40,450，更可申請政府資助及獎學金。 They say it could also improve understanding of how the universe naturally expands. The six-part series 'Mammals' will air this Sunday at 19:00 GMT. Approving two proposed killer whale species could transform how they're conserved. It would also turn a new page in one of the strangest chapters in marine mammal history. HSBC report suggests wealth preservation and its distribution to next generation is a prime objective among the wealthy Want to check out the upcoming astronomical action? Protecting your vision is a must. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Hundreds of schoolchildren charged through a shopping centre with some tussling with security guards, before police issued a dispersal order. The home-grown language, which combines Portuguese, Cantonese and words from other Asian languages, is estimated to have only 50 fluent speakers left Princess Beatrice said becoming a stepmother to Wolfie, her husband Edoardo Mapelli Mozzi's son with Huang, was a \"great honor\" Abby Hensel officially tied the knot in 2021, it has been revealed \"Anyone else would’ve been locked up by now,\" writes one X user admonishing the former president's conduct on social media The post Trump Shares ‘Shocking’ Image of Biden Bound, Gagged as Critics Say He Is ‘Dangerously Unhinged’ appeared first on TheWrap.  This food habit is linked to a specific type of dementia. My ex-husband and I were in an open relationship, but I wasn't happy. I met a new partner at the gym and got a divorce. Now, we're engaged. Five people who took a Japanese health supplement have died and more than 100 have been hospitalized as of Friday, a week after a pharmaceutical company issued a recall of the products, officials said.  Osaka-based Kobayashi Pharmaceutical Co. came under fire for not going public quickly with problems known internally as early as January.  The first public announcement came March 22. "
}