{
    "title": "India’s new EV policy boosts Tesla’s entry plans: Import tax cut announced",
    "date": "3/16/2024",
    "url": "https://www.mypunepulse.com/indias-new-ev-policy-boosts-teslas-entry-plans-import-tax-cut-announced/",
    "text": "PUNE PULSE Trusted-Connected-Targeted PUNE PULSE representational pic India’s government has introduced a new electric vehicle (EV) policy aimed at attracting global manufacturers, with a particular focus on Tesla’s potential entry into the market. The policy includes a significant reduction in import taxes for companies committing to invest at least $500 million and establish local manufacturing facilities within three years. This move aligns with India’s ambitious target of achieving 30% electric car sales by 2030 and reducing its reliance on oil imports. Under the new policy, companies must invest a minimum of $500 million and ensure that at least 25% of EV components are sourced domestically. Those meeting these criteria will be permitted to import 8,000 EVs annually at a reduced import duty of 15% on cars priced at $35,000 and above. Currently, India imposes taxes ranging from 70% to 100% on imported cars based on their value. This policy shift is expected to pave the way for Tesla’s entry into India, as the company has been in discussions with the government for years to lower import duties on its electric vehicles. Additionally, Vietnam’s VinFast aims to leverage India as its new manufacturing hub, with plans to invest $2 billion in the country, including $500 million for setting up a facility in Tamil Nadu. Lotus Cars, owned by China’s Geely, has also entered the Indian market by partnering with a local importer and launching its electric SUV Eletre. However, domestic EV manufacturers such as Tata Motors and Mahindra & Mahindra have expressed concerns about foreign players’ entry, urging the government to promote local industry growth. Despite India’s efforts to attract foreign EV manufacturers with favourable import tax policies, the country remains primarily a two-wheeler-driven market. EVs accounted for just about two per cent of India’s total car sales last year, but the government has set a target of 30 per cent by 2030 and is working on various measures to attract manufacturers Nevertheless, with the implementation of these new policies, India aims to accelerate the adoption of EVs and strengthen its position in the global automotive industry.    "
}