{
    "title": "Lawyers who successfully argued Musk pay package was illegal seek $5.6 \nbillion in Tesla stock",
    "date": "3/2/2024",
    "url": "https://www.manchestertimes.com/news/business/lawyers-who-successfully-argued-musk-pay-package-was-illegal-seek-5-6-billion-in-tesla/article_b1f942dc-394c-58cf-9010-32397cd8a663.html?=/&subcategory=141%7CArts+%26+Crafts",
    "text": "Sunny. High 74F. Winds SW at 10 to 20 mph.. Mainly clear. Low 53F. Winds SSW at 5 to 10 mph. Updated: March 30, 2024 @ 10:25 am From balancing a budget to buying a home, students at Coffee County’s Raider Academy were faced with making these decisions during the On my Own financial education program Thursday, March 21. Updates to future director’s contract recommended On Friday, the CCCHS Red Raiders beat the Portland Panthers in a dominant, 11-1 win in their first game of the East Robertson Classic. Paisley Dyer, a 7th grade student at WMS, hits the target from 45 feet. Paisley's dad, Coach Chad Dyer says that archery will be one of many activities offered during Westwood Middle School's Journeys after school program. 'Wolf Man's release has been delayed to 2025, after it was originally scheduled for a pre-Halloween release in October.        DOVER, Del. (AP) — The lawyers who successfully argued that a massive pay package for Tesla CEO Elon Musk was illegal and should be voided have asked the presiding judge to award them company stock worth $5.6 billion as legal fees. The attorneys, who represented Tesla shareholders in the case decided in January, made the request of the Delaware judge in court papers filed Friday. The amount would apparently be far and away the largest such award, if approved. Lawyers in class-action suits stemming from the collapse of Enron got a record $688 million in legal fees in 2008. “We are ‘prepared to eat our cooking,’” the Tesla plaintiff attorneys wrote in the court filing, arguing the sum is justified because they worked purely on a contingency basis for more than 5 years. If they lost they would have gotten nothing. The benefit to Tesla “was massive,” they said. The requested award represents 11% of the Tesla stock — worth some $55 billion — that Musk was seeking in the compensation package, which Judge Kathaleen St. Jude McCormick ruled illegal in January. Not only does the request take nothing from the electric car company's balance sheet, it is also tax deductible, the attorneys argued. They are also seeking $1.1 million in expenses. In her ruling, Judge McCormick accepted the shareholder lawyers' argument that Musk personally dictated the landmark 2018 pay package in sham negotiations with directors who were not independent. It would have nearly doubled Musk's stake in Tesla. He currently holds 13%. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Egg prices are at near-historic highs in many parts of the world as the spring holidays approach, reflecting a market scrambled by disease, high demand and growing costs for farmers. Asian shares are mixed after Wall Street slipped a bit further from its record highs. Oil prices fell while U.S. futures edged higher. On Tuesday, the S&P 500 fell 0.3% for its third straight modest drop. The Dow Jones Industrial Average slipped 0.1%, and the Nasdaq composite fell 0.4%. Tesla and other Big Tech stocks offset losses in other sectors. But a late-day drop for Nvidia helped to pull the overall market lower. Trump Media & Technology Group jumped 16% in its first day of trading under the ticker symbol that uses former President Donald Trump’s initials. Treasury yields slipped following mixed economic reports. Shares of Donald Trump’s social media company rose about 16% in the first day of trading, boosting the value of Trump’s large stake in the company as well as the smaller holdings of fans who purchased shares as a show of support for the former president. Trump Media & Technology Group runs the social media platform Truth Social, which has yet to turn a profit. Trump holds a nearly 60% stake in the company, which based on Tuesday's closing stock price is worth about $4.6 billion. Some experts compared the enthusiasm for the shares to the meme stock craze that boosted the value of companies such as GameStop to exorbitant heights. Stocks that traded heavily or had substantial price changes on Tuesday: Krispy Kreme, McCormick rise; Consol Energy, Lear fall. PISCATAWAY, N.J., March 26, 2024 /PRNewswire/ -- GenScript, a global leader in life science research and application services, is excited to announce that it has been awarded the Bronze Medal by the internationally renowned provider of business sustainability ratings EcoVadis. This prestigio… NEW YORK--(BUSINESS WIRE)--Mar 26, 2024-- DUBLIN--(BUSINESS WIRE)--Mar 26, 2024-- - New research published in Clinical Cancer Research shows significant improvement in distant recurrence-free survival with combined durvalumab and tremelimumab treatment, supported by Lunit SCOPE IO's analysis of tumor microenvironment NORTH CHICAGO, Ill., March 26, 2024 /PRNewswire/ -- BLR Bio, an early stage biotech company in Rosalind Franklin University's Helix 51 biomedical incubator, released new data on its novel cancer therapy recently at the 7th annual Labroots Drug Discovery and Development conference. The data p… Immersive dining and entertainment experience elevates Nashville nightlife to new heights or call 931-455-4545 or email kboswell@tullahomanews.com. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: Get up-to-the-minute news sent straight to your device.       Account processing issue - the email address may already exist  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. "
}