{
    "title": "Tesla rolls out early Cybertruck delivery offer for TSLA shareholders",
    "date": "3/11/2024",
    "url": "https://www.teslarati.com/tesla-early-cybertruck-delivery-tsla-shareholders-details/",
    "text": "Tesla has launched a program offering early deliveries for the Foundation Series Cybertruck to qualified TSLA shareholders in the United States and Canada. The offer is designed specifically for verified TSLA shareholders who have held their stock in the electric vehicle maker for a significant amount of time. As noted by Tesla on its official page for the promotion, TSLA shareholders who wish to join the early Foundation Series Cybertruck delivery offer must sign up for the program by 11:59 PM CT on March 22, 2024. It should also be noted that the program is limited to one Foundation Series Cybertruck reservation per customer only. Customers who wish to participate in the early delivery program must meet a number of eligibility requirements. For one, the Cybertruck reservation must be made under the participant’s name. The reservation must have been placed before March 1, 2024 as well. Apart from this, only shareholders who have not yet taken delivery of their Cybertrucks are eligible for the newly-launched program. Early Cybertruck delivery for verified long-term TSLA shareholders!If you’re an eligible long-term TSLA holder and you made a Cybertruck reservation prior to March 1st 2024, you can get your Foundation Series Cybertruck early 👇https://t.co/g7JvVfQGB9 Each participant of the early Foundation Series Cybertruck delivery offer must submit brokerage statements that prove that they owned TSLA shares on February 28, 2021 and owned at least 500 TSLA shares on February 29, 2024. The brokerage statements for February 29, 2024 must also show that participants owned at least 50% of the TSLA shares they owned on February 28, 2021. Lastly, Tesla notes that brokerage statements must clearly display the participant’s name, statement date, and number of Tesla shares owned. Other information could be redacted for privacy. While Tesla has not disclosed the specific selection process for the early Foundation Series Cybertruck delivery program, TSLA shareholders meeting the initiative’s eligibility requirements are strongly encouraged to submit their applications before the March 22, 2024, deadline. Participants who are qualified for the program are expected to be contacted by Tesla through email. Sign up for Tesla’s early Foundation Series Cybertruck delivery program for TSLA shareholders here. Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Copyright © TESLARATI. All rights reserved. "
}