{
    "title": "Cathie Wood’s ETFs load up on Tesla’s stock, but not enough to stop the \nselling",
    "date": "3/15/2024",
    "url": "https://www.marketwatch.com/story/cathie-woods-etfs-bought-a-chunk-of-tesla-stock-after-another-selloff-7d8cbc27",
    "text": "Cathie Wood’s ETFs used the recent deep selloff in shares of Tesla Inc. as an opportunity to load up on one of their favorite investments. The electric-vehicle giant’s stock \n        TSLA,\n        -2.25%\n       had rallied as much as 1.6% soon after Friday’s opening bell, before turning back down. The stock was off 0.5% in afternoon trading, and has shed 9.1% amid a four-day losing streak, to put it on track for the lowest close since May 4, 2023. Read: Wall Street has another grim take on Tesla, and the stock is at a 10-month low. Also read: Tesla now worth less than JPMorgan as stock slapped with new bearish call. The stock is on track to suffer the biggest two-week decline — 20.2% — since it tumbled 31.2% in the two weeks before Christmas 2022, when the EV maker saw weaker demand, like it is now, but was also suffering from share sales by Chief Executive Elon Musk to fund his purchase of Twitter. High-profile investor Wood’s ARK Invest ETFs have stepped in, and bought a total of 216,682 shares of Tesla on Thursday, which at the closing price of $162.50 would be valued at $35.21 million. That’s the most the ETFs spent to buy the stock since they resumed purchases in December. Wood’s flagship ARK Innovation ETF \n        ARKK\n       bought 161,956 Tesla shares Thursday, valued at $26.32 million. Tesla is the ETF’s second-largest holding with a 7.62% weighting and a market value of $569.36 million, behind Coinbase Global Inc. \n        COIN,\n        +3.28%\n       with a 10.19% weighting. Tesla’s stock has slumped 35% year to date, while the ARK Innovation ETF has shed 7.3% and the S&P 500 index \n        SPX\n       has gained 7.2%. The ARK Next Generation Internet ETF \n        ARKW\n       bought 36,183 Tesla shares on Thursday valued at $5.88 million, where Tesla is the fifth-largest holding with a 5.15% weighting. The ARK Autonomous Technology & Robotics ETF \n        ARKQ\n       spent $3.01 million to buy 18,543 Tesla shares, which are the ETF’s largest holding with a 9.61% weighting. Terns Pharma is due to release data from an early-stage trial of an obesity treatment in pill form in the second half. Positive data would send the stock higher. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Visit a quote page and your recently viewed tickers will be displayed here. "
}