{
    "title": "Tesla’s Berlin factory comes back online as power is restored after arson \nattack",
    "date": "3/12/2024",
    "url": "https://www.cnn.com/2024/03/12/business/tesla-berlin-losses-power-arson-attack/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Production at Tesla’s factory near Berlin is gradually resuming after the plant was reconnected to the power grid late on Monday following a week-long closure caused by an arson attack. “The lights are back on,” German energy network E.DIS told CNN late on Monday. “At 8:45 p.m. (local) the E.DIS grid control center was able to make the decisive switch… Since then, the power supply has been restored.” A group of far-left activists, calling themselves the “Volcano Group,” claimed it was behind the arson attack on an electricity pylon, which cut off the power supply to the Tesla (TSLA) plant early last Tuesday. Now production at the factory should be gradually ramped up, CNN affiliate RTL has reported. It is not yet possible to say when it will resume fully, RTL cited a Tesla spokesperson as saying Tuesday. Tesla had originally expected the shutdown to last until the end of this week, the German media outlet added. Still, the outage could be costly for Elon Musk’s company. The huge plant — located about 30 kilometers (18 miles) southeast of the German capital — is its only one in Europe and is currently capable of producing 375,000 electric vehicles a year. Prices in Germany for Model Y vehicles, the only cars manufactured at the factory, start at €44,990 ($49,196). That means a week of output is worth about €324 million ($354 million) in sales for Tesla. Analysts had warned of a potential hit to first-quarter earnings from a shutdown lasting about 10 days or more. But tepid demand for EVs in Europe and the possibility that Tesla will make up lost production in the coming weeks should soften the blow, they said. Tesla has not responded to a CNN request for comment. The carmaker’s stock dropped 1% in morning trade in New York Tuesday. The share price has fallen 6.5% since last Monday’s close, the day before the arson attack. In a letter published on the alternative German media website Kontrapolis, the Volcano Group wrote that it had “sabotaged” Tesla because its plant “consumes Earth, resources, people, labor and spits out 6,000 SUVs, killer cars and monster trucks per week.” Musk retorted by saying on X: “These are either the dumbest eco-terrorists on Earth or they’re puppets of those who don’t have good environmental goals. “Stopping production of electric vehicles, rather than fossil fuel vehicles, ist extrem dumm.” Last year, the company lodged an application to increase the factory’s production capacity to 1 million electric vehicles a year, which would make it Europe’s biggest car plant. But in February, local residents voted against a motion to clear enough forest for Tesla to expand the site, leaving it to local authorities to decide how to proceed, according to Reuters. In another setback earlier this year, the carmaker said it would pause most production at the Berlin plant for two weeks because attacks on container ships in the Red Sea had delayed the delivery of components. Stephanie Halasz in London contributed reporting. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}