{
    "title": "Elon Musk Slams 'Evil' Lawyers Seeking $6B In Tesla Shares As Compensation: \n'The System Is Broken...'",
    "date": "3/1/2024",
    "url": "https://www.tradingview.com/news/benzinga:9857e179b094b:0-elon-musk-slams-evil-lawyers-seeking-6b-in-tesla-shares-as-compensation-the-system-is-broken/",
    "text": "Elon Musk on Friday lashed out against the lawyers who requested Tesla Inc TSLA shares worth $6 billion as payment for successfully contesting his $56 billion pay package at the EV company. What Happened: “They are evil,” Musk wrote on X, formerly Twitter. The billionaire CEO also termed it “so ironic” that the lawyers who contested that his package was too high are now demanding such a package. They are evil “The system is broken. Best to get out of Delaware as soon as possible,” Musk wrote in another post, reiterating his call for companies to incorporate elsewhere but Delaware. The billionaire CEO has previously recommended incorporating companies into either Texas or Nevada, claiming that it would help shareholders decide the company's matters. The system is broken. Best to get out of Delaware as soon as possible possible. Attorneys from Bernstein Litowitz Berger & Grossmann, Friedman Oster & Tejtel, and Andrews & Springer of Wilmington, represented Tesla shareholder Richard Tonetta who contested Musk’s 2018 compensation package at Tesla with a maximum value of $56 billion. The judge overseeing the case, Kathaleen McCormick, nullified the package in February after noting the board to be insufficiently independent of Musk and the governance process leading to the grant as well as the value of the shares to be \"unfair\" to other shareholders. Why It Matters: On Friday, the attornies requested a Delaware state court to compensate them with Tesla shares worth $6 billion. The lawyers acknowledged that the requested sum was unprecedented but argued that it was in line with previous Delaware awards and accounted for just 11% of shareholder recovery. Musk is expected to appeal against the pay nullification decision. He can also challenge the fee request. The lawyers' request for payment in Tesla shares could make them among the 10 largest shareholders of the company if approved by the judge overseeing the case. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read More: After Porsche, Ford Reportedly Buys A Cybertruck For A Huge Premium; Tesla CEO Elon Musk Thinks It's ‘Worth It' Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}