{
    "title": "Tesla drivers enjoying tax loophole as company makes small EV adjustment \nfor big savings",
    "date": "3/8/2024",
    "url": "https://www.express.co.uk/life-style/cars/1875482/tesla-drivers-tax-loophole-ev-savings",
    "text": "  Tesla has removed the rear seats in some France-sold Model Y SUVs so business owners can qualify for a tax loophole. Drivers who own one of the vehicles can take advantage of commercial vehicle taxation that requires participants to drive a utility vehicle in a professional context with two or three seats in the front and zero in the back. Clément Maguet, a Senior Account Manager at Tesla in France, said: “France currently has a fleet of around 6.3 million commercial vehicles, mostly powered by diesel. “Faced with this reality, Tesla has developed a 2-seater Model Y with a storage capacity of 2,158 liters and offers a range of 565 km (351 miles, cycle WLTP); this model is eligible for commercial vehicle taxation. “This environmentally friendly and efficient solution offers an additional alternative to professional mobility, whether for the transport of goods or as an emergency vehicle,” Teslarati reports. READ MORE: Martin Lewis issues major March car insurance warning and updates 2024 prediction    Most of France’s vehicles are subject to 20 percent tax — but a utility vehicle for commercial operations, like this electric Model Y, comes tax-free, according to Tesla Oracle. A more technical description of the law from Manageo reads: “The purchase of a utility vehicle represents an investment expense for the company. “The depreciation corresponding to the acquisition may be fully deducted from the taxable income without any cap of any kind. Don't miss...Calls for Chinese car brands to 'understand the market' as insurance costs rise [REPORT]Four common modifications that could cause car to fail MOT and cause accidents [ANALYSIS]Best car features at Geneva Motor Show, including a floating Land Rover rival [INSIGHT]  “This is not the case for passenger vehicles, whose deductibility of depreciation is capped according to the CO2 emission rate. Furthermore, no penalty must be paid when purchasing a utility vehicle.” Tesla’s Model Y was Europe’s best-selling car in 2023. The modified Model Y is currently in its prototype stage, according to InsideEVs.  We use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. More info SEARCH CONNECT WITH US TODAY'S PAPER See today's front and back pages, download the newspaper, order back issues and use the historic Daily Express newspaper archive. EXPRESS.CO.UK "
}