{
    "title": "The S&P 500 and Nasdaq Hit All-Time Highs, but It Could Be Just the \nBeginning If These 3 Stocks Join the Rally",
    "date": "3/10/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA-Q/pressreleases/24682999/the-sp-500-and-nasdaq-hit-all-time-highs-but-it-could-be-just-the-beginning-if-these-3-stocks-join-the-rally/",
    "text": "As the calendar turned to March, the market has wasted no time bidding stocks higher, with the S&P 500 and Nasdaq Composite both closing at all-time highs. As of March 1, the S&P 500 is up 7.7% year-to-date (YTD), and the Nasdaq is up 8.4%. It's been a great run, but some fear that the market won't be able to keep up the pace. At this stage in the rally, it is asking a lot from top leaders like Nvidia to continue carrying the market higher. With a 4.5% weighting in the S&P 500 and a year-to-date return of 66.2%, Nvidia alone has contributed a staggering three percentage points to the S&P 500's YTD return. Put another way, Nvidia is responsible for 39% of the S&P 500's YTD return. Nvidia could keep going up, or it could stall. But the good news is that Nvidia doesn't have to lead the market higher. Apple(NASDAQ: AAPL), Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL), and Tesla (NASDAQ: TSLA) have all missed out on the market rally. In fact, all three growth stocks have actually lost value in 2024. Here's what each company needs to do to regain favor on Wall Street, and what it could mean for the broader market. Image source: Getty Images. The \"Magnificent Seven\" refers to seven of the largest tech-focused companies. Together they make up 28.8% of the S&P 500. But only four of those stocks are doing well this year.  AAPL data by YCharts Apple, Alphabet, and Tesla make up a combined 11% of the S&P 500. If these stocks turn things around, it could help push the S&P 500 higher even if Nvidia, Microsoft, Amazon, and Meta Platforms trade sideways from here. Apple has arguably the best overall case for a turnaround. The valuation isn't bad, with Apple trading at a 27.9 price-to-earnings (P/E) ratio, which is coincidentally the exact same as the S&P 500. The main issue is slowing growth out of China and a perceived lack of innovation with iPhone upgrades. Investors want to see Apple incorporate artificial intelligence (AI) into its products. It has been noticeably absent from the AI-fueled market rally. Investors who have been following Apple for a while know that the company is not one to overpromise and underdeliver by pre-announcing something flashy to boost Wall Street sentiment. Rather, Apple will wait, let the market do what it wants, and wait to reveal a new product, acquisition, innovation, etc. until it is ready. Two dates to keep track of would be the 2024 Apple Worldwide Developers Conference in June and then the unveiling of the iPhone 16, which should be in September. Investors will want to see meaningful strides across Apple's product line and the company's ability to capitalize on AI. As for the quarterly figures, investors will look for improvements from China, ongoing services growth and high margins, and strength from North America and emerging markets. Apple's main product threat is Huawei's new smartphone, which is weighing on its performance out of China. But China in general is down right now. Apple's moat isn't eroding, and it has dealt with plenty of competition before. It's easy to get negative on Apple stock right now. And to be fair, the stock could face a lot of short-term pressure between now and June or September (or beyond if it fails to deliver). But Apple's business isn't necessarily doing bad, it just looks bad compared to the scorching hot growth of the rest of big tech. Alphabet is in a similar but rockier boat. With an 11% share of the global cloud infrastructure market, Google Cloud is a distant third behind Amazon Web Services and Microsoft Azure. Its tried and true search engine business is still the undisputed market leader, but there's concern it could face unexpected threats as the competition makes strides in AI. Alphabet recently came under pressure because its Gemini 1.5 model was an AI disaster. It just seems like Alphabet has been lagging behind the competition in a field that it was once thought to lead. Google search is a brilliant algorithm built upon decades of AI innovation, but Alphabet is struggling to monetize new AI products right now. Until Alphabet reinforces its search fortress and gives the market something to get excited about, the stock will probably remain under pressure. The good news is that Alphabet isn't expensive. It is, by far, the cheapest of the Magnificent Seven stocks, trading at a mere 24.5 P/E ratio. Tesla stands out as arguably more vulnerable than Apple and Alphabet. Apple and Alphabet are already decent valuations relative to the market. So the further they fall, the more they may be considered by value investors. Tesla doesn't have that advantage. It has a lofty 47 P/E ratio and a 63.3 forward P/E ratio, which means that analysts believe the next 12 months of earnings will be lower than the last 12 months. In other words, negative growth. Even Apple and Alphabet have lower forward P/E ratios than their current P/Es because they are still growing, even in the near term. Meanwhile, legacy automakers like Toyota are achieving incredible results. Toyota stock is hovering around an all-time high. A big part of the rally is the company's success with hybrid vehicles, which have become a core part of its business strategy and are contributing to margin expansion. Toyota now has a higher operating margin than Tesla, which casts doubt on the sustained growth of electric vehicles (EV), at least in the short term. Tesla is facing a slowdown in EV adoption and mounting competition. It has also failed to monetize AI in a big way through fully autonomous driving. Tesla is still the market leader in EVs. But right now it's basically only doing one thing well, while the rest of the market is catching up. For Tesla to justify its current valuation, it has to show more growth outside of EVs. I wouldn't go as far as to say the long-term investment thesis for Tesla has changed, but the company has a lot of challenges that don't seem to be going away anytime soon. It would be great for the broader market if Apple, Alphabet, and Tesla joined the rally. But for the reasons discussed, there doesn't seem to be a fundamental reason for that to happen anytime soon. All three companies are facing slowing growth and competition. However, they also have vast financial resources to unlock growth for patient investors. The more Apple and Alphabet fall, the more they look like value plays. When Tesla returns to growth or announces some game-changing stride in AI, the stock could also start to look more reasonable. This market rally is fueled by specific themes and growth, so it's understandable why Apple, Alphabet, and Tesla have been left out. But long-term investing isn't about hopping on whatever trend is working in the short-term, but rather ensuring the businesses you invest in have what it takes to compound earnings over time. Apple, Alphabet, and Tesla have a long growth runway and plenty of potential, but they are all in \"prove it\" mode as far as the market is concerned. Holding all three stocks seems perfectly reasonable right now. And if there's one in particular you believe can address the market's concerns, then it may be an excellent time to buy it while it's out of favor. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 8, 2024  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}