{
    "title": "Adam Jonas trims price target on Tesla stock ahead of earnings",
    "date": "1/22/2024",
    "url": "https://invezz.com/news/2024/01/22/tesla-stock-price-target-lowered-ahead-of-earnings/",
    "text": "Follow Invezz on Telegram, Twitter, and Google News for instant updates > Tesla Inc (NASDAQ: TSLA) is in focus today after a Morgan Stanley analyst trimmed his price target on the electric vehicles behemoth. Adam Jonas continues to see the multinational as a “top pick” and rates its at “overweight”.   The analyst, however, slashed his price target on Tesla stock this morning by nearly 10% to $345 citing “global EV momentum is stalling” and the market is “over supplied versus demand”. Evidently, though, Jonas expects the related negative impact to be short-lived on $TSLA. His research note arrives only days before the EV giant is scheduled to report its financial results for the fourth quarter. Consensus is for it to earn 66 cents a share versus $1.07 per share a year ago.  Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. Are you worried that $TSLA is going to disappoint when they report earnings next week? Well check out my video below to see if it can help you calm your nerves.#teslastock pic.twitter.com/3CN4mGKFCO Adam Jonas remains positive on Tesla stock because of the progress on company’s other ventures. Areas like Optimus, he added, are not factored into his price objective as well. Are you looking for fast-news, hot-tips and market analysis? \n\n  \n    Sign-up for the Invezz newsletter, today. The Morgan Stanley analyst also told clients in his research note today that the Nasdaq-listed firm is the only one in his coverage that is authentically artificial intelligence enabling. He expects more updates from the automaker on that front at its 2024 AI day. It is worth mentioning, however, that Elon Musk recently pushed for more control of Tesla Inc citing: I’m uncomfortable growing Tesla to be a leader in AI and robotics without having ~25% voting control. Enough to be influential, but not so much that I can’t be overturned. Copy expert traders easily with Plus500. Invest in stocks like Tesla & Apple. Instantly trade ETFs like FTSE 100 & S&P 500. Sign-up in minutes. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.  Should you buy Bitcoin before the halving? Should you buy Bitcoin before the halving?  Use Invezz APP Get a better user experience Allow notifications? Allow us to send you updates You must agree to the privacy policy. "
}