{
    "title": "Chinese EV Shares Slump, Pressured by Tesla Price Cuts, Weak Sales",
    "date": "1/16/2024",
    "url": "https://www.morningstar.com/news/dow-jones/20240117105/chinese-ev-shares-slump-pressured-by-tesla-price-cuts-weak-sales",
    "text": "By Sherry Qin Shares of Chinese electric-vehicle makers fell sharply amid intensified competition after Tesla cut prices again in China and weak sales in January so far. NIO shares fell 9.6% to 49.05 Hong Kong dollars (US$6.27) on Wednesday after ADRs shed 8.65% overnight. Its Hong Kong-listed shares have lost 33% so far this year. XPeng dropped 9.9% and Zhejiang Leapmotor Technology declined 5.1%. Tesla cut the price of its entry-level Model 3 by 5.9% to 245,900 yuan (US$34,291) and lowered the Model Y's starting price to CNY258,900 from CNY266,400 on Friday. Tesla's recent price reductions have hurt overall sentiment in the auto industry, Daiwa Capital Markets analyst Kelvin Lau said in a research note. The pricing pressure, together with Chinese EV makers' lackluster January sales so far, triggered the selloff, Lau said. NIO's month-to-date insurance registrations, a gauge of retail sales, have fallen 27% from the previous month, according to data compiled by Citi. XPeng's insurance sales have dropped 62% so far, while Leapmotor's has declined 30%. China's EV sales could fall 30% in January from December, Citi analysts led by Jeff Chung said in a note. Tesla's price cut on models in the CNY200,000-CNY300,000 range, where most of XPeng's products are positioned, could pose a threat to the Chinese EV maker, the Citi analysts said in a separate note recently. Several investment banks, including Citi and HSBC Qianhai, recently lowered their target prices on NIO's and XPeng's ADRs and H shares, citing intense competition and pricing pressures. Write to Sherry Qin at sherry.qin@wsj.com (END) Dow Jones Newswires January 17, 2024 00:58 ET (05:58 GMT) Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}