{
    "title": null,
    "date": "1/13/2024",
    "url": "https://www.hindustantimes.com/india-news/indias-suzuki-moment-with-tesla-musk-really-admires-what-modi-has-done-101705118317434.html",
    "text": "Subscribe Now! Get features like Global electric vehicle (EV) giant Telsa is currently in advanced talks to make a significant foray into India. The company is contemplating a staggering investment of nearly $30 billion over the next five years, according to people closely involved with the company’s official business plans, signalling a potential game-changer for the country's burgeoning EV landscape. A substantial chunk of the envisaged investment, approximately $3 billion, is earmarked for the immediate production of a new small car from an Indian plant. This move is aimed at catering to the wider developing world. In the event of a favourable policy environment, Tesla envisions introducing its standard brands into the Indian luxury car market. Simultaneously, the company plans to kickstart the building and testing of a charging ecosystem, a crucial component in the widespread adoption of electric vehicles. The location for Tesla's potential plant in India is under consideration, with options including Haryana, Tamil Nadu, Maharashtra, and Gujarat. Given the company's export-oriented plans, a coastal state in the west or south is likely. A person close to the company and involved in discussions on the project said this could well be “Suzuki moment” for India’s EV industry and and the “Apple plus moment” for India’s manufacturing aspirations. “But unlike Apple, Tesla brings everything in one go. Don’t think of Tesla as just an auto company. It is a tech company. It is a critical minerals mining and refining company. It makes its own semiconductors. It is a design company. It brings in a huge ecosystem. The spillover from this to other industries is enormous.” Tesla's interest in India is not just a strategic diversification beyond China but also a reflection of Elon Musk's admiration for India and Prime Minister Narendra Modi. “Musk really admires what Modi has done for India and his energy. He spoke to Modi about his interest in Indian spirituality and meditation and expressed an interest in travelling there,” said the person quoted above familiar with Tesla’s thinking. Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}