{
    "title": "Tesla Plans New Mass-Market EV in Mid-2025, Reuters Says",
    "date": "1/23/2024",
    "url": "https://finance.yahoo.com/news/tesla-plans-mass-market-ev-054210169.html",
    "text": "(Bloomberg) -- Tesla Inc. has told suppliers it wants to start production of a new mass-market electric car in mid-2025, Reuters reported, citing people familiar with the matter. Most Read from Bloomberg Three US Troops Killed in Attack Tied to Iran-Backed Groups Traders Line Up for ‘Once-in-a-Generation’ Emerging Markets Bet Houthi Hit on Russian Fuel Has Oil Traders Recalculating Risks Stock Market’s Fate Rests on $10 Trillion in Big Tech Earnings Singapore’s $200,000 Toyotas Fuel Angst Over Widening Wealth Gap The US automaker sent “requests for quotes,” or invitation for bids, for the model codenamed “Redwood” to suppliers last year, and forecast weekly production of 10,000 vehicles, Reuters reported. The model was described as a compact crossover. Chief Executive Officer Elon Musk first promised to build a $25,000 EV in 2020, before putting off the plan. Tesla’s cheapest car, the Model 3 sedan, starts at $38,990 in the US. Tesla lost its rank as the world’s biggest maker of EVs in the fourth quarter to China’s BYD Co., which has a wide variety of cars at a range of price points, from mass-market budget models to high-priced luxury cars. Read More: Tesla Loses World’s Most Popular EV Maker Title to China’s BYD The EV maker reports quarterly results after the close of US trading on Wednesday, with investors focused on the electric-vehicle maker’s guidance for 2024 deliveries and comments about demand. Tesla took some steps to break into the mass market in 2023. It slashed prices across its lineup, sacrificing profit margin for volume. The markdowns were especially pronounced in China, where Musk has said it’s most difficult to compete. Tesla in recent years tore down a Honda Civic, which starts at $23,950 in the US, to study how to make cheaper cars, the Reuters report said. The next-generation Tesla architecture, internally called “NV9X,” will include two or more models, the report said. Most Read from Bloomberg Businessweek How a Lucky Break Fueled Eli Lilly’s $600 Billion Weight-Loss Empire AI Needs So Much Power That Old Coal Plants Are Sticking Around How the West’s Favorite Autocrat Engineered Africa’s Most Dramatic Turnaround Why Did Car Insurance Get So Expensive? American Workers Come Out Winners in a Clash Between Economists Over a Curve ©2024 Bloomberg L.P. Related Quotes "
}