{
    "title": "Delaware Court of Chancery Strikes Down Elon Musk's $55.8 Billion Equity \nCompensation Package from Tesla",
    "date": "2/21/2024",
    "url": "https://www.dentons.com/en/insights/alerts/2024/february/21/delaware-court-of-chancery-strikes-down-elon-musks",
    "text": "A recent decision by Chancellor Kathaleen McCormick of the Delaware Court of Chancery following a five-day trial ordered the rescission of the largest executive compensation package in U.S. history. The decision in Tornetta v. Musk would be newsworthy just for that reason. But the opinion also has important ramifications for companies and their boards when handling transactions with dominant stockholders and when making executive compensation decisions. The Chancellor notably found Tesla CEO Elon Musk to be a controlling stockholder, despite owning only 21.9% of Tesla. This finding caused the court to conclude that the option grants were a conflicted-controller transaction requiring application of the “entire fairness” standard of review, Delaware’s most stringent form of judicial review. The Chancellor held that the defendants failed to meet their burden to prove that the process employed by the Board in approving the compensation arrangements, as well as the compensatory options, were entirely fair. In particular, the Chancellor was troubled by what she perceived to be the pliancy of the compensation committee, which she found to be comprised of directors with deep financial and personal relationships with Musk, acting “almost as an advisory body” to Musk rather than as an independent negotiator. She twice quotes the Compensation Committee Chair’s testimony that “We were not on different sides of things. We were trying to make sure if we were going to go through this exercise that he was on board.” The Chancellor faulted the Compensation Committee and the board for not considering alternatives, failing to conduct a customary benchmarking analysis, and not assessing whether the grant was necessary to meet the company’s purposes. She also found that the burden of proving entire fairness remained with the defendants despite a vote of the stockholders approving the grant, because the relevant proxy statement was deficient for failing to disclose, among other things, the relationships of a majority of the board with Musk that called into question their independence and projections showing that the company expected to meet the milestones for Musk’s compensation. Without such information she found the stockholder vote was not fully informed. Each of these elements of the Tornetta decision bears consideration and analysis beyond the scope of this client alert. Indeed, there may be an inclination to view the opinion as only applying to an entire fairness reviews of conflicted-controller executive compensation transactions. While in a strict sense that may be the case, Tornetta is an important decision on Delaware executive compensation and provides some generally applicable guidance for boards and compensation committees considering executive compensation awards.   Email me ilan.katz@dentons.com Email me ira.kotel@dentons.com Email me kenneth.pfaehler@dentons.com Email me victor.boyajian@dentons.com © 2024 Dentons. All rights reserved. Attorney Advertising. Dentons is a global legal practice providing client services worldwide through its member firms and affiliates. This website and its publications are not designed to provide legal or other advice and you should not take, or refrain from taking, action based on its content. Unsolicited emails and other information sent to Dentons will not be considered confidential, may be disclosed to others, may not receive a response, and do not create a lawyer-client relationship.  If you are not already a client of Dentons, please do not send us any confidential information. You are switching to another language. Please click Confirm below to continue. You will now be taken from the global Dentons website to the $redirectingsite website. To proceed, please click Accept. Beijing Dacheng Law Offices, LLP (\"大成\") is an independent law firm, and not a member or affiliate of Dentons. 大成 is a partnership law firm organized under the laws of the People’s Republic of China, and is Dentons' Preferred Law Firm in China, with offices in more than 40 locations throughout China. Dentons Group (a Swiss Verein) (\"Dentons\") is a separate international law firm with members and affiliates in more than 160 locations around the world, including Hong Kong SAR, China. For more information, please see dacheng.com/legal-notices or dentons.com/legal-notices. Beijing Dacheng Law Offices, LLP (\"大成\") is an independent law firm, and not a member or affiliate of Dentons. 大成 is a partnership law firm organized under the laws of the People’s Republic of China, and is Dentons' Preferred Law Firm in China, with offices in more than 40 locations throughout China. Dentons Group (a Swiss Verein) (\"Dentons\") is a separate international law firm with members and affiliates in more than 160 locations around the world, including Hong Kong SAR, China. For more information, please see dacheng.com/legal-notices or dentons.com/legal-notices. "
}