{
    "title": null,
    "date": "2/3/2024",
    "url": "https://www.forbes.com/sites/brettowens/2024/02/03/a-dicey-dividend-up-to-76-too-good-to-be-true/",
    "text": "Text sign showing Too Good To Be True. Conceptual photo Extraordinarily Fantastic but Doubtful ... [+] Unthinkable. Ten years ago, the city athletics director wrote: Hi Guys, I need to place an order for championship softball shirts. It should say West Sacramento’s Summer 2014 C/D Division Champions. Bad Decisions. Bad Decisions was our team name, a nod to our personnel. I mean that in the most endearing way possible, of course. A lineup filled with guys light on responsibility (at the time) who enjoyed the postgame rehydration process as much as the in-game competition. With two kids, my postgame rituals are different these days. First, a trip out can only occur after our final YMCA basketball game on Saturdays—my third and final game to coach that day. Second, finding another family is a must. The kids need a crew to play with. Third, we all behave. The children know how to behave when eating out. Your income strategist has finally learned, too. The ill-advised actions are few and far between. Unless we consider my email inbox of dividend ideas. In which case, I must don my 2014 championship t-shirt and warn you about some potential bad dividend decisions that readers tell me they are pondering. YieldMax is an ETF shop that we’ll put under the microscope. No relation to CarMax\n  \nKMX\n (KMX) apparently, the company that kindly gave me a fair cash deal for my old Honda Civic. That was a good experience, with one caveat. My Civic was 11 years old and the front bumper was duct taped on. I didn’t want to fix the bumper—I just wanted a fair no-hassle cash deal for the car, which CarMax provided. The catch? They tried to sell me a new car every two minutes. No thanks, no thanks, no thanks. Finally, they cut me my cashier’s check and I was out of there. YieldMax seems to have a similar approach. Here, take this giant yield and be happy. Problem is, from what I can tell, these dividends appear to be quite dicey. But the stated yields are so obscene that they really are tempting. YieldMax TSLA Option Income Strategy ETF (TSLY\n  \nSLY\n), for example, has a headline dividend of 76%. Seventy-six! If TSLY actually paid us 76%, we’d get our money back in a little over a year. In which case, TSLY would be a slam dunk. Just buy it and hang on for a little while, right? Wrong. Don’t believe the headlines. Since inception, TSLY has been a dividend dog. It has paid its investors but lost more in price setbacks. Check out this sad total return versus the S&P 500, a tally which includes all dividends paid: TSLY Underperforms SPY The fund’s goal is to generate a monthly dividend out of Tesla\n  \nTSLA\n (TSLA) by writing options on the stock—selling puts and writing covered calls. In theory, this strategy can work. TSLA is a volatile stock which commands large options premiums—good for an options-for-income strategy. Plus, there are contracts that expire every Friday—also beneficial for this technique as options tend to lose most of their value closer to expiration. There are two potential flaws in this strategy and, unfortunately, this ETF checks both boxes:   Since inception, the underlying TSLA stock has grinded exactly sideways. Which, while not ideal, should be OK. TSLA commands big option premiums. As sellers, this is ideal–we pocket these when we sell puts and write calls. We would expect TSLY, the income fund, to benefit from these fat premiums. Just sell puts and write calls and bank weekly income. Pay a monthly dividend. Rinse and repeat. Right. Wrong. Again, over the period in which TSLA’s stock did nothing, TSLY returned less than nothing. Something is wrong here: TSLY Underperforms TSLA The YieldMax guys seem to be bad at maximizing yield. Best to avoid. It’s either a flawed strategy or poor execution. We can make better dividend decisions. We should apply this “sanity check” to any stock or fund that claims it generates income via options: Show us your total returns! We welcome the dividend, but we want price stability. Many of these funds quietly fail this test. Oh, and don’t forget to check the SEC Yield. That’s a measure of the annualized dividend income that the fund actually generated over the last 30 days. TSLY has a stated yield of 76%, but an SEC Yield of only 3.9%. Big difference! What they say and what we get are an entire football field apart. Let’s be thoughtful and read past the headline yield. We careful contrarians make sound dividend decisions so that we can keep our payouts, and not lose them in price setbacks! Brett Owens is Chief Investment Strategist for Contrarian Outlook. For more great income ideas, get your free copy his latest special report: Your Early Retirement Portfolio: Huge Dividends—Every Month—Forever. Disclosure: none  "
}