{
    "title": "Cathie Wood's Ark Rose To Prominence with Tesla Bet in 2020, But Did ARKK \nMiss Out Big On Other 'Magnific",
    "date": "2/8/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36999228/cathie-woods-ark-rose-to-prominence-with-tesla-bet-in-2020-but-did-arkk-miss-out-big-on-other-ma",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The Magnificent Seven group has been the flavor of Wall Street over the past year, as these stocks led the stock market to rebound from 2022’s dismal performance. Here’s a look at how much return an investment in a basket comprising the Magnificent seven stocks in equal proportion would have fetched vis-a-vis Cathie Wood-led Ark Investment’s flagship Ark Innovation ETF ARKK. New Group On The Block: FAANG was the precursor to the group, now collectively called the Magnificent Seven. Originally named FANG by Jim Cramer in 2013, the group became known as FAANG with the addition of Apple, Inc. AAPL in 2017. The original members were Meta Platforms, Inc. META, which then went by the name Facebook, Amazon, Inc. AMZN, Netflix, Inc. NFLX and Alphabet, Inc. GOOGL GOOG, formerly Google. Later iterations were MAGA, which included Microsoft Corp. MSFT along with Apple, Alphabet and Amazon, and MAMAA, comprising Meta, Apple, Microsoft, Alphabet and Amazon. The phrase Magnificent Seven was first used by BofA Securities analyst Michael Hartnett in 2023. The constituent companies spearheaded the stock market rebound during the year, thanks to the dominant market positioning, innovativeness, brand appeal and financial muscle of these companies. This group comprises the biggest mega-cap techs including Meta, Apple, Alphabet, Amazon, Nvidia Corp. NVDA, Microsoft and Tesla, Inc. TSLA. The AI revolution that is firmly taking hold has to do with Nvidia joining the elite club. The chipmaker was the best-performing S&P 500 stock in 2023 as well as for the year-to-date period, propelling the company to sixth place in terms of market capitalization. The exuberance reflects astounding growth prospects due to Nvidia’s exposure to AI. The Santa Clara, California-based company’s high-performance chips currently power most AI software and applications. Earlier this year, Microsoft toppled Apple to be the top company in terms of capitalization, with the expanded partnership with OpenAI, and the use of its technology in its Bing search and cloud services, among others, generating positive sentiment toward the stock.  Meta and Alphabet also stake claim as among the biggest AI plays. Amazon’s dominant market positioning, its Cloud business, and its AI foray have imparted momentum to the stock. On the other hand, Apple has lagged behind its Magnificent Seven peers due to soft demand for its hardware products. Electric vehicle giant, Tesla’s fundamentals bettered in 2021 as volume growth accelerated following the launch of its Model Y in late-2020. The stock had a stellar run until 2022 — a year that saw the broader market beginning to lose steam. Softness, precipitated by macro and geopolitical conditions, began to take a toll on Tesla. The stock went down in 2022 before making a comeback in the first half of 2023. With Tesla resorting to price cuts to push volumes, its margin contracted, impacting bottom-line performance, even as the price cuts did not give the expected boost to the top-line The underperformance of Tesla has given rise to chatter about whether it should be booted out of the Magnificent Seven group. Source: Benzinga See Also: Best Artificial Intelligence Stocks ARKK’s Trajectory: ARKK, which invests in companies with disruptive innovation potential, has Tesla as its second-most held stock with an 8.09% weighting. The ETF holds 3.39 million Tesla shares currently. The only other Magnificent Seven stock in ARKK’s portfolio currently is Microsoft (200,448 shares). ARKK cashed out of Nvidia in January 2023, with Ark consciously trimming its stake in the chipmaker on the premise that the stock is overvalued. The NYSE-listed ARKK was a high-flier amid the pandemic as most portfolio stocks such as Zoom Video Communications, Inc. ZM were considered as COVID-19 plays and rallied during the pandemic. These shares have since then come back from their COVID-19 highs. ARKK was on a secular downtrend from February 2021 till the end of 2022 and has been going about a consolidation move around the depressed levels since then. Source: Benzinga Returns From $100 Investment: If an investor had invested $100 in each of the Magnificent Seven stocks at the start of March 2020, here’s how much he would have now: If $100 were invested in each of the Magnificent Seven stocks, the combined return on the $700 plowed in would be $2,653.66. In percentage terms, the return would be 279.09% compared to ARKK’s negative 7.80% return. The Invesco QQQ Trust QQQ, an index tracking the Nasdaq 100, ended Wednesday’s session  1.03% at $431.99, according to Benzinga Pro data. ARKK added 0.30% to $47.31. Read Next: Nvidia’s Valuation Set To Leapfrog Past Amazon, Alphabet As AI Stalwart’s Stock Closes In On $700 Mark: Is The Meteoric Climb Sustainable? © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}