{
    "title": "Tesla’s share dive has Wall Street asking questions",
    "date": "2/13/2024",
    "url": "https://www.smh.com.au/business/companies/tesla-s-collapse-has-wall-street-asking-questions-20240212-p5f42d.html",
    "text": "We’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Add articles to your saved list and come back to them any time. If you’re building a list of the most important stocks in the market, Tesla has to be on it. Or does it? That’s part of a growing debate on Wall Street, where shares of Elon Musk’s electric-vehicle maker are tanking as the rest of the market rallies — and the company is warning that things may not get better for a while. An original member of the so-called Magnificent Seven tech stocks that have been driving the S&P 500 Index to new heights, traders are now wondering if Tesla’s name belongs next to those other powerhouses. The storm clouds are gathering for Tesla.Credit: Reuters After doubling last year, Tesla’s stock price is down 22 per cent to start 2024. Compare that to Nvidia Corp.‘s 46 per cent surge or Meta Platforms Inc.’s 32 per cent gain since the beginning of the year and it’s easy to see where the questions are coming from. Indeed, it’s by far the worst performer in the Magnificent Seven Index this year. The problem for the EV-maker is six of those seven companies are benefiting from the enthusiasm surrounding burgeoning artificial intelligence technology. The group hit a record 29.5 per cent weighting in the S&P 500 last week even with Tesla’s decline, according to data compiled by Bloomberg. But despite Musk’s efforts to position his company as an AI investment, the reality is Tesla faces a unique set of challenges. “Although Elon Musk would probably disagree, investors don’t see Tesla as an AI play like most of the other Magnificent Seven stocks,” said Matthew Maley, chief market strategist at Miller Tabak + Co. “We have a much different backdrop for Tesla and the others in the Mag Seven — the demand trend for Tesla products is fading, while it’s exploding higher for those companies that are more associated with AI.” At the heart of this divide is the dimming outlook for electric vehicles. Demand is expected to slow in 2024, and perhaps beyond, raising doubts about Tesla’s ability to grow at the rapid pace investors are accustomed to seeing. Roughly a third of the analysts covering Tesla recommend buying the stock, compared to an average of 85 per cent for the rest of the Magnificent Seven. Moreover, analysts have cut their average 2024 profit estimate for Tesla nearly in half over the past 12 months, while earnings expectations for the others have risen or stayed flat. “The challenge is that Tesla has become a one-product company — the Model Y, with every other initiative either not a meaningful contributor to revenue and earnings or still a bit of a science project,” said Jeffrey Osborne of Cowen. “Being a one-product company and mismanaging the timing of product cycles can create periods of pain, which is what we are in now until the next generation vehicle comes out next year or in 2026.” While other Magnificent Seven companies such as Nvidia are soaring this year, Tesla has struggled.Credit: AP The double trouble of slowing EV demand and shaky AI credentials make it hard for investors to swallow Tesla’s sky-high valuation. Even with this year’s selloff, the stock trades at over 60 times forward earnings. The second-most expensive Magnificent Seven stock is Nvidia at around 36 times forward earnings, while the rest trade between the low twenties and low thirties. “During the year, others in the Mag Seven were able to show how AI was driving real, profitable business growth,” Brian Johnson, former auto analyst with Barclays and founder of Metonic Advisors, said in an interview. “Tesla investors just got some random Optimus videos, Musk’s admission Dojo was a moon shot and yet another full-self-driving release that may be an improvement but still a long ways from robotaxi capability.” “The demand trend for Tesla products is fading, while it’s exploding higher for those companies that are more associated with AI.” In contrast, the rest of the mega-cap technology companies boast of diverse and stable revenue streams, which in most cases translate into slightly slower growth, but also less volatile shares. Tesla believers say the company’s unique position as the only profitable, large-scale, pure-play EV maker earns it a seat in the elite club. Even though demand is expected to fall in the near-term, experts widely expect electric cars to eventually come dominate the auto industry. For anyone willing to bet on that future, Tesla is still the only real game in town, which also explains its lofty market valuation and the all-or-nothing nature of the company’s stock price — soaring 50 per cent in 2021, plunging 65 per cent in 2022, and then leaping 102 per cent in 2023. “I can understand traders being short-term negative on the stock,” said Brian Mulberry, client portfolio manager at Zacks Investment Management. “But long-term investors are likely more positive given that no other EV maker can profitably produce the volume of units that Tesla does, in the pure EV space.” Bullish Tesla investors also point out that the company’s revenue growth beyond 2024 is expected to surpass all of the Magnificent Seven other than Nvidia Corp. Its earnings are also projected to bounce back in 2025 after dropping this year, and will be climbing at a faster pace than most other mega-caps. Still, Tesla’s heavy exposure to the cyclical automotive industry makes it stand out among the Magnificent Seven, particularly in light of the uncertainty around the technology of self-driving cars. Though Musk has often claimed that a future where the so-called robotaxis will be a common thing is not far off, most industry experts believe it’s still years, if not decades, away. “Tesla is one of the riskier companies we cover because the underlying business is cyclical and the autonomy piece is binary,” said Ivana Delevska, chief investment officer of Spear Invest. “They will either crack the code on autonomy or this will drag for many years before anyone has a solution.” Bloomberg The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning. Copyright © 2024 "
}