{
    "title": "Legible and LiveOne team up to provide audiobooks for Tesla drivers",
    "date": "2/9/2024",
    "url": "https://www.thearmchairtrader.com/legible-liveone-tesla/",
    "text": "Legible [CSE:READ], a Canadian-listed infotainment platform and publishing house, says it is teaming up with LiveOne [NASDAQ:LVO], to now provide users with a seamless access to millions of book titles within the Slacker Radio platform, including audiobook previews in Tesla cars. Legible is providing audiobook and eBook content through its newly released Legible Connect service, a fully secure book content delivery tool for B2B clients. Additionally, Legible said its diverse and extensive library of audiobooks and eBooks combined with Slacker Radio’s technology will provide customers with hours of entertainment wherever they listen. Legible is a groundbreaking, mobile-centric global company specializing in eBooks and audiobook entertainment, boasting a market opportunity exceeding billions of dollars. Legible’s extensive partnerships encompass four of the Big Five Publishers and the world’s largest eBook distributor, enabling it to seamlessly deliver over 2 million eBooks and audiobooks, effectively transforming any smart device into a dynamic library and eBookstore. At the heart of Legible’s innovation lies its LibrarianAI, the world’s pioneering AI-powered assistant, enhancing the reading experience. Legible’s publishing division is revolutionizing the industry by crafting proprietary AI-enriched multimedia books, setting new standards in literary engagement. Legible’s contracts with four of the Big Five publishers, the world’s largest book distributor, Ingram CoreSource, and many other publishers, along with a continually growing catalogue, offer users a wide range of audiobooks spanning fiction, non-fiction, self-help and productivity, biographies, kids’ books, and educational content. “As the audio entertainment experience evolves, LiveOne and Slacker remain committed to developing new and diverse entertainment experiences to meet and exceed consumer demand. Our partnership with Legible and the integration of audiobooks represents a significant step forward in redefining the listening experience for our B2C customers and B2B partners. We’re thrilled to embark on this new path with Legible’s unique infotainment platform,” said Rob Ellin, CEO of LiveOne. The partnership underscores Legible’s commitment to pushing the boundaries of innovation in digital publishing content solutions, especially in the automotive space. “By combining technology, content curation, and personalized recommendations, Legible, LiveOne, and Slacker Radio are set to create an immersive and unparalleled audiobook experience for both new and long-time listeners alike,” said Kaleeg Hainsworth, CEO of Legible. LiveOne is the world’s first all-in-one music and entertainment destination that combines premium livestreams of concerts and festivals, expertly-curated streaming radio stations, podcasts, and original artist video and audio content, with a mission to bring music and entertainment to as many people as possible around the globe. LiveOne’s subsidiaries, Slacker Radio and PodcastOne, deliver music and podcasts to automotive users. LiveOne’s subsidiaries include Slacker Radio, PodcastOne (Nasdaq: PODC), PPVOne, Palm Beach Records, CPS, LiveXLive, DayOne Music Publishing, Drumify and Splitmind. LiveOne is available on iOS, Android, Roku, Apple TV, Spotify, Samsung, Amazon Fire, Android TV, and through STIRR’s OTT applications.  Like this article? Sign up to our free newsletter. This article does not constitute investment advice. Do your own research or consult a professional advisor. Use the comment block below to give us your views. Please make sure your thoughts are supported with evidence. All comments are viewed by a member of the Armchair Trader team prior to publication. Let’s keep it respectful. Detailed reviews of selected companies and investment trusts. Our partners are established, regulated businesses and we are grateful for their support. 1 Charterhouse Mews\nLondon\nEC1M 6BB "
}