{
    "title": "Angela Chao's blood-alcohol level was nearly 3 times the legal limit when \nshe drowned in her Tesla, police report shows.",
    "date": "3/20/2024",
    "url": "https://businessinsider.mx/angela-chao-blood-alcohol-three-times-limit-death-tesla-2024-3/",
    "text": "Angela Chao, the shipping magnate who drowned after backing her Tesla into a pond on her Texas ranch, had a blood-alcohol level nearly three times the legal limit when she died, newly released police records show. Chao was the CEO of Foremost Group, the wife of venture capitalist Jim Breyer and the sister of former cabinet secretary Elaine Chao, who is the wife of Senate Minority Leader Mitch McConnell. Chao's sudden death occurred in Blanco County, outside Austin, in the early morning hours of February 11. Local police initially declined to share many details, saying they were still investigating. On Wednesday, the Blanco County sheriff released 62 pages of records. The documents said Chao's death was an \"unfortunate accident.\" It also said that her blood-alcohol concentration was 0.233 grams per 100 milliliters, which is about three times the legal limit of 0.08 grams per 100 milliliters. The police report said Chao was hosting a group of women at her ranch when she died. The group had dinner at the guest lodge on the property on Saturday, February 10. Afterward, at around 11:30 p.m. Chao planned to drive from one building on the ranch to another because it was cold outside. But after getting into her car, she accidentally reversed into a pond, police said. The report describes how Chao's friends, an employee, and first responders attempted to save her from the pond, which was situated between the main house and the guest house on the remote ranch. Even though one of the back doors of the car was open, officers could not pull her out of it, and it took them several minutes to break the driver's side window and extract her body. Police said Chao and the Tesla had been in the water for around 21 minutes by the time they arrived on the scene. While the vehicle was sinking, Chao called a friend and told her she loved her and that she could not open her door, according to the police report. According to The Wall Street Journal, which previously reported details of Chao's death, Chao also said that she had accidentally put the vehicle into reverse. Business Insider previously reported that several Tesla owners had told federal authorities about confusion and dangerous situations that they blamed on their vehicles' unconventional gear-shifting mechanisms. The Journal reported that Chao's family did not blame Tesla for her death. Breyer, Chao's husband, said in an emailed statement: \"I am heartbroken by this terrible tragedy. I am so appreciative for the remarkable efforts of the many first responders in Blanco County who did everything possible to save my wonderful wife's life.\" \"Angela's passing was a terrible tragedy, and words cannot describe the family's profound grief,\" a spokesman for the family of James S.C. Chao, Angela's father, said in an emailed statement. \"The family is grateful for the first responders and friends who tried so hard to save her.\" Correction: March 20, 2024 — An earlier version of this story said Chao's death did not make national headlines until weeks after it occurred. The story has been updated to reflect her death was publicly reported on February 14, three days later. A reference to Sen. Mitch McConnell as the \"former\" Senate minority leader has also been removed. Update: March 20, 2024 — The story has been updated to include a statement from Jim Breyer. Copyright © 2021 Insider Inc. Todos los derechos reservados. Aviso de privacidad y Politica de cookies Ediciones Internacionales: Alemania y Austria, Australia, España, Estados Unidos,  India, Internacional, Japón, Países Bajos, Polonia "
}