{
    "title": "As Tesla stock tanks, key investor explains the (lack of) value in Dojo, \nOptimus",
    "date": "3/14/2024",
    "url": "https://www.dcourier.com/news/2024/mar/14/as-tesla-stock-tanks-key-investor-explains-the-lac/",
    "text": "  Since the start of 2024, the Magnificent Seven as a group has notched decent, though not meteoric, gains. Nvidia  (NVDA)  has become the leader of the tech posse, spiking nearly 80% for the year; Meta  (META)  is up around 40%, Microsoft  (MSFT)  (hitting another 52-week high Thursday) is up around 13%, Amazon  (AMZN)  is up around 17% and Google  (GOOG)  is about flat. Only two of the seven are down for the year: Apple  (AAPL)  and Tesla  (TSLA) . Shares of Apple are down about 10% for the year; shares of Tesla — falling another 5% Thursday — are down 34% for the year. The S&P 500, in comparison, is up around 8% year-to-date. The Nasdaq is up nearly 9%. Related: Here's why the Tesla bears are starting to outnumber the bulls When it comes to Tesla, Morgan Stanley analyst Adam Jonas said in a note last month that the bears are beginning to outnumber the bulls; according to a survey he conducted, Jonas noted that 60% of respondents expect Tesla to continue to underperform the S&P 500 throughout the year. The Future Fund's Gary Black said in a post on X that it is \"increasingly difficult to justify\" a 55-60 times price-to-earnings ratio with \"single-digit year-over-year sales growth\" until Tesla starts selling its $25,000 next-generation car, which Black doesn't expect to happen until 2026. This, he said, is the thing that has been ailing Tesla. What ails $TSLA?  It’s increasingly difficult to justify a 55-60x P/E on a company with single-digit YoY sales growth until next gen 25K vehicle delivs start in 2026. pic.twitter.com/8hbCP2Hlrn Black has a $250 price target on the stock and has said that a cheaper, more accessible next-gen vehicle would be a major catalyst for Tesla. He said in a Thursday post that, though his price target includes \"some estimate\" of the value of full self-driving (FSD), it does not include estimates of Tesla's other artificial intelligence-related businesses (Optimus, FSD licensing and the robotaxi). \"X investors always give us grief for not including robotaxi, FSD licensing or Optimus valuations in our PTs,\" Black said. \"That discipline has worked well for us so far in avoiding posting outlandish price targets based on arbitrary assumptions.\" He said that a company needs a working product in order for an analyst to make forecasts based on that product. Other investors, like Cathie Wood of Ark Invest, have based their valuations exclusively on assumptions regarding those areas that Black is reluctant to touch. Wood expects Tesla to be trading at $2,000 per share by 2027. And the long-term catalyst for that forecast centers around robotaxis, a product Tesla does not seem close to launching. \"Tesla doesn't segregate its AI businesses, so investors can't put a value on Tesla's AI businesses,\" Black said. \"They would be making up (numbers). Black said Thursday that the Future Fund's \"worst performer was Tesla, which until recently was our second-largest position.\" Contact Ian with tips and AI stories via email, ian.krietzberg@thearenagroup.net, or Signal 732-804-1223. Related: Engineering whistleblower explains why safe Full Self-Driving can't ever happen Click Below to: Contents of this site are © Copyright 2024 Prescott Newspapers, Inc. and Western News&Info®, Inc. All rights reserved. |  Terms of Service | Privacy Policy "
}