{
    "title": "Tesla (NASDAQ:TSLA) Shares Gap Down to $172.82",
    "date": "3/23/2024",
    "url": "https://www.defenseworld.net/2024/03/24/tesla-nasdaqtsla-shares-gap-down-to-172-82.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Tesla, Inc. (NASDAQ:TSLA – Get Free Report)’s stock price gapped down prior to trading on Friday . The stock had previously closed at $172.82, but opened at $166.69. Tesla shares last traded at $167.93, with a volume of 19,703,428 shares trading hands. A number of research firms have recently issued reports on TSLA. Truist Financial cut their price objective on Tesla from $227.00 to $193.00 and set a “hold” rating for the company in a research report on Thursday, January 25th. Guggenheim increased their price objective on shares of Tesla from $125.00 to $132.00 and gave the company a “sell” rating in a research report on Friday, December 15th. Robert W. Baird  reaffirmed an “outperform” rating and set a $300.00 target price on shares of Tesla in a report on Thursday, January 25th. Edward Jones cut shares of Tesla from a “buy” rating to a “hold” rating in a report on Friday, January 26th. Finally, TD Cowen reduced their price objective on Tesla from $200.00 to $180.00 and set a “market perform” rating for the company in a report on Thursday, January 25th. Ten research analysts have rated the stock with a sell rating, fourteen have issued  a hold rating and nine have issued  a buy rating to the company’s stock. According to MarketBeat.com, the stock currently has an average rating of “Hold” and an average target price of $211.93. Get Our Latest Stock Analysis on TSLA The company has a debt-to-equity ratio of 0.05, a current ratio of 1.73 and a quick ratio of 1.25. The stock has a market capitalization of $544.06 billion, a price-to-earnings ratio of 39.64, a PEG ratio of 3.89 and a beta of 2.41. The business’s fifty day moving average price is $190.26 and its 200-day moving average price is $223.61. Tesla (NASDAQ:TSLA – Get Free Report) last issued its quarterly earnings data on Wednesday, January 24th. The electric vehicle producer reported $0.71 EPS for the quarter, missing the consensus estimate of $0.74 by ($0.03). The company had revenue of $25.17 billion during the quarter, compared to analysts’ expectations of $25.64 billion. Tesla had a return on equity of 16.62% and a net margin of 15.50%. The business’s revenue for the quarter was up 3.5% compared to the same quarter last year. During the same period last year, the company earned $1.07 earnings per share.  On average, research analysts forecast that  Tesla, Inc. will post 2.45 EPS for the current year. In other news, Director Robyn M. Denholm sold 93,706 shares of the company’s stock in a transaction on Wednesday, February 21st. The shares were sold at an average price of $194.73, for a total value of $18,247,369.38. Following the completion of the sale, the director now owns 15,000 shares in the company, valued at approximately $2,920,950. The transaction was disclosed in a document filed with the SEC, which is accessible through this hyperlink. In other news, Director Robyn M. Denholm sold 93,705 shares of the firm’s stock in a transaction on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total value of $16,439,605.20. Following the completion of the transaction, the director now directly owns 15,000 shares of the company’s stock, valued at $2,631,600. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through this hyperlink. Also, Director Robyn M. Denholm sold 93,706 shares of the business’s stock in a transaction that occurred on Wednesday, February 21st. The shares were sold at an average price of $194.73, for a total transaction of $18,247,369.38. Following the transaction, the director now directly owns 15,000 shares of the company’s stock, valued at approximately $2,920,950. The disclosure for this sale can be found here. In the last three months, insiders have sold 198,598 shares of company stock worth $36,952,434. Corporate insiders own  25.10% of the company’s stock. A number of institutional investors have recently made changes to their positions in the business. Vanguard Group Inc. lifted its position in shares of  Tesla by 1.7% in the 4th quarter. Vanguard Group Inc. now owns 229,806,372 shares of the electric vehicle producer’s stock worth $57,102,287,000 after purchasing an additional 3,866,361 shares during the period.  State Street Corp grew its position in  Tesla by 4.4% in the 2nd quarter. State Street Corp now owns 104,115,390 shares of the electric vehicle producer’s stock worth $27,254,286,000 after purchasing an additional 4,431,570 shares during the period.  Norges Bank bought a new stake in shares of  Tesla during the 4th quarter valued at about $7,844,757,000.  Morgan Stanley boosted its stake in shares of  Tesla by 7.8% during the 3rd quarter. Morgan Stanley now owns 30,160,747 shares of the electric vehicle producer’s stock worth $7,546,823,000 after acquiring an additional 2,177,397 shares during the last quarter.  Finally, FMR LLC lifted its position in  Tesla by 0.9% during the third quarter. FMR LLC now owns 29,040,734 shares of the electric vehicle producer’s stock valued at $7,266,572,000 after purchasing an additional 269,182 shares in the last quarter. Hedge funds and other institutional investors own  41.87% of the company’s stock. (Get Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.  Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter. Marathon Digital (NASDAQ:MARA) Shares Gap Down to $21.78 AAR (NYSE:AIR) Shares Gap Down to $63.92 "
}