{
    "title": "Tesla in talks to open production facility in Italy: reports",
    "date": "3/26/2024",
    "url": "https://www.capitalfm.co.ke/business/2024/03/tesla-in-talks-to-open-production-facility-in-italy-reports/",
    "text": "Hi, what are you looking for? Ghana distributes 1.3 mln free tablets to boost digital literacy in schools Kenyan fintechs head to Ghana to lure investors Florida passes law limiting children’s access to social media 4 out of 5 New Zealand businesses offer employees work-style choices Innovators offer solar drying solutions for farm produce Gov’t to earn Sh5bn from its stake in Kenya Pipeline Company Kenya to resume tea exports to Tanzania after trade dispute resolves Driving Kenya’s Digital Future: Insights from the DTPS Forum and Awards President Ruto launches medium-term economic plan State starts process of licensing more digital certification service providers Introvert DJ Joe Mfalme on his journey to success in the music industry The Evolution of e-commerce as told by Ronald Kaleu Wowzi! You Want To Be An Influencer? Going Full-Time: Julia Gaitho’s Move from Employment to Full-Time Content Creator Digital Marketing and The Transformative Power of The Internet Craft beer maker, Big Five, transfers a portion of its plant, equipment to Wananchi Kenya’s monthly inflation drops to 5.7pc on falling fuel, electricity prices Davis and Shirtliff calls for increased investment in water projects for food security Partnerships crucial in elevating Kenya’s film industry to global standards Britam’s gross profit up 65 percent to Sh4 billion Indian gov’t orders mandatory declaration of wheat stock position from April Ukraine’s GDP grows 5.3 pct in 2023 China’s Xiaomi releases its first self-developed NEV Japan’s February jobless rate climbs to 2.6 pct UK economy falls by 0.3 pct in Q4 2023 The Importance of Attitude and Life Experiences in Career Growth Introvert DJ Joe Mfalme on his journey to success in the music industry The Evolution of e-commerce as told by Ronald Kaleu Wowzi! You Want To Be An Influencer? Going Full-Time: Julia Gaitho’s Move from Employment to Full-Time Content Creator Capital FM commemorates anniversary of Chris Kirubi’s death Finding Opportunity in the midst of the pandemic: AskKirubi COVID-19: Lessons Learned and Future Direction for Entrepreneurs Kirubi set to acquire half of Centum Plc following nod by CMA Kirubi warns investors against fake cryptocurrency platform using his name By Published ROME, March 26 (Xinhua) — U.S. electric vehicle maker Tesla is in talks with the Italian government to open a production facility in the country, Italian media reported Tuesday. Tesla has been engaged in talks with the Ministry of Enterprises and Made in Italy for several months, with the plan to produce electric trucks and vans in southern Italy, according to media reports. Reports revealed that Tesla officials have already begun evaluating potential sites for the production facility. The contact between Tesla and the Italian government occurred as Rome engaged with multiple automakers in a bid to ramp up its car production. Earlier this year, Adolfo Urso, minister of enterprises, said Italy needed to raise its national car production to 1.3 million vehicles a year from below 800,000 in 2023 to preserve its national auto industry amid challenges posed by the transition to electric mobility. Media reports indicated that Italy is also engaging in discussions with three Chinese vehicle manufacturers: BYD, Great Wall Motors, and Chery Automobile. © 2024 Capital Digital Media. Capital Group Limited. All Rights Reserved "
}