{
    "title": "Tesla Bull Says EV Giant Already Has A $25K Car: 'It's Called A Used Model \nY' - Tesla (NASDAQ:TSLA)",
    "date": "3/29/2024",
    "url": "https://www.benzinga.com/news/24/03/38012245/tesla-bull-says-ev-giant-already-has-a-25k-car-its-called-a-used-model-y",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Ross Gerber, the President and CEO of Gerber Kawasaki Wealth and Investment Management and a Tesla TSLA bull, said on Friday that the company already has a $25,000 car — it’s called a used Model Y. What Happened: “Tesla already has a $25k car. It's called a used model Y,” Gerber wrote on X, adding that he is willing to sell his own old Model Y for the price. The investor has a model year 2020 Performance variant Model Y in black equipped with full self-driving (FSD) capability. The Model Y is the best-selling car from the EV giant. A custom Model Y currently starts at $43,990 for the base version. The Long Range version starts at  $48,990 and the Performance variant at $52,490. However, the Performance variant of the SUV was priced at a whopping $69,990 before the company started cutting prices drastically in 2023. Gerber likely bought his older Model Y for over $80,000 given the added price of FSD. Talking about the low resale value of Tesla vehicles, Gerber said, “Elon cost Tesla EV owners 10s of billions….” Older Tesla cars, Gerber said, are “underwater,” making trading in your older Tesla for a new one a less attractive option. Looming Low Resale Value Concerns: Gerber is not the first one to flag the low resale value of old Tesla vehicles. Car rental company Hertz Global Holdings flagged the high repair costs of EVs coupled with the low resale value of vehicles among its reasons to phase out Tesla vehicles from its fleet earlier this year. “The average price of a used Tesla has declined 19 months in a row, moving from a record high of $67,900 in July 2022 to a record low of $33,913 today. That’s a 50% decline,” Chief Market Strategist Charlie Bilello from wealth management firm Creative Planning said in early February. Tesla is currently working on a new EV expected to be priced at around $25,000. The production of the vehicle is expected to start in the second half of 2025. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Second Chance For Nikola? Electric Trucks Return To Customers After Fire Recalls With New Features Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}