{
    "title": "Tesla (NASDAQ:TSLA) Stock Price Down 1.9% Following Analyst Downgrade",
    "date": "3/19/2024",
    "url": "https://www.defenseworld.net/2024/03/20/tesla-nasdaqtsla-stock-price-down-1-9-following-analyst-downgrade.html",
    "text": "Posted by Defense World Staff on Mar 20th, 2024 Shares of Tesla, Inc. (NASDAQ:TSLA – Get Free Report) fell 1.9% on Tuesday after The Goldman Sachs Group lowered their price target on the stock from $220.00 to $190.00. The Goldman Sachs Group currently has a neutral rating on the stock. Tesla traded as low as $167.42 and last traded at $170.43. 37,602,368 shares traded hands during mid-day trading, a decline of 64% from the average session volume of 104,466,219 shares. The stock had previously closed at $173.80. Several other analysts also recently commented on the company. UBS Group cut their target price on Tesla from $225.00 to $165.00 and set a “neutral” rating on the stock in a research note on Thursday, March 14th. Piper Sandler dropped their target price on Tesla from $295.00 to $225.00 and set an “overweight” rating on the stock in a research report on Monday, February 5th. Daiwa Capital Markets lowered shares of Tesla from an “outperform” rating to a “neutral” rating and reduced their price target for the company from $245.00 to $195.00 in a research report on Tuesday, February 6th. JPMorgan Chase & Co. reduced their price target on shares of Tesla from $135.00 to $130.00 and set an “underweight” rating for the company in a research report on Friday, January 26th. Finally, Canaccord Genuity Group cut their price target on shares of Tesla from $267.00 to $234.00 and set a “buy” rating for the company in a report on Thursday, January 25th. Ten investment analysts have rated the stock with a sell rating, fourteen have given a hold rating and nine have issued  a buy rating to the company’s stock. Based on data from MarketBeat, Tesla  has a consensus rating of “Hold” and a consensus target price of $211.93. Check Out Our Latest Analysis on TSLA In other Tesla news, Director Robyn M. Denholm sold 93,705 shares of the firm’s stock in a transaction on Tuesday, March 12th. The stock was sold at an average price of $175.44, for a total transaction of $16,439,605.20. Following the transaction, the director now directly owns 15,000 shares in the company, valued at approximately $2,631,600. The sale was disclosed in a document filed with the SEC, which is available through this hyperlink. In other Tesla news, SVP Xiaotong Zhu sold 687 shares of the company’s stock in a transaction that occurred on Wednesday, March 6th. The stock was sold at an average price of $177.11, for a total value of $121,674.57. Following the completion of the sale, the senior vice president now owns 63,171 shares of the company’s stock, valued at $11,188,215.81. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. Also, Director Robyn M. Denholm sold 93,705 shares of the stock in a transaction that occurred on Tuesday, March 12th. The shares were sold at an average price of $175.44, for a total value of $16,439,605.20. Following the sale, the director now directly owns 15,000 shares of the company’s stock, valued at approximately $2,631,600. The disclosure for this sale can be found here. Insiders have sold a total of 198,598 shares of company stock worth $36,952,434 in the last ninety days. Corporate insiders own  20.90% of the company’s stock. Institutional investors have recently added to or reduced their stakes in the company. Axiom Financial Strategies LLC grew its position in  Tesla by 9.8% in the 1st quarter. Axiom Financial Strategies LLC now owns 906 shares of the electric vehicle producer’s stock valued at $777,000 after acquiring an additional 81 shares during the last quarter.  Mirae Asset Global Investments Co. Ltd. grew its holdings in  Tesla by 19.7% during the first quarter. Mirae Asset Global Investments Co. Ltd. now owns 1,001,923 shares of the electric vehicle producer’s stock worth $1,079,672,000 after acquiring an additional 164,789 shares during the period.  MAS Advisors LLC grew its holdings in  Tesla by 25.7% in the first quarter. MAS Advisors LLC now owns 396 shares of the electric vehicle producer’s stock valued at $433,000 after purchasing an additional 81 shares during the period.  Ergoteles LLC boosted its stake in shares of  Tesla by 33.4% in the first quarter. Ergoteles LLC now owns 3,567 shares of the electric vehicle producer’s stock worth $3,844,000 after acquiring an additional 893 shares during the last quarter.  Finally, Mackenzie Financial Corp lifted its position in  Tesla by 6.8% during the first quarter. Mackenzie Financial Corp now owns 72,167 shares of the electric vehicle producer’s stock worth $77,767,000 after buying an additional 4,593 shares in the last quarter. Institutional investors own  41.87% of the company’s stock. The stock has a market cap of $545.62 billion, a PE ratio of 39.75, a P/E/G ratio of 3.68 and a beta of 2.41. The company has a current ratio of 1.73, a quick ratio of 1.25 and a debt-to-equity ratio of 0.05. The company has a fifty day moving average of $193.48 and a 200-day moving average of $225.06. Tesla (NASDAQ:TSLA – Get Free Report) last issued its earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share (EPS) for the quarter, missing analysts’ consensus estimates of $0.74 by ($0.03). The business had revenue of $25.17 billion for the quarter, compared to analysts’ expectations of $25.64 billion. Tesla had a return on equity of 16.62% and a net margin of 15.50%. The business’s quarterly revenue was up 3.5% on a year-over-year basis. During the same period last year, the company posted $1.07 earnings per share.  Sell-side analysts expect that  Tesla, Inc. will post 2.45 EPS for the current fiscal year. (Get Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.  Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter. Caribou Biosciences (NASDAQ:CRBU) Shares Gap Up  Following Analyst Upgrade Williams-Sonoma (NYSE:WSM) Reaches New 1-Year High on Analyst Upgrade "
}