{
    "title": "Activists protest Tesla plant expansion in Germany - Briefly.co.za",
    "date": "3/10/2024",
    "url": "https://briefly.co.za/business-economy/economy/182034-activists-protest-tesla-plant-expansion-germany/",
    "text": "Global site navigation PAY ATTENTION: We are on WhatsApp! Get trending news in your favourite app - FOLLOW NOW! Several hundred people demonstrated Sunday against plans by Tesla to expand its electric car factory near Berlin, citing environmental concerns. The protest came days after Tesla's Gruenheide site was forced to halt production after a nearby electricity pylon was set on fire in a suspected arson attack, causing a power outage at the plant. The act of sabotage last Tuesday has been claimed by far-left activists from the \"Vulkangruppe\" (Volcano Group), and federal prosecutors have taken charge of the investigation. Sunday's protest was organised by a coalition of environmental protection groups including Extinction Rebellion, Nabu and Robin Hood. Organisers said more than a thousand demonstrators joined the protest, with local media putting the number at around 800 people. Organisers said they were calling for \"a secure water supply\" and \"real climate protection\" and were protesting against Tesla owner Elon Musk's \"capitalist sham solutions\". Read also German federal prosecutors to probe Tesla plant sabotage PAY ATTENTION: stay informed and follow us on Google News! Protesters oppose Musk's plan to expand the Gruenheide plant, south of Berlin, by 170 hectares (420 acres), from a current size of 300 hectares. The US company aims to double production to a million electric vehicles annually. The Gruenheide site is Tesla's only European factory. But the plans have annoyed environmentalists and residents who worry about the deforestation required for the expansion, the impact on local water supply and an increase in road traffic in the area. A local referendum recently saw more than 60 percent of respondents vote against the proposed expansion, though the vote was not legally binding. Annika Fuchs, a member of the Robin Hood environmental group who took part in the protest, said she wanted local authorities to respect the vote outcome. \"It's really important to us that we take the opinion of citizens here seriously,\" she told AFP. Read also US power company admits it might have started huge Texas fire Not all locals are against Tesla's plans however. A smaller counter-protest was held Sunday in support of the Tesla factory, with participants citing economic benefits for the region. Regional news outlet RBB quoted police as saying some 200 people took part. PAY ATTENTION: Follow us on Instagram - get the most important news directly in your favourite app! Source: AFP Recommended for you      Check more articles for you "
}