{
    "title": "Cathie Wood's Ark Ups Tesla Bet With $28M Stock Buy Amid Rebound, Also \nLoads Up On This Online Game Platf",
    "date": "3/25/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/37927191/cathie-woods-ark-ups-tesla-bet-with-28m-stock-buy-amid-rebound-also-loads-up-on-this-online-game",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Ark Investment Management, led by Cathie Wood, continued to buy Tesla Inc. TSLA shares on Monday, even though the stock had already rebounded and outperformed the broader market. What Happened: Through its two ETFs, Ark Innovation ETF ARKK and ARK Next Generation Internet ETF ARKW, Ark bought 163,421 Tesla shares, valued at $28.21 million. Tesla ended the day up 1.05% to $172.63, while the S&P 500 fell 0.31%, according to Benzinga Pro data. This gain came despite a downgrade from Mizuho Securities‘ Vijay Rakesh, who switched the stock from Buy to Neutral due to concerns about the near-term electric vehicle market. Some Tesla bulls, including Gary Black, have also expressed concerns about a potentially weak first-quarter deliveries report. See Also: Best ETFs To Buy Right Now Last Friday, Ark purchased about $20 million worth of Tesla shares. The stock could see some volatility in the shortened trading week as traders anticipate the first-quarter deliveries, likely due on April 2nd. Other Major Buys: Ark also added to its holdings in some of its favorite stocks, including Roku, Inc. ROKU and Roblox Corp. RBLX and also accumulated more of Moderna, Inc. MRNA. They’ve been on a Moderna buying spree since March, anticipating upcoming catalysts for the COVID-19 vaccine maker. Here’s a breakdown of their other purchases: Ark’s flagship ARKK ETF closed Monday up 1.70% at $50.25. Read Next: 5 Technologies That Could Be Worth $220 Trillion By 2030, Cathie Wood’s ARK Predicts: ‘The Time Is Now’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}