{
    "title": "Tesla, a U.S. electric vehicle company that had been competing for \ndiscounts, suddenly announced a p.. - MK",
    "date": "3/18/2024",
    "url": "https://www.mk.co.kr/en/stock/10968303",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share Tesla, a U.S. electric vehicle company that had been competing for discounts, suddenly announced a price hike while Huawei entered the electric vehicle business after Xiaomi, the \"largest electric vehicle market\" in China, is drawing attention. Investors began buying low points in anticipation of an improvement in earnings. However, Tesla's stock price is expected to be affected by the market atmosphere as the overall New York Stock Exchange does not have a direction ahead of the Federal Reserve's (Fed) regular meeting on the 20th (local time). On the New York Stock Exchange on the 18th, Tesla's stock price rose 6.31% in a single day to close at $173.88 per share. Until the previous day, the company's stock price had plunged by 34% since the beginning of the year. The reason behind the rise in Tesla's stock price is the news that the company is raising the price of Model Y electric vehicles in the U.S. and Europe. The company announced on its website over the weekend that it would \"increase all Model Y prices in the United States by $1,000 starting April 1.\" In addition, Tesla plans to increase the price of electric vehicles by 2,000 euros in Europe. Currently, the price of the dual motor long-range Model Y in the U.S. starts at $49,000, which was $54,000 at the beginning of last year and $58,000 in mid-2022, before the discount competition began. Operating profit in the fourth quarter of last year plunged 47% year-on-year due to the company's full-fledged price discount last year. However, Gary Black, co-founder of Future Fund, who is famous as a Tesla investor, said, \"Tesla is now signaling that sales and profits are important, and it is expected that the price of electric vehicles will gradually increase in the future. If demand for Model Y purchases is advanced to March due to the announcement of the price increase in April, it will be beneficial to the first quarter of this year (January to March).\" Tesla is expected to announce its electric vehicle sales in the first quarter of this year around the 2nd of next month. Meanwhile, Fisker, a new electric vehicle company, saw its stock price plunge nearly 16% on the same day, as the U.S. electric vehicle company is facing a triple whammy of competition for low-priced Chinese cars, slowing global demand, and debt burden due to high interest rates. The impact comes as the company said it would issue up to $150 million in convertible bonds (CB) to pay interest debt while suspending electric vehicle production for six weeks due to factory operating costs. CB tends to be evaluated as a short-term negative factor in the stock market in that it is usually a means used when corporate financing is difficult. 2024-03-29 17:44:51 2024-03-28 14:43:55 2024-03-29 10:06:50 2024-03-28 08:35:39 2024-03-29 16:18:40 2024-03-28 22:06:01 2024-03-29 20:51:03 2024-03-28 18:05:38 2024-03-30 06:02:41 2024-03-29 09:51:58 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}