{
    "title": "Some Tesla owners are thinking about ditching their cars, stock, or \nCybertruck reservation after Elon Musk's ...",
    "date": "3/21/2024",
    "url": "https://ca.movies.yahoo.com/movies/tesla-owners-thinking-ditching-cars-190411868.html",
    "text": "Elon Musk's response to an antisemitic post has caused an uproar among some Tesla fans. Musk called a post accusing Jewish communities of hatred against white people the \"actual truth.\" Some Tesla owners and investors said they're looking to sell their cars and their stock over it. Some Tesla owners are sounding off after Elon Musk's latest online outburst that voiced support for an antisemitic tweet. Seven current and would-be Tesla owners reached out to Business Insider to say they are either actively planning or considering selling their vehicles or Tesla shares, or that they're done buying the brand after years of believing in Musk and his company. More Tesla owners voiced similar sentiments online. Musk responded to an antisemitic post and called it \"the actual truth\" on Wednesday. The post was from a user saying that \"Jewish communities\" were pushing \"hatred against whites,\" and western Jewish people specifically were supporting \"hordes of minorities\" who \"don't exactly like them too much.\" The sentiment echoes the \"great replacement\" conspiracy theory supported by many white supremacists who believe minority immigrants are replacing white populations in western countries. Musk's support of the post quickly drew backlash including threats of boycotting Tesla and a Facebook cofounder to all for his resignation. Even some of his most loyal supporters had strong reactions to his post. Many of them said the cars aren't the problem — Musk is. \"The car is brilliantly designed and incredibly functional,\" Peter, a 2022 Tesla Model 3 owner from Vermont who asked to only be mentioned by his first name, told Business Insider. \"However, until Musk leaves Tesla, I will not buy another of their products, and sadly I am considering selling my otherwise near perfect Model 3.\" Peter added that Musk is \"actively alienating his customers.\" He described Tesla customers as \"relatively liberal and centrist.\" Arthur Kulak told BI that he owns Tesla shares and is still deciding whether or not he should sell his stock in the company. He offered Musk some words of advice, \"keep your mouth shut.\" Tesla is set to have a delivery event for its long-awaited Cybertruck at the end of this month. Anticipation has been building and Cybertruck reservations have been made, but at least one person told BI that Musk's posts were enough to make him cancel his reservation. \"Elon makes it hard to want to buy a Tesla. Too bad,\" he said in an email. Tesla investor Ross Gerber, who held $74 million in Tesla stock as of this spring, said in a post on X that he plans to get rid of his Model Y in favor of Tesla competitor Rivian. Another \"livid and appalled\" Tesla owner told BI they've already spoken to their financial advisor about selling their Tesla stock after over 10 years volunteering and investing in the company. The Model Y owner, who asked to remain unnamed, said they've received messages from their family pleading with them to get rid of their car. Similar conversations spilled over to Reddit, where one user suggested Musk's time as the CEO of Tesla should come to an end soon. \"I think he's honestly had his run, and Tesla wouldn't crumble without him. I think it would be a very good thing in the long run to get him replaced,\" the Reddit post read. Online stock commentary site Citron Research, founded by Andrew Left, wrote a post from its official X account condemning Musk's stance. It's unclear if the account is personally run by Left, but the post explained a shift from admiration for Musk to call for \"accountability.\" As a former Musk critic turned supporter and Tesla owner, I once admired Elon Musk for his anti-establishment stance, particularly as a father of a son with Asperger's. However, my perspective has shifted drastically as he's now abandoned truth and started promoting falsehoods… — Citron Research (@CitronResearch) November 16, 2023 Are you a Tesla owner who's having second thoughts about your car after Elon Musk's latest tweets? We want to hear from you. Contact this reporter at jhart@businessinsider.com. Read the original article on Business Insider Money can't buy you happiness, but what about working with a financial advisor? Hollie AdamsAccording to London’s Metropolitan Police and social media footage, a pedicab burst into flames directly in front of Buckingham Palace on Saturday, leaving behind only charred, melted remains. Explosion and fire outside Buck Palace! pic.twitter.com/nUWojD8Ji8— Michael Wright (@Michael_HiFi) March 30, 2024 In video of the incident on X, captioned “Explosion and fire outside Buck Palace,” the pedicab can be heard cracking and popping as it burns, emitting billowing clouds of black smok 這款男性活力「超級配方」的一劑強效劑量就能消除虛弱……但令人驚訝的是它的作用原理。 “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by … The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences. Follow all the action from Stamford Bridge  I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. The Blues sit 11th in the Premier League table heading into the match SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x … Play this game for 1 minute and see why everyone is addicted. Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story.  Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action. Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset. ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said Improve grammar, word choice, and sentence structure everywhere you work. Write better with Grammarly. If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset. St Michael and All Angels Church in Tirley was \"marooned\" by water in January. The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t 連續13日閃購，PS5 Slim、Marshall、Switch OLED、AirPods Pro 2、DJI等人氣產品平到笑！ A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics. April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off A Dyson-rivaling hair dryer for just $30, a rare markdown on classic Levis and an Emeril-approved air fryer for $100-plus off await. "
}