{
    "title": "While Tesla's stock price has fallen more than 10% this month alone and \nrelated exchange-traded fund.. - MK",
    "date": "3/24/2024",
    "url": "https://www.mk.co.kr/en/stock/10973600",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share While Tesla's stock price has fallen more than 10% this month alone and related exchange-traded funds (ETFs) have also been suffering losses, Chinese electric vehicle ETFs are running fast. It is also reflected in the stock price as Chinese electric vehicle companies are rapidly eroding the global market due to low-cost attacks and improving profit prospects. However, the fact that Europe and the United States are tightening regulations on Chinese electric vehicles and signaling a counterattack is expected to serve as a variable. According to the Korea Exchange on the 25th, the KODEX China secondary battery MSCI ETF has risen 9.6% over the past month. It includes CATL, China's largest electric vehicle battery company, BYD, China's largest electric vehicle manufacturer, and EV Energy, a lithium battery company. The recent uptick is in contrast to a more than 14% decline over the past six months. The TIGER China Electric Vehicle SOLACTIVE ETF, which has a market capitalization of KRW 2 trillion, has also been on the rise by 8.7% in the past month. In particular, foreigners bought about 35 billion won a month, showing a buying advantage. This contrasts with the recent struggles of Tesla-related ETFs, the world's largest electric vehicle company. ACE Tesla Value Chain Active (-4.5%), TIGER Tesla Bond Mixing Fn (-3.9%), and KODEX Tesla Comprehensive Bond Mixing (-4.3%) ETF have been recording negative returns in the past month. The rebound in China's electric vehicle ETF is interpreted as reflecting expectations for improved profitability. According to DB Financial Investment, global electric vehicle sales rose 69% year-on-year to 1.1 million units in January this year. Among them, sales in China nearly doubled, accounting for 32% of all new car registrations. \"China's electric vehicles are a theme that has been rebounding little by little from the bottom of the long-term price momentum,\" said Seol Tae-hyun, a researcher at DB Financial Investment. \"In 2021, the 12-month leading PER went nearly 60 times, but now it is at 15 times, which has greatly lowered the valuation burden.\" Analysts say that the recent Chinese government's consumption promotion policy is also a boon to Chinese electric vehicle companies. Earlier, the Chinese government announced that it would pursue 'reincarnation' as its main policy at the two meetings, which closed on the 11th. The policy is to replace old consumer goods, including old cars, with new products. However, the global regulatory pressure over electric vehicles in China is a variable. Last year, exports of electric vehicles to China to Europe rose 53% year-on-year to 408,000 units. It accounts for one-third of China's electric vehicle exports. Among them, the European Union launched an anti-dumping tariff investigation on Chinese electric vehicles in September last year. Tesla was excluded from the investigation. The investigation is scheduled to be concluded in November, but countervailing tariffs are expected to be imposed as early as July. In the United States, checks on Chinese electric vehicles are continuing. Earlier on the 5th, the U.S. Republican Party proposed a uniform import tax of $20,000 on Chinese cars or a 100%p increase in tariff rates on Chinese-made cars, which are currently 25%. President Biden also ordered the U.S. Department of Commerce to investigate security threats from Chinese connected cars earlier this month. 2024-03-29 17:44:51 2024-03-28 14:43:55 2024-03-29 10:06:50 2024-03-28 08:35:39 2024-03-29 16:18:40 2024-03-28 22:06:01 2024-03-29 20:51:03 2024-03-28 18:05:38 2024-03-30 06:02:41 2024-03-29 09:51:58 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}