{
    "title": null,
    "date": "1/13/2024",
    "url": "https://inc42.com/buzz/tesla-firms-up-plans-for-30-bn-investments-to-set-up-base-in-india/",
    "text": "The $30 Bn in direct and indirect investments will primarily go towards establishing a manufacturing facility, a battery ecosystem, and other ancillary industries The Elon Musk-led company is said to be actively considering Haryana, Tamil Nadu, Maharashtra and Gujarat to set up a factory in India At the heart of Tesla’s hectic parlays is the burgeoning Indian EV market, which is projected to balloon to a size of $110 Bn by 2029 As talks with the Indian government progress further over setting up a plant in the country, EV automaker Tesla is reportedly open to committing nearly $30 Bn in direct and indirect investments in India over the course of the next five years. Sources told Hindustan Times that the company is in advanced talks to enter the Indian market, adding that the capital will primarily go towards establishing a manufacturing facility, a battery ecosystem, and ancillary industries. As per the report, Tesla’s India plan may include an immediate investment of $3 Bn to set up a unit to manufacture small cars for the developing world while a separate $15 Bn could be pumped into the battery ecosystem over a five-year period. Sources added that a $10 Bn commitment could also come from Tesla’s other partners to support the manufacturing plans. The Elon Musk-led company is said to be actively considering four major auto manufacturing hubs in the country for the potential facility – Haryana, Tamil Nadu, Maharashtra and Gujarat. While a plant in Haryana could help the company cater to the biggest car market in India (Delhi NCR), people familiar with the development reportedly said that Tesla could instead opt for a coastal state in the west or south given its export ambitions. As per the report, the company is also confident that it could build the entire factory from scratch within three years of entry and roll out its very first car in two years. The development comes amid reports that the Indian government is actively considering slashing import duties for a duration of up to five years to attract global EV makers to manufacture products in India. “India will consider providing incentives to all players in the EV sector. No company specific incentive will be given in any sector,” a senior government official told the publication. Meanwhile, the report said that if a new EV policy is brought in that meets Tesla’s demands for tax sops for foreign-made EVs, the company will kick off its India operations by bringing a limited number of models to the country. Alongside, the company intends to build a charging ecosystem and simultaneously invest in building a factory in India to roll out the first small car in two years. While the pricing structure of this small car has not been decided, it will be a cheaper model catering to emerging economies. As per the report, there will be a high degree of localisation at the potential factory that will cater partially to the Indian market and substantially to export markets. “… unlike Apple, Tesla brings everything in one go. Don’t think of Tesla as just an auto company. It is a tech company. It is a critical minerals mining and refining company. It makes its own semiconductors. It is a design company. It brings in a huge ecosystem. The spillover from this to other industries is enormous,” a person close to the company reportedly said. The pivot to India is part of the company’s wider diversification plan to move some of its production out of China amid ongoing geopolitical tensions between Washington and Beijing. The development comes at a time when the growing EV adoption in the country has garnered the attention of global automakers. From Taiwanese tech giant Acer licensing its brand to mobility startup eBikeGo in India to VinFast signing an MoU with the Tamil Nadu government to set up a plant in the state, a host of companies have made a beeline for India. In addition, giants such as Audi, BMW and Mercedes-Benz have also launched a slew of EV offerings to tap into the burgeoning Indian EV ecosystem and cater to the growing demand. Not just this, local EV juggernaut Ola Electric also filed its IPO papers with the markets regulator SEBI and is looking at a potential 2024 public listing. At the heart of this India push is the country’s burgeoning EV market, which is projected to balloon to a size of $110 Bn by 2029, as per a report. Become a Startup Insider in 2024 with Inc42 Plus. Join our exclusive community of 10,000+ founders, investors & operators and stay ahead in India’s startup & business economy. Unleash your potential by exploring unlimited articles, trackers, and playbooks. Identify the\nhottest startup deals, supercharge your innovation projects, and stay updated with expert\ncuration. Empower yourself with comprehensive playbooks, expert analysis, and invaluable insights. Learn\nto validate ideas, acquire customers, secure funding, and navigate the journey to startup\nsuccess. Access 75+ in-depth reports on frontier industries. Gain exclusive market intelligence,\nunderstand market landscapes, and decode emerging trends to make informed decisions. Stay ahead with startup and funding trackers. Analyse investment strategies, profile successful\ninvestors, and keep track of upcoming funds, accelerators, and more. Join a community of 10,000+ leaders & operators – unlock unlimited access to Inc42 stories,\nvideos, deals, member-only perks, and more. Unlock unlimited access to 500+ monthly new stories and Inc42’s complete archive of\n40,000+ stories. Unlock unlimited access to 500+ monthly new stories and Inc42’s complete archive of\n40,000+ stories. Over $250,000 worth deals on software & tools to help your business scale up. Network with industry leaders & operators with exclusive invites to Inc42’s\nmember-only virtual events Enjoy an ad-free and clutter-free\nexperience as a member, focus on\nwhat really matters to you Your contribution will go on to\nsupport and empower our unbiased\n& data-driven journalism Join 1000's of entrepreneurs, business leaders & makers and stay ahead with our sharp,\nincisive & data-driven analysis on India’s tech and startup economy! "
}