{
    "title": "Tesla To Add Cybertruck Rides To Boring Company Tunnel In Las Vegas",
    "date": "1/10/2024",
    "url": "https://www.carscoops.com/2024/01/tesla-to-add-cybertruck-rides-to-boring-company-tunnel-in-las-vegas/",
    "text": "A city official confirmed that the truck is coming to the tunnel transport system in the near future It looks like that the Tesla Cybertruck is not only making waves above ground with its unique design and innovative features but also preparing to make an impact below ground. According to a government official, it is set to become available for rides in The Boring Company’s underground tunnel in Las Vegas. The Vegas Loop, as it’s called, is a network of tunnels that connect multiple stations under Las Vegas. Originally, autonomous vehicles were meant to ferry passengers from station to station. Today, it exists instead with a human behind the wheel of a number of Tesla models. Now, the Cybertruck appears poised to enter the rotation. Back in late December, The Boring Company posted pictures of the Cybertruck in the tunnel system and at one of the stations. Then, on Monday, the city of Las Vegas itself posted a short clip of a Cybertruck entering the tunnel system. Neither Tesla nor The Boring Company has confirmed that the truck would be available for passenger rides though. More: Someone Rented Out A Tesla Cybertruck On Turo – And It Blacked Out Cybertruck sighting in the Vegas Loop 👀 @boringcompany @cybertruck pic.twitter.com/My5FTYlO4p  Las Vegas Convention and Visitors Authority President and CEO Steve Hill laid out the details though. “They’re going to use that truck in the system,” Hill told the Las Vegas Review-Journal. “It’s fun, but we think it’s got some real application. It’s a really useful vehicle, with the bed of a pickup truck being useful to move things around.” How much cargo hauling is required in the tunnel system is yet to be seen. What’s clear though is that these rides aren’t about to start happening immediately. “It has to be approved as a new vehicle in the system by the county and that hasn’t happened yet,” Hill said. “But I don’t anticipate that it would be long, since it’s an approved vehicle on the roads. But they have to go through that process to make it available in the system.” We expect Tesla or the Boring Company or both to make a statement once passengers can hop in a Cybertruck in the Vegas Loop.  Cybertruck in Vegas Loop pic.twitter.com/zVzJfcowCq Follow Carscoops on \n                                Google News "
}