{
    "title": "Elon Musk's $56 billion pay-package fight shows how modern CEOs see \nthemselves as kings of old",
    "date": "2/17/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240217261/elon-musks-56-billion-pay-package-fight-shows-how-modern-ceos-see-themselves-as-kings-of-old",
    "text": "By Katharina Pistor As some CEOs reach cult-like status, many are treated like royalty Rulers have always found it hard to accept limits on their power. When the French parliament disputed Louis XIV's edicts in 1655, the king of France and Navarre is said to have responded: \"L'état, c'est moi\" (\"I am the state\"). The ensuing age of absolutism in France ended only with the French Revolution in 1789. Like Louis XIV, Elon Musk rejects legal constraints on his power. In defiance of a recent Delaware Chancery Court ruling that voided his $56 billion compensation agreement with Tesla (TSLA), Musk wants to reincorporate the company in Texas, where he is hoping to find more accommodating courts. It is not the first time that Musk has sought to defy the Delaware court, which is the main venue for resolving most corporate law disputes in the United States (because most companies incorporate in Delaware). His hostility to the law and to binding legal agreements was on full display two years ago, when he tried to wriggle out of the deal to buy Twitter. Under court pressure, he eventually completed the transaction. In the Tesla case, a shareholder asked the court to review a compensation package that has made Musk one of the richest men on the planet by granting him equity stakes in the company when it meets ambitious performance targets. For each additional $50 billion (up to a total of $650 billion) increase in market capitalization, plus targets for revenue and earnings before interest, taxes, depreciation, and amortization (Ebitda), Musk would receive the option to purchase an additional 1% of the company's outstanding shares (up to 20 million shares) at a pre-fixed strike price. Delaware courts are typically reluctant to review board actions, and they never simply rule on the amount of pay granted to directors or officers. The only limit is \"corporate waste,\" which, as a former chancellor has quipped, is as rare as the Loch Ness monster. Delaware courts will scrutinize a company's decision-making process if a plaintiff has made the case that the process might have been influenced by conflicts of interest. Directors are supposed to serve as fiduciaries to all shareholders. But they ultimately enjoy significant leeway in running the company, as long as they avoid conflicts - or ensure that conflicts are healed - and as long as transactions are fair to the company and its shareholders. The proposal Tesla's directors put to the shareholders failed to inform them that the new compensation package differed significantly from previous ones. In Tesla's case, the board is plainly conflicted, because most of its members are Musk loyalists who owe their careers and much of their wealth to Musk and his various business entities. The board itself seems to have understood this, since it put the compensation plan before shareholders. But this maneuver can cleanse the decision of board members' conflicts only if shareholders are fully informed about all relevant aspects of the deal. That was not the case here. The proposal Tesla's directors put to the shareholders failed to inform them that the new compensation package differed significantly from previous ones; indeed, it did not even alert shareholders to the amount of compensation the package could entail. Meeting such basic requirements is not a tall order. These are the rules of the game for any publicly traded company. You might be a great soccer star, but you cannot score a goal if you are offside. In this case, the board decided to play entirely on Musk's side, with the directors defending their abdication of their fiduciary duties by hailing him as a superstar. Musk and his lickspittles are not alone, of course. In recent decades, a broader cult has emerged around the figure of the CEO. Many are treated like the kings of old, and it is increasingly taken for granted that their perks and compensation packages should amount to whatever it takes to keep them happy. Often, these pay packages are not even related to performance. Instead, they reflect windfall profits following changes in world markets. But while the performance may not always be real, the impact on inequality certainly is. Still, most CEOs want to be seen as playing by the rules, and thus will comply with a court order if they are unable to settle a case with a plaintiff beforehand. Musk's open defiance of the law is of a different quality, and he may well get away with it. The U.S. legal system has long endorsed the idea that private actors can pick and choose the laws by which they wish to be governed without facing any limits on their ability to do business wherever they want. Centuries after absolutist monarchy's demise in much of the world, its heirs are back. Read: Can Elon Musk do 'whatever he wants'? Why moving Tesla out of Delaware may spook investors. This freedom is comparable to a diplomatic passport that opens doors everywhere without visa requirements. Like diplomats, corporations are largely immune from local jurisdiction; but unlike diplomats, they are difficult to get rid of, not least because they can sue their host governments for allegedly unfair or inequitable actions. Some observers have even called corporations lawmakers in their own right. Because they can opt into or out of different legal systems depending on their needs - or, as in Musk's case, their personal whims - they effectively make the laws that supposedly constrain them. The law is whatever they want it to be. Centuries after the demise of absolutist monarchies in much of the world, its heirs are back, surrounded by legions of white-shoe lawyers, ruling as the supreme leaders of quasi-sovereign corporate empires. Katharina Pistor, professor of comparative law at Columbia Law School, is the author of The Code of Capital: How the Law Creates Wealth and Inequality (Princeton University Press, 2019). This commentary was published with the permission of Project Syndicate - Elon Musk and the Absolutist Revival More: Tesla investors should think twice about Elon Musk's plan to reincorporate in Texas Also read: Nullification of Elon Musk's $56 billion pay package could be a wakeup call for corporate boards -Katharina Pistor This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 02-17-24 1002ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}