{
    "title": "Will Tesla Stock Split In 2024?",
    "date": "2/22/2024",
    "url": "https://www.forbes.com/sites/investor-hub/article/will-tesla-tsla-stock-split-2024/",
    "text": "© 2023 Bloomberg Finance LP Many investors wonder if the electric car maker’s stock will split this year. Here’s an analysis of whether this is a likely scenario to occur in 2024. In 2022, Tesla\nTSLA\n announced a plan to split its stock for the second time in as many years. Some investors are wondering if the two-year split cadence will repeat itself in 2024. Below we'll look at Tesla's stock split history, share price considerations and other factors to assess the likelihood of a split this year. We'll also cover the short- and long-term implications if Tesla does multiply its outstanding share count in 2024. Let's start with some context, including Tesla's split history and how the stock price responded to those transactions in the short-term. Tesla stock has split twice previously. The first was a five-for-one exchange on August 31, 2020. Two years later, on August 25, 2022, the company implemented a three-for-one split. Stock splits are superficial in that they don't change a company's market value. They instead reallocate that value into a different number of shares. Still, a split can affect the prevailing sentiment on a stock. For example, some see a stock split as a signal that the leadership team is bullish. Another theory is that splits make stocks more attractive to a wider investor base by lowering the share price. Both views imply that splits can indirectly increase a company's value and, in turn, raise share prices over time. With respect to Tesla, however, the numbers don't show an obvious and immediate uptick. See the table below, which shows how Tesla stock moved before and after each of its two prior splits. For context, the corresponding changes in the Nasdaq-100 and the S&P 500 are also included. The percentages are calculated from adjusted stock prices, so the effect of the split itself is eliminated. You can see that both post-split timeframes were tough for TSLA and the two indexes. You can also conclude that Tesla was more volatile in these timeframes than the indexes. And finally, in these two cases, Tesla investors seemed more excited about the stock splits before they happened vs. after. The brain trust at Forbes has run the numbers, conducted the research, and done the analysis to come up with some of the best places for you to make money in 2024. Download one of Forbes' most popular and widely anticipated reports, 12 Best Stocks To Buy for 2024. Leadership teams typically pursue stock splits to manage the share price and to promote the liquidity and accessibility of the stock. Before Tesla split in 2020, the stock was trading in the range of $2,200. After the five-for-one exchange, the share price dipped down to about $440. In 2022, the three-for-one split shifted the price of TSLA from $900 down to $300. Today, TSLA trades around $200 per share. That's lower than the post-split price on the stock in 2022, so a split now seems improbable. The question is, at what share price will Tesla's leaders start thinking about the next split? As Tesla grows and matures, the company will get more aggressive about split points. So, you would expect another split to occur well before TSLA hits $900. Given the details of the two previous splits, a two-for-one exchange when the share price exceeds $350 would make sense. The common end-goal of holding share prices low through splits is to improve the stock's liquidity and accessibility. A stock's liquidity relates to how easily it can be bought and sold. This is a function of demand; if many investors are willing to buy, selling investors can liquidate their shares quickly. For exchange-traded stocks like TSLA, accessibility is driven primarily by the share price. Few retail investors, for example, can afford a single share of Berkshire-Hathaway (BRK.A), which costs more than $600,000. But many individuals can afford, say, $100 or $200 for a piece of Tesla. Tesla hasn't targeted a $100 share price yet, but that could change as the company matures. If that were the goal today, Tesla could make it happen with a two-for-one split in 2024. Stop chasing shadows in the market. Forbes' expert analysts have pinpointed the 12 superstars poised to ignite returns in 2024. Don't miss out—download 12 Best Stocks To Buy For 2024 and claim your front-row seat to the coming boom. So, what would happen if Tesla split its stock this year? Let's touch on the short-term and long-term implications. Stock split plans generate buzz, which can drive share prices up in the short-term. Unfortunately, share price gains driven by buzz alone often don't last, especially for volatile stocks like Tesla. As an example, Tesla announced its 2022 split in March. Shareholders approved the split in August and the transaction was implemented later that month. Between March and August, Tesla's share price rose, fell and recovered—finishing out August with a slight gain. Should that volatility repeat when Tesla announces its next split, there will be opportunity for the savviest short-term traders. Looking beyond the immediate term, there is some empirical evidence that split stocks tend to outperform the market for one to three years following the change. This is largely due to investor perception vs. fundamental business improvements, so it can be fleeting. Tesla did perform well in the three years following the 2020 split but has lagged the market since its 2022 split. Longer-term, Tesla should benefit from holding its share price low. But that benefit only applies if the business continues delivering acceptable shareholder returns. To that end, Tesla is entering an interesting period in its evolution. The company has lowered its prices in recent years to stimulate demand. That's putting pressure on margins and profitability just as Tesla's EV competition is on the rise. CEO Elon Musk personally creates another layer of challenge for the company. While Musk is credited with masterminding Tesla's growth to date, he has a history of creating negative headlines and distractions. Most recently, reports have surfaced alleging illegal drug use by Musk and Tesla board members. With those moving pieces in play, a stock split isn't going to make or break Tesla long term. More important will be the company's ability to manage through increased competition, lower margins and the drug-use scandal in 2024. I don't see Tesla stock splitting this year. The share price is about 30% lower now than it was after the 2022 split. That negates any argument about keeping the share price affordable, since the stock has done that on its own. If TSLA were expected to rise some 75% to the mid-$300s this year, the story would be different. In that case, you'd see Tesla on lists of the best stocks for 2024 and split conversations would be ongoing. Unfortunately, most analysts aren't predicting that kind of growth. According to Yahoo Finance, the TSLA price targets range from $22.57 to $320.06. The average is $192.73, which represents a slight decrease from the current share price of $199.95. Tesla's outlook could change for the better if the company’s newly launched Cybertruck makes a big splash. Tesla began delivering the new model in November 2023 with a starting price point of $81,000. The truck is reported to have a towing capacity of 11,000 pounds and a range of 340 miles per charge. Tesla also has growing opportunity in its energy generation and storage business, which quadrupled its sales in 2023. That growth doesn't exactly position Tesla among the best energy stocks, but it's a nice source of revenue diversification. Tesla has split its stock twice in company history. While some believe the EV-maker is due for a third split in 2024, that probably won't happen unless the share price rises significantly from where it is now.   The brain trust at Forbes has run the numbers, conducted the research, and done the analysis to come up with some of the best places for you to make money in 2024. Download one of Forbes' most popular and widely anticipated reports, 12 Best Stocks To Buy for 2024.  "
}