{
    "title": "Ashneer Grover shares pic of Tesla car in Delhi, users react",
    "date": "2/4/2024",
    "url": "https://kalingatv.com/automobile/ashneer-grover-shares-pic-of-cross-breed-tesla-car-in-delhi-users-react/",
    "text": "Publisher - New Delhi: BharatPe’s former MD Ashneer Grover has shared a picture of the first “cross-breed” Tesla car in Delhi on the social media platform X. According to the entrepreneur post, the car, a BYD (Build Your Dreams) Atto 3 in Boulder Grey, was spotted in Karol Bagh and has the word “Tesla” on its back. “World’s first ‘cross-breed’ Tesla! Some Delhi boy literally ‘built his dream’ in Karol Bagh @Tesla,” Grover wrote on Saturday. Since being shared, his post has received over two lakh views and more than four thousand likes on X. Reacting to his post, several users shared their thoughts. “Karol Bagh has the answer to everything. Nirvana stays here,” a user wrote. “After looking at this, Elon will set up his Indian plant in Karol Bagh Delhi,” another user said. One more user mentioned, “We are Indians, Sir. We can make our dreams come true in any way”. The BYD Atto 3 is an electric SUV manufactured by BYD Auto. The price begins at Rs 33,99,000. In December last year, a Tesla Model X sports utility vehicle (SUV) was sighted on a road in Bengaluru, and pictures of it quickly went viral on social media. A red-coloured Model X was spotted on Minsk Square near the Cubbon Park metro station, and two separate photos were shared on X — one with the car halted at the traffic signal, the other on the move. 2024 Bajaj Pulsar NS125 spotted testing in new spy shots Honda recalls Goldwing and CBR1000RR motorcycles in India; Know why Skoda Superb expected to relaunch in early April 2024, will be a CBU unit Suzuki V-Strom 800DE launched in India, gets an introductory price of Rs 10.30 lakh Your email address will not be published.     Save my name, email, and website in this browser for the next time I comment.   Δ TRENDING POSTS Lok Sabha Elections 2024: BJP announces 8th candidates list The mystery of Kailash Mountain. Why has no one ever reached… Odisha: Former Minister Surendra Singh Bhoi quits Congress… Sundargarh: Man stabs brother-in-law to death, arrested Uttar Pradesh: Mukhtar Ansari dies after suffering heart… Career News SSC JE Recruitment 2024: Apply for 968 vacancies, details… IBPS Recruitment 2024: Notification out for various posts,… NPCIL Recruitment 2024: Notification released for 335 Trade… Pawan Hans recruitment 2024: Vacancy out for 50 Associate… UPSC Recruitment 2024: Vacancy out for 147 Assistant… Kalinga TV a 24-hour Odia news channel is part of Kalinga Media & Entertainment Pvt. Ltd. was founded by philanthropist and educationist Dr. Achyuta Samanta with Mr. Himansu Sekhar Khatua, the noted film maker at it’s helm as the Managing Director. "
}