{
    "title": "It's Time! 3 Overvalued EV Stocks to Sell in February",
    "date": "2/25/2024",
    "url": "https://finance.yahoo.com/news/time-3-overvalued-ev-stocks-141300408.html",
    "text": "Many electric vehicle stocks rallied in 2020 and 2021 as investors got excited about the industry gaining market share. While some stocks appreciated due to strong financials, other EV stocks soared just because they had something to do with electric vehicles. This has led to some overvalued EV stocks that you should probably drop soon. Many electric vehicle stocks have lofty valuations, and some of these same stocks don’t have much revenue or profits to show for their efforts. These are some of the overvalued EV stocks you should offload before the losses continue. Source: Roschetzky Photography / Shutterstock.com Tesla (NASDAQ:TSLA) has been the leader of the EV revolution. High-profit margins that exceed what you would expect from an automobile company and strong revenue growth fueled the rally. InvestorPlace - Stock Market News, Stock Advice & Trading Tips Shares are up by 920% over the past five years but they have dropped 20% of their value year-to-date. The stock is also flat over the past year. Investors are concerned about the company’s missing revenue and EPS expectations for the fourth quarter of 2023. A warning about a sales slowdown also sparked concerns and put the valuation in the spotlight. The equity currently has a 57 forward P/E ratio which is a bit much for a company that makes most of its revenue from car sales. Tesla was a $1 trillion company, but is now down by roughly 50% from its all-time high. Investors should expect more of the same given slower sales and Chinese EV manufacturers outselling Tesla in the world’s largest country. Source: T. Schneider / Shutterstock.com Tesla has revenue growth and profits, while Plug Power (NASDAQ:PLUG) currently has neither. Shares have more than doubled over the past five years in a true roller coaster for long-term investors. The stock’s one-year 74% drop highlights how quickly fortunes can change. The firm is developing hydrogen fuel cell systems and hopes that this technology can replace conventional batteries in electric vehicles. While the company has exhibited high revenue growth in the past, the latest quarter showed a dramatic regression. The company’s net sales only increased by 5% year-over-year in the third quarter of 2023. Gross margins got worse and reached negative 69% for the quarter. Plug Power burned through $283 million during the quarter and is likely to burn through more cash. Plug Power’s inability to make a profit and muted growth have tempered expectations and brought the company back to penny stock status. Barring a miraculous switch to profitability or a meme stock rally, Plug Power is likely to stay at this level. Source: Stephanie L Sanchez / Shutterstock.com The beleaguered EV stock has faced controversies for years. The company soared in value after becoming publicly traded through a SPAC merger. However, scandals and net losses resulted in a well-deserved collapse. Nikola’s (NASDAQ:NKLA) market cap fell below $1 billion and may soon get removed from the NASDAQ market. That’s because the stock currently trades below $1/share. The company pitches itself as a producer of commercial vehicles that run on electricity but hasn’t done much for shareholders in the long run. Nikola’s third-quarter results further highlight a company on the brink of extinction. The first bullet point states the following: “During Q3 raised $250M, increasing unrestricted cash by $136.2M, and tripling unrestricted cash since Q1 2023.” When I look at press releases, I want to see that first bullet point talk about revenue growth, net income growth, or meaningful expansion into a promising vertical. Nikola is in survival mode, and its third-quarter press release further highlights this fact. While the cracks within Nikola’s growth story should feel obvious to the people following this stock, it still has a market cap close to $1 billion for some reason. I don’t expect this company to be around for much longer. On the date of publication, Marc Guberti did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Marc Guberti is a finance freelance writer at InvestorPlace.com who hosts the Breakthrough Success Podcast. He has contributed to several publications, including the U.S. News & World Report, Benzinga, and Joy Wallet. The #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now. The post Itâ\u0080\u0099s Time! 3 Overvalued EV Stocks to Sell in February appeared first on InvestorPlace. Related Quotes "
}