{
    "title": "Tesla (NASDAQ:TSLA) Trading Down 2.2% After Analyst Downgrade",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/30/tesla-nasdaqtsla-trading-down-2-2-after-analyst-downgrade.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Tesla, Inc. (NASDAQ:TSLA – Get Free Report)’s share price fell 2.2% during trading on Friday after Deutsche Bank Aktiengesellschaft lowered their price target on the stock from $218.00 to $200.00. Deutsche Bank Aktiengesellschaft currently has a buy rating on the stock. Tesla traded as low as $175.30 and last traded at $175.79. 77,654,838 shares changed hands during trading, a decline of 19% from the average session volume of 95,391,528 shares. The stock had previously closed at $179.83. TSLA has been the subject of a number of other research reports. Edward Jones downgraded shares of Tesla from a “buy” rating to a “hold” rating in a report on Friday, January 26th. Mizuho  reissued a “neutral” rating and issued a $195.00 price objective (down from $270.00) on shares of Tesla in a research note on Monday, March 25th. China Renaissance initiated coverage on shares of Tesla in a research note on Monday, February 26th. They issued a “hold” rating on the stock. Royal Bank of Canada  reaffirmed an “outperform” rating and set a $298.00 price target on shares of Tesla in a research note on Wednesday. Finally, UBS Group decreased their target price on shares of Tesla from $225.00 to $165.00 and set a “neutral” rating on the stock in a research report on Thursday, March 14th. Ten investment analysts have rated the stock with a sell rating, fifteen have issued  a hold rating and eight have given a buy rating to the stock. According to MarketBeat, the stock currently has a consensus rating of “Hold” and a consensus target price of $204.63. View Our Latest Research Report on Tesla In related news, SVP Xiaotong Zhu sold 687 shares of the firm’s stock in a transaction on Wednesday, March 6th. The stock was sold at an average price of $177.11, for a total transaction of $121,674.57. Following the completion of the sale, the senior vice president now directly owns 63,171 shares of the company’s stock, valued at approximately $11,188,215.81. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available at the SEC website. In other news, SVP Andrew D. Baglino sold 10,500 shares of the firm’s stock in a transaction on Thursday, February 29th. The stock was sold at an average price of $204.17, for a total value of $2,143,785.00. Following the transaction, the senior vice president now directly owns 31,230 shares in the company, valued at approximately $6,376,229.10. The transaction was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, SVP Xiaotong Zhu sold 687 shares of the firm’s stock in a transaction on Wednesday, March 6th. The stock was sold at an average price of $177.11, for a total value of $121,674.57. Following the completion of the transaction, the senior vice president now owns 63,171 shares in the company, valued at $11,188,215.81. The disclosure for this sale can be found here. Insiders sold 198,598 shares of company stock valued at $36,952,434 in the last three months. Corporate insiders own  25.10% of the company’s stock. Several hedge funds have recently added to or reduced their stakes in the business. Vanguard Group Inc. raised its stake in  Tesla by 1.7% during the 4th quarter. Vanguard Group Inc. now owns 229,806,372 shares of the electric vehicle producer’s stock worth $57,102,287,000 after buying an additional 3,866,361 shares during the period.  State Street Corp raised its stake in shares of  Tesla by 4.4% in the 2nd quarter. State Street Corp now owns 104,115,390 shares of the electric vehicle producer’s stock valued at $27,254,286,000 after purchasing an additional 4,431,570 shares during the period.  Norges Bank acquired a new stake in shares of  Tesla in the 4th quarter valued at about $7,844,757,000.  Morgan Stanley raised its stake in shares of  Tesla by 7.8% in the 3rd quarter. Morgan Stanley now owns 30,160,747 shares of the electric vehicle producer’s stock valued at $7,546,823,000 after purchasing an additional 2,177,397 shares during the period.  Finally, FMR LLC raised its stake in shares of  Tesla by 0.9% in the 3rd quarter. FMR LLC now owns 29,040,734 shares of the electric vehicle producer’s stock valued at $7,266,572,000 after purchasing an additional 269,182 shares during the period. Institutional investors and hedge funds own  66.20% of the company’s stock. The company has a 50 day simple moving average of $187.05 and a 200-day simple moving average of $221.74. The stock has a market cap of $559.85 billion, a price-to-earnings ratio of 40.79, a P/E/G ratio of 4.06 and a beta of 2.41. The company has a current ratio of 1.73, a quick ratio of 1.25 and a debt-to-equity ratio of 0.05. Tesla (NASDAQ:TSLA – Get Free Report) last released its quarterly earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share (EPS) for the quarter, missing the consensus estimate of $0.74 by ($0.03). The firm had revenue of $25.17 billion during the quarter, compared to analyst estimates of $25.64 billion. Tesla had a net margin of 15.50% and a return on equity of 16.62%. The business’s revenue for the quarter was up 3.5% compared to the same quarter last year. During the same period in the prior year, the business earned $1.07 EPS.  Research analysts expect that  Tesla, Inc. will post 2.44 EPS for the current year. (Get Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.  Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter. Liberty Broadband (NASDAQ:LBRDP) Trading 0.4% Higher  Following Dividend Announcement "
}