{
    "title": "Tesla's German plant hits 4,000 cars per week ahead of schedule",
    "date": "3/6/2024",
    "url": "https://ca.movies.yahoo.com/movies/teslas-german-plant-hits-4-082923807.html",
    "text": "By Victoria Waldersee BERLIN (Reuters) -Tesla's German plant in Brandenburg near Berlin is now producing 4,000 cars per week, the company said on Monday, quadrupling from May when Chief Executive Elon Musk had compared investment in Tesla's new plants to \"gigantic money furnaces.\" The Berlin plant hit the production target three weeks ahead of a production schedule reviewed by Reuters. Shares of Tesla were up 4% at $204.93 on Monday. At its new weekly output, Tesla's plant in Germany would have annual output of over 200,000 vehicles. The maximum capacity planned for the Brandenburg plant is 500,000 cars a year, nearing 10,000 per week, the company has said. Output from the plant in Germany is now a third of the Model Y output in Shanghai, where Tesla planned to keep an average total output of 13,000 Model Ys per week - around 1,000 below maximum capacity - and a further 7,000 Model 3s in February and March, according to the production plan. Tesla was planning to ramp up output from Brandenburg to 4,000 in the week of March 13 and to more than 5,000 by the end of June. It hit production of 2,000 units per week in October last year and 3,000 per week in December. The Brandenburg plant started operations in March but was initially slow to get going. In a May interview, Musk described Tesla's newest plants in Germany and Austin as \"gigantic money furnaces\" due to the challenges of increasing production. The ramp up in output in Germany would allow Tesla to use a larger share of its Shanghai production for markets outside Europe, including Thailand, where it has just launched sales. Tesla has also begun assembling batteries in Germany that will soon be used in vehicles produced at the plant, but said last week it would focus cell production in the U.S. in light of Inflation Reduction Act incentives. The U.S. electric-vehicle maker is also preparing to produce cell components such as electrodes, some of which will be sent from its site in Gruenheide in the state of Brandenburg to the United States, Tesla said on Wednesday. Tesla is due to update analysts on its strategy on Wednesday when the company has its investor day. (Reporting by Victoria Waldersee and Zhang Yan; Editing by Friederike Heine and Bernadette Baum) Money can't buy you happiness, but what about working with a financial advisor? “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by …  The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences. Follow all the action from Stamford Bridge I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” The Blues sit 11th in the Premier League table heading into the match SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x … Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag  In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story. Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action.  Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset. ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset.  St Michael and All Angels Church in Tirley was \"marooned\" by water in January. The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics.  April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off A Dyson-rivaling hair dryer for just $30, a rare markdown on classic Levis and an Emeril-approved air fryer for $100-plus off await. In recent weeks, \"The View\" moderator Whoopi Goldberg has opened up about her use of the weight loss drug Mounjaro, a Type 2 Diabetes medication. "
}