{
    "title": "Tesla shares could fall 23 percent, according to bank Wells Fargo",
    "date": "3/16/2024",
    "url": "https://www.breakinglatest.news/business/tesla-shares-could-fall-23-percent-according-to-bank-wells-fargo/",
    "text": " Experts see a big risk with Tesla. Associated Press Tesla is a “non-growth growth company,” Wells Fargo said in a statement. The bank downgraded its rating on the automaker and lowered its price target on the stock. Wells Fargo analysts said the company is facing increasing headwinds. This is a machine translation of an article from our US colleagues at Business Insider. It was automatically translated and checked by a real editor. Tesla currently looks like a “growth company without growth.” The stock could see a double-digit decline, reflecting increasing headwinds to sales and earnings, analysts at Wells Fargo wrote this week. In a statement on Wednesday, the bank downgraded its rating on Tesla from “neutral” to “underweight” and lowered its price target for the stock from $200 (about 183 euros) to 125 dollars (about 115 euros) per share. That represents a decline of about 23 percent from Thursday afternoon’s level, when the stock was trading at $163.09 (approximately 150 euros) at 1:57 p.m. ET. Read too The secret behind the attack on Tesla: Terrorist group active for ten years, but investigators know little about them Wells Fargo analysts pointed to a growing number of challenges facing the electric vehicle maker. Wall Street strategists warned that demand for electric vehicles will weaken in 2024. This means that Tesla must decide whether it will further reduce the prices of its vehicles in order to remain competitive and outdo rivals such as BYD from China and legacy US automakers. “We see downside risk to volume as price cuts have a diminishing effect. We see headwinds from disappointing deliveries and further price cuts, which will likely result in negative EPS revisions,” Wells Fargo analysts said in their note. The bank’s outlook suggests Tesla’s earnings per share will be 32 percent below Wall Street estimates in 2024 and 52 percent below consensus estimates in 2025. Meanwhile, Tesla’s expected launch of the lower-priced Model 2 may disappoint investors as the vehicle’s profitability is low and the timing of the launch appears to be “rushed.” Read too Tesla could prevent its stock from crashing by replacing Musk as CEO, an investor says The electric car manufacturer still has a few good arguments. Tesla appears to be “forward-thinking” when it comes to production, analysts said. The company has the potential to achieve a cost advantage if it continues to develop so-called unboxed production methods to reduce costs. If the Dojo autonomous driving technology and supercomputer are successful, the company could “take a big lead in autonomy,” the Wells Fargo team continued. Tesla shares got off to a bad start in the first quarter and fell 34 percent compared to January. The company slightly missed fourth-quarter revenue forecasts, taking in $25.17 billion (about 23 billion euros) in the most recent reporting period. Disclaimer: Stocks and other investments generally involve risk. A total loss of the capital invested cannot be ruled out. The articles, data and forecasts published are not a solicitation to buy or sell securities or rights. They also do not replace professional advice. Do you have a contentpass subscription but still don’t want to miss out on displaying external content from third-party providers? Then click on “agree” and we will integrate external content and services from selected third-party providers into our offer to improve your user experience. You can view a current list of these third parties at any time in your privacy (link to privacy). In this context, usage profiles (including based on cookie IDs) can also be created and enriched, even outside the EEA. In this case, your consent also includes the transfer of certain personal data to third countries, including the USA in accordance with Article 49 Paragraph 1 Letter a) GDPR. Further details on data processing can be found in our data protection information and privacy policy, which are available at any time in the footer of our offer. You can exercise your consent to the integration of external content at any time in the footer of our offer via the “Revocation Tracking” link. Agree and view external content     Save my name, email, and website in this browser for the next time I comment.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com Hosted by Byohosting - Most Recommended Web Hosting - for complains, abuse, advertising contact:o f f i c e @byohosting.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More "
}