{
    "title": "TESLA INC. DL -,001 Trade Ideas — HAN:TL0 — TradingView",
    "date": "3/23/2024",
    "url": "https://www.tradingview.com/symbols/HAN-TL0/ideas/page-42/?sort=recent",
    "text": "This is not trading or Financial advice. I was asked to provide and update. I'm in the btd camp.\n\nThere is a bearish cypher,  we also have a potential double bottom. I need to see a close above (B) of the bearish cypher. im  Also monitoring volume in yellow box below. It's in an apex and looking to breakout.. if no position already established then I highly... Update Tesla 10/11\nAfter the revenue report, Tesla dropped sharply according to the reported information, now there is a green cloud appearing, we buy up to the target of 255.\nstop loss at 196, the risk ratio is not high so go with small volume Market makers are going to sweep sell-side liquidity from the October swing low before the rally takes off to new all-time highs. You can see the divergence forming in the RSI on all the low-timeframe charts under the daily. The MACD is printing smaller red bars and is near its extreme oversold conditions. Earnings next week will set the stage for a massive rally.... pattern looks bullish \nhead an shoulders to the up side TSLA has been setting up for a potential rally to test upper 200s, but first it will see sharp downside to 218-223 (point target 220) by 12/13/2023.\n\n- Needs to stay under 239.88 for this to playout, otherwise it can bounce to 260s\n- If makes sustained TSLA break below 220 then there is downside continuation risk to 180s\n\n- Look at this large down channel! if we see a lower low, we can spect a 150 value for the next months The weekly cycle on  NASDAQ:TSLA   is not over yet. We have had 5 days (12.01) out of 6 of its minimum duration (a weekly cycle can last from 6 to 11 days). \n\nUnless from Monday we see a strong push back up that will develop a weekly Hybrid cycle of 12 days (H cycles' are seldom ones), we are expecting a further downtrend. \n\nSuch situation might be in place for... Price first go up cross zone1 then there will be a quick upside in zone2, 300 as a good target. Analyst consensus also has Tesla delivering 2.1 million vehicles in 2024. Auto gross profit margins, excluding regulatory credits, should come in at 16.5%, according to FactSet.\n\nWall Street's profit revisions for TSLA come as Tesla's EV business is facing increased competition outside the U.S., potential demand woes, falling margins and the loss of tax credits... This analysis combines some of the theories in Gann Analysis and the Ichimoku Kinko Hyo system.  \n\n Outlook:  Extremely high probability of a bottom developing soon around the $208 value area and then returning higher to the $244 value area.\n\n Gann And Ichimoku Analysis \n\nThere is a square of price and time in Gann's Square of 9 on the date of January 16 and the... As price hit support area and downside leg of triangle expect to rise pls like for support thank you Tesla has turned oversold on its 1D technical outlook (RSI = 27.952, MACD = -6.270, ADX = 56.430) and crossed under the 1W MA200 for the first time since October 30th. Even though further decline up until the Fed Meeting (January 31st) is possible, on a wider perspective, this is a long term buy opportunity in disguise.\n\nWhy? Because the stock's Channel Down since... 🔴 Resistance - 218 🔴\n🚀 Target - 222 - 227 🚀\n\n🟢 Support - 214 🟢\n🚀Target - 208 - 204 🚀\n\n🔥🔥 Levels Works Best on 5 Minutes Time Frame 🔥🔥\n\n❤️❤️ MARKET SECRET ❤️❤️👇\n\n1. TRADE WHAT YOU SEE NOT WHAT YOU ASSUME\n\n2. FOLLOW THE TREND BECAUSE TREND IS YOUR ONLY FRIEND\n\n3. CHART IS SUPREME\n\n4. YOUR ASSUMPTION & EMOTIONS HAS NO VALUE IN THE MARKET\n\nOur motto is to help each... TSLA shares have lost their most important support level, around $230, and we are getting close to our next support, around $206, and such a move was detailed in our last public analysis, the link to which is below this post, as always.\n\nAs we can see, TSLA shares have consistently failed to react around their support levels, showing great weakness, and so far, we... 195 would be full retracement from previous low, the trend line from there looks even worse When was the last time #TSLA closed below the lower BB for 5 consecutive days? September 2016. The stock needed 3 more months to finally turn the corner 👀 This one suggests the weekly signal will be wiped out, judging by the monthly setup, and the coming Cybertruck event, I think it's likely ok to buy here and front run the monthly signal that might trigger next month (which could also form a larger quarterly trend and point to a rally towards $900 over time too)\n\nI suggest to buy a position here if you own no ... Did we finally bottom in this move down? Is it just the a wave or the entire abc? These are the questions I find myself asking this morning. I think this has all been wave a as I have said in previous posts due to MACD, but we don't have confirmation yet. We have hit with-in the target box, hit the 1.0 fib, and made a new low on positive divergence. These are all... Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}