{
    "title": "Along with Tesla's stock price, which has been on a downward trend this \nyear, the exchange-traded fu.. - MK",
    "date": "3/24/2024",
    "url": "https://www.mk.co.kr/en/stock/10973597",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share Along with Tesla's stock price, which has been on a downward trend this year, the exchange-traded fund (ETF), which follows Tesla's stock price, is also sluggish. According to the Korea Exchange on the 25th, there are four ETFs that invest Tesla as underlying assets. Among them, the \"ACE Tesla Value Chain Active\" ETF has fallen 16% so far this year. \"TIGER Tesla Bond Mixed Fn\" is also negative by 9%. However, \"KODEX Tesla Value Chain FactSet\" rose 6%, which benefited from including the share of the components in the order of Nvidia (18.11%) and Tesla (16.71%). Tesla, which had ranked first in net purchases of Seohak Ant earlier this year, has now fallen to seventh place. According to the Korea Securities Depository, Tesla was the seventh-largest net buyer of Western Studies ants, shrinking to $93 million this month after posting net purchases in January (US$327 million) and February (US$338 million). Nvidia (380 million dollars) was definitely the top net buyer of Seohak Ant this month due to the artificial intelligence (AI) semiconductor craze. Tesla's stock price fell 14.4% from $201.88 at the end of last month to $172.82 on the 21st of this month. Compared to the end of last year ($248.48), the figure is down more than 30%. In fact, the situation at Tesla shows no signs of improvement. According to Bloomberg on the 24th (local time), Tesla has started reducing electric vehicle production at its Shanghai plant in China. Currently, the Shanghai plant produces the Model Y and Model 3 mainly, and produces both domestic and export products. The plan is to control production by reducing employee work to five days a week at this factory, which used to be applied with the six-week general work system. Tesla started to cut prices in China earlier this year, but only shipped 60,000 units from its Shanghai factory in February. The figure is down nearly 20% from 74,400 units shipped in February last year. Compared to 71,400 units in January this year, it is down 16%. Investment opinions of U.S. investment banks are also negative. Wells Fargo lowered its investment opinion on Tesla from \"market weight\" to \"underweight,\" a de facto selling opinion, and drastically cut its target price from $200 to $125. 2024-03-29 17:44:51 2024-03-28 14:43:55 2024-03-29 10:06:50 2024-03-28 08:35:39 2024-03-29 16:18:40 2024-03-28 22:06:01 2024-03-29 20:51:03 2024-03-28 18:05:38 2024-03-30 06:02:41 2024-03-29 09:51:58 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}