{
    "title": "Tesla Q1 Worries Mount, Fisker's Pricing Ploy To Stay Alive, Nikola Stock \nSoars By 57% And More: Biggest",
    "date": "3/30/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/38012902/tesla-q1-worries-mount-fisker-pricing-ploy-to-stay-alive-nikola-stock-soars-by-57-and-more-bigge",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Despite the broader market finishing at a record high, the mood in the electric vehicle space continued to be mixed. From established players such as Tesla, Inc. TSLA to startups such as Fisker, Inc. FSR, companies have faced challenging conditions in the industry. Here are the key events that happened in the EV space during the week: Tesla Analysts Temper Targets, FSD Free Trialing And More: This week, more sell-side analysts reduced their first-quarter deliveries target for Tesla. Bullish analyst Daniel Ives from Wedbush reduced his target  from 475,000 units to 425,000 units, citing a “perfect storm” of demand issues that hit the quarter, which in turn hurt delivery and sales. The analyst also lowered his price target for the stock from $315 to $300. RBC Tom Narayan from Capital Markets revised his first-quarter sales estimate from 500,000 units to 446,000 units. He attributed this adjustment to a demand pull forward from the expiration of certain Model 3s’ IRS tax credits and the shutdown of Giga Berlin for approximately two weeks. Tesla executive Rohan Patel was active on social media, promoting Tesla’s 30-day complementary trial of the company’s full-self driving software. “Please encourage your friends and family who may have a Tesla to try this free 30-day trial of Supervised FSD,”  Patel said on X, formerly Twitter. Patel, who is vice president of public policy and business development at Tesla, said that the progress made by Tesla on the artificial intelligence front is “mind-blowing” and that users will be inspired to either buy the software or subscribe to it after experiencing it during the free trial. RBC’s Narayan said recently that the free trial will help to drive volumes higher in the second quarter. “Higher FSD attach rates are also central to our investment thesis on the stock,” he said. Cathie Wood’s Ark Invest accumulated Tesla shares this week amid their volatility. On Thursday, the firm bought about $14 million worth of the stock, on top of the over $28 million worth of shares it added on Monday. The total purchases for the week amounted to about $42 million. Fisker Sharply Reduces EV Prices: Struggling EV startup Fisker announced this week a sharp reduction in its EV prices. The 2023 Ocean Extreme trim’s manufacturer’s suggested retail price was reduced by $24,000 to $61,499, the Ultra trim’s from $52,999 to $34,999, and the Sport’s from $38,999 to $24,999. “Fisker is strategically positioning the all-electric Ocean SUV to be a more affordable and compelling EV choice,” the company said in a statement. The development came amid rumors of the company hurtling toward bankruptcy. After announcing that it was in talks with a major automaker — allegedly Nissan Motor Co., Ltd. NSANY — for a strategic partnership that would include a cash infusion, Fisker hasn’t shared any updates on further progress. Nikola Amid Positive News Flow:  Alternative energy truck maker Nikola Corp. NKLA, which pulled out its battery EV trucks out of the market due to fire incidents, teased their return. “Next stop – California! Our battery-electric truck is returning to duty as BEV 2.0, heading on a zero-emissions journey provided by the Nikola hydrogen fuel cell electric truck. One truck, two powertrain options,” the company said in a post on X. The company also announced this week the opening of its inaugural HYLA high-pressure modular refueling station and facility in Southern California. Separately, Nikola said Blackjacks Roadhouse unveiled Alberta's first commercial hydrogen fueling station, and the project was supported by Nikola’s Canadian subsidiary. Canoo Buys Assets Of Bankrupt Arrival: Canoo Inc. (NASDAQ:  GOEV) said it completed the acquisition of a substantial portion of the advanced manufacturing assets that were previously owned by Arrival Automotive UK Limited. The latter filed for bankruptcy in February. Canoo said the purchased assets would be collected into more than 20 containers and shipped by sea to its manufacturing facilities in Oklahoma. In January, the company announced the acquisition of essentially all of the new and like-new assets owned by Arrival Automotive USA, Inc. These assets were transported from Arrival's North Carolina facility and received at Canoo's Oklahoma facility, where commissioning is underway, the lifestyle EV manufacturer said. Check out more of Benzinga’s Future Of Mobility coverage by following this link. BYD Reportedly Eyes 20% Sales Growth: Warren Buffett-backed Chinese EV maker BYD Company Limited BYDDY BYDDF aims to sell 3.6 million new-energy vehicles in 2024, a 20% increase from its record 2023 sales, Reuters said, citing people familiar with the matter. The company’s chairman, Wang Chuanfu, reportedly told at an investor meet that the company plans to generate overseas sales to the tune of 500,000 units. The world’s largest EV manufacturer aims to sell 500,000 vehicles overseas this year, more than double last year’s total, and 1 million units in 2025, Wang told a BYD investor meeting on Wednesday, the sources said. They declined to be named as the meeting was not open to the media. The KraneShares Electric Vehicles and Future Mobility Index ETF KARS ended Friday’s session down 2.01% at $22.44, according to Benzinga Pro data. For the week, the ETF fell 0.36%. Read Next: Tesla Bull Says Investors ‘Misdiagnosing’ Fundamentals, Flags This ‘Razorblade’ Factor As Catalyst For ‘Future Penetration Gains’ EV Stock Performances For Week: Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}