{
    "title": "Tesla says Model 3 demand steady amid cancellation reports",
    "date": "3/18/2024",
    "url": "https://www.aol.com/tesla-says-model-3-demand-185335440.html",
    "text": "Advertisement For premium support please call: Tesla CEO Elon Musk doesn’t appear to see a problem with Model 3 reservations or cancellations despite reports that suggest otherwise. This week, Engadget, which cited data from analytics firm Second Measure, reported that 23% of those who placed a pre-order for a Model 3 had their $1,000 deposit refunded as of April. But a Tesla spokesperson told FOX Business those figures don’t line up with the company’s internal data. The company, however, was not able to provide more details on its own percentages regarding how many pre-orders were converted into sales for the automaker. Instead, the automaker has continued to publicly reiterate that demand for the Model 3 is steady, citing in April production delays and “delays in availability of certain planned options” as the reasons for almost all order cancellations. In its first-quarter letter to shareholders, Tesla said Model 3 net reservations “continued to exceed 450,000.” Ramping up production of the Model 3 has proved challenging for the automaker. The company continues to target a weekly production rate of 5,000 Model 3 sedans by the end of the second quarter, despite starting the quarter at a rate of just 2,000 vehicles. Meanwhile, Musk has been playing defense for the automaker during recent weeks, recently cutting off an analyst who asked about the percentage of Model 3 reservation holders who had gotten a vehicle, saying, “These questions are so dry. They’re killing me.” Amid clashes with the media, shareholders on Tuesday are expected to vote on whether to remove Musk as chairman of the board. Shares of Tesla are down more than 7% so far this year. Related Articles Malaysia's central bank governor quits amid land deal furor Stocks gear up for a higher open on thawing trade tensions France, Germany and UK seek exemption from US Iran sanctions Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}