{
    "title": "Tesla offers U.S. customers a month's trial of its driver-assist technology",
    "date": "3/25/2024",
    "url": "https://www.saltwire.com/prince-edward-island/business/tesla-offers-us-customers-a-months-trial-of-its-driver-assist-technology-100951170/",
    "text": "SaltWire.com would like to send you notifications for breaking news alerts. Activate notifications? SaltWire.com would like to send you notifications for breaking news alerts. Activate notifications? Important information regarding Saltwire's CCAA filing STORY CONTINUES BELOW THESE SALTWIRE VIDEOS Barley Risotto and Kimchi: A Culinary Crossroads| SaltWire #food #cookingshorts #kimchi By Hyunjoo Jin and Jyoti Narayan (Reuters) -Electric carmaker Tesla will offer U.S. customers a month's free trial of its driver-assist technology, Full Self-Driving (FSD), CEO Elon Musk said on Monday, as softening demand and price competition pressure the company's sales and margins. Musk has long touted the driver assistant software, priced at $12,000, as a potential profit generator for the company, but has fallen short of his promise of full autonomy for years, amid regulatory and legal scrutiny of Tesla's safety and marketing. \"All U.S. cars that are capable of FSD will be enabled for a one-month trial this week,\" Musk said in a post on social media platform X. He has also told Tesla staff to give demonstrations of FSD to new buyers and owners of serviced vehicles, according to two emails verified by a source who sought anonymity. \"Almost no one actually realizes how well (supervised) FSD actually works,\" Musk said in one of the two emails, sent to Tesla employees. Researcher Troy Teslike said the \"FSD take rate\" was declining in North America, with about 14% of Tesla customers buying the package in the third quarter of 2022, down from a record high of 53% in the third quarter of 2019. Tesla's margins have been hurt by a price war with rivals that started more than a year ago. It also warned in January of \"notably lower\" delivery growth this year, as it focuses on production of its next-generation EV. \"The combination of substantial price cuts on the vehicles and dramatically lower FSD take rates has severely hurt Tesla’s margins,\" said analyst Sam Abuelsamid at Guidehouse Insights. \"The mandate to demonstrate FSD as it is today, is just the latest in a long-running series of end-of-quarter stunts by Musk intended to boost deliveries and revenues.\" The FSD software, which Tesla says does not make its vehicles autonomous and requires active driver supervision, has also been offered at a subscription of $199 a month. (Reporting by Hyunjoo Jin in San Francisco and Jyoti Narayan in Bengaluru; Editing by Gerry Doyle and Clarence Fernandez) "
}