{
    "title": "Opinion: Elon Musk's losing streak is heading for Tesla",
    "date": "1/21/2024",
    "url": "https://www.newshub.co.nz/home/money/2024/01/opinion-elon-musk-s-losing-streak-is-heading-for-tesla.html",
    "text": "Related video: Christopher Luxon shrugs off Elon Musk's well wishes.  Credits: Image - Reuters; Video - AM By Jonathan Guilford for Reuters OPINION: If the $690 billion Tesla (TSLA.O),  faces an unravelling, Twitter might have gotten the ball rolling. Boss Elon Musk wants 25 percent voting control of the carmaker, after selling down shares to help finance a 2022 deal for the social-media company now known as X. His online foray risked making him an absentee CEO; increasing his stake in Tesla would throw bad governance after bad. The billionaire posted on X on Monday that he is “uncomfortable” developing Tesla into a leader in artificial intelligence unless he has more control. Given that Tesla does not have super-voting shares, the simplest way to do that is to issue common stock to Musk. Taking dilution into account, that would mean about $100 billion worth of shares. Musk has a bundle of unexercised options good for a near-9% stake that would reduce the payout needed if exercised, but would entail a huge tax hit. To stay within the safest bounds of corporate law, issuing so many shares as compensation would require an independent board committee's sign-off and a vote of disinterested shareholders. But independence has proven hard. A gigantic $56 billion compensation package issued in 2018, for example, is still wrapped up, in a lawsuit in Delaware that has questioned how close Musk is to his board, which includes his restaurateur brother. With Musk implicitly threatening to steer away from a core competency - he has said that AI could make Tesla “the most valuable company in the world” – natural conflicts could call his fiduciary duty into question, too. That’s especially true given that he also runs xAI, where he could hypothetically divert machine intelligence efforts. The board could ease the pain by pairing a deal with a simultaneous buyback, softening the effect on Tesla's share price, which would drop some 14% as a result of issuing new shares. But that requires cash that Tesla needs. Its once industry-dominating gross profit margin has fallen roughly in half. A deal with Hertz Global (HTZ.O), has turned sour, with the rental-car company flooding the market with used Teslas. That’s a raw deal for customers losing resale value, especially those who paid as much as $15,000 for still-unfinished “full-self-driving” capabilities that have drawn government probes over safety. The biggest risk, though, might be valuation. With its stock priced at nearly 60 times expected earnings, according to LSEG, it’s the far-off, potentially game-changing developments like AI or robotics that hold sway for investors. But with chipmaker Nvidia (NVDA.O), an AI darling growing astronomically, trading at half the multiple, a diversion by Musk could snap the magic spell. Yet if the only way to avoid that outcome is by giving him what he wants, that's a steep price to pay. Tesla Chief Executive Elon Musk said in a Jan. 15 post on social media platform X that he is “uncomfortable” developing leading artificial intelligence and robotics at Tesla unless he has 25% voting control. Musk currently owns around 13% of Tesla’s shares, according to LSEG data, down from 22% before pursuing a $44 billion deal with Twitter in 2022. Reuters "
}