{
    "title": "Musk's Tesla battle, Microsoft Copilot, bank earnings: Top movers",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/video/musks-tesla-battle-microsoft-copilot-153629198.html",
    "text": "Tesla (TSLA) shares slipped Tuesday after CEO Elon Musk tweeted that he aims to boost his stake to 25% of the electric vehicle maker. Musk seeks to secure voting control over the company's future AI product direction. Microsoft (MSFT) has unveiled a new Pro version of its AI chatbot Microsoft Copilot. Subscriptions to Microsoft Copilot Pro are set to start at $20 per month. The banking sector opens Tuesday's trading session under pressure after Goldman Sachs (GS) and Morgan Stanley (MS) reported their quarterly results. Yahoo Finance's Brad Smith and Madison Mills breaks down the details, providing insights into stocks as the market opens. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith MADISON MILLS: Let's look at some of the more specific sector names, because that could be an indicator of what we're going to see throughout today's trade. Starting with Tesla, Elon Musk tweeting that he wants to have 25% voting control over the company if it's going to move towards AI product development. And he hinted at this particularly in his interview with Andrew Ross Sorkin at \"DealBook,\" saying that AI needs a strong leader and a lot of oversight. And he was talking specifically about OpenAI at that time, but I think that gave us an indication of his kind of ideology when it comes to AI product development. Tesla down a little over 2.3% in the pre-market off of that news, indicating that the street would not be pleased with Elon Musk taking more control over the company. Remember, he sold off a lot of shares after he had to get a lot of capital under his belt to close that Twitter acquisition, and that's why he's now at about 13% when it comes to his shares and the voting rights associated with that. I also want to take a look at Microsoft. This name actually in the green this morning after launching Copilot as a consumer first product. This is their AI product. It's $20 a month. And guys, don't forget you can see the founder of Microsoft, Bill Gates, speaking with our very own Yahoo Finance folks on our platform. BRAD SMITH: All right, Maddie, thank you so much there over at the New York Stock Exchange really teeing up today's trading activity. I'm going to take a deeper dive into a few of those names here, especially as we were mentioning Goldman Sachs being one of the top trending tickers here this morning. I'm taking a look particularly at banks as of right now, just to see some of that price action and you're taking a look at a lot of red as at this point in time. JP Morgan that's down by about 1.7% out of the gate. Also here as you're taking a look at the intraday activity, as I was mentioning Goldman Sachs, you're seeing that as one of the only bright spots. It's up by about 7/10 of a percent right now, but HSBC down 3%. You're seeing Morgan Stanley down nearly 3%, 2.8%-- 2.9% to be exact there. Let's also take a look at the Dow components here on the day just to give you a look at those 30. And taking a look at Microsoft, as we were just talking about them on the day with that Copilot announcement, you're seeing them up by about 1%. Apple, as we were mentioning, you've got some more price moves that they're going to be making in China. That's down by about 1.9%. So investors paying close attention to that. Since we mentioned Apple, let's give you a closer look at some of the NASDAQ 100 names. Tech-heavy average here as we kick off the day, it looks like there's more red than green. However, at least in some of the mega-cap tech stocks, you're seeing a lot more green. So we'll see exactly where that continues to move as we go on throughout the rest of today's trading session, a holiday abbreviated trading week. Related Quotes "
}