{
    "title": "US earnings preview: Netflix, Tesla and IBM to release latest results",
    "date": "1/22/2024",
    "url": "https://www.ig.com/en/news-and-trade-ideas/us-earnings-preview--netflix--tesla-and-ibm-to-release-latest-re-240122",
    "text": "We want to clarify that IG International does not have an official Line account at this time. We have not established any official presence on Line messaging platform. Therefore, any accounts claiming to represent IG International on Line are unauthorized and should be considered as fake. CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. \n CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. View more search results US earnings will accelerate from tomorrow with Netflix, J&J, General Electric and Verizon reporting financial results. On Wednesday, it will then be the turn of IBM, Tesla and AT&T; followed by Intel, Visa and American Airlines on Thursday. American Express quarterly earnings will then conclude this busy week, as IGTV’s Angela Barnes explaines. (AI Video Summary)  Next week, we can expect to see a bunch of big companies reporting their financial results in the US. Some of these companies include Netflix, Johnson & Johnson, General Electric, Procter & Gamble, and Verizon. Let's break it down: First up, let's talk about Netflix. In the third quarter of 2023, Netflix did really well. They had an 8% increase in revenue and gained 8.76 million new paid members. In the fourth quarter, they expect to keep up their strong performance with an 11% increase in revenue and 8 to 9 million new subscribers. Basically, things are looking good for Netflix. Their stock has even gone up by 73% since the beginning of the year. Now, let's move on to Tesla, the electric vehicle company. Tesla will also announce its fourth-quarter report. Experts predict that they will earn around $0.72 per share and bring in revenue of $25.52 billion. People are especially interested in Tesla's margins, which is basically how much money they're making from sales. Tesla's focus has been on sales rather than margins, which has caused a decline in automated growth margins from 30% to 16.3%. But don't worry, Tesla's stock has still gone up by a crazy 120% since January 2023. Lastly, we have American Airlines. They will be releasing their quarterly report too. It's estimated that they will earn $0.11 per share and have revenue slightly over $13 billion. People will be closely watching something called the total value per available seat mile. Basically, they want to see if it has gone down between 5.5% and 7.5% compared to last year's fourth quarter. Right now, American Airlines' stock has dropped by 1%. Overall, these earnings reports are really important because they will have a big impact on these companies' stock prices. Investors will be closely examining their financial performance, how much money they're making, and what they predict for the future. So keep an eye out for these reports, because they could have a huge effect on the market. This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. Deal on the world’s major stock indices today. See more forex live prices See more shares live prices See more indices live prices Prices above are subject to our  website terms and agreements. All share prices are delayed by at least 20 minutes. Prices are indicative only. See more forex live prices See more shares live prices See more indices live prices Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Share CFDs Forex Indices Commodities Other markets Web platform Trading apps MetaTrader 4 ProRealTime Compare features Demo News and trade ideas Trading strategy  Charges and margins Premium services Refer a friend Marketing partnerships Corporate accounts New clients: +44 (20) 7633 5430 or email sales.en@ig.com Clients: Help & Support  IG | Terms and agreements | Privacy | How to fund | Vulnerability | Cookies | About IG Follow us online: ^IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG Group established in London in 1974, and is a constituent of the FTSE 250 index. The risks of loss from investing in CFDs can be substantial and the value of your investments may fluctuate. 70% of retail client accounts lose money when trading CFDs, with this investment provider. CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. You should consider whether you understand how this product works, and whether you can afford to take the high risk of losing your money. CFD Accounts provided by IG International Limited. IG International Limited is licensed to conduct investment business and digital asset business by the Bermuda Monetary Authority. IG provides an execution-only service. The information in this site does not contain (and should not be construed as containing) investment advice or an investment recommendation, or an offer of or solicitation for transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. The information on this site is not directed at residents of the United States and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG International Limited receives services from other members of the IG Group including IG Markets Limited. Careers | IG Group "
}