{
    "title": "Tesla stock 'egregiously overvalued': long-running bear analyst says",
    "date": "1/1/2024",
    "url": "https://www.businessinsider.com/tesla-stock-price-outlook-overvalued-bear-call-artificial-intelligence-bubble-2024-1",
    "text": "       Elon Musk's Tesla is grossly overvalued — and its stock could end up plunging as much as 65%, one analyst is warning. Roth MKM analyst Craig Irwin, a long-time bear on Tesla, reiterated his $85 price target for the EV maker. That implies shares more than halving from their current levels, with the stock trading around $248 a share last week. \"I'm bearish because I see it as egregiously overvalued,\" Irwin said in an interview with CNBC last week. Related stories He compared the firm to Toyota, which produces around 9 million vehicles a year. Tesla, by comparison, produced just 1.37 million vehicles last year. \"There's nothing Tesla has that Toyota does not. Why should it trade at a large multiple to Toyota if it's going to sell a fraction of the vehicles?\" Irwin said. Still, Irwin maintained his \"neutral\" rating on Tesla stock, as the EV maker still has a few tools to buoy its stock price. One such tool is Tesla's potential release of a smaller-generation vehicle, something Musk has floated for years. Company executives are already slated to meet with Indian officials to discuss building a factory for the $24,000 mini car, a source told Reuters earlier this year. \"But from here, I see this one as a slow drip over the next couple years,\" Irwin warned. Irwin's view contradicts those of other Wall Street strategists, who have grown more enthusiastic about Tesla after the stock's huge success in 2023. The EV maker soared 130% last year, largely due to Wall Street's hype for AI-related stocks. In a note last week, Wedbush saw the firm's shares soaring to $350, implying around a 41% increase in Tesla's stock. That's due to improving profit margins, progress in full self-driving technology, and strong sales momentum in China, which should give Tesla the same \"good mojo\" Apple between the years of 2008 and 2009, strategists said. Correction January 1, 2024: This story has been updated to reflect that Tesla's stock was trading around $248 last week, not today. Read next Jump to "
}