{
    "title": null,
    "date": "1/28/2024",
    "url": "https://www.autoblog.com/2024/01/28/tesla-stocks-down-30-in-a-month-but-one-fund-manager-thinks-hopes-itll-hit-1200/",
    "text": "Tesla Inc.’s slowing growth and shrinking profit have made it the weakest stock on the Nasdaq 100 this year. Fund manager David Baron is betting it will be a bump in the road for Elon Musk’s company before another parabolic rally. It’s a tough wager to make right now, after the electric-vehicle maker warned on Wednesday that it will expand at a “notably lower” pace this year, prompting a 12% plunge in the stock. It's down 30%, a loss of well over $200 billion in market value this month. But Baron is putting his faith in the controversial chief executive officer to steer the company through the rocky times. The manager of the Baron Focused Growth Fund expects Tesla’s stock to reach $1,200 by 2030, up some 550% from current levels, citing its strong brand. Tesla and Musk’s privately held SpaceX were the fund’s largest holdings as of Dec. 31. Last year, it climbed 28%, beating the 18% rise in its benchmark, the Russell 2500 Growth Index, and the S&P 500’s 24% gain. And despite Tesla’s outlook for slower sales growth this year — a result in part of the EV winter that’s gripping the entire industry — Baron still expects the stock to touch around $300 in about 12 months, from around $183 at Thursday’s close. “While he may not be growing 50% a year as the company thought,” Baron said in an interview, “this year in a tough environment he’s still growing volume by 15% to 20% per year and making us $7,000 per car of gross profit.” Tesla delivered 1.8 million cars in 2023, up 38% from the year before. This year, Wall Street analysts project unit sales will increase 17%. The company didn’t respond to an email seeking comment. The Tesla holding is a key to Baron’s goal of boosting his fund’s assets to $2 billion this year, from $1.3 billion as of Dec. 31. The fund manager’s father, Wall Street veteran Ron Baron, is famously a big Musk bull. The elder Baron oversees the Baron Partners Fund, which a Bloomberg Intelligence study published in August found was alone among thousands of rivals to beat the Nasdaq 100 over the prior five, 10 and 15 years. As for SpaceX, David Baron projects its valuation will rise 20% in a year, double within three years and triple within five. The space and satellite company is worth $175 billion or more, Bloomberg reported last month. Baron, 43, became co-portfolio manager in 2018 with his father. The small- and mid-cap fund first bought Tesla shares in 2014. Its outperformance last year came as Tesla’s stock doubled, powered in no small part by its artificial-intelligence potential. Replicating that success in 2024 will be tough should Tesla struggle amid waning EV demand. “More investors are beginning to increasingly question the company’s growth narrative,” Toni Sacconaghi, an analyst at Sanford C. Bernstein, wrote in a note after the latest quarterly results. And while Tesla bulls often say innovation by the company can allow it to sustain a cost advantage and strong margins, “the counterargument is that the automotive industry is hyper-competitive, and carmakers have historically been unable to sustain cost advantages,” the analyst added. David Baron’s approach echoes the investment thesis his father has championed: Invest only in companies whose leaders have significant stakes in the business, and which the money manager believes can double in market value in five to six years, reflecting a compounded growth of 15% per year. “We are OK if that capital is not generating a return for the company in the near-term, as long as we believe there is a path to generating strong returns over time,” David Baron said. He’s also banking on CoStar Group Inc., for which he sees as much as 20% upside as its residential investments start to generate returns. He also expects holdings including Arch Capital Group Ltd., Figs Inc., and Choice Hotels International Inc. to produce strong cash flows this year. But Musk and his car and space companies remain crucial to his portfolio. “His interests are aligned with ours,” Baron said. “He’s not going to do anything stupid to change the trajectory of the companies.”  Toyota teases the 2025 4Runner 2025 Volkswagen ID. Buzz GTX is one wooly Bulli Nissan considering Xterra revival; 'it's got to be authentic' 2024 Ford Mustang Mach-E reportedly gets another price adjustment to keep it competitive 2025 Honda Pilot Review: Well-rounded three-row SUV adds Black Edition Six-pack of identical Ford Pinto Wagons for sale, in case you were looking    Please enter a display name Please sign in to leave a comment. "
}