{
    "title": null,
    "date": "1/6/2024",
    "url": "https://www.businessinsider.com/tesla-board-members-elon-musk-tweeting-420-drugs-wsj-2024-1",
    "text": "       Tesla board members were privately concerned Elon Musk might have been on drugs when he tweeted he was considering taking the EV company private in 2018, sources familiar with the discussions told The Wall Street Journal. Musk, who was still Tesla's chairman at the time, shocked shareholders in August 2018 when he suddenly announced on Twitter that he was \"considering taking Tesla private at $420\" — a number that references marijuana. \"Funding secured,\" he added. Board members were caught off guard by Musk's message, The Journal reported, despite earlier reports that claimed the Tesla CEO brought up the matter to the company's board of directors a week before the tweet. Now it appears some board members also privately expressed concerns that Musk was tweeting while on drugs and considered asking him to take a leave of absence, according to The Journal report. In an interview with The New York Times following the tweet, Musk said that leading Tesla had been \"excruciating\" and that the past year had \"been the most difficult and painful year\" of his career. Related stories The interview also included reporting about how Tesla's board was concerned about Musk's use of Ambien and whether it could be contributing to his late-night tweeting habits. Musk may also have been \"under the influence\" during the interview with The Times, sources familiar with the matter told The Journal, adding that Tesla's communications team didn't even know he planned to sit down with a reporter. Although Musk has said that he doesn't like taking illegal drugs, the billionaire has been known to have used recreational drugs like marijuana and small doses of ketamine to treat depression. The Journal reported that Musk took multiple tabs of acid at a Los Angeles party that he hosted and psychedelic mushrooms in 2019 in Mexico. Drug use may be common in the sphere of Silicon Valley power players, as The Journal reported last year. Still, illegal drug use could be a cause for concern for someone like Musk, whose rocket company SpaceX relies on billions of dollars in government contracts. To receive those contracts, companies are required to comply with the Drug-Free Workplace Act, according to the Substance Abuse and Mental Health Services Administration. The 2018 tweet also came with its own set of consequences. The Securities and Exchange Commission began investigating Musk's statement and soon filed a lawsuit that led to $40 million in penalties. Musk also agreed to step down as Tesla chairman while Tesla appointed two independent directors to its board. Musk's attorney, Alex Spiro, did not immediately return a request for comment from Business Insider sent during the weekend. Read next Jump to "
}