{
    "title": "Musk's Tesla may be weeks away from its “ChatGPT Moment” of FSD",
    "date": "1/23/2024",
    "url": "https://fortune.com/2024/01/23/elon-musk-tesla-fsdbeta-v12-chatgpt-moment-ai/",
    "text": "Tesla’s self-described ChatGPT moment may finally have arrived—but prepare to be underwhelmed. Last spring, Elon Musk promised Tesla vehicles across the country would soon come to life and drive themselves with no one behind the wheel, causing them to quintuple in value as they earned money driving taxi passengers around while their owners slept. “I think Tesla will have sort of a ChatGPT moment—maybe if not this year, I’d say no later than next year,” he told CNBC’s David Faber following the company’s annual shareholder meeting. “Suddenly 3 million cars will be able to drive themselves.” This bold prediction is now being put to the test. On Monday, the latest version of his Full Self-Driving software was shipped to select U.S. customers in a very limited release right before Tesla’s quarterly earnings call with investors this week. This iteration, v12, is unique in that Musk promised FSD would finally graduate from its incomplete designation after more than three years of “beta” testing on U.S. roads. “Version 12 won’t be beta,” he stated in late June. Well, it’s finally arrived, but thus far it looks as if Musk may have once again overpromised and underdelivered. One of the select early recipients, a San Francisco–based Tesla influencer by the name of Omar Qazi, said engineers warned him it was still a “rough early build.” After initial testing, the man behind the Whole Mars Catalog account—with nearly 420,000 followers on Musk’s X—estimated on Monday it would not likely be given wide release in the U.S. until March. “There’s major improvements in virtually every aspect people care about,” Qazi told a Spaces, before adding, “it’s not really ready for the public.” FSD Beta 12 showcases the impressive capability of the new end to end design, but still has a few rough edges. Expecting wide release in february or march What he did not say, however, is that it improved enough to handle driving in well over 99.99% of the cases, generally considered the level of reliability needed before a vehicle can drive without a human chaperone behind the wheel at all times. And that is the risk—that Musk’s “ChatGPT moment” fizzles, because v12 will not shed its beta designation. Or if it does lose the beta label, it is only because the original goal of a fully autonomous robo-taxi worth five times the car’s purchase price has quietly been buried. “Please slow down the FSDBeta v12 enthusiasm,” cautioned Chuck Cook, a respected FSD driver in the Tesla community known for posting videos of unprotected turns. “Don’t project autonomy on this build yet.” FSD was once the company’s calling card, justifying Musk’s back-of-the-envelope-math $1 trillion valuation. But after revelations emerged that the 2016 video that launched Tesla’s ambitions was dishonestly staged, customers have grown increasingly disillusioned that Musk will ever deliver on his promise. Tellingly, he dropped his asking price by $3,000 after long predicting it would only ever rise. During the October Q3 investor call, Musk went so far as to play up the credentials of his creation by calling FSD nothing less than a rudimentary form of artificial general intelligence. Please slow down the FSDBeta v12 enthusiasm.  It will be great to see it come to fruition.  But it will be an evolution from v11.  I don't have it yet, but I can predict where it will be …. Better .. maybe smoother .. but don't project autonomy on this build yet. “It’s basically baby AGI. It has to understand reality in order to drive—baby AGI,” he explained. Not even Sam Altman, the CEO of OpenAI, has described ChatGPT in such a fashion. Yet Musk asserts that when it comes to functionality outside of predictive speech using large language models, no one beats his company. “Tesla has the best real-world AI team on earth, period,” he told investors in October. “And it’s getting better.” But the narrative has begun to tire for many now, and Tesla stock is down 16% since the year began. Even as many of its peers notch new all-time highs, Tesla has traded sideways on balance since December 2020. More importantly, many investors regret missing out on AI chipmaker Nvidia tripling in value, because their money was tied up in Tesla stock. At this point, Musk will need to show his AI team really is as good as he claims by finally delivering on his ChatGPT moment. Otherwise, he risks more investors losing their faith. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}