{
    "title": "Forget Tesla: Consider These 2 Millionaire-Maker Stocks to Buy Instead",
    "date": "1/27/2024",
    "url": "https://www.fool.com/investing/2024/01/27/forget-tesla-consider-millionaire-maker-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Tesla (TSLA -2.25%) has been one of the best-performing stocks on the market over the last decade as it proved that electric vehicles (EVs) can be a viable business, and even a highly profitable one. However, recently, Tesla stock has been looking surprisingly mortal. The stock trades down by roughly half from its peak in 2021, and its fourth-quarter earnings report shows why the stock has faded. Tesla's revenue growth continues to slow and profits are falling, and that pattern continued in Q4. Automotive revenue rose 1% year over year to $21.6 billion, and overall revenue was up just 3% to $25.2 billion. These metrics reflect the impact of lower prices as the company looks to stay competitive, gain market share, and overcome headwinds from higher interest rates. As a result of lower prices, operating income fell 47% year over year to $2.06 billion, and adjusted earnings per share fell 40% to $0.71. Tesla missed estimates on the top and bottom lines, and it also forecast slower production growth in 2024. Seemingly, Tesla is less of a millionaire-maker stock than it was two years ago. What's an ambitious investor to do with this news? If you're looking for growth stocks that can help make you a millionaire, keep reading. Image source: Tesla. Tesla and every other artificial intelligence (AI) stock can't make their technology without the help of one company, and that's Nvidia (NVDA 0.12%). Nvidia stock soared over the last year as its chips are in extraordinarily high demand from companies like OpenAI, Oracle, Meta Platforms, and Tesla, among others. Nvidia, which invented the graphics processing unit (GPU), has a significant head start over its rivals. AI systems like OpenAi's ChatGPT and autonomous vehicle systems like Tesla's full self-driving rely on massive training models that use the kind of chips and accelerators Nvidia makes. That strong demand should help power Nvidia stock higher this year as it's coming off a third quarter in which revenue tripled year over year and its generally accepted accounting principles (GAAP) profit rose by 12x. As profits have soared, the company's valuation has come down, and it appears to be set for another strong year in 2024 as cloud infrastructure companies and others are still rapidly building out their AI infrastructure. This should favor Nvidia. Tesla made its name in electric vehicles, but there are signs of slowing demand for EVs that could spell trouble for Tesla and its peers. It also creates an opening for traditional automakers like General Motors (GM 1.70%) whose stocks got hammered as investors chased EV stocks and abandoned legacy automakers. As a result, GM stock now trades at a price-to-earnings ratio of just 5. GM may not offer the same growth potential that Tesla does, but the company has a growing EV and autonomous vehicle (AV) business in Cruise, whose rollout has taken a pause after San Francisco regulators suspended operations. GM remains more profitable than Tesla and is reporting solid growth with a 14% increase in vehicles sold to 2.6 million. That's a strong growth clip for a mature business and from a stock priced for no growth. Notably, that's also significantly faster than Tesla's Q4 revenue growth. GM's low valuation also gives the company a greater opportunity to return cash to shareholders. In fact, the company announced a $10 billion accelerated share repurchase program in November and raised its dividend by 33% to $0.12 a share. Considering the growth in its legacy car business and its investments in electric vehicles and autonomy, GM should be able to bridge the gap with EVs and AVs when the time comes. If GM delivers another strong earnings report, the stock could soar. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jeremy Bowman has positions in Meta Platforms. The Motley Fool has positions in and recommends Meta Platforms, Nvidia, Oracle, and Tesla. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}