{
    "title": "Tesla Stock Falls After Reports Company Raising Pay Amid Mounting Union \nPressure",
    "date": "1/11/2024",
    "url": "https://www.investopedia.com/tesla-stock-falls-after-reports-company-raising-pay-amid-mounting-union-pressure-8425139",
    "text": " Justin Sullivan / Getty Images Tesla (TSLA) shares tumbled during intraday trading Thursday after reports that the electric vehicle pioneer would increase wages amid a wave of automaker pay raises following the United Auto Workers (UAW) union's efforts to organize non-union employees. Flyers posted at a California Tesla facility said that U.S. production workers were to receive a \"market adjustment pay increase” in the new year, according to a report by Bloomberg on Thursday. The UAW reached agreements with the Big Three automakers—Ford (F), General Motors (GM), and Stellantis (STLA)—in November of 2023, after a historic six-week-long strike. The agreements included a 25% increase in wages. Following the deal between the UAW and the Big Three, the union launched a campaign to organize non-union workers at other automakers, including Tesla. Since then, some automakers increased employees' wages, which could stave off union organization action. Hyundai said that it would start raising pay for workers in 2024 so that hourly wages would increase by 25% by 2028. Volkswagen also offered an 11% raise to some of its production workers. Tesla itself reportedly announced plans to raise the hourly pay for some workers at its Nevada battery factory by 10% or more starting in January. The pressure for the EV maker to unionize extends beyond the U.S. as workers in Sweden, Denmark, Finland, and Norway went on strike in late 2023. The unions face an uphill battle in organizing Tesla workers especially as the company's chief executive officer, Elon Musk, has been vocal in his firm anti-union stance. Tesla shares were down 3.4% in early afternoon trading Thursday. The stock has gained 83% over the past year. TradingView Bloomberg. \"Tesla Boosts Pay for US Factory Workers That the UAW Wants to Unionize.\" Hyundai. \"Hyundai Announces Higher Wage Structure for Production Team Members in Alabama and Georgia.\" Volkswagen. \"Volkswagen offers 11 percent pay raise for Chattanooga production employees.\" NYT. \"Elon Musk on Advertisers, Trust and the “Wild Storm” in His Mind | DealBook Summit 2023,\" Nov. 30, 2023. (Video.) "
}