{
    "title": "Apple and Tesla Veterans Aim to Help Japan Design AI Chips",
    "date": "2/27/2024",
    "url": "https://finance.yahoo.com/news/apple-tesla-veterans-aim-help-062316869.html",
    "text": "(Bloomberg) -- The Japan government-backed research group developing semiconductors will partner with US startup Tenstorrent Inc. on the design of its first advanced AI chip. Most Read from Bloomberg Trump Warns of Big Losses From Asset Sales During Property Slump Fed’s Preferred Inflation Metric Increases by Most in a Year Stocks End Month at New Highs After Inflation Data: Markets Wrap How Much Wealth You Need to Join the Richest 1% Around the World Biden Amasses Cash Lead as Trump Bleeds Money in 2024 Fight Tenstorrent, led by Tesla Inc. and Apple Inc. veteran Jim Keller, will license its design for part of Japan’s artificial intelligence accelerator and also co-design the overall chip, the US company said at a joint event in Tokyo on Tuesday. Working with the open-source RISC-V standard, Tenstorrent aims to provide customers with an alternative to the leaders Nvidia Corp. and Arm Holdings Plc, who have their own so-called instruction sets to communicate between hardware and software. The Japanese government is funding a range of projects from research to advanced chip manufacturing, making an ambitious $67 billion bid to reclaim a central role in the semiconductor industry. The Tenstorrent agreement has the potential to advance those efforts, with the goal of producing the jointly designed AI chips at the government-backed startup Rapidus Corp. “Concerns around AI using up all the electricity in the world make technology to decrease power consumption important,” said Rapidus Chief Executive Officer Atsuyoshi Koike at the event alongside Tenstorrent CEO Keller. “With Tenstorrent, we hope to launch AI accelerators at the fastest time-to-market rate.” The 18-month-old company is aiming to begin chip production in 2027 in competition with leaders Taiwan Semiconductor Manufacturing Co. and Samsung Electronics Co. But Rapidus will need customers for its facility and Keller’s team sees Japan working to ensure both supply and demand. “What Japan is doing is they recognize that you can’t just build a fab and hope,” David Bennett, chief customer officer of Tenstorrent, said in an interview. “So they’re taking large investments to make sure that they’re filling this fab. So what you see today is really the first one.” Bennett said that Tenstorrent has “line of sight to hundreds of millions of dollars of business in Japan” and is working closely with the Japanese government and corporations. His firm presently has 400 employees across the US, Canada, Serbia, India, South Korea and Japan. Tenstorrent is also in close contact with the US government to ensure it’s in full compliance with Washington’s technology export controls. Beside Keller, Tenstorrent has Keith Witek, who spent 13 years at Advanced Micro Devices Inc., as its chief operating officer and Wei-han Lien as its chief chip architect. Lien led Apple’s work on advancing its in-house chip design, which has grown from powering the iPhone to also running its iPads and even desktop Mac computers. In Japan, the company will work on AI chip designs with the government research group, known as Leading-edge Semiconductor Technology Center or LSTC. Still, production in Japan may be a challenge. Rapidus’ goal of manufacturing state-of-the-art, 2-nanometer logic chips by 2027 is considered something of a long shot. Japan’s LSTC will pursue and promote AI tech dedicated to “edge inference processing applications, including generative AI, through international collaboration,” its chairman, Tetsuro Higashi, said in the announcement. The country has managed to attract many of its semiconductor experts who’d gone to work overseas back, Bennett said, as it works to bolster its expertise. Read More: Japan Earmarks $300 Million to Fire Up Chip Research at Home --With assistance from Takashi Mochizuki. (Updates with quotes from executives) Most Read from Bloomberg Businessweek China’s Piano Dreams Are Fading for a Cash-Strapped Middle Class Chocolate Makers Try a New Recipe: Less Chocolate Elon Musk’s Vegas Tunnel Project Has Been Racking Up Safety Violations Hollywood Is Banking on Dune: Part Two to Revive the Blockbuster Experience Robotics Startups Hope the AI Era Means Their Time Has Come ©2024 Bloomberg L.P. Related Quotes "
}