{
    "title": null,
    "date": "2/3/2024",
    "url": "https://www.benzinga.com/news/24/02/36921801/tesla-model-y-production-at-giga-berlin-likely-hit-new-high-of-6000-weekly-units",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW EV giant Tesla Inc TSLA has seemingly built 6000 Model Ys in a week at its gigafactory in Berlin. What Happened:  Lars Lengacker, an associate quality engineer at Tesla Germany, earlier this week posted a video on LinkedIn of a silver Model Y with several t-shirts on it. The t-shirts pose graphics reading “1k,” “2k”, “3k” and so on, hinting at the weekly production milestones achieved at the Giga Berlin factory. One of the t-shirts has “6k” printed on it, hinting that the company has achieved that milestone as well. Director of Quality Bob Foulkes also took to LinkedIn to acknowledge the engineer’s post and wrote, “Your post is something that we all feel at Giga, something that pulses through us, a pride in what we've achieved. The hood of your new beautiful Quicksilver Model Y scattered with trophies of our achievements – 1K all the way to 6K and beyond.” Foulkes also posted a picture of the workers at the factory donning the 6K t-shirt, hinting that the company has indeed achieved the target. However, Tesla is yet to officially confirm this landmark achievement. Why It Matters: Giga Berlin achieved a weekly production capacity of 5,000 vehicles in March. The factory currently has an annual capacity to produce 375,000 Model Ys. Last month, Tesla reduced the prices of the Model Y in Germany by 1,900 euros ($2,065.6) on the base version and a more substantial 5,000 euros on Long Range and Performance versions. The rear-wheel-drive variant of the SUV is now listed at 42,990 euros on the company's Europe website, while the Long Range version is priced at 49,990 euros, and the Performance version at 55,990 euros. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read More: Rivian Beats Tesla, BMW In Customer Satisfaction: Elon Musk’s EV Giant Slips To 5th Position: Survey Photo by Michal Lauko on Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}