{
    "title": "Miffed Musk relocates Neuralink from Delaware after Tesla pay package ruling",
    "date": "2/10/2024",
    "url": "https://www.upi.com/Top_News/US/2024/02/10/Elon-Musk-Neuralink-Tesla-Nevada-Texas-Delaware/1091707599670/",
    "text": "Feb. 10 (UPI) -- Neuralink Corp. founder and investor Elon Musk is relocating the tech company from Delaware to Nevada after losing a $55.8 billion Tesla pay package that a Delaware judge recently nixed.\nMusk notified Neuralink shareholders of the change from Delaware to Nevada, which the Nevada Secretary of State finalized Thursday, according to Bloomberg and the Wall Street Journal.\nAdvertisement\n\"Never incorporate your company in the state of Delaware,\" he posted on X.\n\"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" Musk said in another post.\nRelated\nElon Musk will urge Tesla to incorporate in Texas after X poll\nDelaware judge strikes down Tesla's $56 billion package for Musk\nElon Musk's Neuralink says it has FDA approval for human testing for brain implants\nThe billionaire also said he intends to have Tesla shareholders vote on his proposal to move Tesla to Texas from Delaware. Tesla is headquartered in Austin but was incorporated in Delaware in 2003.\nDelaware Chancellor Kathleen St. Jude McCormick last month voided a 2018 Tesla pay package that mostly included Tesla shares in lieu of cash payments.\nA shareholder in 2018 filed a legal challenge to Musk's $55.8 billion pay package, saying he dictated its terms and misled shareholders with incomplete disclosures in a Tesla proxy statement.\nThe shareholder said Musk controlled the Tesla corporation's board of directors, who approved the pay package, and dictated the terms of the package that included performance incentives.\nAdvertisement\nMusk argued that he owned less than a third of Tesla's shares and wasn't Tesla's controlling shareholder. He said Tesla share values rose from $53 billion to more than $1 trillion since the board approved his pay package in 2018.\nIn ruling against and rescinding the payment package, McCormick said the process to create the compensation plan was flawed and involved people with whom Musk has longtime business, legal and personal relationships.\nMusk asked Tesla's board of directors to create a new compensation package that would award him 25% of Tesla shares, which would nearly double his current 13% stake in the electric vehicle maker. The 25% stake in Tesla would give him more influence over corporate decisions, Musk told the board.\nNeuralink is a U.S.-based neurotechnology company working to develop an interface system that would enable the human brain to communicate with tech devices using only a person's thoughts.\nCompany officials say the technology could help people afflicted with paralysis to live more independent lives and in January announced its first brain implant to start its human trials.\n\n\n\nTopics\nBusinessElon MuskTESLA Motors\n\n\n\n\n\n\nLatest Headlines\n\n\n\n\n\n\n\nU.S. News // 28 minutes ago\nTrump, Giuliani, others appeal to remove Willis and dismiss Georgia case\n March 30 (UPI) -- Former President Donald Trump, Rudy Giuliani and seven co-defendants say a Georgia judge erred in allowing Fulton County District Attorney Fani Willis to continue her racketeering case against them.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 1 hour ago\nReport: Biden administration makes new arms transfer to Israel\n March 30 (UPI) -- The Biden administration has approved the transfer of more bombs and fighter jets to Israel even after voicing its disapproval of a planned new ground offensive in southern Gaza, according to published report.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 2 hours ago\nMajor storm to drench Southern California on Easter weekend\n  A potent storm will grab Pacific Ocean moisture and fling it at Southern California as multiple rounds of heavy rain and gusty thunderstorms into Easter Sunday, forecasters say.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 1 day ago\nAs largest crane on East Coast arrives, Baltimore bridge collapse cleanup underway\n March 29 (UPI) -- The biggest crane on the eastern seaboard arrived Friday in Baltimore as cleanup efforts get underway to clear the Patapsco River of wreckage after this weeks Francis Scott Key Bridge collapse.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 19 hours ago\nCalif. Gov. Gavin Newsom says 480 street cameras to be installed in Oakland, East Bay\n March 29 (UPI) -- California Gov. Gavin Newsom on Friday announced a contract to install 480 high-tech cameras in Oakland and East Bay to battle crime.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 19 hours ago\nKia recalling 427,000 Telluride SUVs over parking safety concerns\n March 29 (UPI) -- Kia is recalling 427,000 of its Telluride SUVs over concerns that the vehicles can keep rolling after being parked, according to the National Highway Traffic Safety Administration.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 19 hours ago\nUSNS Harvey Milk completes maiden voyage to San Francisco\n March 29 (UPI) -- The U.S. Navy ship named after gay rights icon Harvey Milk made its first voyage through the Golden Gate Bridge and docked in San Francisco Thursday.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 1 day ago\nBiden says government working to free Gershkovich 1 year after arrest by Russia\n March 29 (UPI) -- President Joe Biden said that diplomats are continuing to work on gaining freedom for Wall Street Journal reporter Evan Gershkovich on the first anniversary of his arrest by Russian authorities.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 20 hours ago\nJudge grants N.J. Rep. Andy Kim injunction tossing state 'county line' ballot design\n March 29 (UPI) -- Federal Judge Zahid Quraishi Friday eliminated a New Jersey ballot design that gave party-backed candidates an advantage in the June primary.\n\n\n\n\n\n\n\n\n\n\nU.S. News // 20 hours ago\nDemocratic senators raise concerns over ICE solitary confinement\n March 29 (UPI) -- Twelve senators signed a letter Friday to Homeland Security Secretary Alejandro Mayorkas expressing concern over alleged solitary confinement policy violations by U.S. Immigration and Customs Enforcement. Feb. 10 (UPI) -- Neuralink Corp. founder and investor Elon Musk is relocating the tech company from Delaware to Nevada after losing a $55.8 billion Tesla pay package that a Delaware judge recently nixed. Musk notified Neuralink shareholders of the change from Delaware to Nevada, which the Nevada Secretary of State finalized Thursday, according to Bloomberg and the Wall Street Journal.\nAdvertisement \"Never incorporate your company in the state of Delaware,\" he posted on X. \"I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters,\" Musk said in another post.\nRelated\nElon Musk will urge Tesla to incorporate in Texas after X poll\nDelaware judge strikes down Tesla's $56 billion package for Musk\nElon Musk's Neuralink says it has FDA approval for human testing for brain implants The billionaire also said he intends to have Tesla shareholders vote on his proposal to move Tesla to Texas from Delaware. Tesla is headquartered in Austin but was incorporated in Delaware in 2003. Delaware Chancellor Kathleen St. Jude McCormick last month voided a 2018 Tesla pay package that mostly included Tesla shares in lieu of cash payments. A shareholder in 2018 filed a legal challenge to Musk's $55.8 billion pay package, saying he dictated its terms and misled shareholders with incomplete disclosures in a Tesla proxy statement. The shareholder said Musk controlled the Tesla corporation's board of directors, who approved the pay package, and dictated the terms of the package that included performance incentives.\nAdvertisement Musk argued that he owned less than a third of Tesla's shares and wasn't Tesla's controlling shareholder. He said Tesla share values rose from $53 billion to more than $1 trillion since the board approved his pay package in 2018. In ruling against and rescinding the payment package, McCormick said the process to create the compensation plan was flawed and involved people with whom Musk has longtime business, legal and personal relationships. Musk asked Tesla's board of directors to create a new compensation package that would award him 25% of Tesla shares, which would nearly double his current 13% stake in the electric vehicle maker. The 25% stake in Tesla would give him more influence over corporate decisions, Musk told the board. Neuralink is a U.S.-based neurotechnology company working to develop an interface system that would enable the human brain to communicate with tech devices using only a person's thoughts. Company officials say the technology could help people afflicted with paralysis to live more independent lives and in January announced its first brain implant to start its human trials. "
}