{
    "title": "Elon Musk's Tesla to enter India soon? Centre's new policy may benefit EV \nmaker",
    "date": "2/19/2024",
    "url": "https://www.hindustantimes.com/business/elon-musks-tesla-to-enter-india-soon-centres-new-policy-may-benifit-ev-maker-101708307912588.html",
    "text": "Subscribe Now! Get features like Months after expressing interest in entering the Indian market, billionaire Elon Musk-led Tesla may be making its way to the country as the central government is in the process to finalise its policy to extend concessional import duty, reported The Economic Times. Tesla is now on the verge of entering the Indian market as the government is planning to extend its concessional import duty on electric cars exceeding ₹30 lakh ($36,000) for 2-3 years, reported ET. This move will help India boost employment and cut down the prices of EVs in the country. Further, the reduction of import duties may be done in lieu of Tesla getting bank guarantees for constructing an EV manufacturing plant in India, the ET report said citing sources. US electric carmaker Tesla was speculated to announce its entry into the Indian EV market during the Vibrant Gujarat 2024 summit, but no final calls had been taken on the set up of an electric vehicle plant in the state by the billionaire till then. According to the existing policy, India has a 100 percent import duty imposed on cars valued at over $40,000 ( ₹33 lakh), and 60 percent import duty for cars valued under this amount. Elon Musk's electric carmaker Tesla, however, said that it will enter the Indian EV market and invest up to $2 billion in the country if the Centre cuts down the import duty to 15 percent for vehicles for the first two years of operations. Hence, the government is now mulling the reduction of concessional import duties in imported cars, finalising the policy on the basis of the bank guarantees. Notably, these bank guarantees can be encashed if the company fails to comply with the fixed timeline for making said investments. Currently, companies like Mahindra and Mahindra, Tata and Ola Electric lead the space in electric vehicle manufacturing in India. These companies have often urged for a level playing field, and concerns have been raised regarding an unfair advantage towards Tesla. Mahindra & Mahindra reached out to government officials to assert the need for a level playing field, urging for a boost in manufacturing inside India. Ola CEO Bhavish Aggarwal has also been against the idea of importing electric cars from foreign players, saying that offering incentives to Tesla and other international firms can lead to a major hit in sales for domestic players.   "
}