{
    "title": "Tesla is 'a partner' in the EV transition, BYD executive says",
    "date": "3/16/2024",
    "url": "https://nz.news.yahoo.com/tesla-is-a-partner-in-the-ev-transition-byd-executive-says-204138991.html",
    "text": "Chinese electric vehicle maker BYD (BYDDY) surpassed Tesla (TSLA) to become the world’s top seller of electric vehicles in 2023, demonstrating a remarkable turnaround for a company that was worried about survival just a few years ago. Yet, BYD executive vice president Stella Li insists there is no gloating to be had. “We have a high respect for Tesla,” Li said to Yahoo Finance Live (video above). “They’re a market leader. They’ve given a great education to the market. Without them, I think the global EV market could not [advance] so rapidly. I think they are a partner … pushing the whole auto industry to transition to the future electric car.” BYD edged past Tesla at the end of 2023 after selling more than 3 million cars, with more than 80% of sales in China. The milestone highlighted BYD’s fast track to the top, as the company grew sales by a million cars in each of the last two years. Read more: Are electric cars more expensive to insure? That rise coincided with the explosive expansion in China’s EV market. New energy vehicles (NEV), which include plug-in hybrids and battery electric vehicles, accounted for less than 5% of the country’s automobile sales in 2019. Today, that rate has soared to 35.7%, according to data from the China Association of Automobile Manufacturers. Founded in 1995 as a battery manufacturer for cell phones and other consumer electronics devices, BYD has spearheaded the Chinese EV transition by building a business model reliant on vertical integration. Roughly 75% of the parts and components that go into its vehicles are manufactured in-house, allowing the company to control costs and timelines, according to Li. Li said BYD operates on an 18-month road map from concept to market, far faster than the years it takes for Western rivals to develop cars. Government subsidies and tax breaks introduced to kick-start EV adoption have also played a key role in BYD’s expansion, along with that of other Chinese carmakers. At a conference earlier this year, Ford (F) CEO Jim Farley said the Chinese held a “20% to 30%” cost advantage, noting that BYD produced its entry-level Seagull EV for $9,000 to $11,000 in materials. But Li dismissed BYD’s reputation as a cheap car manufacturer, saying the company has evolved and improved its technology to compete head-to-head with Western rivals on innovation. Its lineup ranges from a $10,000 vehicle to the ultra-luxury Yangwang brand, which recently introduced a sports car that retails for $233,000 in China. “In China, the message is strong,” Li said. “If you are not investing in electric cars, you are out. You will die. You’ll have no future.” The Chinese automaker has also gotten backing from Berkshire Hathaway's Warren Buffett, who took a 10% stake in the company in 2008. BYD has been competing directly with Tesla in its home market since the US carmaker entered China in 2020. While Tesla CEO Elon Musk initially mocked BYD as a competitor back in 2011, during Tesla’s most recent earnings call, he warned about the global expansion of Chinese EV makers, saying they are “extremely good.” “Frankly, if there are not trade barriers established, they will pretty much demolish most other car companies in the world,” Musk said. The US maintains a 27.5% tax on cars made in China and imported into the US. Li likened the threat of Chinese competition raised by auto executives like Musk to the narratives that followed the entry of Japanese cars into the US market. She added that, despite Tesla’s success in China, Musk’s firm and BYD have “less than a 15%” overlap in buyers. “Our real competition is the ICE car,” Li said, referring to internal combustion engine vehicles. “The more people jump in to produce EVs or [plug-in hybrids], the better for the industry.” Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance A large fire has broken out at an Indonesian military ammunition facility outside the capital Jakarta. Dutch police have detained a man who walked out of a nightclub where hostages were being held after a tense hours-long stand-off.  Envoys from several countries have laid flowers in Russia at the site of an attack on a concert hall that killed 144 people. Melbourne's Ben Brown has kicked three goals as the Demons scored a seven-point away victory against Port Adelaide. Lachlan Lonergan has suffered a serious ankle injury as the ACT Brumbies overcame a nine-point deficit to beat the Queensland Reds 20-19 at Suncorp Stadium.  The Dolphins have gone top of the NRL ladder with a 30-14 win over Gold Coast as their big-name off-season recruits Thomas Flegler and Herbie Farnworth shone. Goalkeeper Ryan Scott was the hero for the Newcastle Jets as they hung on to deny A-League Men finals hopefuls Melbourne City in a scoreless draw. Goals from Anthony Caceres and Joel King have sealed a 2-0 win for Sydney FC over the Central Coast Mariners in the A-League Men.  The Hurricanes and Blues have both recorded huge Super Rugby Pacific wins, thumping the Highlanders and Moana Pasifika, respectively. Police are investigating racial abuse yelled at the children of an AFL legend while they were playing in their yard as support floods in for the family. St George Illawarra fullback Tyrell Sloan has scored two tries to help the Dragons bounce back to winning ways with a 20-12 NRL victory over a poor Manly side.  Essendon star Jake Stringer has kicked the match-winning goal to pull the Bombers over the line against a tired St Kilda at Marvel Stadium. The great Kelly Slater has been beaten at Bells Beach as Australians Morgan Cibilic and Ethan Ewing advanced to the quarter-finals of the Rip Curl Pro. The Western Force's unbeaten start to the Super Rugby Women season has come to an end, losing to Fijian Drua, while the Brumbies saw off the Reds. 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ Wellington have dealt a blow to Western Sydney's finals hopes, while Michelle Heyman equalled an ALW record as Canberra staged a late comeback in Brisbane. Liam Wilson has been told by ring rival Oscar Valdez he must not give up on a promise he made to his dying dad, despite losing his latest world-title fight. Melbourne United will have home-court advantage for the deciding game of the best-of-five NBL championship series against the Tasmania JackJumpers. 滿滿花青素，美容養顏，明目養髮，泡水/泡茶/泡酒/即食 多種食用方式 Endale Mekonnen and Chloe Mannix-Power have set the pace in the heats for the 2024 Stawell Gifts. The Western Force were up a man for 30 minutes against the Drua, but still suffered a 31-13 loss in wet and slippery conditions in Fiji. Australian star Josh Giddey scored a team-high 23 points to help the Oklahoma City Thunder roll past the Phoenix Suns in the NBA. "
}