{
    "title": "Tesla To Hike Prices On China-Made Model Ys From Next Month",
    "date": "3/19/2024",
    "url": "https://www.tradingview.com/news/benzinga:d5fc11472094b:0-tesla-to-hike-prices-on-china-made-model-ys-from-next-month/",
    "text": "EV giant Tesla Inc TSLA will reportedly increase the prices on China-produced Model Y vehicles starting next month. The move follows warnings of impending price hikes issued by the company in the U.S. and Europe over the weekend. What Happened: The starting price of China-made Model Y SUVs will increase by 5,000 yuan ($695) starting April 1, Reuters reported. Whether the price hike will be across versions or limited to select versions of the vehicle is not known. Over the weekend, the company said it would increase the price of its best-selling SUV in several countries across Europe on March 22 by about 2000 euros ($2,173). In the U.S., the company is looking to increase the starting price on all its Model Y variants by $1000 starting April 1. Why It Matters: Tesla delivered 484,507 vehicles in the last quarter of 2023. Whether the warnings of an impending price hike coupled with incentives will help boost first-quarter deliveries beyond fourth-quarter levels will be known when the company announces quarterly delivery numbers next month. Price Action: Tesla shares closed down 1.43% on Tuesday at $171.32. The stock has dipped 31% year-to-date, according to Benzinga Pro. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Tesla FSD Should Be ‘Really Shining Bright' By Late April Or Early May, Says CEO Elon Musk Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}