{
    "title": "History Says You Should Sell EV Stocks Before It's Too Late",
    "date": "3/11/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA-Q/pressreleases/24710172/history-says-you-should-sell-ev-stocks-before-its-too-late/",
    "text": "The auto industry has been a terrible place to invest money for decades, so why is the EV market any different? The same laws of supply and demand are in place, and manufacturers face similar fixed costs that have plagued the auto industry. Travis Hoium gives historical context and questions the valuation of all EV stocks in this video. *Stock prices used were end-of-day prices of March 8, 2024. The video was published on March 11, 2024.  Should you invest $1,000 in Rivian Automotive right now? Before you buy stock in Rivian Automotive, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Rivian Automotive wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  Travis Hoium has positions in General Motors. The Motley Fool has positions in and recommends BYD and Tesla. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy. The Motley Fool has a disclosure policy. Travis Hoium is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}