{
    "title": "Tesla stock analyst revamps price target ahead of delivery data",
    "date": "3/27/2024",
    "url": "https://www.dcourier.com/news/2024/mar/27/tesla-stock-analyst-revamps-price-target-ahead-of-/",
    "text": "  Elon Musk wants you to stop thinking of Tesla  (TSLA)  as just a car company. Yes, the electric vehicle maker does indeed make... electric vehicles. But the CEO is hoping people will look beyond that one particular product. Musk has said that Tesla \"should really be thought of as roughly a dozen technology startups, many of which have little to no correlation with traditional automotive companies.” \"Tesla is currently between two major growth waves,\" Tesla told analysts during the company's January earnings call. \"We're focused on making sure that our next growth wave driven by next-gen vehicle, energy storage, Full Self-Driving, and other projects is executed as well as possible.\" Full-Self-Driving, or FSD, came into focus earlier this week when Musk told Tesla employees that it would be \"mandatory\" for its North American operations to \"install and activate\" the software in new Tesla vehicles and to \"take customers on a short test ride before handing over the car.\" \"Almost no one actually realizes how well (supervised) FSD works,\" Musk wrote in the memo. \"I know this will slow down the delivery process, but it is nonetheless a hard requirement.\" Image source&colon Getty Images&period Musk has said that Tesla, which is scheduled to report first-quarter earnings on April 17, is in discussions to license the technology to a “major” original-equipment manufacturer and is “very open to licensing our Full-Self-Driving software and hardware to other car companies.\" Cars are still the major part of Tesla's DNA. While Musk was telling analysts about \"two major growth waves\" at the start of the year, the company reported disappointing earnings that included a lack of specific guidance for 2024 profit. Related: Tesla stock leaps as Elon Musk pushes key technology tied to profit boost Tesla posted weaker-than-expected fourth-quarter earnings of 71 cents a share on $25.17 billion of revenue. Both figures missed Wall Street forecasts despite record deliveries of 484,507 vehicles over the final three months of the year. Tesla shares fell after the earnings release, and Wedbush analyst Dan Ives, a longtime Tesla bull, called the report \"another train-wreck conference call\" with Musk at the helm. The company also said that 2024 growth rates, in terms of vehicle deliveries, would be \"notably lower\" than 2023 levels. And now, with the critical delivery data slated to be reported next week, Wall Street analysts are taking another look at the price targets for Tesla. Citi analyst Itay Michaeli lowered the firm's price target on Tesla to $196 from $224 while affirming a neutral rating on the shares. Michaeli also slashed his first-quarter delivery estimate, to 429,900 from 473,300, to reflect recent data points. The first-quarter setup for Tesla \"looks tough on aggressive consensus estimates,\" the analyst told investors in a research note. In recent weeks, consensus estimates have come down, but March data points have also disappointed, Michaeli said. He added that Wall Street estimates are still looking too high, not only for 2024 but also 2025. Bernstein analyst Toni Sacconaghi lowered his Tesla price target by $30 to $120 a share on March 26, while cutting his forecast for first-quarter deliveries by nearly 70,000 units to 426,000. Quarter to date, \"Tesla has experienced soft China/Europe demand and constrained U.S. Model 3 production,” Sacconaghi said. More Tesla: “Despite the stock’s underperformance year to date, we struggle to see a catalyst for Tesla. We expect tepid growth in 2024, as well as 2025, bringing into question the company’s growth narrative,\" the analyst said. On Monday, Oppenheimer reduced its initial delivery estimates for Tesla For the first quarter, the firm now projects deliveries at 468,000 vehicles, according to Investing.com, down from 509,000, and it lowered its full-year 2024 delivery prediction to 2.13 million vehicles from 2.17 million. As a result, Oppenheimer analysts expect Tesla's 2024 revenue to be $109.8 billion, with adjusted earnings per share of $3.01. That's down from their previous forecasts of $112.3 billion in revenue and adjusted earnings of $3.10 per share. Their projections for 2025 and 2026 are unchanged, at $141.7 billion with earnings of $4.35 per share and $173.3 billion with earnings of $5.67 per share, respectively. Oppenheimer analysts also addressed the Full-Self-Driving issue. \"With TSLA signaling an acceleration in FSD development after major investments in compute power and a wider rollout of V12 FSD, allowing for accelerated system training with real world data,\" they said, \"we believe the company is setting the stage for increased software-driven revenue growth as it prepares to launch the Model 2.\" “As we trim estimates, we believe the 1Q24 report could lead to a final near-term cut on TSLA estimates,” they added. Meanwhile, Chinese electric-vehicle battery maker CATL is reportedly in talks with Tesla and other unnamed automakers to license its battery technology in the U.S. instead of building its own plant there, The Wall Street Journal reported on Monday. Morgan Stanley called the U.S. an underpenetrated EV market “in need of high quality, cheap battery tech, while China is a highly penetrated EV market with an oversupply of batteries.” The firm said in a research note that a Tesla-CATL partnership \"could be a game changer.\" Related: Veteran fund manager picks favorite stocks for 2024 Click Below to: Contents of this site are © Copyright 2024 Prescott Newspapers, Inc. and Western News&Info®, Inc. All rights reserved. |  Terms of Service | Privacy Policy "
}