{
    "title": "Elon Musk's Recommendation To Invest In 'Physical Things' May Be His Best \nAdvice Yet",
    "date": "3/22/2024",
    "url": "https://ca.news.yahoo.com/finance/news/elon-musks-recommendation-invest-physical-100050186.html",
    "text": "Tesla Inc. (NASDAQ: TSLA) CEO Elon Musk posted in a thread on Twitter earlier this year advising his followers to own “physical things” when inflation is high. The post came shortly after inflation hit its first 40-year high in March. In the tweet, Musk said, “As a general principle, for those looking for advice from this thread, it is generally better to own physical things like a home or stock in companies you think make good products, than dollars when inflation is high.” “I still own & won’t sell my Bitcoin, Ethereum or Doge fwiw.” Musk’s message points out that physical assets are generally the safest investment during times of high inflation. This message coming from the “Dogefather” himself should speak volumes. The stock market started its major decline shortly after Musk’s March 14 tweet. The S&P 500 is down 15.33% since April 1, and Tesla stock is down 38.52%. The cryptocurrencies Musk said he wouldn’t sell have fallen even harder in price. Bitcoin (CRYPTO: BTC) is down 57.57% since April 1, Ethereum (CRYPTO: ETH) is down 59%, and Dogecoin (CRYPTO: DOGE) is down 56.85%. So how have physical assets performed during that time? Real Estate Recent headlines about real estate values would have many people believing that an investment in this asset class during the first half of 2022 would have been a mistake. According to data from Redfin, the U.S. median sale price has fallen roughly 4.4% since the beginning of April but has mostly leveled out over the past two months. What that data doesn’t account for is the cash flow generated by investment properties. Investors on the fractional rental property investment platform Arrived Homes are earning a 4.8% median annualized return just from rental income. Another important point to remember is that not all U.S. markets are experiencing the same decline in property values. One market that Arrived Homes began acquiring properties in this year is Cincinnati, which has actually seen a 2% increase in its median sale price since the beginning of April. Real estate has also become more accessible than it’s ever been. Arrived Homes, which is backed by Amazon.com Inc. (NASDAQ: AMZN) founder Jeff Bezos, allows retail investors to buy shares of long-term and short-term rental properties with as little as $100. The Arrived Homes platform currently has seven rental property investments available. Other options like CalTier allow individuals to invest in an entire portfolio of multifamily properties with as little as $500. Wine and Spirits Potent potables have become an extremely popular investment option for retail investors, which is no surprise considering the Liv-ex Fine Wine 1000 index is up 10.3% since April 1 and 14.1% year-to-date. The Rare Whisky Apex 1000 index is also performing well this year, up 4.9% since April and 10.4% year-to-date. Investors on the fractions wine and spirits investing platform Vint recently made out quite well on an investment in the platform’s Bowmore Cask Collection, which provided a net annualized return of 35.49%. Investors were able to purchase shares of the collection for just $47 each. The Vint platform currently has two Bordeaux collections available for investment. Collectibles Buying and selling shares of assets like sports memorabilia, fine art and even classic cars has become as easy as trading stocks. The popular investing platform Public recently added collectibles to its suite of investment options. Investors can now trade stocks, crypto, non-fungible tokens (NFTs) and collectibles on the same platform. Trading cards have remained relatively stable this year. The PWCC 2500 index, which tracks the investment performance of professionally graded trading cards, is up about 1% since April and roughly 8.3% year-to-date. Photo by Daniel Oberhaus on Flickr Don't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better. © 2022 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented.  Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. WASHINGTON (AP) — Presumptive Republican presidential nominee Donald Trump drew criticism Friday for posting a video on social media that contains the image of a hog-tied President Joe Biden painted on the tailgate of a passing truck. The Biden campaign was quick to condemn the video for suggesting physical harm to the sitting Democratic president. Biden has portrayed his likely 2024 opponent as someone who freely evokes Nazi imagery with regard to immigrants, while also stressing in speeches th This food habit is linked to a specific type of dementia.  \"Virgin River\" star Tim Matheson is mourning the loss of his ex-wife, actress Jennifer Leak, who died this month at age 76. Nordegren has moved on and built a life that focuses on her six kids Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump…  Seven reportedly cost $20 million The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt  The NHL playoff picture is becoming clearer. Here's an early look at who has a shot at winning the Stanley Cup. A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. Shannon Stapleton/ReutersDonald Trump once again went scorched earth against the daughter of the judge overseeing his New York hush-money trial on Thursday, posting a fiery rant to Truth Social that called her out by name.That woman, Loren Merchan, has become the focal point of Trump’s attacks against her dad, Judge Juan Merchan, in his longshot attempt to have him ousted as the judge presiding over his criminal case in New York. Trump has decried Loren’s position as president of a political con He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” \"I guess turning 29 isn’t so bad,\" the musician joked of her latest milestone Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o They soft-launched their relationship at the supermodel's cookbook event in Miami.  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. The \"Late Night\" comedian brutally summed up the former president's media company. Amid reports the scandal-hit rapper is forcing his wife Bianca Censori into flashing her flesh in outrageous outfits, Amber Rose has declared her ex Kanye West is the reason she dressed like a “sexpot” while they dated. "
}