{
    "title": "2 EV Stocks Respond to Analyst Downgrade to 'Neutral'",
    "date": "3/24/2024",
    "url": "https://www.schaeffersresearch.com/content/news/2024/03/25/2-ev-stocks-respond-to-analyst-downgrade-to-neutral",
    "text": "Mizuho downgraded electric vehicle (EV) stocks Tesla Inc (NASDAQ:TSLA) and Rivian Automotive Inc (NASDAQ:RIVN) today to \"neutral\" from \"buy.\" The analyst cited near-term demand weakness, as well as tighter liquidity. TSLA is up 1.1% at $172.66, brushing off the bear note, while RIVN is down 1.4% to trade at $10.65 at last check. Elsewhere, peer sector Nio Inc (NYSE:NIO) was last seen up 1.9% at $4.99. Diving into each stock's respective price activity, TSLA is recovering from a pullback to its lowest level since May, after staging a bounce off the $160 region. While the equity is now running into resistance from the 20-day moving average, it snapped back-to-back weekly losses on Friday with a 4.4% gain. Meanwhile, the $10 level has been acting as a floor for RIVN, after its Feb. 26 record low of $10.05. The stock is on track for its third-straight daily loss, and has struggled with pressure at the 40-day moving average for most of the year. So far in 2024, the security has already shed 54.7%. Lastly, NIO closed at a four-year low of $4.81 in the previous session, after briefly dipping into penny stock territory earlier this month. The 60-day moving average has been guiding the shares lower since early January, contributing to a 45% loss so far this year. Target Effortless Triple-Digit Gains Every Sunday Evening For Life! 101.0% GAIN on Apollo Global Management calls\n103.6% GAIN on JP Morgan  Chase calls\n105.3% GAIN on DraftKings calls\n101.3% GAIN on Airbnb calls\n203.0% GAIN on Shopify calls\n102.0% GAIN on Cboe Global Markets calls\n100.9% GAIN on Boeing calls\n102.1% GAIN on Microsoft puts\n102.3% GAIN on First Solar calls\n101.5% GAIN on PulteGroup calls\n101.0% GAIN on Apple calls\n209.4% GAIN on NXP Semiconductors calls\n100.8% GAIN on Uber Technologies calls\n100.4% GAIN on Academy Sports and Outdoors puts\n102.2% GAIN on Trade Desk calls\n100.8% GAIN on DoorDash calls\n100.0% GAIN on Camping World Holdings puts\n100.0% GAIN on Cboe Global Markets calls\n100.2% GAIN on C3.ai calls\n238.5% GAIN on Oracle calls     "
}