{
    "title": "Elon Musk claimed Teslas would appreciate in value post-purchase, but \npredictably, they've lost value",
    "date": "3/3/2024",
    "url": "https://africa.businessinsider.com/transportation/elon-musk-claimed-teslas-would-appreciate-in-value-post-purchase-but-predictably/cdrndw9",
    "text": "Business Insider Edition Elon Musk once claimed his Teslas would climb in value post-purchase, a rare feat in the auto industry. Musk made the comments in 2019, arguing that his vehicles were \"appreciating assets,\" Business Insider previously reported. \"If you buy a Tesla today, I believe you are buying an appreciating asset, not a depreciating asset,\" Musk said during the 2019 interview, arguing the brand's self-driving features would set it apart in value by tens of thousands. Lo and behold, the opposite of Musk's prediction is what has transpired. Teslas have largely depreciated in value, CNN reported. Take the Tesla Model 3, which was priced at $35,000 in early 2019. The car, like many, surged in value during the pandemic, but the used models have now fallen to a price point of $29,000, CNN reported. Tesla did not immediately respond to Business Insider's request for comment. Broadly speaking, vehicles depreciate in value as soon as they're driven off the lot of a car dealership. They lose nearly a fifth of their value each year following their purchase, according to AAA. Late last year, Tesla was slashing its prices by nearly 25% in an attempt to drive up sales and manage competition, Business Insider previously reported. Those efforts appear to have stalled as Tesla is selling about 56% of the electric vehicles on the American market compared to 80% of them in 2020, CNN reported. It's worth noting that at least one Tesla Cybertruck was resold for up to twice its value. Even so, that novelty may not last long. Some new owners of the trucks have complained of rust spots developing after short stints in rainy conditions. Thanks for signing up for our daily insight on the African economy. We bring you daily editor picks from the best Business Insider news content so you can stay updated on the latest topics and conversations on the African market, leaders, careers and lifestyle.  Also join us across all of our other channels - we love to be connected! © 2024 africa.businessinsider.com "
}