{
    "title": "Elon Musk: Tesla CEO slips to third position in world's richest list, \nbehind Bernard Arnault and Jeff Bezos",
    "date": "3/8/2024",
    "url": "https://www.connectedtoindia.com/elon-musk-tesla-ceo-slips-to-third-position-in-worlds-richest-list-behind-bernard-arnault-and-jeff-bezos/",
    "text": "After losing the top spot to Amazon boss Jeff Bezos, the fortunes of Elon Musk – amongst the richest in the world – have further slipped. According to Bloomberg, Bernard Arnault, LVHM boss and the richest person on earth has a net worth of USD 200 billion. Meanwhile, Jeff Bezos, who was the richest for a brief period, went back to the second spot with USD 199 billion. Elon Musk, however, has seen his numbers drop even further, at USD 191 billion, occupying the third position. This came to pass after Tesla shares dropped at the beginning of the week. According to the recent numbers, the shares of the company stood at USD 178.65, having gained some ground after the slump. This slump in company shares comes right after a positive start in March, when the share price clocked at USD 202.64 a piece. His other ventures, including The Boring Company, a construction company and his space research company, SpaceX, are not listed companies. These developments come at a time, when Tesla’s dominance as the EV giant is being put to test by many, particularly the Chinese automotive company, BYD. BYD has been bullishly pursuing routes to maximise and expand its footprint in a world that is hungry for sustainable mobility options. Meanwhile, many other big names, including American giants, Ford and GM, are scaling back, having not found sufficient success, compared to the likes of Tesla. In addition, Apple, the world’s second most valuable company’s decision to relinquish its plans to make their EV, after a decade long journey, has aided the prospects of Tesla. BYD on the other hand, with its recent launch of Seal in India – a budding market for EVs and Hybrids – has made its intention clear of how it intends to enter bigger markets. In addition, the Chinese car-manufacturer’s launch of its ‘Supercar’, the Yangwang U9, has exhibited its capabilities of making not just cars that fit into budgets of common individuals, but also make luxury wagons, that appeal to the taste of the EV-enthusiasts. These factors, in addition to the perennial issues concerning X, formerly Twitter, have also plagued Elon Musk and the companies that he heads. (The article is published under a mutual content partnership arrangement between The Free Press Journal and Connected to India)   Filmfare did the right thing by giving Ranbir Kapoor the best actor for Animal?  View Results ©2016. ConnectedtoIndia. All rights reserved. "
}