{
    "title": "Neuralink scares doctors, Elon Musk's new Tesla, and RIP Apple Car: Tech \nnews roundup",
    "date": "3/2/2024",
    "url": "https://qz.com/neuralink-elon-musk-tesla-roadster-apple-car-1851301185",
    "text": "2 / 12 Neuralink, billionaire Elon Musk’s side hustle, began brain-computer interface implant long-term trials in human subjects late last month, the third such company to do so. There are very few details available about the trial’s first volunteer, though Musk has said that the subject “seems to have made a full recovery, with no ill effects that we are aware of” and “is able to move a mouse around the screen by just thinking.” As is common with Musk and his various enterprises, no proof of this is offered beyond just taking him at his word. This has caused others in the field to express their concerns. Read More 3 / 12 Have you seen a photo on social media recently that appears to show a man in 1980s-style clothes smoking a cigarette in McDonald’s? The image has gone viral, racking up over 21 million views at the time of this writing. But it’s completely fake. The image was made using generative AI. Read More 4 / 12 Flock, a startup which promotes a surveillance state, has installed car tracking cameras in 4,000 cities among 42 states. The company makes its money and shareholder value by delivering AI-based tracking hardware and software to local police departments, which are more than happy to pay Flock’s $3,000 annual fee. The Atlanta-based company has grown nearly 2,700 percent since 2020, and at least some of that growth, according to a new report from Forbes, has come from a willingness to bend the rules to get their cameras installed and tracking your every movement. Read More 5 / 12 Tesla CEO Elon Musk is teasing the EV-maker’s highly-anticipated sports car, the Roadster, and announced that it will finally ship next year. “There will never be another car like this, if you could even call it a car,” Musk posted on X, the social platform he owns, early Wednesday morning. He went on to say that the car’s production design is complete and will be unveiled by the end of the year and ready to ship in 2025. But the electric sports car has been plagued with delays and has already missed multiple ship dates. Read More 6 / 12 Roughly a decade after Apple launched Project Titan, the technology giant’s plans to build and sell its own electric car have reportedly been terminated. Read More 7 / 12 Elon Musk’s tunnels below the Las Vegas strip are not exactly going as planned. Since his Boring company first appeared about seven years ago, plans have been scaled back, promises have been broken and safety violations have piled up. Read More 8 / 12 BYD, Tesla’s Chinese rival, has unleashed its latest effort to corner the electric vehicle market with a new “supercar” — one that comes with a steep price tag. Read More 9 / 12 The Toyota Prius Prime has beat out the latest EVs for the title of greenest car. Despite more EVs coming to market, none of the latest fully-electric vehicles in the U.S. managed to outdo the efficiency of the humble Prius plug-in, according to the Washington Post and recent findings in the 2024 GreenerCars report. Read More 10 / 12 Police were called to the scene of “Willy’s Chocolate Experience” in Glasgow, Scotland, as children burst into tears when the “immersive experience” promised in AI advertisements turned out to be a sparsely decorated warehouse. Read More 11 / 12 The second-generation Tesla Roadster is back in the news after Elon Musk announced that the car would hit 60 miles an hour in less than a second. This is nearly a full second faster than the current record-holder, which got me wondering: Is it actually possible? I crunched some numbers to get the answer: It’s technically doable, but it would be so inconvenient as to make the whole endeavor not worth it. Let’s run down what I found. Read More 12 / 12 "
}