{
    "title": "TSLA investors with early Tesla Cybertruck delivery requests should check \ntheir emails",
    "date": "3/26/2024",
    "url": "https://www.teslarati.com/early-tesla-cybertruck-delivery/",
    "text": "‘If you requested an early Cybertruck delivery, check your inbox! ‘Tesla’s Martin Viecha said on X. According to Viecha, Tesla recently sent emails to people who requested early Cybertruck delivery asking for certain documents to be submitted. A few people responded to Martin Viecha’s post, confirming they received Tesla’s email and could submit the necessary documentation. However, a few more mentioned issues with their submission or just hearing about the opportunity to request early Cybertruck delivery. Martin please look into the issue with SAY and @Fidelity as many of us have most of our $TSLA there that is no longer recognized on Say. Please and thank you! Tesla had announced early Cybertruck delivery requests for long-term TSLA shareholders on its website and via social media earlier this month. However, the signup period ended on Friday, March 22, 2024. The early delivery requests applied to Foundation Series Cybertruck units. The short offer was limited to one reservation per customer and only available in the United States and Canada. The Tesla Cybertruck reservation must be made before March 1, 2024, and in the participant’s name. Plus, participants must not have taken delivery of a Cybertruck yet. The email Martin Viecha mentioned in his X post might have to do with one of the requirements for the early Cybertruck delivery request. Participants must provide brokerage statements showing that they owned TSLA shares on February 28, 2021, and owned at least 500 TSLA shares on February 29, 2024. Tesla’s requirement for brokerage statements has caused some issues with its early Cybertruck requests. “Martin please look into the issue with Say and Fidelity as many of u s have most of our TSLA there that is no longer recognized on Say. Please and Thank you,” commented Dogearmy General. If you have any tips, contact me at maria@teslarati.com or via X @Writer_01001101. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}