{
    "title": "Electric vehicle space gets big policy boost",
    "date": "3/15/2024",
    "url": "https://www.bizzbuzz.news/industry/auto/electric-vehicle-space-gets-big-policy-boost-1299507",
    "text": "MORE Gearing Up New Delhi: The central government on Friday approved an electric vehicle (EV) policy, under which duty concessions will be given to companies setting up manufacturing units in the country with a minimum investment of $500 million, a move aimed at attracting major global players like US-based Tesla. According to an official statement, the companies setting up manufacturing facilities for e-vehicles will be allowed to import a limited number of cars at lower customs duty. The policy seeks to promote India as a manufacturing destination for EVs and attract investment from reputed global EV manufacturers, it added. Under the policy, a company will be required to make a minimum investment of $500 million or Rs4,150crore. There will be no upper investment limit. “The duty foregone on the total number of EVs allowed for import would be limited to the investment made or Rs6,484crore (equal to incentive under PLI scheme) whichever is lower. A maximum of 40,000 EVs at the rate of not more than 8,000 per year would be permissible if the investment is $800 million or more. The carryover of unutilised annual import limits would be permitted,” it said. The investment commitment made by the company will have to be backed up by a bank guarantee in lieu of the custom duty forgone. The statement further said the bank guarantee will be invoked in case of non-achievement of DVA (domestic value addition) and minimum investment criteria defined under the scheme guidelines. It said that the initiative “will provide Indian consumers access to the latest technology, boost the Make in India initiative, strengthen the EV ecosystem by promoting healthy competition among EV players, leading to high volume of production, economies of scale, lower cost of production, reduce imports of crude oil, lower trade deficit, reduce air pollution, particularly in cities, and will have a positive impact on health and environment”. The policy is designed to attract investments in the e-vehicle space by reputed global EV manufacturers, it said. As per the policy, a company will get “three years for setting up manufacturing facilities in India and to start commercial production of e-vehicles, and reach 50 per cent domestic value addition (DVA) within five years at the maximum”. With regard to domestic value addition during manufacturing, it said, “a localisation level of 25 per cent (will have to be achieved) by the third year and 50 per cent by the fifth year”. The customs duty of 15 per cent (as applicable to CKD units) would be applicable on vehicles of minimum CIF (cost, insurance, freight) value of $35,000 and above for a total period of 5 years, subject to the manufacturer setting up facilities in India within a three-year period, the ministry said. Recently in an interview, Commerce and Industry Minister Piyush Goyal said that India will not tailor its policies to suit US EV maker Tesla, and its laws and tariff rules will be formulated to attract all-electric vehicle manufacturers from across the world to set up a base in the world’s fastest-growing economy. © Copyright 2024 | Powered by Hocalwire © Copyright 2022 | Powered by Hocalwire "
}