{
    "title": "Direxion Daily TSLA Bull 1.5X Shares (NASDAQ:TSLL) Shares Gap Down to $7.94",
    "date": "3/23/2024",
    "url": "https://www.defenseworld.net/2024/03/24/direxion-daily-tsla-bull-1-5x-shares-nasdaqtsll-shares-gap-down-to-7-94.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Shares of Direxion Daily TSLA Bull 1.5X Shares (NASDAQ:TSLL – Get Free Report) gapped down prior to trading on Friday . The stock had previously closed at $7.94, but opened at $7.51. Direxion Daily TSLA Bull 1.5X Shares shares last traded at $7.60, with a volume of 4,545,415 shares trading hands. The stock’s fifty day simple moving average is $9.43 and its 200 day simple moving average is $12.63. The business also recently disclosed a quarterly dividend, which will be paid on Tuesday, March 26th. Investors of record on Wednesday, March 20th will be given a dividend of $0.0788 per share. The ex-dividend date is Tuesday, March 19th. This represents a $0.32 dividend on an annualized basis and a dividend yield of 4.05%. A number of hedge funds have recently added to or reduced their stakes in the business. B. Riley Wealth Advisors Inc. acquired a new stake in  Direxion Daily TSLA Bull 1.5X Shares during the 4th quarter worth approximately $144,000.  Clarity Capital Partners LLC acquired a new stake in  Direxion Daily TSLA Bull 1.5X Shares during the 4th quarter worth approximately $1,058,000.  Tower Research Capital LLC TRC raised its holdings in shares of  Direxion Daily TSLA Bull 1.5X Shares by 771.2% in the 4th quarter. Tower Research Capital LLC TRC now owns 30,517 shares of the company’s stock valued at $438,000 after purchasing an additional 27,014 shares in the last quarter.  Capital Investment Advisory Services LLC acquired a new stake in shares of  Direxion Daily TSLA Bull 1.5X Shares in the 4th quarter valued at $29,000.  Finally, Smith Anglin Financial LLC raised its holdings in shares of  Direxion Daily TSLA Bull 1.5X Shares by 266.5% in the 4th quarter. Smith Anglin Financial LLC now owns 39,659 shares of the company’s stock valued at $570,000 after purchasing an additional 28,838 shares in the last quarter. (Get Free Report) Featured Stories\n\nFive stocks we like better than Direxion Daily TSLA Bull 1.5X Shares\nWhat are earnings reports?\nMarketBeat Week in Review – 3/18 – 3/22\nThe Most Important Warren Buffett Stock for Investors: His Own\nKB Home: Building on Strong Foundations During Volatile Times\n3 Grocery Stocks That Are Proving They Are Still Essential \nNike Stock and the 30% Rally That’s Expected\n\n\n\n\n\n\n\nReceive News & Ratings for Direxion Daily TSLA Bull 1.5X Shares Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Direxion Daily TSLA Bull 1.5X Shares and related companies with MarketBeat.com's FREE daily email newsletter.  Receive News & Ratings for Direxion Daily TSLA Bull 1.5X Shares Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Direxion Daily TSLA Bull 1.5X Shares and related companies with MarketBeat.com's FREE daily email newsletter. Dutch Bros (NYSE:BROS) Shares Gap Down  on Insider Selling ProShares UltraShort 20+ Year Treasury (NYSEARCA:TBT) Shares Gap Down to $34.00 "
}