{
    "title": "BYD Overtakes Tesla in EV Sales: What Does That Mean?",
    "date": "1/4/2024",
    "url": "https://foreignpolicy.com/2024/01/04/byd-tesla-sales-electric-cars-ev-china/",
    "text": "Analysis:\n                    \n\n                    A Chinese EV Company Has Taken Tesla’s Crown Create an FP account to save articles to read later and in the FP mobile app. Sign Up ALREADY AN FP SUBSCRIBER? LOGIN Print Archive See All Foreign Policy Magazine is a division of Graham Holdings Company. All contents (c) 2024, Graham Digital Holding Company. All rights reserved. Foreign Policy, 655 15th St NW, Suite 300, Washington, DC, 20005. By submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time. Your guide to the most important world stories of the day Essential analysis of the stories shaping geopolitics on the continent The latest news, analysis, and data from the country each week Weekly update on what’s driving U.S. national security policy Evening roundup with our editors’ favorite stories of the day One-stop digest of politics, economics, and culture Weekly update on developments in India and its neighbors A curated selection of our very best long reads  For years, Tesla has been synonymous with electric vehicles, enjoying a dominance in the sector that carmakers the world over have desperately been trying to shake. Days into 2024, a Chinese rival has succeeded in doing just that. For years, Tesla has been synonymous with electric vehicles, enjoying a dominance in the sector that carmakers the world over have desperately been trying to shake. Days into 2024, a Chinese rival has succeeded in doing just that. BYD, a Shenzhen-based EV giant, sold 526,000 fully electric vehicles to Tesla’s 484,000 in the last three months of 2023, according to figures released by both companies this week, outpacing the U.S. carmaker headed by billionaire Elon Musk for the first time ever. BYD’s rapid ascent, while no surprise to industry experts, is a product of China’s yearslong push to build up its automotive manufacturing base and stake out a position in the global car market. That effort has largely been successful—China surpassed Japan last year as the world’s biggest automobile exporter, according to multiple industry estimates; market research firm Canalys expects EVs will have made up around 40 percent of those exports. Beijing has poured billions of dollars and immense resources into EV manufacturing, and BYD—which stands for “Build Your Dreams”—has been one of its foremost champions. “The government in China went all in on EVs,” said Erica Downs, an expert in Chinese energy markets at Columbia University’s Center on Global Energy Policy. “This was an industry that they wanted to develop, and they made sure that they had the different building blocks needed for success in place—so there were subsidies to EV manufacturers; there were subsidies to EV buyers; and they’ve been working on making sure there is adequate charging infrastructure.” That strategy has long rattled Washington and Brussels, where tech competition with Beijing dominates foreign-policy concerns and policymakers fear that an influx of Chinese-made vehicles could strain their domestic markets. To curb China’s technological advancement in strategic sectors such as semiconductors and artificial intelligence, Washington has imposed export controls and unveiled new legislation, such as the Inflation Reduction Act, aimed at strengthening domestic capabilities and attracting more manufacturing to U.S. shores. Under the Biden administration, boosting the U.S. EV sector has been a key prong of that strategy. Worried about China’s EV exports, Washington is reportedly mulling hiking up tariffs on Chinese EVs, the Wall Street Journal reported in December; they already face a 25 percent tariff. “There’s real concern in the United States about having Chinese EVs come into the market and dominate and put domestic producers at a disadvantage,” Downs said. Similar fears have also swept the European Union, which launched an investigation into Chinese EV subsidies last fall as concerns grew over Beijing’s EV ambitions. Over the last three years, Beijing’s global EV exports have soared by a stunning 851 percent—with the bulk of the cars going to Europe. Brussels’s probe, which is still ongoing, could result in additional tariffs on Chinese exports. “Global markets are now flooded with cheaper Chinese electric cars,” European Commission President Ursula von der Leyen declared when the probe was first announced. “And their price is kept artificially low by huge state subsidies.” Beijing has two key advantages in its quest to lead the global EV race. One is the sheer size of its own sector: China is home to the world’s biggest automotive market, by both manufacturing output and annual sales. The industry is only set to grow, with the country’s domestic production projected to soar to 35 million vehicles by 2025, according to the U.S. Commerce Department. Eager to harness this market, even Tesla has spent billions of dollars building a “gigafactory” in Shanghai, where it produced more than half of its cars in 2022. Other legacy companies such as Volkswagen and Volvo have also made major investments and even entered into joint ventures with Chinese counterparts, which in turn has helped China enhance its own carmaking chops. “You have to be there to capture the market. It’s very hard to decouple,” said Xiaomeng Lu, a director in the Eurasia Group’s geotechnology practice. “It just defies logic for them not to be there, and I think that’s why this particular sector is kind of the glue among the European companies, American companies, and the Chinese market.” The second advantage is China’s grip on global battery supply chains. After a decades-long push, Beijing overwhelmingly commands the supply chains for the critical minerals powering EV batteries and other clean energy technologies, including graphite, lithium, and cobalt. That dominance is particularly pronounced with rare earths, the powerful elements underpinning offshore wind turbines, missile guidance systems, and much more. In the rare-earth sector, 85 percent of processing and 92 percent of magnet production are currently controlled by China. “Right now, Europe and the United States aren’t even in the game when it comes to rare earths, battery cell manufacturing, rare-earth mining and refining,” said Tu Le, the managing director of the consultancy Sino Auto Insights. BYD is a prime example of how Chinese companies have leveraged these dynamics to gain an important edge. Before emerging as an EV giant, the Chinese firm was primarily a battery manufacturer, and it still makes its own batteries—a background that has given it a deep expertise and major leg up in the global EV market. “They have a real competitive advantage there,” said Colin McKerracher, the head of transport and automotive analysis at BloombergNEF. “Not only do they have a cost advantage from the vertical integration that they have by both making the batteries and the vehicles, but they are also making better batteries than a lot of the other groups out there, just in terms of cost and in terms of performance and safety.” And while market power and rare-earth dominance both constitute levers that China could pull to make life difficult for Western companies, its own slumping economy means it would take a significant emergency for Beijing to break that glass. “The Chinese economy is weaker, so I think really exerting force would probably alienate countries that they’re really trying to build bridges with,” Le said. The interconnectedness of the global automotive supply chain also means that it’s hard to cut off access without unpredictable global knock-on effects that could hurt everyone. “I think [the Chinese] realize that if they take out the big hammer, they’re going to hit themselves in the foot,” said Lu of the Eurasia Group. The big question now facing BYD is one that eventually comes for all successful Chinese firms: Can it parlay its domestic success into global dominance? The company has already made inroads in cost-sensitive markets such as India and Southeast Asia and will look to expand further if it isn’t stymied by Western protectionism and concerns around Chinese tech. A battle with Tesla is shaping up here as well—both companies are seeking manufacturing expansions around the world, with BYD announcing new factories in Hungary and Brazil, while Tesla has announced a new facility in Mexico and is reportedly mulling an India expansion. Things could get more complicated if countries are forced to pick sides. “Even if there are major tariff barriers erected in developed-country markets, BYD’s product portfolio means that it can expand significantly in developing-country markets, where its supply chain vertical integration gives it some major cost advantages,” said Paul Triolo, a China analyst and tech policy lead at the Albright Stonebridge Group. Tesla’s heavy dependence on China, paradoxically, could end up evening the scales. “There’s risk with having 52 percent of my manufacturing come from one place,” said Le of Sino Auto Insights. “Maybe that balances out or zeroes out the growth that BYD has outside of China.” For now, however, experts say the immediate geopolitical impact of BYD’s latest achievement will largely be limited to a major public relations victory for China. The electric car race is somewhat analogous to the smartphone industry, with Apple and South Korea’s Samsung duking it out at the top and everyone else trying to catch up. “I don’t think there’s any real risk here for U.S. competitiveness. The U.S. has Tesla; China has BYD. They’re the two leading EV companies in the world,” McKerracher said. “They are so far ahead of everyone else that it’s not like either of those are being left behind.”  Rishi Iyengar is a reporter at Foreign Policy. Twitter: @Iyengarish Christina Lu is a reporter at Foreign Policy. Twitter: @christinafei Commenting on this and other recent articles is just one benefit of a Foreign Policy subscription. Already a subscriber?\n\t\t\t\tLog In. Subscribe\nSubscribe View  Comments Join the conversation on this and other recent Foreign Policy articles when you subscribe now. Subscribe\nSubscribe Not your account?\n\t\t\t\tLog out View  Comments Please follow our comment guidelines, stay on topic, and be civil, courteous, and respectful of others’ beliefs.  I agree to abide by FP’s comment guidelines. (Required) The default username below has been generated using the first name and last initial on your FP subscriber account. Usernames may be updated at any time and must not contain inappropriate or offensive language. Username I agree to abide by FP’s comment guidelines. (Required)  Read More The security of clean energy is easier to manage than the security of oil. | China’s EV industry is ascendant everywhere—except the U.S. Is that about to change? | New electric vehicle restrictions will end up hurting U.S. interests. | You’re on the list! More ways to stay updated on global news: By submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time. Beijing’s unwillingness to let go of certain claims suggests there’s more at stake than reversing past losses. A close look at the foundations of U.S. influence—and the lack of it. Iran’s aging supreme leader is ensuring that any successor will stay the course. The chair of the Federal Trade Commission makes the case for competition in an increasingly consolidated world. | | | | | | Sign up for World Brief By submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time. Foreign Policy Magazine is a division of Graham Holdings Company. All contents (c) 2024, Graham Digital Holding Company. All rights reserved. Foreign Policy, 655 15th St NW, Suite 300, Washington, DC, 20005. "
}