{
    "title": null,
    "date": "1/13/2024",
    "url": "https://www.sagoodnews.co.za/here-comes-tesla-south-africa/",
    "text": "by SouthAfrica.info Elon Musk’s Tesla Motors will open a South African office this month, which will be managed by Evan Rice, the chief executive of GreenCape, an organisation formed to help develop the market for renewable energy in Western Cape. The South African Tesla operation will start off with only one employee. But Rice told the htxt website that “if we can find some solid business cases and get them going, we will be expanding”, hinting at further announcements for the company’s presence in South Africa and the rest of the continent later in 2016. Rice says the company’s priority in South Africa will be to develop a market for Tesla’s industrial-scale battery pack, called the Powerwall. It was introduced to the world in 2015 by Musk. At the launch, Musk called the revolutionary device “the most suitable and cost-effective way to manage energy grids and supplement renewable energy sources for both industrial and home markets”.  The Tesla Powerwall is a home battery system charged with solar energy that can provide power after sunset. The system can be plugged into the power grid, connected to buildings or paired with solar panels. Utilities can use them to operate their grids more smoothly and avoid having to build more expensive power plants that create pollution. Powerwall batteries are currently manufactured in Nevada, in the US. Tesla already has distribution deals in place to sell Powerwall products in South Africa through several renewable energy companies, including Dako Power and Rubicon, according to Rice. Rice also says the company, together with GreenCape, has spoken to municipal energy providers about feed-in tariffs which would allow customers to sell energy back to the grid. This would help to encourage private capital to invest in the systems, he says. “At the moment, we’re seeing the majority of solar going into shopping malls or retail parks where all the energy produced can be used on site,” Rice explains. “If you could sell some back to the grid it would make (investing in storage) a much more attractive business case and help to leverage private capital.”  While Tesla has no plans to bring the group’s electric vehicles here, the anticipated success of the Powerwall home battery system in South Africa – which is no stranger to electricity constraints – might push forward plans to introduce the hugely popular vehicle in the country. Tesla Motors was founded in 2003 by Musk and a group of Silicon Valley engineers looking to improve the performance and cut the costs of electric motors. The defining aspect of the Tesla vehicles and the Powerwall is the principles of the AC induction motor patented in 1888 by inventor Nikola Tesla. The resulting Tesla Roadster not only set a new standard for non-emission vehicles, but was also the fastest and most cost-effective electric car in the world. Tesla Motors turned its first profit in 2013, according toForbesmagazine, giving Musk a net worth of $13-billion (R209.4bn), while making Tesla a household name in the United States. Born in 1971, Musk grew up in Johannesburg and Pretoria and immigrated to Canada when he finished high school. He sold his first start­up, a company that provided maps and business directories, to Compaq Computer for $22-million. He went on to co-create the PayPal online payment system, which he later sold to eBay for $250m. This, in turn, financed Musk’s interests in alternative energy and space technology. His two business focuses now are Tesla and SpaceX, the private space exploration company dedicated to developing affordable and advanced space travel and research. Described by biographer Ashlee Vance as a “possessed genius on the grandest quest anyone has ever concocted, (Musk) is no less a (chief executive) chasing riches than a general marshalling troops to secure victory. Where Mark Zuckerberg wants to help you share baby photos, Musk wants to save the human race from self-imposed or accidental annihilation.”  Steuart has done some 500 talks on South Africa’s progress since 1994 and SA’s prospects for the future’ "
}