{
    "title": "Elon Musk Used To Tag Along With His Little Sister To Parties As A \nTeenager, But She Insisted He 'Stay 10 Feet Away ...",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/elon-musk-used-tag-along-150917303.html",
    "text": "Tesla Inc. and SpaceX Founder Elon Musk, currently the richest man in the world, had an unconventional journey to the pinnacle of entrepreneurial success. As a teenager, he often followed his younger sister Tosca to clubs and parties seeking social interaction. This anecdote, as detailed in Walter Isaacson's biography \"Elon Musk,\" portrays a stark contrast to his later life. Although he is a household name now, he hated being alone growing up. Living in Toronto with his family, Musk's teenage years were spent mostly reading or working on the computer, while Tosca, described as a \"saucy teenager\" eager to socialize, would often venture out. Despite her objections, Musk insisted on accompanying her, albeit keeping his distance at her request.  According to the biography, he had to “stay 10 feet away” at all times. He would carry a book to read at the clubs or parties they attended. This early inclination toward solitude and study was a precursor to Musk's innovative ventures in college. Don't Miss: Airbnb was worth $47 billion at IPO. This startup is automating the trillion-dollar hospitality market. This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it? After relocating from South Africa to Canada for education at Queen's University in Ontario, he later transferred to the University of Pennsylvania on a scholarship in 1992. There, along with his roommate Adeo Ressi, Musk rented a large, off-campus frat house, which they transformed into a nightclub. This was a strategic decision to pay their rent, exemplifying Musk's early entrepreneurial skills. They charged a $5 entry fee for their nightclub, which featured blacklights, luminescent spray paint and metal junk sculptures, effectively turning their house into an unlicensed speakeasy. Despite the raucous atmosphere of the parties, Musk was not one to indulge in the revelries. He was not a big drinker, and as he mentioned in Ashlee Vance's book \"Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future,\" he mostly stayed sober during these events, remarking, \"Somebody had to stay sober during these parties.\" Trending: What decision made this 20-year-old a millionaire in 1 year? His business-focused approach was further exemplified by instances where Musk would be found alone in his room playing video games, even as a party he organized was in full swing downstairs. Musk's resilience and determination were also evident in his teenage years in South Africa, which were marked by challenging experiences of bullying some with instances leading to hospitalization. He described the environment as violent, akin to \"Lord of the Flies,\" with bullying gangs targeting victims, including himself. His stand against bullying, where he defended another student, made him a target as well. His transition from a young man desperate for social interaction to a leader in innovative ventures is a compelling story of personal growth and determination. Despite challenges, he managed to persevere. Musk’s establishment of Tesla, a trailblazer in electric vehicles, exemplifies this tenacity. His story offers inspiration not only to budding entrepreneurs but to anyone with a vision, urging them to persist. Investing in startups and innovative ideas not only offers the potential for major financial gains but also helps foster a future you believe in. Read Next: Elon Musk reportedly bought 6,000 acres of land outside of Austin. Here’s how to invest in the city’s growth before he floods it with new tech workers. Hedge funds intend to snatch all pre-IPO shares of future AI unicorns before you can. But there is one venture product investing on your behalf. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? APPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report This article Elon Musk Used To Tag Along With His Little Sister To Parties As A Teenager, But She Insisted He 'Stay 10 Feet Away' At All Times originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}