{
    "title": "You can get a used Tesla for $20,000 from Hertz. Buyer beware.",
    "date": "1/11/2024",
    "url": "https://www.businessinsider.com/used-tesla-hertz-sales-cheap-red-flags-battery-depreciation-2024-1",
    "text": "       A slew of used Teslas have hit the Hertz car sales website after the company announced Thursday it was selling off 20,000 EVs from its fleet. Across the US, there were 657 Teslas to choose from — mostly Model 3s — with some listings as low as $20,125 when we checked on Thursday afternoon. It's a screaming deal for shoppers in the market for a used Tesla or any budget-minded EV shopper, a demographic slowly making up most of the electric car market. A car-rental company like Hertz is always a good place to look for a deal on a used car, but when it comes to EVs, there are a number of different pitfalls to keep in mind since the used market is not near as mature for battery-powered vehicles. A used Tesla that has been in a rental fleet is likely to used much more frequently than one that's been personally owned. You can see that in the difference in mileage when you look on Kelley Blue Book for a used Model 3. The first one that came up here in Southeast Michigan was listed for $27,995 at a local dealership with 46,171 miles. That $20,125 Model 3 we found on the Hertz website, a 2021 model, was listed with 92,789 miles. Related stories Mileage is always something to consider when shopping for a used car, but with electric vehicles little is known at this early stage about battery deterioration at high mileages. This mystery in the valuation equation has created a headache for the industry as more electric cars hit the used market. Used cars tend to require more maintenance than a car fresh from the factory. With an EV that can look different than a simple part or filter replacement. One of the reasons Hertz cited in its Thursday filing for reducing its EV fleet was the elevated cost of maintenance for these vehicles. Teslas in particular are notoriously difficult to service, due to the lack of brick-and-mortar infrastructure for Tesla service and the level of technology packed into the cars. Even something as simple as a fender bender can be difficult to manage with a Tesla, and these cars are a lot easier to total than their gas-powered counterparts. While $20,000 is an incredible deal in today's car market (the average new car sells for around $46,000, and the average new EV closer to $50,000), adding an EV to your driveway comes with more than just the sticker price on the car. In order to get the most out of an electric vehicle, it's usually recommended to have some form of fast charging at home. These chargers cost anywhere from $250 to $750, and installation can run you somewhere around $1,600. Depending on your state, the energy usage for overnight charging can start to get pricey as well. Perhaps one of the reasons you can get such a good deal on a Tesla at Hertz right now is that the outlook for EV value retention is pretty grim at the moment. A recent study from iSeeCars found that electric cars have an average five-year depreciation rate of 49.1%, compared to an industry average of 38.8%. Tesla's Model 3 does fare the best in resale values, only falling 42.9% in five years, but as Tesla lathers on more discounts for new models, that could quicken the pace of depreciation. Read next Jump to "
}