{
    "title": "Cathie Wood buys more Tesla stock on a dip and keeps on cutting her \nCoinbase stake",
    "date": "1/12/2024",
    "url": "https://www.marketwatch.com/story/cathie-wood-buys-more-tesla-stock-on-a-dip-and-keeps-on-cutting-her-coinbase-stake-2ad975ae",
    "text": "When it comes to Tesla Inc.’s stock, Cathie Wood seems to subscribe to the Wall Street strategy of buying on dips and selling on rallies. Wood’s flagship ARK Innovation exchange-traded fund \n        ARKK\n       bought 94,733 shares of the electric-vehicle giant on Thursday, which at the closing price that day would be valued at $21.53 million. Tesla’s stock \n        TSLA,\n        -2.25%\n       is the second-largest holding of the ETF, with a weighting of 7.9%, behind only Coinbase Global Inc.’s stock \n        COIN,\n        +3.28%\n       at 9.28%. After a stretch of trimming its stake in Tesla into mid-October 2023, the ETF started buying again in December. The ETF bought 93,965 shares valued at $23.22 million on Dec. 20, a day the stock sank 3.9%. On Jan. 3, when the stock sank 4%, the ETF purchased 91,194 shares valued at $21.75 million. On Thursday, the stock slumped 2.9% to a two-month low, as rental-car company Hertz Global Holdings Inc.’s \n        HTZ,\n        -3.21%\n       move to downsize its EV fleet due to weak demand helped put pressure on EV stocks. Also read: Lucid’s stock dives toward another record low after EV deliveries disappoint When the ETF made its last sale of Tesla shares on Oct. 18, the stock was up 97% year to date, while the S&P 500 index \n        SPX\n       was up 12.4%. The ARK Innovation ETF, which had $8.12 billion in net assets as of Nov. 30, invests in “disruptive innovation,” or companies that introduce technologies and products that could potentially change the way the world works. Meanwhile, the ETF continues to trim its stake in cryptocurrency exchange Coinbase, whose stock has been soaring as the much-anticipated approval of spot bitcoin ETFs fueled a frenzy in cryptocurrency markets. Wood’s ETF sold 26,301 shares, valued at $3.71 million, on Thursday. Since Dec. 20, when the ETF started buying Tesla’s stock, it has sold a total of 604,074 shares valued at a total of $96.47 million. Read: Don’t assume Coinbase’s stock will benefit from the bitcoin ETF, analysts say Also read: Bitcoin is a ‘public good,’ says ARK’s Cathie Wood as spot ETF debuts Coinbase’s stock, which slumped 5% through morning trading on Friday, has rocketed 182% over the past 12 months, while bitcoin \n        BTCUSD,\n        +0.51%\n       has run up 136% and the S&P 500 has advanced 19.9%. The ARK Innovation ETF has climbed 34.4% over the past year. Terns Pharma is due to release data from an early-stage trial of an obesity treatment in pill form in the second half. Positive data would send the stock higher. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Visit a quote page and your recently viewed tickers will be displayed here. "
}