{
    "title": "BYD beats Tesla EV sales in Q4 for first time, but remains underdog",
    "date": "1/2/2024",
    "url": "https://www.cbtnews.com/byd-beats-tesla-ev-sales-in-q4-for-first-time-but-remains-underdog/",
    "text": "Your #1 source for auto industry news and content BYD surpassed Tesla's quarterly electric vehicle sales total for the first time, marking a new phase in the two companies' competition for market share Chinese electric vehicle maker BYD surpassed Tesla in both production and sales for the second consecutive year in 2023, as the two companies compete for market share in China’s rapidly growing electrified segment. BYD announced on January 1 that it built more than 3 million hybrid and battery-powered units in 2023, beating Tesla’s 1.84 million revealed the day after. Of its production total, the Chinese automaker’s electric-only models accounted for more than half at 1.6 million units. Thus, by excluding hybrids, the Elon Musk brand remains the top EV producer, although only by some 240,000 units. In terms of sales, BYD sold 3.02 million units, 1.6 million of which were fully electric. Tesla sold 1.81 million units in 2023, again beating its Chinese competitor by a modest amount. However, although the U.S. automaker achieved its sales target during a rocky year for the electric vehicle market, its fourth-quarter sales were surpassed by BYD, a first for the company. From October through December, BYD sold 526,000 battery-powered models, beating Tesla’s delivery total of 485,000 units, a new record for Q4. This upset underlines the Chinese EV segment’s rapid growth as much as BYD’s increasing strength in both domestic and foreign markets. Although Tesla finished 2023 ahead of the China-based automaker, it is as vulnerable to competition overseas as it is in North America, if not even more so. BYD owns more than one-third of its domestic market, while Tesla commands approximately one-fifth. To retain its dominant position among electric vehicle manufacturers, Tesla will need to address the problems limiting its reach, such as its aging model lineup, unaffordable pricing, and the controversial antics of its CEO. Stay up to date on exclusive content from CBT News by following us on Facebook, Twitter, Instagram and LinkedIn. Don’t miss out! Subscribe to our free newsletter to receive all the latest news, insight and trends impacting the automotive industry. CBT News is part of the JBF Business Media family. Tesla  Contact us: Info@CBTNews.com © Created by CBT News | Atlanta Web Design We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. "
}