{
    "title": "'No separate policy for Tesla'",
    "date": "2/9/2024",
    "url": "https://www.deccanherald.com/business/companies/no-separate-policy-for-tesla-2888501",
    "text": "Follow Us Hyderabad: The Centre on Friday reiterated that any separate policy is not in the making to incentivise an investment by the US EV car maker Tesla. “Sir, there is no separate policy that has been framed by the Ministry of Heavy Industries for providing incentives to US-based Tesla. However, two Production Linked Incentive (PLI) Schemes are being implemented by the Ministry of Heavy Industries for promotion of Advanced Automotive Technology (AAT) Products including electric cars and Advanced Chemistry Cell (ACC) Batteries, with an aim to enhance India’s manufacturing capabilities,” the Union Minister of State for Heavy Industries, Krishan Pal Gurjar stated in a written reply to a query raised by the V Vijaysai Reddy, a Member of Parliament belonging to the Yuvajana Sramika Rythu Congress Party. Prime Minister Narendra Modi’s meeting with Elon Musk, the co-founder and CEO of Tesla, during his US visit last June, raised hopes of the EV maker investing in India. However, the expected investment is yet to materialise. In his reply Gurjar specified that the application window of Production Linked Incentive (PLI) Scheme for Automobile and Auto Component Industry, has been closed and Tesla can apply for PLI scheme in another newly launched programme. The Modi government on May 12, 2021 approved the Production Linked Incentive (PLI) scheme, ‘National Programme on Advanced Chemistry Cells (ACC) Battery Storage’ in order to promote manufacturing in the country. The budgetary outlay of the scheme was Rs 18,100 crore. The scheme envisaged to establish a cumulative ACC battery manufacturing capacity of 50 GWh. The government also approved another PLI Scheme for Automobile and Auto Component Industry on September 15 the same year with a budgetary outlay of Rs 25,938 crs, which provides financial incentives to boost domestic manufacturing of Advance Automotive Technologies (AAT) products including electric vehicles and their components. While there has been much speculation about a special scheme being tailored for Tesla, the government has time and again denied it.  Gurjar’s reply in Rajya Sabha comes at a time when domestic  EV manufacturers have been showing resistance over  possible lower import taxes on imported EVs and also Modi government’s insistence on Tesla’s commitment on investment and manufacturing should the government provide lower taxes. #Elections2024 "
}