{
    "title": "Musk pays $2K to bakery after Tesla canceled Black History Month order",
    "date": "2/27/2024",
    "url": "https://www.businessinsider.com/elon-musk-pays-bakery-tesla-pies-canceled-black-history-order-2024-2",
    "text": "       Tesla has settled a bill with a bakery that said it ran up $2,000 in costs for a massive order for the company, which was then canceled at short notice, The Guardian reported. Voahangy Rasetarinera, the owner of The Giving Pies in San Jose, California, wrote on Instagram last week that Tesla had \"hurt my small Black women-owned business\" by canceling an order for 4,000 pies after she hastily bought supplies and rallied staff to meet the tight deadline requested by the company. \"To fulfill the order, I had turned down other Black History Month catering inquiries, purchased supplies, and prepared for a demanding production schedule,\" she wrote. After the story spread, Elon Musk responded on X, writing: \"Just hearing about this. Will make things good with the bakery.\" Just hearing about this. Will make things good with the bakery. People should always be able to count on Tesla trying its best. Rasetarinera confirmed to The Guardian Monday that she had received $2,000 from Tesla. The situation unfolded after Rasetarinera received an order for 2,000 pies on February 14 from a Tesla representative, which was quickly doubled to 4,000 the next day, she wrote on Instagram. The order was worth $16,000, NBC Bay Area reported, though other outlets set that figure at $6,000. Related stories Rasetarinera told ABC7 that although Tesla did not immediately pay the invoice, she proceeded anyway because she believed \"they are professional.\" However, after following up on the invoice she received a text message from the company representative saying the order would no longer be needed, she said. While the bakery has a cancellation policy, it could not recoup its costs because Tesla had not paid the invoice, NBC Bay Area reported. Tesla did not respond to Business Insider's request for comment, but as the story spread Rasetarinera told ABC7 that a company representative had reached out to her. The representative said that the employee who had made the order had not been authorized to promise any payment, the outlet reported. Rasetarinera's post garnered massive attention, gaining hundreds of comments — some supportive of her business, others defending Tesla. According to local outlet KRON4, the small business has seen an outpouring of community support since she posted about the situation. San Jose Mayor Matt Mahan wrote on X that when he visited the bakery on February 25 \"the line was wrapped around the block!\" Rasetarinera said in a February 2 post celebrating Black History Month that she's of Madagascan heritage. \"As I reflect on this ordeal, I am reminded of the resilience and determination that have propelled me forward as a black woman entrepreneur,\" Rasetarinera wrote in her original Instagram post. Read next Jump to "
}