{
    "title": "Safety Group Urges Tesla Boycott With Super Bowl Ads, Targeting \nSelf-Driving Software's Safety Issues: 'D",
    "date": "2/12/2024",
    "url": "https://www.benzinga.com/news/24/02/37062459/safety-group-urges-tesla-boycott-with-super-bowl-ads-targeting-self-driving-softwares-safety-issues",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The Dawn Project, a safety advocacy group, has launched a Super Bowl advertising campaign calling out Tesla Inc. TSLA for its self-driving software’s safety issues. What Happened: In a press release on Sunday, The Dawn Project, founded by tech billionaire Dan O’Dowd,  released two commercials during Super Bowl LVIII. The ads highlight the dangers of Tesla’s self-driving software and urge consumers to boycott the company. The commercials feature real crash footage from incidents involving Tesla’s self-driving software, particularly focusing on areas where Tesla admits its software may not operate reliably, such as highways with cross-traffic. The Dawn Project’s ads call out Tesla’s inaction following fatal crashes on roads where the company acknowledges its software isn’t safe to engage. The group demands that Tesla be held accountable for these incidents and urges consumers to boycott the company. The ads also call on the National Highway Traffic Safety Administration (NHTSA) to ban Tesla’s defective software. These ads continue The Dawn Project’s efforts to raise awareness about the safety issues of Tesla’s self-driving software. Last year, the group released an ad disclosing the results of its safety tests of Tesla’s Full Self-Driving (FSD) software, which included the software running down a mannequin on the road and driving into oncoming traffic. “Through numerous nationwide TV commercials, including at last year's Super Bowl, five full-page ads in the New York Times and online advertising, we have tried to pressure Tesla and Elon Musk to do the right thing and take their defective software off our roads. However, it seems that the only thing that will pressure Tesla and Elon Musk to do the right thing is to deny them your money,” O’Dowd said. See Also: Tesla Model Y Price Cut Alert: EV Giant Temporarily Trims Prices Of Its Bestseller, Reportedly Quashes Re Why It Matters: Tesla’s self-driving software has been under intense scrutiny recently. The company has faced a series of controversies and recalls related to its Autopilot system. In December, Tesla recalled 2.03 million vehicles equipped with all versions of Autosteer, including its higher-end models S and X and its lower-end Model 3 and Y vehicles, due to legal challenges and controversies surrounding its Autopilot system. Earlier this month, Tesla announced its first-ever recall of the Cybertruck as part of a larger 2.2 million vehicle callback, due to concerns about a smaller font size for warning lights compromising the visibility of crucial safety information. This was followed by a fresh NHTSA scrutiny over steering issues in the Model 3 and Model Y EVs. Read Next: Rivian Beats Tesla, BMW In Customer Satisfaction: Elon Musk’s EV Giant Slips To 5th Position: Survey Image made via photos on Shutterstock Engineered by Benzinga Neuro, Edited by \nPooja Rajkumari The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}