{
    "title": "Tesla Plans Solar Panel Manufacturing In India Amid Government's Rs 75,000 \nCrore Push: Report",
    "date": "2/14/2024",
    "url": "https://swarajyamag.com/news-brief/tesla-plans-solar-panel-manufacturing-in-india-amid-governments-rs-75000-crore-push-report",
    "text": "MONTH END OFFER: Subscribe For Just ₹̶2̶9̶9̶9̶ ₹699 About Swarajya Swarajya is a publication by Kovai Media Private Limited.Swarajya - a big tent for liberal right of centre discourse that reaches out, engages and caters to the new India. Useful Links Useful Links Participate Stay Connected News Brief Kuldeep Negi Feb 14, 2024, 02:44 PM | Updated  02:44 PM IST Save & read from anywhere! Bookmark stories for easy access on any device or the Swarajya app. US electric automaker Tesla is reportedly looking for local partners to make its rooftop solar panels in India. The selected partner will help with the manufacturing and installation, while Tesla will provide technology and sales expertise. The Elon Musk-led has already communicated its plans to the government and is looking for subsidies and other grants for the venture, Livemint reported citing sources. This comes as Prime Minister Narendra Modi on Tuesday (12 February) announced the launch of PM Surya Ghar: Muft Bijli Yojana (free electricity scheme) to provide up to 300 units free electricity to 1 crore households in the country. Also Read: BJD Supports Ashwini Vaishnaw's Rajya Sabha Nomination From Odisha, Here's List Of Four BJP Candidates From Madhya Pradesh The project, with an investment of Rs 75,000 crore, aims to light up 1 crore households by providing up to 300 units of free electricity every month though rooftop solar panels. Under the scheme, the government will provide substantive subsidies, credited directly to people’s bank accounts, to heavily concessional bank loans on installation of roof top solar panels. Apart from electric vehicles, Tesla manufactures several home power products covering solar power generation and storage products such as Solar Roof, Powerwall, a battery power storage unit, and solar panels. Tesla had earlier last year submitted a proposal to the government to set up a factory to manufacture battery storage systems. This proposal includes using Tesla's \"Powerwall\" system, which can store power from solar panels or the grid for use during outages or at night. While Tesla has been in discussions about establishing an electric vehicle factory in India, its plans for battery storage have not received widespread attention. During its meetings with officials in New Delhi last year, Tesla presented its proposal to support India's battery storage capabilities with its Powerwall system. However, the Indian government indicated that it would not provide incentives for a battery storage factory. Instead, the government suggested the possibility of offering subsidies to consumers who purchase Tesla's battery storage products, creating a fair business model for the company. Tesla's broader plans in India extend beyond electric vehicles, as the company is interested in finding residential and industrial customers for its battery storage systems, such as the Powerwall. Also Read: Prime Minister Modi Announces PM Surya Ghar Free Electricity Scheme: Here's All You Need To Know About The Rs 75,000 Crore Initiative Save & read from anywhere! Bookmark stories for easy access on any device or the Swarajya app. Kuldeep is Senior Editor (Newsroom) at Swarajya. He tweets at @kaydnegi. Join our WhatsApp channel - no spam, only sharp analysis Comments ↓ Introducing ElectionsHQ + 50 Ground Reports Project  The 2024 elections might seem easy to guess, but there are some important questions that shouldn't be missed.  Do freebies still sway voters? Do people prioritise infrastructure when voting? How will Punjab vote?  The answers to these questions provide great insights into where we, as a country, are headed in the years to come.  Swarajya is starting a project with an aim to do 50 solid ground stories and a smart commentary service on WhatsApp, a one-of-a-kind. We'd love your support during this election season.  Click below to contribute. "
}