{
    "title": "Tesla Layoff Rumors, Rivian Drops Entry-level Pricing, Lucid's Unusual \nPartnership And More: Biggest EV S",
    "date": "2/10/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/37052646/tesla-layoff-rumors-rivian-drops-entry-level-pricing-lucids-unusual-partnership-and-more-biggest",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Electric vehicle stocks ended the week on a mixed note, with high-profile stocks rising along with the broader market while most struggling startups posted weekly declines. Shares of market leader Tesla, Inc. TSLA made a comeback after pulling back to their lowest level in about nine months. Here are the key events that happened in the EV space during the week: Tesla China Sales, India Rumors and More:  Tesla sold 71,447 made-in-China EVs in January, marking a 24% month-over-month drop but a 8% year-over-year increase, said China Passenger Car Association, according to CnEVPost. Of the total, the company sold 39,881 cars domestically, while the remaining 31,566 units were exported. Domestic sales were up about 48.5% year-over-year but declined over 47% from December. Separately, a report said Tesla upgraded its hardware for its Model Y EVs in China to the HW 4.0 version. This will improve the vehicle’s self-driving capabilities. The January sales data from CPCA showed that the break-up of Tesla’s total sales was 41,873 Model Ys and 29,574 Model 3s. Tesla stirred concerns among its workforce this week as it asked its managers in the U.S. to categorize the roles of their team members as either critical or non-critical, Bloomberg reported. The development came close on heels of the company cancelling some employees' biannual performance reviews and reporting its second straight quarter of a double miss. Tesla’s India plans also continue to be in limbo. The country’s Ministry of Heavy Industries clarified in a parliamentary session on Friday that it wasn’t contemplating a separate policy to accommodate the EV giant’s request for incentives, local media outlets reported. Tesla has been clamoring for reduced import duties for its cars even as the Indian authorities are firm on having the company localize manufacturing. Rumors suggest the company might set up a manufacturing plant in the northwestern state of Gujarat. Rivian Announces New Battery Pack Options: Amid the slowing global EV adoption, Rivian Automotive, Inc. RIVN deemed it fit to lower prices. Instead of announcing outright price cuts, the Irvine, California-based company announced two new battery packs, namely the Standard and Standard+, which will reduce the starting prices of its R1T and R1S EVs by $3,100 each. The company also said customers may qualify for a federal tax credit of $3,750 on the purchase of vehicles with the newly introduced battery options. See Also: Best Electric Vehicle Stocks Ford Wants To Go Low-end With EVs: Legacy automaker Ford Motor Co. F, which has been struggling with its EV transition, is set to tap the low end of the market. On an earnings call with analysts, CEO Jim Farley said, “We made a bet in silence two years ago. We developed a super-talented skunkworks team to create a low-cost EV platform.” “We are working really hard to be on the low end of that range because we think it’s appropriate to run the business,” he added. He also said that the Gen 2 platform products will be profitable after the first year of their launch. Lucid Strikes Pact With Saks: This week, luxury department store chain Saks announced a partnership with Lucid Group, Inc. LCID under which the former will offer exclusive demo drive experiences of the Lucid Air at select Saks Fifth Avenue store locations. Additional features include a dedicated Lucid landing page on Saks.com, content on Saks-owned digital channels and an event at the new Saks Fifth Avenue West Coast flagship in Beverly Hills. Nikola Snubs Convicted Founder: Nikola Corp. NKLA announced Friday that it rejected a slate of five dissident nominees for election at its annual shareholders meeting. The nominees were proposed by an entity controlled by former chairman and founder Trevor Milton. The rejection was based on the grounds that the nominees have no public company experience, add no skills or experience to the board and lack the expertise or knowledge needed to navigate the complexities of a zero-emissions trucking and energy infrastructure business. The KraneShares Electric Vehicles and Future Mobility Index ETF KARS ended Friday’s session down 0.19% at $21.43, according to Benzinga Pro data. For the week, the ETF added 3.23%. Read Next: Cathie Wood’s Ark Says Tesla’s Total Addressable Market Will Jump Tenfold With $25K Next-Gen EV Launch EV Stock Performances For Week: Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}