{
    "title": "Auto shop shares footage of repair job on Tesla after it was vandalized: \n'Some people have no respect'",
    "date": "2/25/2024",
    "url": "https://www.thecooldown.com/green-home/tesla-model-y-vandalism-footage-tiktok/",
    "text": " © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. The incident represents a concerning trend of EVs being targeted — seemingly by individuals clinging to gas-guzzling modalities. Photo Credit: TikTok Destruction is never the answer. A recent social media moment brought attention to an act of vandalism against a Tesla Model Y. On TikTok, Denver auto shop Mile High Customs (@milehighcustomsco) shared footage of extensive scratches keyed into the passenger side of a client's Tesla that they had previously wrapped. \"They keyed the whole entire passenger side,\" the autorestyler explains. \"There were some areas that looked a little worse than others … However, after putting the vinyl wrap on top, it really did a good job of hiding it. \"Luckily, the scratches on this vehicle weren't too bad, and it did not have to go to a body shop.\" The malicious damage serves as a sobering reminder that some still react to electric vehicles with hostility rather than celebration. \"Some people have no respect for other [people's] property!\" the video's caption read. Thankfully, the custom shop easily replaced the Tesla's wrap, minimizing costs and frustration. However, the incident represents a concerning trend of EVs being targeted — seemingly by individuals clinging to gas-guzzling modalities. Attacks like this one may intend to intimidate EV owners in an attempt to slow down adoption. However, damage or not, the Tesla owner is still reaping the ongoing benefits of EVs: zero carbon pollution, better performance on the road, and a heavier wallet. Ultimately, the vandal's actions reflect poorly on themselves, not the Tesla owner, and it may even galvanize efforts to spread EV adoption. Whether easing into battery power with a plug-in hybrid or diving in with a fully electric model, drivers deserve to feel safe and empowered by their eco-friendly decisions. Other TikTokers were not shy about sharing their support for the Tesla owner. \"This is why I'm scared to wrap my Tesla, don't wanna draw attention to it,\" commiserated one EV driver. Another aptly states, \"People suck.\" Join our free newsletter for easy tips to save more, waste less, and help yourself while helping the planet. © 2024 THE COOL DOWN COMPANY. All Rights Reserved. Do not sell or share my personal information. "
}