{
    "title": null,
    "date": "3/9/2024",
    "url": "https://www.thehindubusinessline.com/news/world/teslas-wall-street-fans-turn-squeamish-as-ev-turmoil-mounts/article67931972.ece",
    "text": "Get businessline apps on Connect with us TO ENJOY ADDITIONAL BENEFITS Connect With Us Get BusinessLine apps on By  Bloomberg Comments READ LATER Tesla Inc’s support among Wall Street bulls is weakening with the lowest percentage of analysts since April 2021 recommending that investors buy the stock. The outlook for Elon Musk’s electric carmaker has been darkening rapidly this year as demand for electric vehicles (EVs) continued to decelerate. This week, the backdrop worsened further as data showed competition from other car companies in China is getting fiercer and as production at Tesla’s Germany factory was halted amid disruption. As a result, just 20 of the 59 analysts covering Tesla have buy ratings on the stock. And one long-term bull, Morgan Stanley analyst Adam Jonas, thinks the company could even lose money in its auto business this year. This is going to be “a challenging year for EVs,” Jonas wrote in a note this week, adding that he expected Tesla’s profits in the first half of 2024 to miss expectations and that margins in the EV manufacturing business, excluding income from retail and EV credits, could be in the red. The analyst also lowered his 12-month price target on the stock to $320 from $345, but maintained his buy rating. The shares are trading for less than $180 after plunging 28 per cent to start 2024. Another Tesla bull, Robert W Baird analyst Ben Kallo, is also growing concerned. He’s had a buy rating on the shares since October 2020, but on Wednesday he said that analysts’ average estimates for first-quarter deliveries were “too high.” He also noted that the company’s willingness to lower the prices of its vehicles and its failure to offer clear guidance on sales volumes make the “demand argument difficult to decipher in the near term.” Analysts on an average expect Tesla to deliver over 474,000 cars in the first three months of the year, according to data compiled by Bloomberg. Kallo now estimates it be around 421,100 units. The stock, meanwhile, is unravelling fast. Tesla is the biggest decliner in the Nasdaq 100 Index this year, returning to that unenviable position after this week’s 12 per cent selloff. It’s the second double-digit weekly loss for the shares this year, after the 14 per cent drop in the week ending Jan. 26, when the company reported fourth-quarter results and said 2024 growth will be “notably lower.” The stock was trading nearly unchanged at 10:26 a.m. in New York on Friday. A big part of Tesla’s troubles is the swing in expected EV demand. Many experts thought electric vehicles would be broadly adopted by now, but the reality is it’s still seen as a fairly new, expensive technology, with a charging infrastructure that isn’t fully built out. So mainstream, cost-conscious consumers aren’t buying in yet. Add to that a high interest rate environment and the plunging value of used EVs, and it becomes clear why the industry hasn’t seen broad enthusiasm for the cars. “We believe there is still a material gap between consumer perception versus the reality of EVs — particularly in the areas of price and maintenance,” said George Gianarikas, an analyst with Canaccord Genuity. Tesla isn’t the only automaker struggling with this. But as a pure-play EV maker with an expensive valuation, its stock is most at risk. Traditional auto manufacturers can earn some much needed cash flow from sales of hybrids and plain-old gas-powered cars while consumers ease into the new EV technology. But Tesla doesn’t have that luxury. Also read: Billionaire Elon Musk says X’s long-form videos will soon be available on smart TVs If Tesla has had one key self-inflicted wound it’s in the development of its self-driving software. The company has had to recall millions of cars due to problems with its driver-assistance system causing crashes. For investors, it’s unclear when, or if, the company will have the technology ready for road use. Still, despite the challenges and the rout in Tesla shares this year, the stock continues to trade at a hefty valuation of 59 times forward earnings. That compares with low-to-mid-single digits for General Motors Co. and Ford Motor Co. Tesla’s also the most expensively valued company among its mega-cap peers. The average price-to-forward-earnings ratio for the Bloomberg Magnificent 7 Price Return Index stands at 31. “Tesla’s valuation is rich,” Bloomberg Intelligence automotive analyst Steve Man said. “Investors are concerned about the timing on the implementation of the full-self driving software, on top of the price cuts that seem never-ending.” More stories like this are available on bloomberg.com Comments BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Terms & conditions  |  Institutional Subscriber "
}