{
    "title": "Fisker Stock: EV Startup Plummets After Tesla Rival Mulling Bankruptcy \nReport - THE BHARAT EXPRESS NEWS",
    "date": "3/13/2024",
    "url": "https://thebharatexpressnews.com/fisker-stock-ev-startup-plummets-after-tesla-rival-mulling-bankruptcy-report/",
    "text": " Fisker (FSR) fell more than 40% in trading late on Wednesday, following a report that the US EV startup and potential rival to Tesla is preparing for a possible bankruptcy filing. X Fisker has hired restructuring advisers to help with a possible bankruptcy filing, The Wall Street Journal reported, citing sources. The EV startup said last month it could run out of money this year and issued a going concern warning.  At the end of February, Fisker postponed its full 2023 financial results because there were not enough accountants. Fisker has struggled with stagnant demand for electric vehicles and the persistent production hurdles many EV startups face.  In June, Fisker finally began U.S. deliveries of its first electric car, the Ocean SUV. Fisker shares fell 45% after hours on Wednesday.  Shares rose 3.5%, or 1 cent, to 32 cents on Wednesday, but are down 82% in 2024 alone. Tesla CEO Elon Musk recently noted this Rivian car industry (RIVN) could go bankrupt within six quarters.  Rivian’s production and deliveries are much stronger than Fisker’s, but its 2024 production expectations were disappointing and it put a planned factory in Georgia on hold. Luxury EV maker Clear engine (LCID) recently cut its 2024 production guidance well below expectations amid weak demand and prices. Tesla is profitable and an EV giant, but profits have fallen and deliveries are expected to fall sharply in the first quarter compared to the fourth quarter, despite continued price cuts and incentives worldwide. Rivian shares moved higher in late trading.  Shares fell 5.3% to 11.71 on Wednesday, a third straight decline after a recent rebound from record lows. Lucid Stock rose slightly during extended action. Tesla stock fell fractionally overnight.  Shares fell 4.5% to 169.50 on Wednesday, the lowest since May.  TSLA stock is down nearly 32% in 2024, making it the worst performer within the S&P 500 index. Before Wednesday’s open, Wells Fargo downgraded the EV giant to sell.  After the close, UBS cut its Tesla price target from 225 to 165. Both joined other analysts in lowering first-quarter delivery targets and full-year earnings estimates. Follow Ed Carson on Threads at @edcarson1971 and X/Twitter at @IBD_ECarson for stock market updates and more. YOU MAY ALSO LIKE: Best growth stocks to buy and watch IBD Digital: Unlock IBD’s premium stock lists, tools and analysis today Market resilient, but this gauge should worry you  Save my name, email, and website in this browser for the next time I comment.   Δ "
}