{
    "title": "Tesla CEO Elon Musk Wants German Authorities To 'Absolutely Find A Way' To \nCatch Giga Berlin Arsonists -",
    "date": "3/27/2024",
    "url": "https://www.benzinga.com/news/24/03/37975553/tesla-ceo-elon-musk-wants-german-authorities-to-absolutely-find-a-way-to-catch-giga-berlin-arsonists",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla Inc TSLA CEO Elon Musk reportedly wants an investigation into the arson attack at the company’s gigafactory in Berlin and for those behind the attack to be caught. What Happened: Musk wants an investigation into the arson attack on the factory which interrupted production for several days, Brandenburg’s Minister of Economic Affairs Jörg Steinbach told German television RBB24. \"Elon Musk has made it clear what he expects from us. In his words, ‘You absolutely need to find a way to apprehend this attacker. People shouldn't be left with the wrong message if they escape capture,’\" Steinbach said. The arson attack on the factory in early March caused a power outage and halted production for about a week. It was claimed by a far-left activist organization known as the Vulkan Group. The Federal prosecutor’s office is currently investigating the event. Musk met with Steinback on his visit to Berlin following the attack. Tesla’s public perception in the region also came up in the discussion including the public resistance to its plans to expand the factory site, the report said. Local people have protested the proposed expansion, citing environmental concerns. \"We were able to convince him that Tesla needs to make significant changes to its public relations work, that it needs to open up significantly more, and that it needs to become a lot more part of the community.\" Steinbach said about his discussion with Musk. Tesla Berlin plant manager Andre Thierig told RBB24 that the public resistance, however, is based on “misinformation.” Proposed Expansion: Tesla's gigafactory in Berlin is its only factory in Europe. As per the company's 2023 annual report, the factory currently has an installed annual vehicle capacity of 375,000 Model Y vehicles. The company is currently looking to expand the plant to double its capacity for battery production to 100-gigawatt hours and car production to 1 million units annually. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Elon Musk Says Cost Of Making An Optimus Is Half That Of Manufacturing A Tesla EV Despite Complexity Of Humanoid Robot Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}