{
    "title": "Why Tesla's Stock is Plummeting Due to Elon Musk's Unfinished Projects, \nClaims Investor Ross Gerber",
    "date": "3/5/2024",
    "url": "https://www.globalvillagespace.com/tech/why-teslas-stock-is-plummeting-due-to-elon-musks-unfinished-projects-claims-investor-ross-gerber/",
    "text": "Tesla’s Stock Plummets as Elon Musk’s Unfinished Projects Take a Toll, Investor Claims Elon Musk, the enigmatic CEO of Tesla, is once again in the spotlight as investor Ross Gerber claims that the company’s stock is plummeting due to Musk’s numerous unfinished projects. Gerber, a longtime Tesla bull, argues that these unfinished projects are causing investors to view Tesla primarily as a car company, which has led to a decrease in the company’s valuation. According to Gerber, Tesla has been facing several headwinds over the past year, including rising competition from companies like BYD in China. In an effort to maintain its market position, Tesla had to issue significant price cuts on some of its models. However, despite these efforts, Tesla’s sales in China hit a low point last month, raising concerns about the company’s ability to compete globally. Gerber believes that the increasing competition has diverted Tesla’s attention away from its other projects, such as developing its full self-driving technology. This technology is seen as crucial for adding value to the company, but its completion remains uncertain. Additionally, Musk’s threats to move AI projects away from Tesla unless he gains 25% ownership of the company have been criticized by Gerber as “delusional.” The combination of Musk’s erratic behavior and the lack of progress on these projects has led to a reevaluation of Tesla’s valuation. Gerber argues that investors are now valuing Tesla more as a hardware company rather than a software company. This shift in perception has caused Tesla’s stock to decline significantly, with shares down 24% since the beginning of the year. Gerber is not the only one concerned about the risks associated with Musk’s leadership. In 2023, a group of 17 shareholders wrote a letter to Tesla’s board expressing their concerns and calling for Musk to be reined in amid his chaotic takeover of Twitter. As Tesla’s stock continues to drop, some investors are questioning whether the company can still be considered part of the group of mega-cap tech stocks that have powered the stock market in recent years. Tesla’s stock dropped almost 3% on Tuesday, trading at around $183.15 per share. Despite these concerns, Tesla has yet to comment on the situation. As the company faces increasing competition and criticism of its CEO’s leadership style, it remains to be seen how Tesla will navigate these challenges and regain investor confidence. In conclusion, Tesla’s stock is currently experiencing a significant decline due to Elon Musk’s unfinished projects, according to investor Ross Gerber. The completion of projects such as full self-driving technology and Musk’s demands for greater ownership have left investors concerned about Tesla’s future. As a result, the company is now being valued primarily as a car company, with a decrease in its overall valuation. With increasing competition and criticism of Musk’s leadership, Tesla faces an uphill battle to regain investor confidence and reestablish itself as a major player in the market. © 2023 | Email: contact@globalvillagespace.com "
}