{
    "title": null,
    "date": "3/17/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/TSLA/pressreleases/24849913/novo-nordisk-isnt-in-the-magnificent-seven-but-heres-why-i-think-it-should-be/",
    "text": "The \"Magnificent Seven\" are helping lift major U.S. indexes to record highs. This group of highly acclaimed stocks -- among the heaviest-weighted equities in the S&P 500 -- is comprised of Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. There are good reasons to invest in all seven of these corporations, and that's why they've performed so well in recent years. However, some companies outside this clique are just as impressive and deserve to be considered on par with the Magnificent Seven. One of these corporations is Novo Nordisk(NYSE: NVO), a Denmark-based pharmaceutical giant. Here's why this drugmaker has earned consideration for inclusion in what would be called the Magnificent Eight. NVO Total Return Level data by YCharts. Novo Nordisk has been around for several decades. Throughout its entire history, the company has been a leader in one key therapeutic area: diabetes care. Through the development of various novel insulin products and other medicines aimed at diabetics, Novo Nordisk has helped contain this severe global health crisis. The company's ability to maintain a lead in this market, despite stiff competition from various other players, is impressive. As of November 2023, Novo Nordisk had a 33.8% share of the worldwide diabetes market, up almost 2% year over year. The company is still innovating in this area, too. Last year, it submitted regulatory applications for icodec, a potential once-weekly insulin product, in the U.S., Europe, and China. Here's why this matters: Diabetes patients who need insulin typically take it daily. A once-weekly option is more convenient, and eligible patients will be thrilled to make the switch. Icodec should earn approval sometime this year if everything goes according to plan. Novo Nordisk's dominance in diabetes care has generally yielded solid financial results. NVO Revenue (Quarterly) data by YCharts. The performance of the company's stock has also been strong, with returns in the past decade that have been far better than that of the broader market. The Magnificent Seven are so named partly because of their ability to deliver outsized returns, clearly a point in Novo Nordisk's favor. Novo Nordisk is making noise in another related therapeutic area -- obesity care. The company's weight loss medicine Wegovy became so popular that the demand outpaced the supply. The company is dealing with the issue of shortages as the anti-obesity drug market is projected to soar through the end of the decade. The pharmaceutical giant has plenty of competition, including from its longtime rival in the diabetes market, Eli Lilly. And Amgen, Pfizer, and Viking Therapeutics are among the drugmakers looking to launch their own weight loss medicines. Investors shouldn't be worried, though. As Novo Nordisk has shown before, it can handle the competition. The company's Wegovy should remain one of the top-selling obesity therapies for some time. It's also working on newer targets. Novo Nordisk recently reported highly encouraging phase 1 results for a potential oral diabetes medicine called amycretin. The company has created a culture centered around innovation, particularly within its core areas of expertise. That's a key reason why leaders in certain therapeutic areas generally remain near the top of their fields. Novo Nordisk is also looking to diversify its lineup. Its pipeline features medicines across rare diseases, cardiovascular conditions, neurological disorders, etc. Novo Nordisk checks all the same boxes as the existing Magnificent Seven. These corporations are all innovative leaders in their respective industries and have delivered strong financial performance and stock market returns for a while -- and they'll likely continue to do so. The shoe fits -- and that's why Novo Nordisk has earned its spot here. It doesn't matter if someone creates a new Magnificent Eight that includes Novo Nordisk. Investors should consider adding the company's shares to their portfolios. Should you invest $1,000 in Novo Nordisk right now? Before you buy stock in Novo Nordisk, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Novo Nordisk wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 11, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Prosper Junior Bakiny has positions in Amazon and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Pfizer, and Tesla. The Motley Fool recommends Amgen and Novo Nordisk and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Tesla Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}