{
    "title": "Tesla Model Y Performance Takes Another Hit: Estimated Range Now Down 24 \nMiles Since Year Started",
    "date": "3/8/2024",
    "url": "https://www.tradingview.com/news/benzinga:8554f2f7c094b:0-tesla-model-y-performance-takes-another-hit-estimated-range-now-down-24-miles-since-year-started/",
    "text": "EV giant Tesla Inc TSLA has reduced the estimated range of its Model Y Performance variant by 6 miles, marking a further decrease from the 18-mile reduction made in January. What Happened: Tesla’s website now displays an EPA estimated range of 279 miles for the Model Y Performance variant, down from the previous 285 miles. Notably, until the close of last year, the company advertised an estimated range of 303 miles for the vehicle. Meanwhile, the EPA estimated range for both the rear-wheel drive and all-wheel drive versions of the SUV remains unchanged at 260 miles and 310 miles, respectively. Tesla attributed the reduced range estimate in January to various comfort and functionality enhancements in the vehicles, alongside the Environmental Protection Agency's (EPA) updated range testing guidance. This guidance mandates sticker estimates for all manufacturers to more accurately reflect real-world range. The individual contributions of vehicle changes and the updated EPA guidance to the lowered estimate are not fully discernible. Why It Matters: Earlier on Thursday, reports surfaced regarding several Tesla buyers who brought a federal court case, alleging that the company had falsely advertised the range of their vehicles. These buyers were advised to pursue their grievances through individual arbitrations rather than a class action lawsuit. The plaintiffs accused Tesla of fraudulently enticing consumers to purchase its cars by overstating the distance they could travel on a single charge. Additionally, the lawsuits contended that Tesla misrepresented the driving range displayed on vehicle dashboards. Although the lawsuits were not dismissed by U.S. District Judge Yvonne Gonzalez Rogers, she suggested that she might potentially issue an injunction against Tesla if the drivers successfully arbitrated their claims under California's unfair competition law and other statutes. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Rivian Almost Catches Up To Tesla’s EV Lineup With New R2, R3 — But There’s No Cybertruck Fighter Yet © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}