{
    "title": "Tesla Rolls Out 30-Day Free Trial For Its Full Self-Driving Software - \nTesla (NASDAQ:TSLA)",
    "date": "3/29/2024",
    "url": "https://www.benzinga.com/news/24/03/38012152/tesla-rolls-out-30-day-free-trial-for-its-full-self-driving-software",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW EV giant Tesla Inc TSLA on Friday started rolling out a free trial of its full self-driving software to customers. What Happened: During the 30-day complimentary trial, customers can experience the capabilities of the software that Tesla says will enable fully autonomous driving in due time. Currently, the software performs as a driver assistance system that requires active driver supervision. “Please encourage your friends and family who may have a Tesla to try this free 30-day trial of Supervised FSD,” Tesla executive Rohan Patel said on X, formerly Twitter. Patel, who is vice president of Public Policy and Business Development at Tesla, said that the progress being made by Tesla on the artificial intelligence front is “mind-blowing” and that users will be inspired to either buy the software or subscribe to it after experiencing it during the free trial. Even in case customers do not want to engage with the software longer, the trial will enable users to simply experience the progress made, he said. While the free trial trial is currently limited to the U.S., it will soon be available in Canada, Patel added. Why It Matters: Tesla CEO Elon Musk announced the free trial earlier this week. As per media reports, Musk has also directed employees to mandate the installation and demonstration of the latest FSD version to customers before vehicle delivery. Earlier this month Musk stated that FSD \"should be really shining bright\" by late April or May, as the company plans to roll out three significant improvements to the software every two weeks. “Most people still have no idea how crushingly good Tesla FSD will get,” Musk wrote on X on Friday. In June 2023, the CEO pegged vehicle autonomy as the main driver of the brand's market value. \"The value of the company is primarily on the basis of autonomy,\" Musk then said at the VivaTech conference in Paris. \"That's really, I think, the main driver of our value.\" Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: German Chancellor Olaf Scholz Calls Arson Attack On Tesla’s Giga Berlin A ‘Terrorist Act,’ Wants EV Giant’s Factory To Grow Like Ford’s 93-Year-Old Cologne Plant Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}