{
    "title": "Seems Like Elon Musk Wanted to Take Over OpenAI to Help Save Tesla",
    "date": "3/10/2024",
    "url": "https://www.businessinsider.com/elon-musk-openai-take-over-save-tesla-chatgpt-sam-altman-2024-3",
    "text": "In wooing Sam Altman, Musk revealed his deepest fear — and his desperation over Tesla        We know that Elon Musk was very desperate back in 2018. We know that Tesla was near death as it struggled to build the Model 3, the car that was supposed to be the company's saving grace. We know that the development process was running late and over budget, so Musk needed capital. What we did not know was that during this tumultuous period, Musk was also working on a deal to take over OpenAI, the artificial-intelligence startup that created ChatGPT and is now worth $86 billion. We did not know he'd suggested that OpenAI raise $1 billion, merge with Tesla, and name him CEO. And we did not know that he was selling this structure to OpenAI's founders as their company's last, best, and maybe only hope for survival. But now, thanks to OpenAI's present-day fight with Musk, we know these things. And it's not hard to see how Musk's two desires — saving Tesla and wresting control of Open AI — are connected. He's angry at OpenAI for giving other investors the opportunity to invest in a powerful company he wanted for himself. But he never approached OpenAI and its founders as respected business partners; he approached them like a frat boy who puts down girls he's interested in because he's terrified of rejection. Musk's overtures came to light on Tuesday when OpenAI published a blog post detailing the company's relationship and communications with Musk dating back to its formation in 2015. The blog post was a response to Musk's decision to sue OpenAI, accusing it of breaching its contract to remain a nonprofit. (The company created a \"capped profit\" division in 2019 to attract investors and pay top-tier AI talent.) The blog post and emails indicate that in 2015, Musk pushed the OpenAI founders Greg Brockman and Sam Altman to raise far more money than they felt they needed to. The duo wanted to start by gathering $100 million from investors, but Musk pushed them to raise $1 billion to compete with megacompanies like Google and Facebook (now Meta). The emails also indicate that by 2017, contrary to Musk's accounts, the Tesla CEO didn't have a problem with OpenAI becoming for-profit as long as he could take control of the company. In February 2018, Musk even suggested merging OpenAI with Tesla, saying that the automaker could be OpenAI's \"cash cow\" and that Tesla was \"the only path that could even hope to hold a candle to Google.\" It was an extremely aggressive sell to Altman and Brockman — very \"come with me if you want to live\" vibes. But it was really Tesla that desperately needed a lifeline. Musk clearly saw OpenAI's potential to raise capital, and, coincidentally, that's what he needed right then. It's also clear he saw the importance of keeping OpenAI's technology a secret, as long as the secret was in his hands. In February 2018, while Musk was shooting off merger missives to OpenAI, Tesla was in the thick of \"production hell\" on the Model 3, bleeding money and falling behind schedule. In the company's conference call in May 2018, Musk flipped out on an analyst for asking a \"boring, bonehead\" question. The question was about how much money Tesla thought it was going to spend to get through the Model 3 launch — you know, business-critical, very-important-to-investors stuff. Musk didn't have an answer, just steam. That June, Tesla laid off 9% of its staff. At the same time, Musk's expensive attempt to turn his factory into a fully robotic \"alien dreadnought\" fell apart, and cars were instead being put together in a tent. In August, Musk falsely claimed he had financing lined up to take Tesla private for $420 a share. That month, the company reported wider losses than expected. After the Model 3 finally rolled off the assembly line, the car got stuck in delivery hell. Getting the Model 3 to Tesla's customers turned into a poorly planned, poorly executed logistical nightmare. Cars were so delayed that Tesla was spending a fortune on expedited shipping, and Musk was frantic to lower costs. He asked Tesla employees from all parts of the company to go personally deliver the cars to customers on their days off. Slowly, Tesla started to make a little profit — but not enough to make up for the year's losses, especially since it was deeply in debt. The company limped into 2019 with a sinking stock price, a few executive departures, and an admission from Musk — on a closed call with select reporters — that Tesla would not be profitable in the first half of that year. That spring, Musk claimed that Tesla would have 1 million robotaxis on the road in a year. Getting the Shanghai plant operational by the end of 2019 gave Tesla the opportunity to sell into China's booming electric-vehicle market and massively cut costs. Thanks to China, 2020 was the company's first year of annual profit. Despite the Model 3 chaos, Musk continued to position himself as OpenAI's savior. In a December 2018 email, he implied to Altman and the other executives that without him and Tesla, their work would never come to fruition. \"My probability assessment of OpenAI being relevant to DeepMind/Google without a dramatic change in execution and resources is 0%. Not 1%. I wish it were otherwise,\" he wrote, adding, \"This needs billions per year immediately or forget it.\" Obviously, no one forgot it — especially not Musk. Now he's suing OpenAI because, contrary to his saber-rattling, the company's explosion since the introduction of ChatGPT has it ascendant in the most exciting field in tech, while Tesla is yet again in a moment of weakness. Tesla's stock went on a glorious tear from 2019, after the Shanghai factory opening, through 2023. It was one of what Wall Street called the \"Magnificent 7\" tech companies leading the rally in stocks. But over the past few months, Tesla has diverged from the rest of the group. China's economy is slowing, and America's electric-vehicle market has slowed as well. Tesla is in a price war that has thinned margins, and sales are down. In a conference call in January after Tesla's fourth-quarter earnings — a miss — Musk didn't seem to have a plan for getting through this period. Plus, he still has to pay for the money suck that is X. So now Musk is turning back to OpenAI, hoping the latest charmless offensive can help shore up his empire. As much as Musk positioned himself as a white knight in 2018, Tesla was in dire straits. Musk was willing to go to any length to save Tesla. What's a little bullying, negging, smoke and mirrors? His belief that he alone can fix anything, combined with a relentless desire for control, eventually turns all negotiations into a \"my way or the highway\" scenario. Perhaps that's why Musk's pitches to OpenAI have all the finesse of a flailing balloon man outside a used-car lot where everything, absolutely everything, must go! If Musk indeed believed OpenAI needed him or Tesla to succeed, he was as belligerent about it as he was wrong. Linette Lopez is a senior correspondent at Business Insider. Through our Discourse journalism, Business Insider seeks to explore and illuminate the day’s most fascinating issues and ideas. Our writers provide thought-provoking perspectives, informed by analysis, reporting, and expertise.\n                              Read more Discourse stories here. Related stories More from Tech Jump to "
}