{
    "title": "Tesla’s $350 billion stock slump shreds investor expectations",
    "date": "3/30/2024",
    "url": "https://www.autoblog.com/2024/03/30/teslas-350-billion-stock-slump-shreds-investor-expectations/",
    "text": "Tesla shares are down nearly 30% in the year to date, and investors lack the clarity needed to bet on any lasting recovery. The electric vehicle maker is due to provide its first-quarter delivery numbers early next week, and rapidly dropping estimates over the past month suggest a lackluster report. More importantly, tepid demand for its cars is expected in coming months. “Delivery estimates have been cut a lot, and that has really killed investor confidence in the name. It will be hard to spin the first-quarter numbers positively, even if they modestly beat expectations,” said Nicholas Colas, co-founder of DataTrek Research. “Valuations are often tied to a company’s weakest link. In Tesla’s case, that is the automotive business.” Reasons for the shares’ dismal run this year — down more than 29% compared to a 10% advance in the S&P 500 Index — are many. However, the biggest cloud looming over the EV giant is the slowdown in the demand for electric vehicles, which is happening just as competition from legacy carmakers and Chinese rivals is heating up. The soon-to-end first quarter will rank among the stock’s three worst ever. The EV maker is the biggest percentage decliner on the S&P 500 so far this year. The stock has given up all its gains since mid-May, and has erased over $350 billion from its market capitalization since touching a 52-week high in July. Expectations are low. Analysts have been rapidly dialing back their estimates for deliveries, revenue and profit, while the share of bullish ratings on the stock has dropped to the lowest in about three years. But more importantly, enthusiasm toward Tesla has eroded significantly, with investors concerned over a lack of new catalysts that can propel the stock near term. Several analysts cut estimates just this week. Mizuho Securities’ Vijay Rakesh noted that EV sales expectations were decelerating faster than expected. Rakesh estimates EV sales will grow about 15% over last year in 2024, down from his prior expectation of 25%. And Sanford C. Bernstein’s Toni Sacconaghi said that as growth expectations decline, the stock increasingly looks expensive compared to large-cap tech companies. “There is quite a bit of pessimism already built into the stock at these levels,” said Ivana Delevska, chief investment officer at SPEAR Invest. “From here, I think it will be a binary outcome,” she added, saying that the company will either show progress in its self-driving technology, or will continue to trade with the struggling EV market. In recent weeks, investors have begun to pay relatively more for options protecting against a selloff. The cost of puts that profit on a 10% slump in shares within the next month has trended higher — signaling rising skittishness toward the stock. At the same time, Tesla’s claim to become a major artificial intelligence player has also started to look shaky. While self-driving cars — which the company is trying to develop — would be a major feat in AI, it remains a problem notoriously difficult to solve. Experts and analysts don’t expect it to become a widely-adopted technology any time soon. All of this pushed Tesla’s shares into the so-called technical oversold territory last week, signaling that the stock has fallen too far, too fast. If the delivery figures next week are significantly better than what analysts currently expect, a relief rally in the shares — however temporary — cannot be ruled out. The idea is that with so much negativity already built into the shares, there may not be much room left for more. Also, as long-term Tesla bulls will be quick to note, the current weakness in EVs could prove to be just a blip for the company in the next few years, as adoption of these cars pick up globally amid strong political push. That helps to support the stock price as well. But even then, the near-term concerns about Tesla and its core EV business will continue to haunt investors, until there is a clear sense of the trajectory of EV sales this year and the next. “The big focus for investors on Tesla right now is going to be delivery volume and gross margin - the direction of the stock will be based off of these numbers relative to whisper expectations,” said David Wagner, portfolio manager at Aptus Capital Advisors. “But for now, momentum has taken hold of the stock and there has been some indiscriminate selling as Tesla has been a funding mechanism for the narrative de jour — AI.”  Toyota teases the 2025 4Runner 2025 Volkswagen ID. Buzz GTX is one wooly Bulli Nissan considering Xterra revival; 'it's got to be authentic' 2024 Ford Mustang Mach-E reportedly gets another price adjustment to keep it competitive 2025 Honda Pilot Review: Well-rounded three-row SUV adds Black Edition Six-pack of identical Ford Pinto Wagons for sale, in case you were looking    Please enter a display name Please sign in to leave a comment. "
}