{
    "title": "Stephen Colbert calls out Elon Musk over Don Lemon drama with a parody \nvideo of the Tesla CEO asking himself ...",
    "date": "3/15/2024",
    "url": "https://ca.sports.yahoo.com/news/stephen-colbert-calls-elon-musk-185427461.html",
    "text": "\"The Late Show with Stephen Colbert\" called out Elon Musk over his drama with Don Lemon. In a parody video, Musk has a conversation with himself asking softball questions. Musk canceled X's partnership with Lemon after being asked about ketamine use, Trump, and moderating X. Stephen Colbert mocked Elon Musk reportedly bristling at the interview questions that Don Lemon said led to the end of his partnership deal with X. The late-night host posted a video about \"the Elon interview of Elon\" that includes a parody clip of Musk interviewing himself. The video points out that Musk is a self-proclaimed \"free speech absolutist\" but reportedly was angered at the subject matter Lemon asked during their real-life interview. \"Coming soon: The only interview style that meets Elon Musk's approval,\" Colbert captioned a post on Threads. The clip depicts the parody Elon Musk sitting across from himself asking softball questions. \"Coming soon to X, Elon Musk sits down with the only person on the platform that can be trusted with free speech: Elon Musk,\" a narrator says. \"Elon asks Elon the tough questions.\" The parody Musk then asks if the Tesla CEO is good at his job, works hard, and has high integrity. The other Musk answers affirmatively to each question. The narrator closes out the Colbert video joking that X is \"where everyone named Elon can speak Freelon.\" Former CNN host Lemon announced on Wednesday that the deal he'd announced with X for \"The Don Lemon Show\" had been terminated by Musk hours after he'd interviewed the owner of the platform. Lemon said Musk had grown \"upset\" and \"mad\" at questions about his reported ketamine use, recent meeting with Trump, and whether he held a responsibility to moderate antisemitism and hate speech on the platform. Musk invited Lemon to work with X on his show after he and CNN parted ways. In his statement on his canceled partnership, Lemon said the X owner had gone back on his word. \"His commitment to a global town square where all questions can be asked and all ideas can be shared seems to not include questions of him from people like me,\" Lemon said. Following his announcement, the official X Business account put out its own statement on the issue. It emphasized the company's support of free speech and assured that \"The Don Lemon Show\" would be allowed to post its content to X — but that its partnership with Lemon wasn't happening. \"However, like any enterprise, we reserve the right to make decisions about our business partnerships, and after careful consideration, X decided not to enter into a commercial partnership with the show,\" the statement said. Lemon's interview with Musk is still set to premiere as part of the \"The Don Lemon Show\" on Monday. Read the original article on Business Insider Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented.  Seven reportedly cost $20 million \"We love to cook and we have the family together,\" Richards tells PEOPLE The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida  They soft-launched their relationship at the supermodel's cookbook event in Miami. Nordegren has moved on and built a life that focuses on her six kids Photo Illustration by Luis G. Rendon/The Daily Bast/GettyFriends of Princess Beatrice and Princess Eugenie have said they are “very upset” but “not surprised” to have not been asked to carry out any royal engagements while the threadbare royal family grapples with a double health crisis that has seen King Charles, Prince William, and Kate Middleton all step back from royal duties.A friend of the young women told The Daily Beast: “It seems mean that the girls aren’t being used at all when they ha  Anderson shared the hilarious moment on her Instagram The \"Late Night\" comedian brutally summed up the former president's media company. The Princess of Wales spoke about her husband in the self-written speech, but significantly delivered it solo  The Grammy winner celebrated 'Cowboy Carter' in style \"She speaks out of both sides of her lips,\" Behar jokes of Lara Trump The post ‘The View’: Whoopi Struggles to Collect Herself After Joy Behar Makes Sexual Innuendo About Trump’s Daughter-in-Law | Video appeared first on TheWrap. The couple followed the sun to the Caribbean island, where they've previously vacationed  The Prince of Wales is following his late grandmother's lead The sitting president relayed the story (joke?) during Thursday's star-studded fundraiser The post Joe Biden Says He Challenged Donald Trump to a Golf Game on 1 Condition | Video appeared first on TheWrap. Tim Allen’s former sitcom wife is calling BS on the alleged Home Improvement revival. Even before Fox pulled the plug on Last Man Standing in 2021, Allen spoke to TVLine about his desire to revive “The Tool Man” and check in with Tim Taylor’s family. “I just think it’s a marvelous idea,” he said at …  Prince Harry will spend Easter with his wife Meghan Markle and their two children Prince Archie and Princess Lilibet while King Charles will celebrate in Windsor... On Beyoncé's new album, she covers Dolly Parton's famed 1973 song \"Jolene.\" But Bey takes some liberties and makes some changes. ‘STEVE! (Martin) A Documentary in 2 Pieces,’ streaming on Apple TV+, includes Martin’s hilarious recollection of meeting Elvis "
}