{
    "title": "Tesla Bull Says He Knows Why Wall Street Doesn't 'Yet Get How Great FSD' \nIs: 'Won't Add Value To TSLA's V",
    "date": "3/28/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/03/38000833/tesla-bull-says-he-knows-why-wall-street-doesnt-yet-get-how-great-fsd-is-wont-add-v",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla Inc. TSLA investor and Future Fund Managing Partner Gary Black has said that the valuation of the EV giant will only be influenced by its full self-driving (FSD) software once it achieves fully autonomous driving capabilities. What Happened: Black emphasized that although Wall Street acknowledges Tesla’s progress with the FSD software, it will not impact the valuation until the software achieves fully autonomous driving. Presently, Black views the FSD software as a remarkable driver assist tool rather than a fully autonomous driving solution. He stated that for the software to truly deliver autonomous driving capabilities, Tesla must assume full liability for any injury or damage incurred. “Since I don't see that happening anytime soon, WS won't add incremental value beyond the normal take rate math in every analyst's TSLA valuation model,” Black said. To date, Tesla has attributed responsibility for all incidents involving FSD to the driver, emphasizing that the software remains in its testing phase and requires active driver supervision. Earlier this week, Tesla said all its U.S. vehicles with FSD compatibility will have the feature enabled free for a month. Why It Matters: Tesla CEO Elon Musk previously stated that FSD “should be really shining bright” by late April or May, as the company plans to roll out three significant improvements to the software every two weeks. Additionally, Black has advocated for Tesla to consider adding a fourth segment focused on its artificial intelligence endeavors to its earnings reports to garner greater investor attention for its FSD project and other initiatives such as FSD licensing, robotaxis, Optimus, and Dojo. Currently, all attention is on Tesla’s first-quarter delivery numbers, expected next week, according to Black. He believes that any figure surpassing last year’s delivery number of 423,000 will be well received, with his own estimate sitting around 425,000 units. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Tesla CEO Elon Musk Wants German Authorities To ‘Absolutely Find A Way' To Catch Giga Berlin Arsonists Image via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}