{
    "title": "Elon Musk Wants More Tesla Control, Issues AI/Robotics Threat",
    "date": "1/16/2024",
    "url": "https://www.investors.com/news/tesla-stock-elon-musk-issues-ai-threat-if-he-doesnt-have-more-control-at-tesla/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Tesla (TSLA) stock pared early losses Tuesday after Chief Executive Elon Musk posted on X, formerly Twitter, that he feels he needs more TSLA shares and voting power before making the EV giant an AI and robotics leader. Musk on Monday posted on the social media site that he's \"uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control.\" The chief executive added that he wants enough shares to be \"influential but not so much that I can't be overturned.\" \"Unless that is the case, I would prefer to build products outside of Tesla,\" Musk said Monday. Elon Musk currently has a nearly 13% stake in Tesla. Prior to selling TSLA shares to purchase Twitter, now X, for $44 billion in late 2022, Musk owned around 22% of Tesla. Elon Musk has repeatedly said Tesla is not an EV company but is an AI and robotics operation that happens to make cars. Bullish analysts also weigh Tesla's AI and self-driving technology heavily in valuing Tesla stock. Musk's comments on X about came just a few hours after he also posted a video of Optimus folding a shirt, with a human operating the Tesla humanoid robot remotely. Tesla stock fell early before gaining 0.5% to 219.89 Tuesday during market action. Wedbush analyst Dan Ives, a longtime Tesla bull, wrote Tuesday that it would be a \"big negative for the Tesla story\" if Musk creates a separate company focused on next generation AI projects. Futures Fall Amid China Data; Tesla Cuts Prices Again Musk added on X that the \"Tesla board is great\" and the reason there is not a new compensation plan for him yet is because of the current Delaware lawsuit relating to Musk's 2018 compensation and pay package. \"This is primarily about ensuring the right amount of voting influence at Tesla,\" Musk said. \"At 15% or lower the for/against ratio to override me makes a taker by dubious interests too easy.\" TSLA shares tumbled 7.8% to 218.89 last week, plunging below  the 50-day and 200-day lines. Tesla stock is in an awkward double-bottom base with a 278.98 buy point according to MarketSmith analysis. The relative strength line, which tracks a stock's performance vs. the S&P 500, is at its lowest level since late May, according to MarketSmith. Amid this Tesla stock downturn, Ives wrote Tuesday that Musk's decision to discuss his control of Tesla on X is \"far from ideal for the investment community\" and \"creates a distraction and likely some selling pressure.\" In 2023, Tesla doubled, easily outperforming the broader S&P 500 index. Tesla stock ranks fifth in the 35 member IBD Auto Manufacturers industry group. The stock has a 67 Composite Rating out of a best-possible 99. Tesla stock also has a 70 Relative Strength Rating and an 88 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla Stock A Buy Or A Sell? Stocks Near A Buy Zone Learning How To Pick Great Stocks? Read Investor's Corner MarketSmith: Research, Charts, Data And Coaching All In One Place Is Rivian A Buy Right Now With The Cybertruck Hype? 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}