{
    "title": "Elon Musk's drug use causing turmoil for Tesla, SpaceX execs: WSJ",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/video/elon-musks-drug-causing-turmoil-155951308.html",
    "text": "Tesla (TSLA) shares fell in early trading following a Wall Street Journal report that CEO Elon Musk's illegal drug use has worried Tesla executives and board members. Musk denied the report, saying he is subjected to random drug testing by NASA. Yahoo Finance’s Seana Smith and Brad Smith discuss the latest report and potential impact on shareholders. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim BRAD SMITH: A report from \"The Wall Street Journal\" claimed illegal drug use was the cause of some of Elon Musk's questionable behavior, and executives are concerned about the impact on his companies, including Tesla and SpaceX. What's worth noting here within this is that there were claims that he was using drugs, illegal ones, such as LSD, ecstasy, ketamine, and cocaine. And Musk pushed back on this via a few social media posts saying that not even trace quantities of the alcohol and drugs were found in his systems after multiple years of random drug testing. SEANA SMITH: Yeah. And I think this is just the latest headache here for Tesla's board, right? Not exactly something that they're unfamiliar with, trying to dealing with some of these side reporting and exactly how it's impacting CEO Elon Musk. But still, the reason why we're bringing this up today is because the pressure that we're seeing in shares just because of what this means in terms of casting some uncertainty around the stock going forward. We know a lot of the hype and a lot of excitement surrounding Tesla is tied directly to CEO Elon Musk and his vision there for the company. So any sort of scenario where you could potentially, down the road, not see Musk lead Tesla, that obviously would be a massive concern for many of the shareholders out there today. But again, these reports from \"The Wall Street Journal\" just something that adds to some of the risk that is there for shareholders here going forward, and something that could lead to a little bit more caution going forward on the stock. BRAD SMITH: I mean, even when he was on \"The Joe Rogan Experience,\" and that podcast, of course, there was a video component to that as well where we all saw Musk lighting one up with Joe Rogan and NASA then prompted their own random drug testing for multiple years. Related Quotes "
}