{
    "title": "Hertz sells off 20,000 electric cars as drivers stick with petrol",
    "date": "1/11/2024",
    "url": "https://www.telegraph.co.uk/business/2024/01/11/hertz-sells-tesla-electric-cars-drivers-stick-with-petrol/",
    "text": "Rental giant expects to take £190m hit after blaming weak demand and high repair costs US rental giant Hertz is selling off thousands of Teslas as weak demand forces it to replace 20,000 electric cars with petrol-powered vehicles. Hertz said it would sell the vehicles over the next year and expected to take a $245m (£193m) hit as it reversed plans to massively expand its electric car fleet. The company is selling off a range of makes and models but is expected to offload thousands of Teslas. More than 600 are already listed for sale on its used car website. Three years ago, Hertz announced plans to buy 100,000 Tesla electric cars, a move that pushed Tesla’s market value beyond $1 trillion. However, Hertz said renting out electric cars had proved to be less profitable than traditional vehicles and the cars had also come with higher repair costs. Drivers also still want petrol or diesel-powered cars. Hertz said it would “reinvest a portion of the proceeds from the sale of EVs into the purchase of internal combustion engine vehicles to meet customer demand”. The sell-off, which applies only in the US but amounts to around a third of the company’s global electric vehicle fleet, comes after years of Hertz positioning itself as a “first mover” in electric car rentals. As well as agreeing to buy 100,000 Teslas, it committed to buying 65,000 vehicles from Polestar, Volvo’s electric subsidiary, and last year it said a quarter of its fleet would be electric by the end of 2024. However, deliveries to date have been well below those headline numbers. The company said the decision to sell off thousands of cars was being taken “to better balance supply against expected demand of EVs” and that “this will position the company to eliminate a disproportionate number of lower margin rentals and reduce damage expenses associated with EVs”. Hertz said investing in petrol-powered cars would improve profitability. It added that it hoped to make electric car rentals more profitable in future by expanding charging stations and improving access to repairs. Motorists have complained about experiences when renting electric cars as a result of the myriad of different charging networks, the fact that the cars are often unsuitable for long road trips, or in some cases because drivers receive vehicles without fully-charged batteries. Hertz chief executive Stephen Scherr said last year that the plummeting value of used electric cars also made them less profitable. Data from CarGurus compiled by HSBC this week showed that the values of the top 10 used electric cars had fallen by 28pc in the US last year, and 20pc in the UK. Rental car companies are heavily affected by falling used prices because they regularly recycle their fleets, buying cars new and selling them within two years. Hertz, which sells used cars directly on its website, was selling Tesla Model 3 vehicles for as low as $17,700 this week, less than half the $38,990 price of a new model. The vast majority of electric cars currently listed for sale are Teslas although it said the sale of 20,000 cars would “cover multiple makes and models”. Hertz shares fell by almost 5pc in trading on Wall Street. The company has an ongoing tie-up with Uber that allows drivers to rent electric cars from Hertz, but has said taxi drivers’ driving habits mean the cars are more likely to be damaged. It has cut down on the supply of cars to Uber drivers but says this has led to an over-supply of electric cars available to rent to ordinary drivers. Demand for electric cars in the UK flatlined last year, according to figures from the Society of Motor Manufacturers and Traders. They accounted for 16.5pc of all new car sales last year, slightly down on the 16.6pc in 2022. It has led to calls from industry for VAT on the cars to be cut to stimulate demand. "
}