{
    "title": "Tesla Stock: When Will This Hype Bubble Burst? (Rating Downgrade) \n(NASDAQ:TSLA)",
    "date": "1/3/2024",
    "url": "https://seekingalpha.com/article/4660963-tesla-stock-when-will-this-hype-bubble-burst-rating-downgrade",
    "text": "jetcityimage  jetcityimage Tesla, Inc. (NASDAQ:TSLA) remains one of the most hyped and highly valued automakers in the world. The massive 127% gains witnessed in share prices throughout 2023 have been another example of a hype-train rally which has remained unsupported by the underlying business fundamentals. The firm continues to trade a valuation metrics that would put a start-up growth company to shame. Furthermore, our intrinsic value calculation supports the thesis that Tesla shares are massively overvalued, somewhere to the tune of around 250%. Given the firm's weak revenue growth and falling profitability as a result of price cuts and operational inefficiencies, I cannot advocate building a position in the automaker, and thus rate it a Strong Sell. Tesla is one of the most recognizable automakers in the world. Their pioneering mission of bringing battery electric vehicles, or BEVs, to the masses has resulted in the company developing a huge customer base along with significant automotive popularity. Since their first car in 2008, the company has grown into a $789B automotive giant producing over 1.8 million cars in 2023, up from just 1.4 million compared to the previous year. While Tesla has enjoyed an almost decade-long head start in the BEV vehicle market, the tides are rapidly changing against the automaker. The surge in competing electric vehicles from other firms could begin to erode Tesla’s commanding market position along with reducing overall demand for their BEVs. Furthermore, the last couple years since the company’s record high valuations in late 2021 have been less than impressive for shareholders, with significant volatility and what can only be described as a downward trend being present in share prices since 2021. When combined with the highly volatile nature of the company’s increasingly erratic CEO Elon Musk, it is difficult to determine what the future holds for Tesla. I completed an in-depth analysis of Tesla’s economic moat back in March 2023, to read that article please click here. In this update, I will summarize what I believe can be characterized as a marked deterioration in Tesla’s moat over the past year. While Tesla continues to be one of the most highly valued automakers in the world, their economic moat is still not particularly wide and, in my opinion, is shrinking. Tesla’s cars are not affordable for a majority of consumers in the economy, with most of their vehicles such as the Model S, 3, X and Y being priced at similar prices to other luxury vehicle offerings from the likes of Mercedes-Benz (OTCPK:MBGYY) or BMW (OTCPK:BMWYY). Tesla Cybertruck Delivery Event Tesla Cybertruck Delivery Event Considering that even their new utility-oriented pickup truck, the “Cybertruck,” is priced starting at around $60,000, it would be foolish to suggest the firm’s automotive department is anything more than a luxury automaker. Therefore, Tesla relies primarily on their image to sell cars and to compete against the “traditional” automaker’s vehicles. Given that the likes of Mercedes, BMW, Volkswagen (OTCPK:VWAGY), and not to mention an onslaught of Chinese BEVs now arguably beat Tesla in terms of performance and range, the firm entirely relies on the image of their products to drive sales. I believe the last year has seen a marked decline in the majority of the public's opinion and fondness in the Tesla brand primarily as a result of unfulfilled promises and Musk’s increasingly erratic behavioral patterns. Furthermore, the cult-like passion some consumers hold for Tesla vehicles is ultimately not too differentiated from the admiration some clientele holds for BMWs, Porsches, or other luxury car brands. Tesla is expected to release two lower-end EVs in the coming few years in order to target consumers at a more budget-friendly price point and bring the fight to Chinese and legacy automakers as a whole. This very strategy threatens to further decrease the appeal behind the Tesla badge, thus further decreasing the pricing power Tesla will hold in the future. When combined with what is now an aging portfolio of cars, it is difficult to see how Tesla will be able to maintain their brand reputation without significant investment into new models and technological improvements. All car manufacturers (Tesla included) thus face significant threats to their economic moat due to changing consumer tastes and preferences combined with a lack of tangible switching costs, meaning that consumers can easily change their purchasing habits as popularity shifts. I believe this exact phenomenon has begun to impact Tesla, as evidenced by the aggressive price cuts the automaker has been forced to adopt across all of their international markets in response to increasing levels of more affordable competition. The price cuts in China particularly illustrate the real double threat Tesla faces from a degrading brand image and increasing levels of competition, leading to a decrease in consumer desire for Tesla vehicles. The automaker has also faced increasing public criticism about failing to meet promises made on performance metrics for some of their vehicles. For example, the Cybertruck has ended up costing almost 30% more than initially suggested by Elon Musk, while range, power, and torque figures have all failed to meet the targets set by Tesla’s leader a few years prior. Elon Musk is known for overhyping and making empty promises about current and future Tesla vehicles, which in the long run should do tangible damage to the brand's reputation. While the supercharger network remains a great source of moatiness and income for Tesla, the fact remains that even this infrastructural advantage is no longer as moaty as before. Given that Tesla has begun opening up the supercharger network to other automakers such as Ford (F) and Kia, consumers now have more choice than ever when it comes to finding a place to charge their non-Tesla EV. Furthermore, traditional energy suppliers such as Shell (SHEL), BP (BP), Exxon (XOM), and Chevron (CVX) have begun to aggressively increase the presence of their own universal charging networks, which once again will lead to a degradation in the offering of Tesla’s proprietary solution. Considering these recent developments, I must downgrade Tesla’s economic moat from narrow to none. The firm no longer holds any tangible pricing power against its competitors with their core competitive advantages of a great brand image and exceptional performance offerings having been degraded during 2023 from a relative perspective. While Tesla cars may continue to be good products when viewed in isolation, the truth is that the firm operates in a rapidly developing and expanding BEV market and has not kept up with the competition in 2023. I have completed an in-depth analysis of Tesla’s financial situation in a previous article available here. In this update I will analyze their most recent Q3 10-Q form and any relevant industry developments that have impacted their finances. TSLA FY23 Q3 10-Q TSLA FY23 Q3 10-Q The firm’s most recent Q3 10-Q shows us that the firm had a great year in terms of total automotive revenues, which grew a solid 5.5% YoY to just under $18.6B. This is not with counting the record number of deliveries achieved in Q4 as published by Tesla, with the automaker achieving over 484,000 in the last quarter of FY23. TSLA FY23 Q3 Press Release TSLA FY23 Q3 Press Release While this progress in sales is positive, the reason behind these increasing revenues and sales figures come from the aggressive price cuts Tesla has pursued throughout FY23 in order to retain market share in an increasingly competitive environment. When combined with the significant increase in COGS associated with the production of Tesla’s vehicles, the firm ends the third quarter with YoY gross profits down 21% YoY and down over 12% when considering the first nine months collectively. This decrease in profitability has resulted in net margins contracting to around 11.25% TTM down from highs of 15.45% in FY22. Given that the Cybertruck has been labeled by Elon himself as a initially unprofitable venture whereby high manufacturing costs and difficult process will most likely lead to little margin expansion for the firm, the full Q4 results will most likely not be able to salvage FY23 from a profitability perspective. This stagnation in profits aligns with the hypothesis that Tesla’s underlying competitive advantages of a highly efficient manufacturing supply chain and a great brand image have been challenged in 2023. Tesla can no longer command the significantly premium prices required in order to maintain their net margin. Furthermore, while Tesla’s manufacturing processes have long been touted as being difficult to replicate for traditional automakers, I believe this theory is beginning to be proven as unfounded. Tesla’s previously massive margins (when compared to traditional automakers) came mainly from premium pricing rather than any underlying COGS advantages. As prices have been decreased, Tesla’s manufacturing processes have become exposed as being less ultra-efficient than once imagined. The firm also saw their inventories rise significantly YoY, up from $12.8B in Q3 FY22 to over $13.7B in the latest quarter. This 7% increase comes as no surprise, especially considering the relatively muted economic performance achieved in the U.S. economy during 2023, but still is a regrettable statistic for the firm. Increasing inventories suggest the automaker is having more difficulty moving their stock of vehicles than in previous years. This, once again, supports the hypothesis that Teslas are simply no longer as attractive to consumer as in previous years. Seeking Alpha | TSLA | Profitability Seeking Alpha | TSLA | Profitability Nonetheless, Seeking Alpha’s Quant still assigns Tesla with an “A+” Profitability rating, which I am largely inclined to agree with when considering a short two-year timeframe. Given that these metrics are relative to the sector median and Tesla’s own 5Y averages, it is still clear that Tesla is a mostly profitable and healthy enterprise. Tesla’s long-term outlook remains clouded with significant uncertainty pertaining to their future ability to sell vehicles at large enough margins. When combined with the increasingly unpopular image Elon Musk is garnering, Tesla very well may or may not be a market-leading automaker in the future. If the firm’s 2023 earnings are anything to go by, it would seem that Tesla is slowly but surely becoming exactly what it once sought to defeat: a legacy automaker characterized by low-margin, high volume cars. This is, once again, supported by the desire for Tesla to produce two lower-end vehicles which will be sold at cheaper prices than their current vehicles. Seeking Alpha | TSLA | Valuation Seeking Alpha | TSLA | Valuation Seeking Alpha’s Quant has assigned Tesla with an “F” Valuation rating. I am largely inclined to agree with this assessment at the current time. The firm is currently trading at a FWD P/E GAAP ratio of 94.42x and a FWD P/CF ratio of 62.02x. Their FWD Price/Book ratio is 14.92x and the company’s EV/Sales FWD multiple is 7.95x. These valuation metrics are incredibly inflated, especially for a company that has seen 5.5% YoY revenue growth and falling gross, operating and net margins. Seeking Alpha | TSLA | Advanced Chart Seeking Alpha | TSLA | Advanced Chart From an absolute perspective, Tesla’s shares have witnessed a remarkable resurrection compared to the lows witnessed at the end of 2022. Prices have risen a whopping 129% YoY, soundly beating the S&P 500’s (SP500) own gains of around 24%. While this massive surge has brought great gains to many investors, there is simply nothing tangible driving this increase in valuations, as supported by the relatively mute growth witnessed at the firm in 2023. Considering this massive surge in share prices and the lack of fiscal data to support the rise, I believe Tesla stock may very well be in a truly massive bubble. The relative valuation provided by simple metrics and ratios along with the absolute comparison already suggest that shares in Tesla are massively overpriced. However, an intrinsic valuation calculation must be completed in order to understand what real value exists in Tesla shares. The Value Corner The Value Corner By utilizing our specially formulated Intrinsic Valuation Calculation, we can better understand what value exists in the company from a more objective perspective. Using the firm’s current share price of $248.42, an estimated 2024 EPS of $3.92, a realistic “r” value of 0.07 (7%) and the current Moody’s Seasoned AAA Corporate Bond Yield ratio of 5.28x, I derive a base-case IV of $69.10. This represents a truly gigantic 259% overvaluation in shares. Even when using a massively more optimistic CAGR value for r of 0.20 (20%) to reflect a scenario where Tesla manages to somehow retain pricing power amid increasing levels of competition all the while the firm expands margins through operational improvements, shares still continue to remain 67% overvalued with a calculated IV of $148.80. Considering the valuation metrics, absolute valuation and intrinsic value calculation, I believe that Tesla stock is currently in an absolutely massive bubble. In the short term (3-12 months), it is still difficult to say what will happen to share prices of Tesla. While the stock is undoubtedly trading at a huge overvaluation, the irrationality of the public is almost impossible to predict, with a sustained overvaluation potentially existing for months to come. In the long term (2-10 years), I believe Tesla simply cannot sustain the current valuations let alone grow any further. To achieve significant future growth, Tesla would have to regain their brand image and move their vehicles upmarket. Considering that the firm is striving to do the opposite, thus placing their cars in direct competition with mass-market manufacturers, I do not believe the firm will see any sustained share price growth in the years to come. In evaluating Tesla’s current suitability to value-oriented long-term investors, I believe it is essentially impossible to argue building a position in the stock. Even if the firm traded at a significant undervaluation, implying a share price of around $60, the volatility of the stock would make it a poor long-term hold pick. Research has proven that low risk companies with beta values of less than one (Tesla has a 5Y monthly beta of 2.07) will invariably lead to better long-term value generation than their high-risk counterparts. Quite simply, Tesla still trades at massive growth multiples while having transformed into a laggard legacy automaker. While speculation and hype can potentially continue to drive prices into even crazier valuations, the reality of Tesla’s situation as a business will eventually come back to bite the firm and its shareholders. Tesla continues to face a multitude of risks which will largely impact what the future may hold for the company. For an in-depth analysis of these threats, please read my previous in-depth analysis here. The real changes to Tesla’s risk profile arise from even more erratic than predicted behavior by Elon Musk, the reality of encroaching worker unionization, and continued competitive pressures resulting in a poor brand image and falling margins. The calendar year 2023 has seen Elon Musk become increasingly aggressive and focused on disseminating what is arguably misinformation on his social media platform X. This attitude is viewed by some business professionals as dangerous and untrustworthy, which ultimately could reduce the ability for Tesla to market their products to consumers. Unionization has also become a hot topic among Tesla manufacturing staff, with the firm facing multiple threats from both the UAW along with Swedish mechanics unions. The Swedish mechanics trade union IF Metall has begun a strike on Tesla vehicles, which has resulted in Tesla cars in Sweden being denied service and spare parts imports. This strike has spread to Finland, Denmark and Norway, who have joined in the boycott to show solidarity with Sweden. The strikes and boycotts come as a reaction to the poor conditions offered by Tesla to mechanics in Sweden, with the union accusing Tesla of violating workers' rights laws. The UAW is also planning to attempt unionization of Tesla’s manufacturing workforce in the U.S. amid a push to ensure fair working conditions and employee treatment at Tesla’s factories. While Elon Musk continues to deny any accusations of toxic work culture, the reality of unionization cannot be waved off. Finally, Tesla’s push to produce lower-priced vehicles goes directly against the goals of margin expansion and maintaining a luxury brand image. When combined with Musk’s polarizing character and the threat of unionization, it is difficult to see a future where Tesla’s margins do not contract as the firm essentially evolves into what is a traditional legacy automaker. From an ESG perspective, only the aforementioned social concerns of Musk’s behavior and unionization efforts have changed. I still do not believe Tesla would be a suitable pick for an ESG-conscious investor. Of course, opinions may vary with regards to ESG material, and I implore you to conduct your own ESG and sustainability research before investing in Tesla if these matters are of concern to you. The last year has seen Tesla become an even more polarizing company than it previously was all the while their profitability has worsened. While the release of the Cybertruck and updated Model 3 have resulted in another hype-train driving share prices through the roof, the underlying business fundamentals of the company have simply worsened. Price cuts in order to retain market share and sales have left Tesla with a falling margin, while the brand's image appears to have lost some of the allure and popularity of years gone by. When combined with what is simply a huge overvaluation, it is essentially impossible to rationally argue building a position in shares at the present time. I believe that Tesla stock is in a huge bubble which ultimately will burst. When this may occur is difficult to predict, and it is undeniable that some investors who have gambled on the stock will have reaped massive gains throughout 2023. Nonetheless, investing is not about gambling in my opinion, but about making rational choices based on valuations, data, and trends in order to generate long-term sustained gains. I think the Tesla, Inc. stock bubble will inevitably burst, and I don’t plan on being fiscally involved when it happens. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I do not provide or publish investment advice on Seeking Alpha. My articles are opinion pieces only and are not soliciting any content or security. Opinions expressed in my articles are purely my own. My opinions may change at any time and without notice. Please conduct your own research and analysis before purchasing a security or making investment decisions. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}