{
    "title": "Tesla Launches New Model 3 In U.S., But This Hasn't Changed",
    "date": "1/10/2024",
    "url": "https://www.investors.com/news/tesla-model-3-upgrade-now-available-in-north-america/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Tesla (TSLA) said Tuesday night that the updated Model 3 is now available in North America. TSLA stock edged lower early Wednesday. The EV giant made the announcement via Elon Musk's X social site Tuesday night. Tesla in the fourth quarter began delivering the \"Highland\" Model 3 in China and Europe. The refreshed Model 3 has limited exterior changes and some internal refinements. Tesla is selling Rear Wheel Drive and Long Range variants of the updated Model 3, for $38,990 and $45,990, respectively. That's unchanged from the original Model 3's latest prices. The RWD and LR trims are not eligible for IRA tax credits of $7,500 due to tougher battery sourcing rules. Tesla, for now, is no longer offering a Model 3 Performance. The old Performance had a $50,990 price tag, but only $43,490 including tax credits. In fact, the updated Tesla Model 3 Long Range is more expensive than all the Model Y variants after the tax credit is included. TSLA stock fell 0.8% to 233.13 in Wednesday morning trade. Tesla stock sank 2.3% on Tuesday to 234.96, undercutting the 50-day moving average but still holding above the 200-day line. The U.S. EV giant still has a 265.13 handle buy point from a double-bottom base. But the relative strength line is approaching October lows, according to MarketSmith. Please follow Ed Carson on Threads at @edcarson1971, X/Twitter at @IBD_ECarson and Bluesky at @edcarson.bsky.social for stock market updates and more. YOU MAY ALSO LIKE: Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Tesla Vs. BYD: Tesla Tests Key Levels; Big News Looms For New EV King HPE To Buy Juniper Networks For $14 Billion Futures: Tesla Launches Updated Model 3 In North America 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}