{
    "title": "US Judge Voids Elon Musk's $56 Billion Tesla Compensation",
    "date": "1/30/2024",
    "url": "https://www.barrons.com/news/us-judge-voids-elon-musk-s-56-billion-tesla-compensation-2d1c26df",
    "text": "This copy is for your personal, non-commercial use only. To order presentation-ready copies for distribution to your colleagues, clients or customers visit http://www.djreprints.com. https://www.barrons.com/news/us-judge-voids-elon-musk-s-56-billion-tesla-compensation-2d1c26df A judge in the US state of Delaware voided the $56 billion compensation package of Tesla chief executive Elon Musk on Tuesday, siding with a shareholder who claimed the entrepreneur was overpaid. The judge in Delaware Chancery Court ruled that the plaintiff, a Tesla shareholder named Richard Tornetta, was \"entitled to rescission,\" approving the annulment of Musk's 2018 compensation agreement. Judge Kathaleen McCormick added that the parties must now \"confer\" and then submit a joint letter \"identifying all issues, including fees, that need to be addressed to bring this matter to a conclusion at the trial level.\" The electric vehicle maker's share price fell more than three percent in after-hours trading following the publication of the 200-page ruling. In a message posted to X, formerly Twitter, shortly after the decision was announced, Musk -- the world's richest person -- wrote: \"Never incorporate your company in the state of Delaware.\" A lawyer for Musk did not immediately respond to a request for comment. Musk's 2018 compensation plan was \"the largest potential compensation opportunity ever observed in public markets by multiple orders of magnitude,\" McCormick said in her decision. He was sued, along with Tesla and some other members of the company's board of directors. \"We are enormously grateful for the court's thorough and extraordinarily well-reasoned decision in turning back the Tesla board's absurdly outsized pay package for Musk,\" Greg Varallo, who represented the shareholders, said in a statement shared with AFP. \"The court's hard work will redound directly to the benefit of Tesla investors, who will see the dilution from this gargantuan pay package erased,\" he added. da/mlm A judge in the US state of Delaware voided the $56 billion compensation package of Tesla chief executive Elon Musk on Tuesday, siding with a shareholder who claimed the entrepreneur was overpaid. An error has occurred, please try again later. Thank you This article has been sent to  Copyright ©2024 Dow Jones & Company, Inc. All Rights Reserved This copy is for your personal, non-commercial use only. Distribution and use of this material are governed by our Subscriber Agreement and by copyright law. For non-personal use or to order multiple copies, please contact Dow Jones Reprints at 1-800-843-0008 or visit www.djreprints.com. "
}