{
    "title": "Tesla stock gets another quick buy from ARK in two ETFs",
    "date": "1/4/2024",
    "url": "https://www.teslarati.com/tesla-tsla-ark-invest-quick-buy-january-3-2024/",
    "text": "Tesla stock (NASDAQ: TSLA) was the subject of another day of buying from the bulls at ARK Invest, marking the second time in as many weeks the firm bought the automaker’s shares in its ETFs. ARK Invest, headed by Cathie Wood, is arguably the most bullish firm on Wall Street when it comes to Tesla stock. For years, Wood and ARK analysts have said that Tesla shares will be subject to exponential value increases, mostly due to the Robotaxi fleet and the completion of the Full Self-Driving suite. However, ARK went around eight months without buying Tesla shares in 2023 and made its first purchase since April on December 20, two weeks ago yesterday. Tesla shares highlight ARK Invest ETF moves  During that buying period, ARK’s Innovation ETF, known as $ARKK, loaded up on 93,965 Tesla shares. Meanwhile, its Next Generation Internet ETF, known as $ARKW, purchased 17,422 shares. ARK did sell some Tesla shares during the period where it was not buying them, but this was due to a rebalancing of the ETFs, as it does not want one holding to have too large of a concentration. The ETFs consist of many different stocks. However, on Wednesday night, ARK bought more shares, adding them to $ARKK and $ARKW. $ARKK filled up on 91,194 Tesla shares, equating to roughly 0.24 percent of the ETF. $ARKW added 14,007 shares, roughly 0.198 of the ETF’s concentration. Tesla shares opened at $244.98 and closed at $238.45 yesterday, presenting a buying opportunity for ARK and other investors. Since January 4, 2023, Tesla shares are up over 112 percent. In 2022, the shares had a relatively large slide of over 65 percent, but Wood was never convinced Tesla was a bad investment. ARK has continued to buy Tesla shares, and 2024 presents even more potential catalysts, including the Cybertruck ramp, potential FSD improvements, and the release of revamped Model 3 and Model Y vehicles globally. Tesla shares are trading at $240.60 at 11:51 a.m. on the East Coast. I’d love to hear from you! If you have any comments, concerns, or questions, please email me at joey@teslarati.com. You can also reach me on Twitter @KlenderJoey, or if you have news tips, you can email us at tips@teslarati.com. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}