{
    "title": null,
    "date": "1/28/2024",
    "url": "https://www.cnn.com/2024/01/28/investing/magnificent-seven-tesla-earnings/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Tech behemoths will face their next test to keep the market’s throne this week, after a bleak quarter from Tesla sent its stock sliding. Tesla shares have tumbled more than 26% so far in 2024 after the electric-vehicle maker reported a fourth-quarter operating margin that has almost halved to 8.2% from the year-earlier period. Tesla also warned that it expects slower sales growth this year. That comes as the rest of the “Magnificent Seven” — Nvidia, Microsoft, Meta Platforms, Amazon, Apple and Alphabet — continue climbing higher. Nvidia, Microsoft, Meta Platforms and Alphabet shares closed at record levels several times last week. Now, they face their own tests. Microsoft and Alphabet report earnings on Tuesday, with Amazon, Meta Platforms and Apple to follow on Thursday. Nvidia reports quarterly results on February 21. Excluding Tesla, the Magnificent Seven is projected to report an aggregate 53.7% fourth-quarter earnings growth from the prior year, according to FactSet. Companies in the S&P 500 index are expected to report a 10.5% earnings decline minus those six firms. The Magnificent Seven’s quarterly results will be some of the most-watched this earnings season, due to the outsized influence the group has had over the broader market since last year. The returns in the Magnificent Seven drove about 62% of the benchmark index’s 26% total return last year, according to Howard Silverblatt, senior index analyst at S&P Dow Jones Indices. Related article\nMicrosoft is worth more than $3 trillion. It’s the second company to ever break that threshold Some investors say that while it’s unclear whether the elite tech cohort will continue its reign as the market’s top brass this year, it will be difficult for the stocks to repeat their blockbuster gains from 2023. “You’re coming in to a tougher and higher bar this year,” said Saira Malik, chief investment officer at Nuveen. “That will be the headwind to returns this year for tech.” Investors crowded into mega-cap tech stocks last year after the launch of ChatGPT in late 2022 prompted a flurry of artificial excitement. While the market rally broadened in late 2023 as optimism swirled that the Federal Reserve would soon start cutting rates, Wall Street still didn’t retire its old playbook. So far this year, the S&P 500 and Dow industrials indexes have reached all-time highs and topped their closing records several times over. So has the tech-heavy Nasdaq 100. But the Russell 2000 index, which tracks the performance of US small-cap stocks, is down 2.4% for the year compared to the S&P 500 index’s 2.5% gain. The S&P 500 equal-weighted index, which gives every stock the same influence over its performance, has fallen 0.4%. The “Magnificent Seven” excluding Tesla has a combined market cap of roughly $12 trillion, according to Bespoke Investment Group data through Wednesday’s close. That’s equivalent to over 65% of the Russell 2000’s market cap. Shelby McFaddin, investment analyst at Motley Fool Asset Management, said she will home in on cash flow when parsing quarterly earnings reports from big tech companies this week. Her firm owns all of the Magnificent Seven stocks except for Tesla. Related article\nExtreme greed is back on Wall Street “You can model out top-line growth until you’re blue in the face, but eventually, you run out. It can’t be infinite. So, if you’re doing AI, what does it do?” said McFaddin. “That’s what everyone has to answer to, because there’s a lot of aspiration in a lot of these valuations.” Some investors say that the Magnificent Seven could extend their dominance even if the Federal Reserve doesn’t cut interest rates as expected, thanks to their status as one of Wall Street’s favorite defensive plays. Investors sought out big tech stocks last year during turbulent times like the regional banking crisis, figuring that their flush balance sheets and AI involvement made them dependable havens. The Fed has projected three rate cuts for 2024, and data released so far this year suggests the economy remains resilient against rates currently hovering around a 23-year high. Still, that doesn’t guarantee continued strength in markets. “My concern is more towards the tail end of the year. Advertisers — is there going to be the demand? Are we heading into a recession? I don’t know,” said Joe Mazzola, director of trader education at Charles Schwab. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}