{
    "title": "EV growth is 'stalling' and Tesla has these 7 major obstacles ahead",
    "date": "1/22/2024",
    "url": "https://www.businessinsider.com/why-tesla-should-be-worried-this-year-morgan-stanley-adam-jonas-2024-1",
    "text": "       The year ahead for Tesla is shaping up to be a challenge. Tesla CEO Elon Musk will face a litany of obstacles in 2024 as the global electric car market shows signs of softening, according to Morgan Stanley analyst Adam Jonas. He expects Musk to present a cautious outlook for the year ahead, even after Tesla managed to eke out an impressive year in 2023. Tesla is scheduled to report fourth quarter and year-end earnings Wednesday evening when Musk and other leadership will face questions about their outlook for the year ahead. In a note to clients on Monday previewing the challenges ahead, Jonas laid out seven reasons Musk should be worried heading into 2024: Tesla kept an edge over its competitors in 2023 by driving down average EV prices with a slew of price cuts — made possible by Tesla's industry-leading profit margins. Heading into the fourth quarter of 2023, Tesla's margins still outpaced its competitors, though the gap was closing. Jonas points to German Tesla price cuts as a warning sign for the year ahead. The reductions came days after Tesla announced production cuts in Berlin, a move that typically has a positive impact on pricing. Tesla is quickly running out of government incentive programs for potential shoppers, particularly in the US. Earlier this month, the list of vehicles eligible for up to $7,500 in tax credits dwindled to just 13 cars, of which only three are Tesla models. Related stories Jonas and his team, who remain bullish on Tesla shares with a new price target of $345, are expecting more pullbacks like this in other countries as governments assess budgets in 2024. The mix of discounts and government incentives that helped Tesla keep its lead in the EV market this year is likely to have longer-term negative effects on pricing for the brand. \"Residual value volatility hurts the value proposition for consumers and creates uncertainty around leasing partners who don't want to hold the risk,\" Jonas wrote. Electric cars already have some of the worst resale values in the automotive industry, though Tesla leads this pack with the Model 3's residual value. Tesla was a recent high-profile victim of fleet buyers moving away from EV commitments. Car-rental company Hertz, which initially raised much fanfare over its partnership with Tesla, said earlier this month it would sell off a third of its global EV fleet and replace those vehicles with gas-powered cars. That spells trouble for Tesla's volumes, as fleet sales are often used as a dumping ground for vehicles with more supply than demand. EVs have enjoyed four years of government support and incentives under the Biden Administration, which initially bolstered the industry's commitment to battery-powered cars. However, a looming rematch between Biden and former President Donald Trump has investors worried about future support for Biden's clean energy incentives. \"Any potential rollback of EV incentives would be an impediment for the pace of EV adoption,\" Jonas wrote. A supply and demand imbalance for electric vehicles appears poised to hit China this year after a sprint to the finish in 2023 and the expiration of some key local stimulus measures, Jonas wrote. This imbalance is already playing out on a smaller scale in the US, with several executives pulling back on future EV ambitions recently. Related to China's looming overcapacity issue, the country's government said this month it would rein in EV exports and crack down on \"blind\" production of electric cars. Anecdotally, Jonas also pointed to rumblings that customers are returning to gas-powered cars and shifting away from EVs while interested EV buyers become more intrigued by used electric cars. Read next Jump to "
}