{
    "title": "Weekend Watchlist: 7 Stocks to Track Before Monday's Opening Bell",
    "date": "1/19/2024",
    "url": "https://investorplace.com/2024/01/weekend-watchlist-7-stocks-to-track-before-mondays-opening-bell/",
    "text": " Stock market news cycles continue at a breakneck speed, but this week’s major movers remain at the top of the list of stocks to watch for Monday Advertisement  Source: Shutterstock The list of stocks to watch for Monday is long. As the saying goes, “There are decades where nothing happens, and there are weeks where decades happen.” Though we’re less than a month into the new year, it seems as though it’s already one of those series of weeks where decades happen – at least in the stock market. We’ve already seen crypto ETFs take off, a series of merger arbitrage hopes dashed, and a much more lukewarm start to the year as market indices slump through January and lose the momentum we closed 2023 with. With that being said, stocks to watch for Monday include many of this week’s top newsmakers. If decades are happening in terms of weeks, expect major developments to continue for these names on Monday. Tesla (NASDAQ:TSLA) got its teeth kicked in this week, pointing to uncertainty and shakiness as the company preps for its earnings report on the 24th. A slew of EV owners throughout the Midwest saw their Teslas die in the frigid cold, as the weather puts added pressure to the car’s batteries and drains them faster than in normal operating conditions. As EVs become increasingly unpopular and investors turn their eyes to competitors like Chinese manufacturer BYD Company (OTCMKTS:BYDYY), Tesla could take a major hit if earnings aren’t as expected next week. Perhaps as an early warning sign that next week’s earnings might not be up to snuff, Elon Musk is challenging Tesla’s board to give him more control – or else. Musk owns about 12% of the company after selling a substantial chunk of shares to fund his Twitter/X venture, leaving him as the top executive without the total control he desires. Musk pointed to ongoing AI and robotics efforts at Tesla that work parallel to the company’s core car offerings as things at stake if he doesn’t get his way. Specifically, Musk took to X and said that, “I am uncomfortable growing Tesla to be a leader in AI & robotics without having ~25% voting control […] unless that is the case, I would prefer to build products outside of Tesla.” Tesla shareholders are doubtlessly used to drama by this point, but multiple bearish data points could rock the stock as we enter next week. AST SpaceMobile (NASDAQ:ASTS) had a major win this week – but one that left retail shareholders scratching their heads as shares plunged following the announcement. After months of kicking the can down the road, ASTS finally announced a confirmed strategic investment totaling $206.5 million to catapult the space stock’s growth plans as it begins bringing its satellite-to-cell service coverage to market. The deal includes convertible notes and non-dilutive purchases alongside a planned credit withdrawal. Better yet – and this is huge – one of ASTS’ new funding partners is Google (NASDAQ:GOOG, NASDAQ:GOOGL). In today’s investment landscape, companies like Google are increasingly nervous about plunging cash into tech startups, especially those in pre-revenue phases like ASTS. An endorsement from Google centers ASTS as a major player in the space industry moving forward. So what’s the downside? Even though the strategic investment does not include dilutive measures, ASTS is also launching a public stock offering worth $100 million. While the equity offering brings much-needed cash into ASTS’ coffers as it plans to launch its commercial offerings, it dilutes the existing retail shareholders who have been patiently waiting thus far. Shares surged on the initial report before falling after management announced the dilutive offering – creating a push/pull dynamic that should prove interesting as we watch the stock on Monday. In some of this week’s top news, regulators blocked a planned merger between Spirit Airlines (NYSE:SAVE) and JetBlue Airways (NASDAQ:JBLU). The deal devastated merger arbitrage investors, who buy shares of soon-to-be-bought companies to capture the difference between market and acquisition pricing to pocket the difference. But the long-term effects of the blocked merger could prove more catastrophic for Spirit than it does for the many investors who saw their planned merger play crumble into dust. Analysts expect that, in lieu of acquisition, Spirit’s current prospects point to bankruptcy more than any other course of action. Specifically, instead of a bankruptcy consolidation and reorganization, analysts see Spirit liquidating assets and ceasing to exist. Airline analyst Helane Becker summed up the stock’s immediate prospects, saying, “We recognize this sounds alarmist and harsh, but the reality is we believe there are limited scenarios that enable Spirit to restructure. We believe Spirit will first look for an alternative buyer, but another airline may get the same pushback.” Spirit is pushing JetBlue’s management to challenge the block, so where the airline ends up next is anyone’s guess – making it a top stock to watch for Monday to see how the situation develops. Echoing the “tough times for arb plays” in 2024, iRobot Corporation (NASDAQ:IRBT) shares got trimmed mightily this week as indications point to a potential block in the company’s planned Amazon (NASDAQ:AMZN) acquisition. Shares fell nearly 15% in a single day on the news, marking a nearly 40% loss since January 1st for the robotic vacuum cleaner company. The European Union block comes from claims that the merger creates an anticompetitive landscape for other robotic vacuum cleaners. The deal’s been on the backburner since August 2022 when Amazon announced they’d buy the company for $61 per share. Since then, the company’s stock is down mightily from the planned purchase price, sitting below $25 per share today. Realistically, we can expect legal recourse from Amazon’s acquisition team to challenge European decisions. Compared to the Spirit merger, there’s less meat behind this particular decision – but, as the battle’s already raged for years, Amazon might decide the juice isn’t worth the squeeze any longer. Still, if the deal goes through on its original terms, there’s a massive merger upside at play. That may not pan out, though, as many merger arb investors remain spooked after the SAVE fiasco unfolded. Apple’s (NASDAQ:AAPL) winning streak is untouchable, and the tech giant’s strong 2024 points to continued strength next week. A major upgrade from analysts at Bank of America reinforces Apple’s solid position going into earnings season. In the upgrade, analysts pointed to artificial intelligence and the company’s new Vision Pro headset as major growth catalysts. In turn, the upgrade included a $225 fair value revision upward, representing nearly 20% upside. But not everyone is as bullish on Apple’s prospects, creating a bear/bull dynamic that makes Apple another exciting stock to watch for Monday. Two other research firms, Piper Sandler and Barclays, downgraded Apple stock earlier this month. Both cited slumping iPhone sales as signs the tech megalith’s strength is waning. Likewise, the much-vaunted Apple Vision Pro is facing competitive headwinds that could keep sales lower than planned. Multiple providers, including Spotify (NYSE:SPOT) and Netflix (NASDAQ:NFLX) stated that they wouldn’t launch apps for the headset. This puts a damper on consumer enthusiasm, as Apple’s in-house suite of apps lacks the popularity offered by major media companies like Netflix. Boeing Co (NYSE:BA) had a mixed week and, going into the weekend, bullish and bearish tendencies are battling to make it another stock to watch for Monday. In this case, the good news is that Indian airliner Akasa Air just placed a massive order for 150 of Boeing’s 737 Max jets. The deal comes on the heels of Air India’s 2023 announcement that they, too, would buy more than 200 Boeing planes. The news points to the continued trust airliners place in Boeing’s aircraft – despite their recent rocky track record. Most recently, a midair incident saw door paneling fly off of a 737 Max as it flew above 16,000 feet – concerning, to say the least. The incident was one of several factors contributing to the company’s 20% stock loss thus far in 2024. The dueling narratives put Boeing shareholders in a tricky position. Still, as we’ve repeatedly seen, mega-corps like Boeing can’t be kept down over the long run. That could put today’s per-share pricing, which sits below pre-pandemic highs, an ideal entry point for long-term investors as they balance stock picks to watch for Monday. Winter sports season is in full swing. DraftKings’ (NASDAQ:DKNG) recent launch in Vermont points to solid signs that the digital gambling stock is set to maintain its winning streak next week. Defying wider market performance, shares surged already in 2024, returning more than 10% despite the S&P 500 eking out just 1% over the same period. Of course, DKNG bulls might be somewhat nervous that the stock got a hearty endorsement from CNBC’s Jim Cramer, which, as the “inverse Cramer” theory goes, might mean shares reached their peak and are due for a reversal. Still, Cramer’s endorsement comes from decent due diligence and echoes many of the same bullish notes other analysts put forth. Specifically, DKNG boasts an unmatched market share. The gambling company represents the cream rising to the top as competitors who couldn’t cut it fall back. Likewise, across multiple markets, DraftKings notes that “betting participation is larger and growing faster than previously anticipated.” Tailwinds propelling DraftKings remain strong, making it a top stock to watch for Monday. On the date of publication, Jeremy Flint held no positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Jeremy Flint, an MBA graduate and skilled finance writer, excels in content strategy for wealth managers and investment funds. Passionate about simplifying complex market concepts, he focuses on fixed-income investing, alternative investments, economic analysis, and the oil, gas, and utilities sectors. Jeremy’s work can also be found at www.jeremyflint.work.   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/weekend-watchlist-7-stocks-to-track-before-mondays-opening-bell/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}