{
    "title": "Musk To Appeal Court Ruling Voiding $55 Billion Tesla Payout As He Moves \nSpaceX To Texas",
    "date": "2/15/2024",
    "url": "https://www.carscoops.com/2024/02/elon-musk-and-tesla-shareholder-working-on-appeal-bond-after-his-55-billion-pay-package-was-voided/",
    "text": "The billionaire is expected to appeal the ruling that could see him lose options for 303 million Tesla shares Just a few weeks after a Delaware judge voided Elon Musk’s $55 billion compensation package from Tesla, the eccentric billionaire and the Tesla shareholder who sued him will ask a judge to pause her ruling while they resolve an appeal. A letter submitted to the court last Thursday disclosed that both parties are willing to agree to a stay if they can come to terms on an appeal bond. This communication suggests that Musk intends to appeal the ruling. However, before initiating any appeal process, the two parties will submit a final order for approval by Judge Kathaleen McCormick, along with a petition for legal fees. The appeal bond will protect the plaintiff and ensure Tesla has to pay up if they cannot overturn the verdict. Read: Elon Musk’s ‘Unfathomable’ $55.8 Billion Tesla Pay Package Blocked By Judge Reuters has learned that Musk and the Tesla shareholder will communicate their stance on fees to the court by March 1. The decision to nullify the substantial pay package could lead to one of the largest legal fee payouts Tesla has ever faced. If the judge approves the fee and final order, Musk will have a 60-day window to file an appeal with the Delaware Supreme Court. Judge Kathaleen McCormick of Delaware’s Court of Chancery voided Musk’s pay package, stating that he controls the Tesla board through his personality and influence. The compensation plan was approved by the board in 2018 and consisted of 12 tranches of stock options that would be vested when the carmaker reached certain targets. If the ruling is upheld, Musk will lose options for over 303 million Tesla shares. In her original ruling, Judge McCormick said Musk “enjoyed thick ties with the directors tasked with negotiating on behalf of Tesla, and dominated the process that led to board approval of his compensation plan. At least as to this transaction, Musk controlled Tesla.” Musk files relocate SpaceX to Texas While this unfolds, Elon Musk’s private rocket company SpaceX, originally incorporated in Delaware, has filed for relocation of its business incorporation with the Texas Secretary of State. Elon Musk himself shared this update on his social media platform X, formerly known as Twitter, on Wednesday. The world’s wealthiest man and CEO of Tesla also tweeted: “If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible.”  SpaceX has moved its state of incorporation from Delaware to Texas!If your company is still incorporated in Delaware, I recommend moving to another state as soon as possible. pic.twitter.com/B7FLByL2dY Follow Carscoops on \n                                Google News "
}