{
    "title": "Tesla cancels $16,000 pie order, leaving California bakery in setback",
    "date": "2/24/2024",
    "url": "https://e.vnexpress.net/news/business/companies/tesla-cancels-16-000-pie-order-leaving-california-bakery-in-setback-4714891.html",
    "text": "Tesla Motors CEO Elon Musk speaks next to the company's Model S during the Model S Beta Event held at the Tesla factory in Fremont, California Oct. 1, 2011. Photo by Reuters NBC Bay Area reported that Voahangy Rasetarinera, the bakery’s owner, was contacted by a representative from Tesla on Feb. 14 to supply 2,000 pies for a company event in honor of Black History Month, she recounted. The parties agreed on a delivery schedule for Feb. 20 and 22. Nonetheless, as the New York Post highlighted, issues emerged almost immediately when Tesla’s vendor was unable to complete the payment for the pies. Rasetarinera, who followed up on the payment on Feb. 15, received assurances and was also requested to increase the order to 4,000 pies by the Tesla representative, a challenge she accepted despite the significant strain it imposed on her and her staff. To accommodate the enlarged order of 4,000 pies, Rasetarinera took extensive steps, including the cancellation of other orders and the procurement of extra ingredients, which notably increased the bakery’s operations. However, a sudden text from the Tesla representative on Feb. 16 notified her that the pies were no longer required. \"This abrupt reversal left me reeling, realizing the extent of the impact on my small business,\" Rasetarinera expressed on the bakery’s Facebook page. \"I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry.\" When Rasetarinera questioned the Tesla representative regarding the cancellation, she was told it was a decision from senior management, a revelation she described as \"compounded on the betrayal\" she felt. Consequently, she condemned Tesla’s corporate practices for seemingly valuing convenience over responsibility and for their apparent indifference towards the well-being of small business proprietors. Tesla has yet to issue a public statement regarding the incident. Subsidiary of VnExpress\nLicense number: 71/GP-CBC, Ministry of Information and Communications, September 22, 2021 © Copyright 1997 VnExpress.net. All rights reserved. "
}