{
    "title": "Tesla repays owner of San Jose's The Giving Pies after last-minute \ncancellation",
    "date": "2/26/2024",
    "url": "https://abc7news.com/tesla-the-giving-pies-sj-elon-musk-x-pie-order/14471112/",
    "text": "WATCH LIVE The cancellation cost her thousands of dollars but after the small bakery owner's story went viral, Tesla responded. SAN JOSE, Calif. (KGO) -- A South Bay business owner says her sales are up after a big order from Tesla was canceled last minute. The cancellation cost her thousands of dollars but after her story went viral, Tesla responded. \"It's so heartwarming, I'm so super grateful,\" said Voahangy Rasetarinera, \"I don't think I have any words to use to say how grateful I am.\" Grateful because the community rallied around her business, The Giving Pies, after it took the significant hit. Rasetarinera said Tesla requested a last minute order for 2,000 mini pies, later doubled the order to 4,000 and then canceled abruptly. RELATED: Tesla criticized for canceling pie order worth $2,000+ with San Jose bakery Something that has never happened in Rasetarinera's experience with large corporations. \"They request a quote, I send the quote, they approve, I send the invoice - I'm paid immediately,\" she said. Tesla told her the representative she worked with mistakenly told her that payment was guaranteed and on its way when it was not. The business that had already turned down other orders to accommodate Tesla, was out $2,000 for already-purchased ingredients. \"When you're a big corporation, $2,000 is pocket money, it's nothing,\" Resetarinera said, \"But for us, it's a lot.\" VIDEO: Elon Musk says he'll 'make things good' with SJ pie shop after Tesla unexpectedly cancels order Days after the cancellation, Rasetarinera shared her story on social media where it went viral. ABC7 News met her the same day, by then customers already started pouring in to support her. The response only skyrocketed in the days after with so many customers over the weekend that she had to close Monday to catch up and fulfill orders. ABC7 News reached out to Tesla when we first met with Rasetarinera and never heard back; now she has heard from them moments after our first interview with her. Later, Elon Musk responded on X saying: \"Just hearing about this. Will make things good with the bakery. People should always be able to count on Tesla trying its best.\" RELATED: Business booms for San Jose pie shop after Tesla unexpectedly cancels order Rasetarinera said someone reached out to her about catering upcoming events. \"They asked me to cater March 5 and 7 but I had to decline because I don't have any more crust - because everybody came to buy pies,\" Rasetarinera said, \"We have so many events in March, we have PI Day, we have women's events, we also have Easter this year so it's all crazy. I really don't have any time for them.\" More than an hour after Rasetarinera's Monday interview with ABC7 News, she confirmed that Tesla had officially repaid the $2,000 that she was out for the purchase of the ingredients. Though she's too busy to work with Tesla in the immediate future, she says she's open to the possibility of working with them again. \"I think that we're all humans, we all make mistakes, and they're trying to do good on their mistakes,\" she said, \"So if they want to work with me, and they're not bitter about the whole experience - then yes, I would love to.\" If you're on the ABC7 News app, click here to watch live PG&E customers could see lowered, fixed bills with new proposal Wild spring storm drenches North Bay BART data shows arrests are up but so is crime "
}