{
    "title": "Altimeter Capital Is Betting Big on Tesla (TSLA) Stock",
    "date": "2/16/2024",
    "url": "https://investorplace.com/2024/02/altimeter-capital-is-betting-big-on-tesla-tsla-stock/",
    "text": " Altimeter is back in TSLA stock after selling out in Q4 2022 Advertisement Source: Roschetzky Photography / Shutterstock.com Altimeter Capital, led by founder Brad Gerstner, operates as a highly concentrated hedge fund with over $6 billion in 13F assets under management (AUM). Its top position, Snowflake (NYSE:SNOW), accounts for 41.05% of its 13F portfolio. Altimeter also operates as a long-term fund with an average 13F holding period of 9.36 quarters, or 2.34 years. During the fourth quarter, Altimeter purchased just one new stock: Tesla (NASDAQ:TSLA). Altimeter picked up 156,670 shares of TSLA, making the electric vehicle (EV) leader its ninth-largest position out of 11 total. This isn’t the fund’s first time buying Tesla. It first purchased 173,000 shares of TSLA stock in Q3 2022 before selling out of its entire position the next quarter. “While we expect their share will stay at around 15% as we move forward, that’s 15% in a massively growing market and we think they are going to be a much larger percentage of the profit pool in electric vehicles, in energy storage, etc.,” said Gerstner in 2022. He also added that he expected the EV market to grow by 30% to 40% over the next five to 10 years. Gerstner was previously bearish on TSLA in 2019 and 2020 due to a fear of undercapitalization and a possible bankruptcy. His view changed due to government support of EVs and Tesla’s high margins in relation to competitors. At the same time, Altimeter’s stake in Tesla is accurate as of Dec. 31. Since then, TSLA stock has fallen by about 19%. According to Morgan Stanley analyst Adam Jonas, institutional investors believe that TSLA stock will underperform during the next six to 12 months. Jonas made this conclusion following the Tesla “bull/bear” lunch event hosted by Morgan Stanley. “We expected bearishness from institutional investors given recent negative sentiment on the name,” said Jonas and his team. “But there was barely any attempt to argue for a near-term bull case.” Jonas himself has a price target of $345 and an “overweight” rating on the company. The analyst believes that Tesla is not only a tech company, but also an energy, robotics and artificial intelligence (AI) company. On the date of publication, Eddie Pan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Eddie Pan specializes in institutional investments and insider activity. He writes for InvestorPlace’s Today’s Market team, which centers on the latest news involving popular stocks. Consumer Discretionary, Automotive, Electric Vehicles Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/altimeter-capital-is-betting-big-on-tesla-tsla-stock/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}