{
    "title": "LGES 46800 battery reportedly to first power Tesla Cybertruck",
    "date": "2/21/2024",
    "url": "https://www.digitimes.com/news/a20240221PD203/lges-4680-battery-battery-tesla-cybertruck.html",
    "text": "Credit: LGES South Korea-based LG Energy Solution has revealed a schedule for the volume production of its 46800 battery, which will likely first support Tesla. Media reported that EV makers Rivian and Mercedes-Benz have also expressed their interest in cylindrical batteries with a 46mm diameter and may partner with LGES. According to South Korea-based ET News, LGES CEO Kim Dong-Myung recently said the company will start mass-producing the 46800 batteries as soon as August 2024. Tesla Cybertruck is reportedly the first EV that will adopt the battery. The 46800 battery, which can reduce production costs efficiently, holds five times more energy capacity than the 21700 battery. Tesla launched the Cybertruck at the end of 2023 and has been manufacturing the 46800 battery for the vehicle. Sources said as Tesla still sees a lower yield rate in its 46800 batteries, the EV company has asked LGES to advance the beginning of the 46800 battery supply. Therefore, LGES might start mass-producing the product in July. LGES has been mass-producing the 46800 battery on a trial basis at its Ochang plant in South Korea. Although the company has not finalized the production capacity, the volume production will help Tesla stabilize its battery procurement. Besides Tesla, several international carmakers have closely watched LGES' next-generation cylindrical batteries. Rivian and Mecedes-Benz have reportedly begun discussions with LGES about signing a supply contract likely beyond the 46800 battery. The conversation also covered the 46950 and 46120 batteries, which all have a 46mm diameter but different heights. LGES calls these products the \"46 series.\" Demand for LGES' new cylindrical batteries will grow rapidly if the company can broaden its customer base. After its Ochang plant starts mass-producing the 46800 battery, LGES plans to begin manufacturing the battery at its factories in Nanjing, China, and Arizona, the US. While major South Korean battery makers have been developing cylindrical batteries, LGES has been the only one that has finalized the production schedule for the 46800 battery, which will benefit its market share initially. Samsung SDI has named its cylindrical batteries with a 46mm diameter \"46pi\" and has been preparing for volume production. SK On began developing cylindrical batteries later than its competitors. Panasonic, Tesla's primary battery supplier, had aimed to start mass-producing 46800 batteries in fiscal year 2023, which ends in March 2024. The Japanese company later delayed production to the first half of fiscal year 2024, which ends in September 2024. Since Panasonic and LGES have a similar schedule for the 46800 battery volume production, competition between the two companies for Tesla orders has attracted the industry's attention. "
}