{
    "title": "Tesla Needs Elon Musk More Than He Needs It: Why That Is Problematic \n(NASDAQ:TSLA)",
    "date": "2/22/2024",
    "url": "https://seekingalpha.com/article/4672460-tesla-needs-elon-musk-more-than-he-needs-it-why-that-is-problematic",
    "text": "Tesla CEO Elon Musk arriving at the Court of Chancery in Wilmington, Delaware The Washington Post/The Washington Post via Getty Images Tesla CEO Elon Musk arriving at the Court of Chancery in Wilmington, Delaware The Washington Post/The Washington Post via Getty Images A while ago, I discussed the question of whether Tesla, Inc. (NASDAQ:TSLA) is more than a car company. I came to the firm conclusion that, in fact, Tesla is, indeed, a car company first and foremost and should be valued as such. Evidently, the stock market does not entirely agree with me on that point. I attribute this in no small part to the larger than life personality of CEO Elon Musk. In this article, I aim to lay out how that dependency on a single executive’s charisma may become increasingly problematic following a landmark court ruling blocking his path to the level of control he desires. Elon Musk is Tesla’s single largest shareholder and, for the time being apparently, Tesla stock his largest financial asset. His personal portfolio, however, comprises much more than just Tesla. There is, of course, X, the company formerly known as Twitter. Other companies founded and/or lead by Mr. Musk include SpaceX (SPACE), Neuralink, and X AI. The latter, in particular, is something that Tesla shareholders should be aware of. Significant portions of Tesla’s valuation are contingent on the anticipation of the company becoming a leader in the field of artificial intelligence. That, in turn, is largely fueled by a belief in its CEO’s brilliance. Given that he also serves as CEO of a dedicated AI company, there is, however, a very real possibility of whatever edge he may have ending up benefiting that business instead. Tesla might end up being a mere customer. Notably, Tesla plans to employ X AI’s Grok software in its cars in the future. Naturally, Elon Musk’s various holdings and leadership positions create potential conflicts of interest. Especially, once those companies interact with one another. Owning a larger share of X AI than Tesla, Mr. Musk could, for example, potentially profit more if driver assistance software is developed by X AI and licensed to Tesla rather than by Tesla itself. That conflict would even be more pronounced when it comes to licensing of such software to third parties, namely other carmakers. Selling AI software or other products/services to Tesla would also be a way to fund those other ventures through Tesla without having to sell or borrow against shares. Of course, even a CEO and largest shareholder cannot simply do whatever he wants. But it might be hard to put in effective guard rails, especially with a board stacked with close confidants of Mr. Musk. More generally, there is also the issue of divided attention. Leading a company such as Tesla would usually have to be considered a full-time job, even for somebody working “extremely hardcore.” In fairness, Mr. Musk’s other activities are of benefit to Tesla in terms of marketing, if nothing else. Nonetheless, doubts may be merited as to whether he is able to afford Tesla the necessary attention, while preoccupied with other projects. Recent events might put the aforementioned issues in focus going forward. The Delaware Court of Chancery ruled in Tornetta v. Musk, voiding a 2018 compensation package. Chancellor McCormick’s detailed post trial opinion in the matter might be an interesting and insightful read for anybody assessing Tesla from an investors’ perspective. The plaintiff, Mr. Tornetta, is a Tesla shareholder objecting to the terms and size of executive compensation and argued that in awarding the 2018 compensation scheme, directors breached fiduciary duties. The court found that plaintiff Tornetta was entitled to rescission and issued the appropriate order. Simply put, that means that stock options already vested under the program were cancelled and no stock options would vest under the package. That also means that the beneficial ownership reported in Tesla's December 31st SEC filing are no longer up to date. Fellow Seeking Alpha contributor Bill Cunningham recently explained this in more detail. The ruling may yet be appealed to the Delaware Supreme Court. However, the Court of Chancery is very rarely overturned on appeal. Assuming that the ruling will stand, the question of what its direct and indirect consequences are likely to look like presents itself. Theoretically, the package could be cancelled altogether. Chancellor McCormick, in no uncertain terms, questions the very proposition that additional incentives are required to motivate a person who, like Mr. Musk, already owns a substantial stake in the company worth billions of dollars. More likely, in my opinion, it will be retroactively replaced with a right-sized package. In any case, the number of new shares granted will most certainly be materially lower. In theory, that would be great news for shareholders, as it means less dilution, thus a higher per share interest in the underlying business. Essentially, the effect is comparable to share buybacks. Maybe the more important implication is, however, that there is no longer any realistic way for Elon Musk to get to 25 percent ownership. That is relevant insofar as he has publicly voiced his preference to “build products outside of Tesla” if he were not to receive voting rights of around 25 percent. Tesla, mind you, only has one share class. In fairness, it should be noted here, that given Tesla’s elevated valuation, which in no small part is based off of non-automotive hopes, there are incentives for Mr. Musk not to deflate those expectations. After all, his Tesla shares represent a fairly significant portion of his personal wealth and his ability to fund his other ventures. So, the aforementioned statement may be a bluff, so to speak. But, on the other hand, Elon Musk would be a billionaire many times over even without Tesla (not to mention that his stake in Tesla would still be worth a lot, if it were valued as “only” a carmaker). Apart from an appeal to the Delaware Supreme Court, there are some possible to get around the ruling that may or may not be explored going forward. For one, the board might, in theory, put the original compensation package back on the table and have shareholders vote on it again. But, in my opinion, this is highly unlikely. Simply proposing the same terms again could potentially open directors as well as any institutional shareholders with fiduciary duties towards their investors who approve in a vote to liability risks. Another option might be to reincorporate Tesla outside the State of Delaware in order to escape the Court of Chancery’s jurisdiction. As is often his style, Mr. Musk polled his followers on X/Twitter regarding an incorporation in Texas. Needless to say, that a Twitter poll is not, in any way, binding, but in case you wondered: 87.1 percent voted in favor. In the real world, that decision would ultimately be up to shareholders. Assuming that shareholders would approve the aforementioned move, that would arguably not result in free rein for Elon Musk and the board to reinstate or increase the compensation package at will. The State of Texas, I am sure, has little interest in ruining its reputation with investors. Notably, Texas law stipulates a robust duty of loyalty for directors and officers. One downside to a Texas incorporation from investors’ point of view might be the state’s constituency statute, which in effect allows for the consideration of factors beyond shareholder value in running a company, in so far deviating from the principle of shareholder primacy as developed in the seminal case of Dodge v Ford Motor Co. (204 Mich. 459, 170 N.W. 668 (Mich. 1919)); the opinion can be read in full here). So, I would not treat shareholder approval as a foregone conclusion (although I believe it to be a probability, if formally proposed). Another state that I feel Elon Musk et al. might consider moving Tesla’s incorporation to is Nevada. It would not be the first time, Mr. Musk had one of his companies reincorporated there. Notably, Neuralink was recently reincorporated in Nevada. X, too, did the same. An advantage over Delaware (and Texas) may be that Nevada law, to a higher degree, protects individuals from shareholder lawsuits against corporate leadership. Then again, as with Texas, I doubt that the State of Nevada and its courts are particularly eager to acquire a reputation as a jurisdiction in which executives and directors are granted free rein at the expense of shareholders. Lastly, I would not entirely rule out the possibility of the creation of a new share class with additional voting rights. While I am generally not a big supporter of dual share classes (and would definitely advise shareholders to always vote against ex-post creations of such special voting shares), in the case of Tesla, shareholders might come to the conclusion that it would be advisable to keep Elon Musk happy in order to preserve the valuation premium his presence arguably affords the share. Previously, I identified what I described as the “Musk Factor” as a key driver of Tesla’s elevated valuation. For a detailed explanation, kindly refer to my previous article. Consequently, Elon Musk’s exit from his role as CEO of Tesla could very well be the catalyst that leads to a (lower) valuation as a car company rather than a technology company. To be clear, I believe the odds of him leaving are low. Tesla is so highly valued that, arguably, he cannot afford to deflate its value without personally taking a massive financial hit. It should also be kept in mind that he has borrowed extensively against Tesla stock. However, Mr. Musk has a certain history of controversial actions (just consider his history at the helm of Twitter/X). He might, for lack of a better word, throw a tantrum, if he does not get his will. I have never personally met Elon Musk, let alone spoken to him. Therefore, my assessment of his character should be taken with a grain of salt. That being said, I get the impression that of all his visions and activities, space exploration and the eventual colonization of Mars is what he is most passionate about. For a man of his wealth, he shows surprisingly little interest in material luxuries. Instead, my feeling is that he seeks wealth primarily in order to be able to make his ideas possible. Without the perspective of being able to meaningfully increase his Tesla stake (and by extension his financial means), he might choose to focus his attentions on SpaceX instead in order to fulfil his grander vision. After all, he would retain his existing Tesla shares, no matter what, regardless of any additional stock options. There are also some challenges with regard to Tesla’s core business. To be clear, the company is in very respectable shape overall. Yet, as I stated before, simply being the best carmaker is not enough to justify Tesla’s current valuation. Its financial results have to be viewed in that context. YoY growth all but stagnated in terms of Q4 automotive revenue. On a full year basis, automotive revenues were up 15 percent. That, while still a rather healthy number compared to other carmakers, is markedly down from a growth rate of more than 50 percent between FYs 2021 and 2022. The adjusted EBITDA margin deteriorated further to now 15.7 percent (Q3: 16.1 percent; Q4 2022: 22.2 percent). With Tesla in the process of developing a new entry level product with a target price at around $25,000 there may be even more margin pressure ahead. On the positive side, annual net profits increased 19 percent to just shy of $15 billion. On a side note, while up 10 percent YoY, revenues in the energy generation and storage segment were down about 7.7 percent from the previous quarter. Revenue in the services and other segment increased 27 percent YoY, likely reflecting the increase in superchargers in the same order of magnitude (YoY +27 percent charger stations; +29 percent individual chargers). However, compared to Q3 the revenue remained flat at $2,166 million (that, in turn, representing only minimal growth from $2,150 million in Q2) pointing to slowing growth if not an intermediate peak. For 2024, there may be further headwinds. The Biden administration is reportedly considering pushing back the EV transformation targets. A possible (and not unlikely) Trump administration from 2025 through 2028 would presumably be even less inclined to push (and subsidize) faster adoption of EVs. Tesla also suffered from shipping disruptions due to attacks by Yemeni terrorist group Ansar Allah (commonly known as the “Houthi movement”) in the Bab al-Mandab strait and had to temporarily halt production in Grünheide near Berlin, Germany during Q1. On top of that, a (albeit non-binding) vote among citizens rejected a proposed development plan for the Grünheide facility. Meanwhile, Tesla’s latest (and, given the initial time frame, late) product, the Cybertruck, is perhaps on the way to becoming a costly flop – although I would not go as far as to compare it to digging the company’s grave as Musk himself did. From the outset, the Cybertruck was always unlikely to be a volume leader for Tesla. However, it might serve as a kind of “halo car” for the company. There are, however, apparent quality issues that might backfire in this regard. In particular, the vehicle’s highly touted stainless steel body – famously made of the same alloy as SpaceX’s starship – appears to be rather susceptible to rust or rusty dust. This could very well be a conceptual issue, for example the DeLorean DMC-12 had a similar weakness. Rust stains on a brand new, let alone expensive, vehicle could lead to reputational damage, if not properly addressed. Despite the aforementioned challenges, I believe that Tesla is still on a good way of becoming the most profitable carmaker, or at least the global number two behind Toyota Motor Corp. (TM). Tesla deserves certain valuation premium compared to other auto manufacturers on account of a strong brand, efficient sales channels, and a healthy balance sheet. A forward earnings multiple of 8 to 10 would thus, I believe, be justified. I further assume that despite somewhat weaker margins, the company will be able to eventually grow profits to around $20 to $25 billion per annum. Moreover, I am confident that Tesla could do so with or without Elon Musk as its CEO. If Mr. Musk were, for whatever reason, out of the picture, I have no doubt that the company could find a very qualified replacement from within the industry. Based on that, I believe a share price of $65 on an undiluted basis – translating to a total valuation of around $200 billion - to be justified (though admittedly ambitious). Obviously, despite YTD losses, Tesla stock still trades at about three times that level. Thus, unsurprisingly, I maintain my sell rating. I am, one might say, optimistic for the business, but pessimistic for Tesla stock. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}