{
    "title": "Musk vs Zuckerberg: 'Clear winner' as on tech titan boasts $200m a day feat",
    "date": "2/14/2024",
    "url": "https://nz.news.yahoo.com/musk-vs-zuckerberg-clear-winner-as-on-tech-titan-boasts-200m-a-day-feat-023643508.html",
    "text": "In 2023, two of the world’s richest tech titans started talking about a fight. It never came to physical blows, but that doesn't mean there wasn't a clear winner. Elon Musk got punched in the face and he never even got to fight. It all began back in June, last year, when the Tesla boss said he’d be up for a “cage match”. Mark Zuckerberg responded with the claim that he just needed to know the location and he’d be there. The fight briefly looked like it was going to actually happen - it even has its own Wikipedia page. I think I speak for all of us when I say we were looking forward to it. But, after a while, it became clear the head of Meta was keen on a formal affair, with rules, to raise money for charity. Musk, however, just wanted to rumble, possibly even in someone’s backyard. Also by Jason Murphy: Tax secrets of the most profitable private companies What bitcoin ETF means for Aussies and why they should be careful The Aussies copping the biggest cost-of-living hit - and those bucking the trend By late 2023, Zuck appeared to back away, saying the moment had passed. Since then, he’s taken the fight to the arena that matters: business. And it’s been a knockout. Look at the performance over the past year. The CEO of Meta (formerly Facebook) has added $2,000 million a day in value to his investors, almost tripling the value of his company. The CEO of Tesla, meanwhile, has cost his investors around $100 million a day, as the value of his company fell by 5 per cent. The chart above sets the two companies equal a year ago and uses an index to compare changes since that date.So, the values on the vertical axis are arbitrary. But we can look at the actual market capitalisation too. That way we can compare the pair in dollar terms. Here it is over a short time frame – the months since Musk proposed a cage match. We can see that, in June last year, Musk’s company was worth several-hundred-billion dollars more than Zuckerberg’s company. But, while Musk was weightlifting and practicing his ‘walrus’ fight moves, Zuck snuck up and hit him where it really hurts. Now, Meta is worth double what Tesla is worth. Both men own about 13 per cent of their companies, so you might assume Zuck is now richer than Musk. But don’t forget all the other pies in which the Tesla founder has a finger. Musk is also the owner of SpaceX, Twitter and several other small companies. According to Forbes estimates, Musk is still richer than Zuckerberg, although the gap is closing! Four things have happened that have driven Tesla down and Meta up: Tesla’s new cybertruck is not a runaway hit. It’s rusty and expensive. The company has no new products on the horizon, while Chinese competitors are flooding the zone. Meta launched a Twitter clone called Threads, which is eating Twitter’s lunch. It’s quite a good user experience, in my view. (I have accounts on both Twitter and Threads). Facebook announced a dividend. American companies pay dividends less often than Australian companies because their tax structure makes it less beneficial. But, in January 2024, Zuckerberg announced a dividend of 50 cents a share would be paid each quarter. That’s a pretty low yield for a share priced at $400+. You collect $2 a year for every share you own. It’s like a 0.5 per cent interest rate for parking your money in the bank of Facebook. But it was enough to make the stock pop. Musk’s reputation has taken a hit, as his political views have been exposed and a big expose in the Wall Street Journal revealed the extent of his drug taking (tranquilisers, hallucinogens, party drugs etc). The multi-divorced father of 10 says none of his friends has asked him to go to rehab though. They say those who burn brightest burn fastest. Musk’s rise into the business stratosphere has been extremely fast and extremely bright. Is he going to burn out? We will see. Follow Yahoo Finance on Facebook, LinkedIn, Instagram and Twitter, and subscribe to our free daily newsletter. A large fire has broken out at an Indonesian military ammunition facility outside the capital Jakarta. Dutch police have detained a man who walked out of a nightclub where hostages were being held after a tense hours-long stand-off.  Envoys from several countries have laid flowers in Russia at the site of an attack on a concert hall that killed 144 people. Melbourne's Ben Brown has kicked three goals as the Demons scored a seven-point away victory against Port Adelaide. Lachlan Lonergan has suffered a serious ankle injury as the ACT Brumbies overcame a nine-point deficit to beat the Queensland Reds 20-19 at Suncorp Stadium. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” The Dolphins have gone top of the NRL ladder with a 30-14 win over Gold Coast as their big-name off-season recruits Thomas Flegler and Herbie Farnworth shone. Goalkeeper Ryan Scott was the hero for the Newcastle Jets as they hung on to deny A-League Men finals hopefuls Melbourne City in a scoreless draw. Goals from Anthony Caceres and Joel King have sealed a 2-0 win for Sydney FC over the Central Coast Mariners in the A-League Men.  The Hurricanes and Blues have both recorded huge Super Rugby Pacific wins, thumping the Highlanders and Moana Pasifika, respectively. Police are investigating racial abuse yelled at the children of an AFL legend while they were playing in their yard as support floods in for the family. St George Illawarra fullback Tyrell Sloan has scored two tries to help the Dragons bounce back to winning ways with a 20-12 NRL victory over a poor Manly side.  Essendon star Jake Stringer has kicked the match-winning goal to pull the Bombers over the line against a tired St Kilda at Marvel Stadium. The great Kelly Slater has been beaten at Bells Beach as Australians Morgan Cibilic and Ethan Ewing advanced to the quarter-finals of the Rip Curl Pro. The Western Force's unbeaten start to the Super Rugby Women season has come to an end, losing to Fijian Drua, while the Brumbies saw off the Reds.  Wellington have dealt a blow to Western Sydney's finals hopes, while Michelle Heyman equalled an ALW record as Canberra staged a late comeback in Brisbane. Liam Wilson has been told by ring rival Oscar Valdez he must not give up on a promise he made to his dying dad, despite losing his latest world-title fight. Melbourne United will have home-court advantage for the deciding game of the best-of-five NBL championship series against the Tasmania JackJumpers.  Endale Mekonnen and Chloe Mannix-Power have set the pace in the heats for the 2024 Stawell Gifts. The Western Force were up a man for 30 minutes against the Drua, but still suffered a 31-13 loss in wet and slippery conditions in Fiji. Australian star Josh Giddey scored a team-high 23 points to help the Oklahoma City Thunder roll past the Phoenix Suns in the NBA. "
}