{
    "title": "Tesla scraps Elon Musk's no-advertising mantra as stock nosedives nearly \n30% this year",
    "date": "3/30/2024",
    "url": "https://www.aol.com/finance/tesla-scraps-elon-musk-no-213627194.html",
    "text": "Advertisement For premium support please call: Amid rising competition and a lackluster stock performance, Tesla is brushing off CEO Elon Musk’s previous disdain for marketing and pushing ahead with digital ads in search of a much needed sales boost. The company spent an estimated $6.4 million on digital advertising last year, the Wall Street Journal reported, citing data from Vivvix, a subsidiary of ad-tracking platform MediaRadar. The company’s marketing budget last year dwarfed the $175,000 Vivvix estimates that the company spent in 2022. Tesla has spent 900 times more on U.S.-targeted digital advertising in the first quarter compared to a year ago, according to a report by market intelligence firm Sensor Tower. Tesla’s ad spend was mostly focused on YouTube, Sensor Tower reported, but also included campaigns on Facebook, Instagram, Google, and the Musk-owned X platform, according to a review of publicly available data. More affordable than you think World’s bestselling SUV is $1k off this month Prices will go up again in Marchhttps://t.co/tEj0udh3Ll pic.twitter.com/aFPqU1CnyG — Tesla (@Tesla) February 11, 2024 Many of the ads are promoting the company’s Model Y vehicle, with a call to buy before prices increase on April 1. Some tout Tesla features such as its Autopilot and extra cargo space, while others show families using the touchscreen to play games or stream video. Musk and Tesla have often dismissed traditional forms of promotion, relying instead on word-of-mouth, referral programs, and the starpower of its chief executive to attract customers. The Tesla CEO has previously said money spent on publicity campaigns would be better spent elsewhere. “Tesla does not advertise or pay for endorsements. Instead, we use that money to make the product great,” he wrote in a post on X, formerly Twitter, in 2019. Still, Tesla shares’ nearly 30% nosedive since January and heightened competition from Chinese EV makers has recently led Musk to open up more to advertising. In response to a question at last year’s annual shareholder meeting in May, Musk said Tesla would “[T]ry a little advertising and see how it goes.” The company’s reversal on advertising comes as the first three months of the year wrap up and analysts prepare for what could be a subpar quarter for the EV maker. Several analysts have already downgraded their estimates for first quarter vehicle deliveries (an approximation for sales) after Bloomberg reported last week that Tesla was cutting back production at its plant in China. On Wednesday, Wedbush Securities cut its estimate to 425,968 from about 475,000, according to a note. The consistently bullish Wedbush analyst Dan Ives also cut his price target to $300 from $315, although the firm reiterated its “outperform” rating for the company. A recent internal email to staff showed Musk is not just relying on digital advertising but also aggressive promotion to beef up sales of its $12,000 per year subscription for “full-self driving.” In a leaked internal email this week, Musk said Tesla staff were required to give potential customers a quick trial while they are picking up their cars. “I know this will slow down the delivery process, but it is nonetheless a hard requirement,” he wrote in the internal email. This story was originally featured on Fortune.com Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}