{
    "title": null,
    "date": "3/9/2024",
    "url": "https://fortune.com/2024/03/09/rivian-r2-electric-vehicles-elon-musk-tesla-cost-cutting/",
    "text": "Tesla rival Rivian faced a make-or-break moment this week as it unveiled its latest model, the R2 SUV. Judging by its soaring shares, things went well. Since the Thursday event, the market value of the Amazon-backed electric-vehicle maker has jumped by more than $1.7 billion. Whether it sinks again as investors reconsider remains to seen, but the initial reaction has meant a much-needed boost for the beleaguered EV maker. Last month, Rivian announced a disappointing quarter and outlook and said it would cut its salaried workforce by roughly 10%. Its market cap has plunged from a peak of $153 billion in 2021 to $12.5 billion today. Gene Munster, managing partner of Deepwater Asset Management, recently mulled the possibility of Apple buying Rivian, noting the low valuation and the tech giant needing to do “something big” after killing its own EV project. Tesla CEO Elon Musk said last month that Rivian’s product design was “not bad,” but added, “the actual hard part of making a car company work is achieving volume production with positive cash flow.” He suggested his rival would go bankrupt in six quarters without a drastic change, saying it needed to “cut costs massively.” On Thursday, Rivian demonstrated that it’s willing to do just that, announcing to the surprise of many that it’s delaying plans to build a $5 billion factory in Georgia. Instead, it will manufacture its new models at its existing plant in Illinois, allowing it to save more than $2.25 billion in capital expenditures. Deutsche Bank analyst Emmanuel Rosner told Reuters he sees the move “relieving considerable pressure to raise capital in the near term,” as it appears Rivian will have enough cash on hand to carry it through production of the R2. Rivian surprised investors with other news, as well, unexpectedly unveiling another model—the smaller, cheaper R3 compact SUV—to be produced after the R2. It also showed off a beefier, more rugged R3X. “You didn’t expect that ‘one more thing’ here,” joked CEO Robert “RJ” Scaringe, referencing the tendency of the late Apple cofounder Steve Jobs to make last-minute product announcements after his keynotes. In an X post on Friday, Scaringe wrote that in less than 24 hours the company had taken more than 68,000 reservations for the R2, which will start at $45,000. He added that the company was “overwhelmed” by the response to the new vehicles. But the fact remains that Rivian has never made a profit, it’s still losing money on each vehicle it makes, and EV sales in general are growing at a slower pace than the industry expected. After a long stretch of difficult months, Rivian had a good Thursday and Friday. Whether that proves to be a blip or a turning point remains to be seen. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}