{
    "title": "Elon Musk Says Cost Of Making An Optimus Is Half That Of Manufacturing A \nTesla EV Despite Complexity Of H",
    "date": "3/26/2024",
    "url": "https://www.benzinga.com/news/24/03/37950895/elon-musk-says-cost-of-making-an-optimus-is-half-that-of-manufacturing-a-tesla-ev-despite-complexity",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla Inc TSLA CEO Elon Musk on Tuesday said that making its humanoid robot Optimus costs the company only half as much as making a car. What Happened: \"Complexity per unit mass is much higher with humanoid robots,\" Musk wrote on X. \"…but still I think it ends up costing less than half of a car.\" The CEO was responding to Sam Korus, director of research of autonomous tech and robotics at ARK Invest. Korus opined that the constraint to ramping humanoid robots as opposed to cars would be mostly software capability and not manufacturing. In another post, Musk confirmed to an X user that the Optimus will be priced between $25,000 and $30,000 initially and less as time passes. Why It Matters: During Tesla's fourth-quarter earnings call in January, CEO Elon Musk expressed optimism about delivering some units of its Optimus humanoid robot next year. \"I think we've got a good chance of shipping some number of Optimus units next year,\" Musk said. However, the CEO also warned that there is a lot of uncertainty and it is impossible to make a precise prediction. \"I do think it has the potential to be the most valuable product of any kind ever by far,\" he added. Tesla introduced its humanoid bot in 2021 with the initial goal of handling unsafe, repetitive, or tedious tasks. Morgan Stanley analyst Adam Jonas previously estimated that the addressable market for these bots would be \"huge\" given they can replace workforce around the globe. The global labor market is about $30 trillion or roughly 30% of global GDP, the analyst wrote in a note in late December. Photo Courtesy: KLYONA on Shutterstock Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Cybertruck Lead Engineer Fires Back After User Pokes Fun At Tesla's Advice Against Auto Wash: ‘Manual Doesn't Suggest You Shoot It Either' © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}