{
    "title": "3 Strong Buy EV Stocks to Add to Your Q2 Must-Watch List",
    "date": "3/28/2024",
    "url": "https://investorplace.com/2024/03/3-strong-buy-ev-stocks-to-add-to-your-q2-must-watch-list/",
    "text": " Here are just a few top EV stocks that could accelerate moving forward Advertisement Source: shutterstock.com/Nixx Photography Crisis will lead to opportunity with strong buy EV stocks. Many of the top EV stocks could see upside if and when the Federal Reserve starts cutting interest rates again. As it stands now, current rates have put a chokehold on the industry with ridiculously high borrowing costs. But again, once rates come down, sales could go back up. The other issue hurting greater adoption is the lack of EV charging infrastructure. Nearly 51% of Americans are concerned about that, says EY.com. However, with greater investment in infrastructure, we could soon see greater chances for further adoption. Plus, with many of the top strong buy EV stocks down in the dumps, I’d use that as an opportunity to accumulate on the cheap. Remember, as Baron Rothschild would say, “buy the blood in the streets, even if the blood is your own” Again, once we see the Federal Reserve cut ratee, and we start to see a greater build-out of EV charging infrastructure, sales will come back strong. For the time being, I’d just invest in some of the top names on the cheap and wait. Here are three EV stocks you may want to buy now. At the moment, Tesla (NASDAQ:TSLA) is technically oversold at double-bottom support dating back to May. It’s also just starting to pivot from over-extensions on RSI and MACD. And from its current price of $180.01, I’d like to see it retest $260 again near term. Helping, the company just said prices of its Model Y will increase by April 1 by $1,000–which should help improve its margins. Two, analysts at Morgan Stanley are out with a $320 price target. Three, according to the Italian newspaper–II Sold 24 Ore–officials at the Industry Ministry may be working with Tesla to produce EV trucks in the country. Recent earnings were nothing to write home about. Fourth quarter revenues were up just 3% to $25.2 billion. Adjusted EPS slipped to 71 cents a share. And both disappointed analysts. However, much of that negativity has been priced into the TSLA stock. Plus, Cathie Wood’s ARK funds bought about 116,408 shares of TSLA earlier this month. I’d also use weakness in other EV stocks, like Li Auto (NASDAQ:LI) as an opportunity. Granted, LI did just drop from about $46 to $30.19. All after noting that its first quarter deliveries would come in far less than prior estimates. It now expects deliveries to come in around 76,000 to 78,000, which is less than its prior forecast range of 100,000 to 103,000. That’s to be expected when EV sales have slowed, though. The good news here is that it appears most of the negativity stemming from guidance has been priced in. It’s also now oversold on RSI, MACD, and Williams’ %R and is likely to push higher, with patience. If you pull up a two-year chart, you’ll see that each time RSI, MACD, and W%R align in oversold territory, the stock bounces back strong. Also, just days ago, analysts at Bank of America reiterated a “Buy” rating on the Li Auto stock, with a price target of $57 a share. That was after the company’s fourth quarter earnings report, which showed a 136% jump in revenue, and a jump in gross profit margins to 23.5%. Or, if you want greater exposure to most strong buy EV stocks at less cost, look at the Global X Autonomous & Electric Vehicles ETF (NASDAQ:DRIV). With an expense ratio of 0.68%, the ETF currently invests in 45 stocks involved in the development of autonomous vehicle technology, electric vehicles and EV components and materials. Some of its top holdings include Nvidia (NASDAQ:NVDA), Toyota Motor (NYSE:TM), Microsoft (NASDAQ:MSFT), Tesla, and Apple(NASDAQ:AAPL) to name a few. At less than $25 a share, the DRIV ETF has been trending higher since bottoming out at around $23 a share. From its current price of $24.67, I’d like to see it retest $27.50 near term. What’s nice about the ETF is that I can buy 100 shares of it for about $2,500. Meanwhile, if I were to buy 100 shares of just one of its holdings, such as TSLA, it would cost me close to $18,000. On the date of publication, Ian Cooper did not have (either directly or indirectly) any positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Ian Cooper, a contributor to InvestorPlace.com, has been analyzing stocks and options for web-based advisories since 1999. Automotive, Consumer Discretionary, Electric Vehicles Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/3-strong-buy-ev-stocks-to-add-to-your-q2-must-watch-list/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}