{
    "title": "Tesla challenger Fisker, flirting with bankruptcy, gets both a design award \nand another scathing review in the same week",
    "date": "3/21/2024",
    "url": "https://finance.yahoo.com/news/tesla-challenger-fisker-flirting-bankruptcy-001141023.html",
    "text": "To call Fisker a “Tesla rival” might be a stretch at this point. The electric-vehicle maker’s market cap has plunged to $72 million, down from a peak of $4.1 billion in 2021. Compare that to the $542 billion enjoyed by Elon Musk’s juggernaut. Fisker did receive some much-needed good news this week, winning an iF Design Award for its Ocean SUV. That was offset, however, by Consumer Reports giving the vehicle a scathing review—not the first one it’s received. The design award comes amid a torrent of troubling news. Last month, Fisker issued a going concern warning, saying it would lay off 15% of its workforce. It also received a notice from the New York Stock Exchange for noncompliance as its stock closed at under $1 on average for 30 trading days consecutively. The U.S. National Highway Traffic Safety Administration opened a preliminary probe into claims of “unintended vehicle movement” with the Ocean. This week, Fisker announced a production pause of six weeks to “align inventory levels,” adding that it missed an interest payment, may need to seek bankruptcy protection, and is in continuing negotiations with an unnamed large automaker that might make an investment in it. (Reuters reported a few weeks ago that Fisker is in advanced talks with Nissan, citing unnamed sources). Fisker’s mounting woes come as the EV sector faces slowing sales growth, and as more consumers turn instead to hybrid models, much to the benefit of Toyota, which pioneered the technology. Former Ford CEO Mark Fields believes the transition to EVs will happen, but more slowly than automakers anticipated—spelling difficulties for EV startups. “With this longer path, a number of them are going to get into real financial trouble, and you’re seeing that play out right now,” he told CNBC’s Squawk on the Street last week. With doubts swirling about Fisker’s future, CEO Henrik Fisker recently told Yahoo Finance: “I believe that we have a future—otherwise I wouldn’t be here. And I believe we’re gonna manage to get out of this, I would say, general EV slump that there is out there.” But Fisker’s problems might extend beyond the slump. Consumer Reports called the Fisker Ocean as “unfinished,” “lost at sea,” and “one of the strangest cars we’ve ever encountered,” knocking the software and describing the powertrain as “bizarrely tuned.” That followed an earlier take by influential YouTuber Marques Brownlee (aka MKBHD), who called the Ocean the “worst car I’ve ever reviewed.” Still, the Ocean has its fair share of fans and defenders, and the iF Design Award called it “beautifully designed,” adding that its “sculptural surfaces, muscular stance, and slim lighting exude a powerful road presence.” Fisker told Fortune it had no comment on Consumer Reports review, but it added: “We are proud to have received the iF Design award. The Fisker Ocean has received numerous awards at this point, demonstrating that we have produced an excellent vehicle that has captured a deservedly great deal of recognition.” The accolades from a design competition are perhaps not surprising: Henrik Fisker has designed luxury cars for the likes of BMW and Aston Martin, to much acclaim. But designing cars is not nearly as difficult as producing them profitably at a large scale, as Tesla CEO Elon Musk has often noted. \"The issue is not about coming up with a car design—it's absolutely about the production system,\" Musk said in 2019 when unveiling the Model Y. \"You want to have a good product to build, but that's basically the easy part. The factory is the hard part.\" In the case of Fisker, the company leaves the job of making the Ocean to Magna Steyr, a contract manufacturer in Austria. Henrik Fisker told Automotive News last week that the Ocean’s early quality problems stemmed from the difficulty of getting components from different suppliers—each with their own software—to work seamlessly together. A cash-strapped EV startup relying on a contract manufacturer is less equipped to integrate components, of course, than a legacy automaker. That may help explain the Fisker Ocean suffering quality woes even as it wins accolades for its design. This story was originally featured on Fortune.com Related Quotes "
}