{
    "title": "Apple blew $10 billion on failed car project, considered buying Tesla",
    "date": "3/8/2024",
    "url": "https://arstechnica.com/cars/2024/03/apple-blew-10-billion-on-failed-car-project-considered-buying-tesla/",
    "text": "Front page layout Site theme Jonathan M. Gitlin\n    -    Mar 8, 2024 4:45 pm UTC Apple spent roughly $1 billion a year on its car project before canceling it last month, according to a report in Bloomberg. The project, which apparently made as little sense to many inside Apple as it did to outside observers, began in 2014 as the tech giant looked for a new revenue stream to supplement its hardware and software businesses. But grand plans for a fully autonomous vehicle were never able to overcome the various technical challenges, and prototypes only ever ran on a closed-course test track. During his tenure as CEO, the late Steve Jobs contemplated Apple getting into the automotive world, an idea that did not survive the global financial crisis of 2008. But by 2013, Apple executives thought this could be \"one more example of Apple entering a market very late and vanquishing it.\" At first, the company considered simply acquiring Tesla—at the time the startup automaker was worth just under $28 billion, a fraction of the annual profit that Apple was raking in even then. It is suggested that Musk standing down from Tesla was a sticking point, and talks ended. Later, in 2017, Musk apparently tried to interest Apple in buying Tesla, which at the time was mired in Model 3 \"production hell,\" but current Apple CEO Tim Cook refused the meeting. With a Tesla purchase off the table, in 2014 Apple instead decided to set up its own automotive R&D program, known internally as Project Titan. Almost immediately, Project Titan was the cause of arguments within Apple. The company's CFO, Luca Maestri, was not a fan; having come from General Motors' European arm, Maestri was all too familiar with the low profit margins enjoyed by automakers. Apple's top software engineer, Craig Federighi, and its star designer, Jony Ive, were both skeptics, too. But it seems the lure of a fully autonomous (level 5) vehicle, capable of driving anywhere without a human at the wheel, was too tempting to ignore. By 2015, the plan was to bring an Apple EV to market by 2020, and with Ive in charge of the style, that vehicle was destined to be a minivan. Given some of the ideas Apple experimented with, it's no surprise that Project Titan's gestation proved problematic—touchscreens folding down from the roof as controllers and external microphones to pipe in outside sounds, to name but two. In 2016, Apple decided to bet even more heavily on autonomous driving, as some in the company believed this could leave the company with a product to license to others, even if the car never materialized. Though the Tesla deal never happened, Apple considered partnering with or buying other automakers, including BMW, Canoo, Ford, McLaren, Mercedes-Benz, and Volkswagen. Apple prototypes were running on a private test track in Arizona in 2020. These were rounded minivans, painted white, with sliding doors and whitewall tires, apparently inspired by the VW microbus.—Ive must have been as enamored with VW ID. Buzz as pretty much everyone else on the planet. By this point, the company knew 2025 would be the earliest it could bring its car to market and planned to equip it with \"a giant TV screen, a powerful audio system and windows that adjusted their own tint,\" plus reclining seats for the passengers. It wouldn't feature a steering wheel, however, \"just a video-game-style controller or iPhone app for driving at low speed as a backup,\" an idea that is sure to horrify many Ars readers. There are longstanding reasons why the industry continues to use a steering wheel and pedals rather than joysticks or controllers, but the autonomous vehicle sector has been actively lobbying Congress to update federal regulations to allow for AVs sans steering wheel. In 2022, GM's Cruise petitioned the National Highway Traffic Safety Administration for permission to build its Origin robotaxis without one. By 2020, the prospect of achieving a fully autonomous vehicle capable of driving anywhere its user wanted to go—rather than one with a more limited design domain like a geofenced robotaxi—was still daunting. At the time, Project Titan was being run by Doug Field, formerly of Tesla, who suggested a conditionally automated driving feature, also known as \"level 3,\" was more realistic. This proved unwelcome advice, and in 2021, Field moved to Ford. The Apple car continued to morph, apparently losing its front and rear windshields for some time as the design switched to a curved pod with gullwing doors. Finally, in 2023, visions of fully autonomous driving were downgraded to the same kind of advanced cruise control and lane keeping offered by most automakers, and the cabin now had a steering wheel. But it wouldn't be cheap; estimates put Apple's cost of building the car at $120,000. The problem, according to Bloomberg, was Cook's decadelong indecision. \"If Bob [Mansfield] or Doug ever had a reasonable set of objectives, they could have shipped a car,\" says someone who was deeply involved in the project. \"They'd ask to take the next step, and Tim would frequently say, 'Get me more data, and let me think about it.'\" Kevin Lynch replaced Field and recently succeeded in piercing the reality distortion field, convincing the Apple board of something obvious to many of us: full autonomy you could sell to the public is at least a decade away, and the margins for selling cars are terrible. And at the end of February, the Apple car was no more. Join the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox. Sign me up → CNMN Collection\n  WIRED Media Group\n  © 2024 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 1/1/20) and Privacy Policy and Cookie Statement (updated 1/1/20) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights |  Do Not Sell My Personal Information\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices "
}