{
    "title": "Elon Musk Not Spending Enough Time At Tesla? Venture Capitalist Slams \nCritics: 'They Weren't Saying That When The ...",
    "date": "3/22/2024",
    "url": "https://www.tradingview.com/news/benzinga:42507098c094b:0-elon-musk-not-spending-enough-time-at-tesla-venture-capitalist-slams-critics-they-weren-t-saying-that-when-the-stock-was-going-up/",
    "text": "Venture capitalist David Sacks slammed critics on Friday for suggesting that Elon Musk isn't devoting enough time to the electric vehicle giant. What Happened: While appearing on CNBC's Last Call, Sacks, prominent venture capitalist and former PayPal executive, addressed concerns about something needing to be \"fixed\" at the EV giant given its continuous sinking performance. Sacks said he doesn't agree with the sentiment, at least not the way critics are suggesting. \"It sounds to me like Tesla has intensifying competition in China and then there's also some softening demands in the U.S. and Europe for EVs generally.\" He went on to add, \"So I think they are facing some cyclical issues here, so they’re gonna have to address those. But do I think they need to make a deeper change than that? No, I think that would be a huge mistake.\" See Also: Elon Musk Calls Jimmy Kimmel ‘Unfunny’ After His ‘Great White Supremacist’ Remark On Donald Trump: ‘The Other Jimmy Is Way Better’ Sacks then concluded by saying, \"These critics are basically saying that Elon isn’t spending enough time at Tesla,” adding, “They weren’t saying that when the stock was going up and he was doing the exact same thing. So, from my standpoint nothing’s really changed about his commitment or activities.\" \"These critics are basically saying that @elonmusk isn't spending enough time at Tesla,\" says @DavidSacks. \"They weren't saying that when the stock was going up and he was doing the exact same thing. From my standpoint nothing's really changed about his commitment.\" $TSLA pic.twitter.com/WrUejRnq7u Why It's Important: Earlier this week, it was reported that Tesla's shares have experienced a substantial downturn, dropping 34% year to date and marking the poorest performance among S&P 500 stocks. The EV giant's market evaluation has plummeted by $400 billion, causing it to drop out of the ranks of the top 10 largest corporations in the U.S. However, despite challenges like a slowdown in the Model 3 production and its sales, weakening demand for EVs and operational interruptions at Tesla's Berlin facility, Goldman Sachs has identified potential growth catalysts for Tesla. This includes increased production of new models like the Model 3 and Cybertruck along with upcoming updates for the Model Y and the launch of a budget-friendly vehicle projected to be priced between $25,000 and $30,000. Having said that, risks such as greater-than-expected reductions in vehicle prices, intensified competition within the EV industry, delays in product and technological advancements, and operational hurdles, could further impact Tesla's valuation, according to Goldman Sachs. Price Action: Tesla stock closed the regular Friday session at $170.83, down 1.15% from its previous close, according to data from Benzinga Pro. Read Next: Elon Musk Draws Attention To Satya Nadella’s Words In Lawsuit, ‘If OpenAI Disappeared Tomorrow... We Have All The IP Rights And All The Capability’ Image Via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}