{
    "title": "Lawyers who voided Elon Musk's 'excessive' Tesla pay package want $6 \nbillion fee",
    "date": "3/3/2024",
    "url": "https://www.foxbusiness.com/markets/lawyers-who-voided-elon-musks-excessive-tesla-pay-package-want-6-billion-fee",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy OLeary Ventures Chairman Kevin OLeary reacts to Elon Musk being forced to testify in the SECs probe into his purchase of Twitter on The Big Money Show. The lawyers who voided Elon Musk's $56 billion Tesla compensation package as being excessive are seeking a record $6 billion legal fee payable in the company's stock. \"We recognize that the requested fee is unprecedented in terms of absolute size,\" the three law firms said in a filing with the Delaware Court of Chancery. The law firms said the fee works out to an hourly rate of $288,888 for representing Tesla shareholder Richard Tornetta in the lawsuit to rescind the massive compensation package. The lawyers' request comes over a month after a Delaware judge voided Musk's $56 billion pay package because his close ties with the directors who approved the deal weren't fully disclosed to shareholders and the package's performance targets were easier for Musk to meet than the company acknowledged. The $56 billion package was the largest ever provided to the CEO of a publicly traded U.S. company, although Musk wasn't guaranteed any salary. \"The lawyers who did nothing but damage Tesla want $6 billion,\" Tesla CEO Elon Musk wrote in a post on X, formerly Twitter. \"Criminal.\" ELON MUSK'S $56 BILLION PAY PACKAGE VOIDED BY JUDGE Tesla CEO Elon Musk slammed the $6 billion fee request from the shareholder's lawyers. (Slaven Vlasic/for The New York Times / Getty Images) The EV maker is being asked to pay the legal fee because it benefited from Musk's pay package being voided, which the lawyers say will result in the return of 266 million shares of stock. \"This structure has the benefit of linking the award directly to the benefit created and avoids taking even one cent from the Tesla balance sheet to pay fees,\" the lawyers wrote, adding that the fee would be tax deductible for the company. Tesla may object to the legal fee requested by the law firms as it did with the fee requested in a similar case that challenged its directors' pay. Tesla did not respond to a request for comment. ELON'S EXODUS: TRACKING MUSK'S BUSINESS INCORPORATION STATE CHANGES Tesla's $56 billion pay package for CEO Elon Musk was voided by a Delaware court in January. (Tingshu Wang / Reuters Photos) The largest settlements in shareholder cases have historically occurred in federal court. The biggest fee was $688 million in 2008 for the legal team that obtained a $7.2 billion settlement in a securities fraud case over the failure of Enron. The Tesla fee request comes as the Delaware Supreme Court considers an appeal of a $267 million fee in a case that settled for $1 billion involving Dell technologies. Delaware judges have said that firms pursuing cases deep into litigation, through depositions and toward trial, should get a higher percentage of the recovery to reflect the risk and effort. The case involving Musk's Tesla compensation package went to a one-week trial. ELON MUSK MOVES SPACEX TO TEXAS AFTER DELAWARE REVOKED HIS TESLA SALARY PACKAGE Tesla may object to the $6 billion fee sought by the shareholder's legal team. (Wang Zhao/AFP via / Getty Images) Opponents of this approach argue that as settlements and judgments grow in size, attorneys should collect a declining percentage to avoid overcompensation. The legal team in the Musk case said the requested $6 billion fee represents about 11% of the judgment. Under the terms of his compensation plan, Musk was granted access to stock options that let him buy Tesla stock at heavily discounted prices and he was required to hold the stock for five years. The shareholder's legal team said they were seeking stock without restrictions on selling it. GET FOX BUSINESS ON THE GO BY CLICKING HERE The shareholder's legal team consists of three law firms – Bernstein Litowitz Berger & Grossmann and Friedman Oster & Tejtel, both of New York, and Andrews & Springer of Wilmington. Reuters contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}