{
    "title": "Hyundai Motor Group started second after Tesla in the U.S. electric vehicle \nmarket this year. Hyunda.. - MK",
    "date": "3/24/2024",
    "url": "https://www.mk.co.kr/en/business/10973556",
    "text": "Language Change font A A A A Share TOP Most read Language Change font A A A A Share Hyundai Motor Group started second after Tesla in the U.S. electric vehicle market this year. Hyundai Motor Group's share in the U.S. electric vehicle market is just around the corner. According to Automotive News, a U.S. automobile media outlet, Hyundai Motor and Kia registered 8,262 new electric vehicles in the U.S. in January this year, accounting for a 9.3% share in the local electric vehicle market. After Hyundai Motor Group, GM (6546) and Ford (5,429), respectively, ranked third and fourth. This is a statistic that cites S&P Global Mobility, a market research company. Tesla (48,757 units) recorded the largest number of registrations. However, Tesla's new registration in the U.S. in January has only increased by 15% over the past year as the number of entry-level Model 3 (11,739 units) has decreased by 23% from the same period last year. Unlike Tesla's slowing growth, Hyundai Motor Group's electric vehicle registrations increased significantly from the previous year. In January this year, the number of Hyundai Motor brands registered increased 79% from January last year, and Kia and Genesis more than doubled each. Hyundai Motor Group's new electric vehicle sales are cruising in the U.S. market. Hyundai Motor Group sold 14,399 electric vehicles in the U.S. between January and February this year, up 51.9% from the same period last year. Over the past year, sales of electric vehicles increased by 40.2 percent for Hyundai Motor (including Genesis) and 65.0 percent for Kia. Hyundai Motor Group's only stumbling block is a lack of U.S. electric vehicle production, which will expand its market share and outpace existing companies when its U.S. plants operate this year, Automotive News said. Hyundai Motor Group plans to operate an electric vehicle-only plant (HMGMA, Hyundai Motor Group Meta Plant America) in West Banner, Georgia, starting in October. 2024-03-29 17:44:51 2024-03-28 14:43:55 2024-03-29 10:06:50 2024-03-28 08:35:39 2024-03-29 16:18:40 2024-03-28 22:06:01 2024-03-29 20:51:03 2024-03-28 18:05:38 2024-03-30 06:02:41 2024-03-29 09:51:58 ※ This service is provided by machine translation tool, NAVER papago. Maeil Business Newpaper(MK) provides these translations \"as they are\" and makes no warranties of any kind, either\nexplicitly or implicitly, regarding accuracy, reliability and marketability, suitability for a particular purpose,\netc. of translation.\nPlease be informed that the content provided may not be translated accurately due to limitations in machine\ntranslation before using this service. Copyright (c) 매경닷컴. Maeil Business News Korea & mk.co.kr, All rights reserved.\nProhibition of unauthorized reproduction, redistribution, and use of AI learning "
}