{
    "title": "Tesla's Superchargers Just Got a Whole Lot Busier",
    "date": "3/2/2024",
    "url": "https://finance.yahoo.com/news/tesla-superchargers-just-got-whole-073601499.html",
    "text": "It’s a strange sight: Ford F-150 Lightning trucks and Mustang Mach-E crossovers lined up at a Tesla Supercharger, plugged into the familiar red-and-white posts. After years of driving a Model 3, and greeting only other Teslas at our charging stops, I can’t quite get used to the visual. Yet I must, because a new phase of EV charging has arrived. In the year-plus since Tesla transformed its proprietary plug into an open standard and invited the other automakers to adopt it, they did. Company after company pledged to adopt the renamed North American Charging Standard (which has since been given the technical name J3400) over the tech they’d been using, which would allow their EV customers to use Tesla’s bigger and more reliable network of fast chargers. This week, Ford, the first company to go all-in with Tesla’s plug, gained access to the Supercharger network. Around 15,000 Tesla chargers will be compatible with Ford EVs and will show up as part of the BlueOval charging network that appears in the cars’ infotainment screens. The Detroit giant is helping out its early adopters by offering free adapters that would normally cost more than $200, at least for now. (Future Fords will be built with the NACS plug and require no dongle). With many more brands to follow Ford’s lead, we’re about to see Supercharger access change America’s charging dynamic in several ways. For one thing, buying a non-Tesla EV just got more appealing. Loren McDonald, CEO of the analyst website EVAdoption, says horror stories about busted third-party chargers or the lack of sufficient plugs have dissuaded many on-the-fence drivers from going electric. When he asked his own brother-in-law, who wasn’t a total stranger to electrics, about switching to an EV, the reply was: So if I take that road trip across Idaho, I've heard there's no place to charge. And what if I run out of battery? “I think that was really eye-opening for me,” he says. Tesla, meanwhile, has held a sales advantage thanks to the closed access of Superchargers. Lots of buyers, myself included, bought a Tesla over another EV because its network was vast, fast, and reliable, which made it possible to drive an electric vehicle as the primary or only car. Once Ford EVs (or Rivians, or Chevys, or Hyundais) can use the Tesla network, too, those cars suddenly become more viable options. Just look at Tesla’s updated website and check out all the Supercharger locations suddenly open to other cars with NACS plugs. It might be annoying for Tesla drivers like me to give up our exclusivity; I’m sure I’ll mutter under my breath the first time I wait for an F-150 to finish charging. But it’s certainly good for electrification at large if expanded plug access gives more people the confidence to go electric. Tesla, of course, isn’t opening its network out of the goodness of its heart. Even as the company loses its dominant market share in EVs, its triumph in the charging standard wars means that Elon Musk’s company gains new customers who’ll be paying Tesla for electricity. Ford sold more than 70,000 EVs in 2023, for example, all of whom became potential Supercharger users this week. With NACS having succeeded in becoming the industry standard, we’re talking about millions of vehicles around the world ready to buy Tesla’s power. Those new customers might be paying extra, too. Electrek reports that Tesla is charging Ford drivers a 30% premium per kilowatt hour. Ford owners can get around that fee by purchasing a $12.99 per month Supercharger subscription that would see them pay the same kWh price as Tesla drivers. Of course, that model incentivizes those drivers to subscribe indefinitely and to maximize their investment by choosing Superchargers as often as possible. Fortunately, the new charging paradigm could benefit those who don’t care to pay for yet another subscription. Ford’s electric drivers could get along just fine by doing nearly all their charging at home or at stations run by Electrify America or EVgo. Then, if they need a little juice somewhere with only a Tesla supercharger, they could pay a premium and be on their way. On the other hand, Tesla’s new power in the charging market means it could go the other direction, too — say, by starting a price war like it did in the EV market, which kneecapped the profitability of EV efforts by traditional carmakers like Ford. Once again, it’s Tesla’s competitors who might be in trouble. Read more at Heatmap News: The Quest to Ban the Best Raincoats in the World We Fact Checked Everything Trump Has Said About Climate Change Since 2021 Or sign up to receive our best story in your inbox every day here. Related Quotes "
}