{
    "title": "Tesla Executive Says Working On Deploying FSD Subscriptions In Canada: \n'Elon Approved This...'",
    "date": "3/10/2024",
    "url": "https://www.tradingview.com/news/benzinga:cb84b0547094b:0-tesla-executive-says-working-on-deploying-fsd-subscriptions-in-canada-elon-approved-this/",
    "text": "A Tesla Inc TSLA executive said on Saturday that the company is working on the processes leading up to enabling full self-driving subscriptions in Canada. The proposal, he said, has already been accepted by CEO Elon Musk. What Happened: “Elon approved this Canada update and the team is working on the technical and regulatory procedures to make sure we don't trigger any unintended provincial issues,” Rohan Patel wrote on X, formerly Twitter. Patel is vice president of Public Policy and Business Development at Tesla. “Barring any setbacks, I'd expect this in the coming weeks,” he added. Patel was providing an update to an X user who reached out to him in February requesting FSD subscriptions on behalf of Canadian Tesla owners. Patel then assured the user that he would “get this done.” Elon approved this Canada update and the team is working on the technical and regulatory procedures to make sure we don't trigger any unintended provincial issues. Barring any setbacks, I'd expect this in the coming weeks. I take responsibility for missing this one when the... https://t.co/ZZjUjwMfRw Why It Matters: FSD capability is already available in the U.S. on a subscription basis. Depending on whether your vehicle is equipped with basic autopilot or enhanced capability, FSD capability can be subscribed to for either $199 per month or $99 per month. In Canada, however, Tesla buyers can only buy FSD with a one-time payment of C$16,000 (about $11,863). Photo via Shutterstock Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Elon Musk Cracks Up As Tesla FSD Testing Raises Concerns Of A Cult In Florida Neighborhood: ‘It Must Look Pretty Weird’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}