{
    "title": "What next for Elon Musk's Tesla Insurance?",
    "date": "1/5/2024",
    "url": "https://www.insurancebusinessmag.com/au/news/auto-motor/what-next-for-elon-musks-tesla-insurance-471753.aspx",
    "text": "By\n                                Gia Snape When Tesla announced it was venturing into auto insurance in 2019, it promised a better and cheaper insurance experience for electric vehicle (EV) drivers beset by high repair costs and premiums. But nearly four years since it launched, Tesla Insurance has faced significant challenges and questions over its viability. A slew of consumer complaints drew lawsuits and regulatory scrutiny last year, and the brakes appear to have been put on Tesla Insurance’s launch in Europe, originally slated for 2023. One analyst Insurance Business spoke to said the EV giant seems to have run into the same problems that other tech firms fall into while trying to enter insurance. At the same time, Tesla may have struggled in handling the operations of its insurance arm. We are actually looking for revolutionary actuaries for Tesla Insurance! Please inquire, if interested. “First of all, when Tesla first came into the industry, they didn’t actually keep the risk themselves; they were just a distribution channel,” said Adam Denninger (pictured), global industry leader for insurance at Capgemini. “What you’ve seen for a long time is that a lot of technology companies coming into the industry on the distribution side – offering new agent experiences, new mechanisms of gathering data, even occasionally doing the underwriting piece as well – all have had a similar experience. They lost a lot of money.” Denninger cited high-profile insurtechs like Hippo and Lemonade as examples of startups that have had a similar experience to Tesla Insurance. “[These companies] came in thinking that the technology was the hard part, and thinking insurance is this old, slow backwater industry,” Denninger said. “[They thought] it’s not that complicated, and they could solve it. But they realised [insurance] was pretty complicated, and it’s difficult to do it without losing your shirt. I think that’s what happened to Tesla.” Experts earlier claimed that Tesla’s pioneering use of advanced telematics would significantly help it price risk better and bring down auto insurance premiums for its policyholders, in a market where traditional insurance players were raising their rates. However, accounts of high auto insurance premium quotes by EV drivers soon surfaced in media reports, appearing to contradict Tesla founder Elon Musk’s assurances of affordable rates. In December 2023, a California judge ruled that the tech firm’s insurance arm would face a class action lawsuit from drivers who claimed they were overcharged for their premiums which Tesla allegedly based on “false” crash warnings instead of actual driving behaviour. Danger ahead for Tesla insurance: faulty forward collision warnings inflate premiums, triggering a class-action lawsuit. If you'd like to see this fixed, please share this article and spread the word.https://t.co/6dEVVYXGqK$TSLA @Tesla @torquenewsauto #teslainsurance A recent investigative report by Reuters included allegations that poor management practices and understaffing by the company had led to extensive delays in claims and other operational shortfalls at Tesla Insurance. “I think when Tesla came in, they didn’t understand the level of difficulty for servicing and managing claims, how much work it is to run an operation centre and handle all the incoming calls, the support that people need, etc.,” said Denninger. “Essentially, they were not prepared for what it meant to actually be an insurance company from an operational perspective, which led to negative reviews.” There have also been questions as to whether Tesla can deliver on the promise of its telematics scheme. “This is what people said would disrupt the industry because [Tesla] was going to use their cars to do telematics,” said Denninger. “They are going to have a data set on a large number of cars that’s incredibly rich that nobody can compete with, and they will be able to price more accurately than anyone else. As you look forward, that probably will happen.” However, critics have argued that Tesla’s reliance on in-house data may not align with industry standards, potentially leading to inaccurate risk assessments and mispriced insurance premiums. The US class action against Tesla Insurance also raised concerns about the sensor technology they’re using and whether these are “misreading” driving events. But Denninger maintained that Tesla’s fundamental insurance pricing model is sound. “People are saying, ‘your car isn’t scoring me correctly because the things you’re dinging me for scoring are incorrect’. So, there’s a technology fail,” Denninger said. “But the underlying model that they’re using to price insurance, there’s nothing wrong with it at all. People do variations of that using smart devices. “The question is really whether the technology is doing it correctly and whether Tesla has a liability associated with that. That’s an interesting question, and I don’t know where it’s going land.” Though there are technology and operational concerns on the table from some corners, Denninger also points out that increased scrutiny over Tesla Insurance could also be part of the “Elon Musk effect.” “When I look at all this stuff around Tesla, and all the noise around it, I think some of it is just that Elon Musk is larger than life. People react to him, and they try to jump on any bad news,” said Denninger. An appeals court has ruled that Elon Musk will not have to testify in a wrongful death lawsuit after two teenagers were killed in a Tesla Model S going 116 miles per hour in 2018—after a Tesla technician removed speed limiting software on the vehicle. https://t.co/Sl6EkLeSvg Its controversial CEO aside, Tesla seems to be making all the right moves in its insurance strategy, according to the Capgemini leader. “What they’re doing is cutting-edge. It’s exactly where the rest of the insurance industry is going for telematics. Everybody wants to feed data off their cars,” Denninger said. “As for retaining the risk themselves, other technology companies have tried to do this. It’s not new, and all of them lose their shirts when they do it, and they end up partnering with traditional insurance companies at some point. There’s nothing new here from an insurance industry perspective.” But is there hope for redemption for Tesla Insurance? Denninger told Insurance Business that the tech giant is likely already “digging their way out.” “I’m sure they’re fixing it because the company is incredible when you think about what they’ve done,” he said. “But in the meantime, it’s causing them all kinds of public relations problems.” What are your thoughts on Tesla Insurance’s rollout? Do you have any experience with Tesla Insurance you’d like to share? Tell us in the comments.  "
}