{
    "title": "Elon Musk shares clip of Tesla's Optimus robot folding a shirt. Then, a \nclarification",
    "date": "1/16/2024",
    "url": "https://www.moneycontrol.com/news/trends/elon-musk-shares-clip-of-teslas-optimus-robot-folding-a-shirt-then-a-clarification-12061541.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Billionaire Elon Musk recently shared a video featuring Tesla's Optimus robot expertly folding a shirt. However, as the virtual dust settled on social media platforms, Musk was forced to clarify that the seemingly autonomous feat was not a current reality but a tantalizing glimpse into the future. Musk had earlier showcased the prowess of Tesla's Optimus robot in various tasks, from yoga stretches to delicate egg handling. The latest demonstration, though, sparked skepticism, with users dissecting the video on social media. “Optimus folds a shirt,” read the caption of Musk’s video. Half hour later, he had a follow up. \"Important note: Optimus cannot yet do this autonomously, but certainly will be able to do this fully autonomously and in an arbitrary environment (won't require a fixed table with box that has only one shirt),\" the owner of X wrote.Important note: Optimus cannot yet do this autonomously, but certainly will be able to do this fully autonomously and in an arbitrary environment (won’t require a fixed table with box that has only one shirt) — Elon Musk (@elonmusk) January 15, 2024Notable tech YouTuber Marques Brownlee queried Musk about the video's authenticity. \"This is a video, not CG?\" Brownlee asked. Musk did not respond. As discussions unfolded, users on Threads pointed out peculiarities in the footage. A slow-motion analysis suggested potential inconsistencies, as the shirt manipulated itself at times. Observant eyes also caught a glimpse of a gloved hand in the video's periphery, raising suspicions about remote operation rather than true autonomy. Many chimed in with jokes. One wrote, \"My mom would’ve already taken its place and said: Too slow, I’ll do it. I always have to do everything around here.\" Despite the skepticism, Musk's ardent supporters rallied on X, showering praise on the visionary entrepreneur. Lex Friedman, a podcaster known for engaging conversations with Musk, commended the effort with an enthusiastic \"Amazing work.\" While there is no timeline on when Musk’s video becomes a reality, other advances in robotics and Artificial Intelligence has stumped the world with many asking to exercise caution against deepfake videos and other scams. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}