{
    "title": "Tesla gets a $94-billion reality check as EV winter sets in",
    "date": "1/15/2024",
    "url": "https://financialpost.com/investing/tesla-94-billion-reality-check-ev-winter",
    "text": "Elon Musk's EV maker off to its worst start to any year — ever Author of the article: You can save this article by registering for free here. Or sign-in if you have an account. Tesla Inc. had a blockbuster 2023, as its shares more than doubled in 12 months, but 2024 is starting on a different note, with Elon Musk’s electric-vehicle maker off to its worst start to any year — ever.  The company has lost more than US$94 billion in market valuation in just the first two weeks of 2024. It’s not hard to figure out why, as the Austin, Tex.-based EV maker has been pounded by a barrage of negative news: an about-face on EVs from car rental giant Hertz Global Holdings Inc., yet another price cut for its cars made in China and signs of rising labor costs. Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience.  All this comes in the face of slowing growth in demand for EVs, especially in the United States.  “Investors’ main concern on Tesla is stagnating growth,” TD Cowen analyst Jeffrey Osborne said. The price cuts in China only fan those concerns, because it is starting to look like “a race to the bottom for the EV industry given intense competition in that market.”  The hit to Tesla’s market capitalization to start the year is the biggest the company has had over a similar period since it went public in 2010. In percentage terms, Tesla’s 12 per cent drop since the start of January is the worst since 2016, when the stock fell 14 per cent over the first nine trading days of the year.   To make matters worse, the odds of an imminent turnaround for the EV maker don’t look good.  Tesla has been cutting prices on its cars aggressively since early 2023 in an effort to boost demand. But the result has been a steady erosion of its once-hefty profit margin. Tesla’s automotive gross margin ex-regulatory credits for the third quarter fell to 16.3 per cent from 27.9 per cent a year ago. And the pressure is only mounting now that production workers at Tesla’s U.S. plants are getting pay raises. Canada's best source for investing news, analysis and insight. By signing up you consent to receive the above newsletter from Postmedia Network Inc. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Investor will soon be in your inbox. We encountered an issue signing you up. Please try again  “We are going through a cyclical downturn for EVs, but competitive dynamics are exacerbating the cyclical pressures,” Ivana Delevska, chief investment officer at Spear Advisors LLC, said. “Price cuts and plummeting margins are all a function of these unfavourable competitive dynamics.”  Adding to the woes, Tesla has had to re-route shipments destined for its Berlin plant after Western military actions and security concerns in the Red Sea, and is suspending most production at its plant near Berlin from Jan. 29 to Feb. 11, according to a person familiar with the matter.   Tesla first warned about the deceleration in EV demand during its October third-quarter earnings report. Almost immediately after, automakers and suppliers across the globe chimed in with their own downbeat forecasts. Many carmakers dialed back their plans for expansion.  Then, earlier this month, Tesla reported its fourth-quarter delivery numbers. While they were better than what analysts expected, they put the company behind China’s BYD Co. Ltd. in global electric-car sales.  The result has been a rude awakening for Tesla investors. Last year, the stock was the eighth-best performer in the S&P 500. So far this year, it’s the eighth worst.  Naturally, Musk is taking a big hit personally. The world’s richest person, who gained more wealth in 2023 than anyone else on the planet, has seen his net worth shrink by US$23 billion so far this year, according to the Bloomberg Billionaires Index. Musk regained the top spot on Bloomberg’s wealth index last year, overtaking Bernard Arnault, but now Jeff Bezos is rapidly closing in, with US$179 billion to Musk’s US$206 billion as of Jan. 12’s close.  The bulk of Musk’s net worth comes from his 13 per cent stake in Tesla and about 304 million exercisable stock options. He also owns about 42 per cent of Space Exploration Technologies Corp., which is valued at about US$53 billion, according to Bloomberg’s wealth index.   With all that said, Tesla remains a key player in the global transition from gas-powered vehicles to largely electric ones. The reason: It’s so far ahead of its potential rivals. China’s BYD may have surpassed Tesla in the number of units sold, but it still lags in revenue and profits. And BYD doesn’t sell cars in the U.S., where Tesla remains the market leader.  In many ways, Tesla’s biggest problem may be its past success and the hope it generated. As investors piled into the stock, Tesla’s market capitalization ballooned, making it way larger than any other car company in the world. However, with the shares priced for perfection, that also made them highly vulnerable to big reactions to any negative news.   That’s why so many Tesla proponents argue it shouldn’t be compared to regular car companies. To them, the ultimate true value of the company rests in the future and its hope to develop the first truly self-driving vehicles. The only problem is Tesla has been promising this for years, and most experts say the technology is still years, maybe even decades, away.  “Tesla has not been able to deliver on fully autonomous driving and AI promises, which are already embedded in the valuation,” Delevska said. “Being simply another automotive manufacturer is not going to cut it for a US$750-billion valuation.”  — With assistance from Matt Turner, Kristine Owram and Ed Ludlow.  Bloomberg.com  Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2024 Financial Post, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. You can manage saved articles in your account. and save up to 100 articles! You can manage your saved articles in your account and clicking the X located at the bottom right of the article. "
}