{
    "title": null,
    "date": "1/6/2024",
    "url": "https://finance.yahoo.com/news/china-tesla-beating-ev-maker-230344437.html",
    "text": "When China’s BYD recently overtook Elon Musk’s Tesla as the global leader in sales of electric vehicles, casual observers of the auto industry might have been surprised. But what’s caught other carmakers around the world off-guard is something else about BYD, which is backed by Warren Buffett’s Berkshire Hathaway: its low prices. “No one can match BYD on price. Period,” Michael Dunne, CEO of Asia-focused car consultancy Dunne Insights, told the Financial Times. “Boardrooms in America, Europe, Korea and Japan are in a state of shock.” BYD can keeps its costs low in part because it owns the entire supply chain of its EV batteries, from the raw materials to the finished battery packs. That matters because a battery accounts for about 40% of a new electric vehicle’s price. While BYD cars are not yet a common sight on American roads, many experts believe it’s only a matter of time, despite the high tariffs that help keep them at bay for now. Currently in the U.S., made-in-China EVs are subject to a 25% tariff, which goes atop a 2.5% tariff on imported cars. But if BYD or other Chinese carmakers were to come in with a $20,000 car, noted Dunne, they’d still be a “good position” despite the high tariffs, given that the average price of a new car in the U.S. this year is about $48,000. BYD launched an EV called the Seagull with a cutthroat price of about $11,000 last year in China, where it quickly became one of the bestselling EVs. “But it is overseas that the EV could be a truly disruptive force,” wrote the UK-based market intelligence firm Autovista Group. Even today, BYD’s Dolphin hatchback starts at $33,000 in Britain, according to Reuters, or nearly 30% below the starting price of the VW’s rival ID.3 hatchback. But BYD is planning to export much cheaper models to markets around the world, including Europe, South America, and Southeast Asia. And over the past three years, China’s EV exports have jumped 851%, the New York Times reported in October. As for the U.S., BYD may enter from south of the border. In Mexico, the company is scouting locations for a new manufacturing plant, according to the FT. Mexico has a free trade agreement with the U.S. and Canada. In November, House lawmakers warned about Chinese giants like BYD “gaining a back door to the U.S. market” through the southern neighbor. Last year, Ford Motor executive chairman Bill Ford Jr. warned that American automakers are “not quite yet ready” to compete with Chinese rivals on EVs. “They developed very quickly, and they’ve developed them in large scale, and now they are exporting,” he told CNN. “They are not here, but they will come here we think at some point.” BYD also has the advantage of its founder and CEO Wang Chuanfu, a relentless cost-cutter whom the late Charlie Munger—Buffett’s long-time partner at Berkshire—described in one of his final interviews last year. On the Acquired podcast, Munger said that Wang could look at somebody’s part in the morning “and in the afternoon he could make it. I’ve never seen anybody like that…He is a natural engineer and a get-it-done-type production executive, and that’s a big talent to have in one place.” He added, “The guy at BYD is better at actually making things than Elon is.” This story was originally featured on Fortune.com Related Quotes "
}