{
    "title": "Tesla's US market share now tops Volkswagen, Subaru, and BMW",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/teslas-us-market-share-now-tops-volkswagen-subaru-and-bmw-161055575.html",
    "text": "Tesla (TSLA) isn’t just dominating the electric vehicle market in the US, it’s also gaining ground in the overall market for cars. Per data from Cox Automotive and its subsidiary Kelley Blue Book, Tesla increased its market share in the US across all automakers to 4.2% in 2023 from 3.8% in 2022. That 4.2% market share resulted from 654,888 Tesla vehicles being sold in the US, as estimated by Cox, a whopping 25.4% jump from 2022. Though a 4.2% market share for Tesla still puts it behind automakers such as GM (GM), Ford (F), and Toyota (TM), it translates to Tesla now having a larger market share than Volkswagen (4.1%), Subaru (4.1%), and BMW (2.5%). Overall, Cox’s data shows GM leading the way in the US by market share (16.5%), followed by Toyota (14.4%), Ford (12.7%), Hyundai (10.6%), Stellantis (9.8%), Honda (8.4%), Nissan-Mitsubishi (6.3%), and Tesla (4.2%). Read more: Are electric cars more expensive to insure? In addition to Tesla, the brands making the biggest gains in sales in 2023 were Honda (up 33%), Mazda (23.2%), and Volvo (26.1%), among those with over 100,000 unit sales in the US. While Tesla’s gains in the overall market are strong, it did come at the expense of profitability. Tesla’s jump in sales came as its average transaction price tumbled from approximately $60,000 in January 2023 to $50,051 at the end of the year. Cox said overall EV sales in the country rose 46% from a year ago, though sales improved only marginally from Q3 to Q4, indicating a sales plateau may be near. Looking ahead, the EV landscape will shift considerably from a competition point of view, which will likely increase sales of EVs but bring pressure on top US EV sellers like Tesla and Ford. Cox estimates that over 70 new EVs will be on the way in the next two years, with 37 models debuting this year and another 34 in 2025. This will coincide with the overall vehicle sales market in the US improving in 2024 despite headwinds such as high financing costs and higher overall pricing. Cox forecast the market for new vehicle sales will hit a seasonally adjusted 15.7 million in 2024, up from 2023’s 15.5 million. Fleet sales, new lease volume, and higher lease penetration will help boost those sales figures, with leasing seen as a way to offset higher prices via lower payments to consumers. Pras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Related Quotes "
}