{
    "title": "Fisker, Rivian, TSLA, MULN stocks plunged: here’s another risk to know",
    "date": "1/19/2024",
    "url": "https://invezz.com/news/2024/01/19/fisker-rivian-tsla-muln-stocks-plunged-heres-another-risk-to-know/",
    "text": "Follow Invezz on Telegram, Twitter, and Google News for instant updates > Electric vehicle companies are having a bad year, with most of them falling by double digits. Tesla has slumped by more than 14% while Fisker is down by over 50% this year alone. Other companies like Nio, Xpeng, Canoo, and Mullen Automotive have crashed by over 30%. VinFast, Nio, Rivian, Tesla, and Fisker stocks   They are not alone. As I wrote recently, the prices of battery electric metals like nickel, lithium, and cobalt have crashed. On Thursday, BHP, the biggest miner in the world, said that it was considering a big write-down of its nickel business. Additionally, QuantumScape, a company that is building solid-state batteries, has dropped by over 10% this year. EV charging companies like EVGo, ChargePoint, and Blink Charging are down by double-digits this year. This performance is happening as traders reflect on the negative press about the industry. For example, we covered that Hertz was selling its EV inventory for a big loss. The company, which is a big car buyer, said that there was little demand for EVs and their maintenance was not cheap.  Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. Further, there were reports that EV sales continued slowing down in 2023. As I wrote before, many dealers in the US have complained about weak EV sales even after they offered huge discounts. Are you looking for fast-news, hot-tips and market analysis? \n\n  \n    Sign-up for the Invezz newsletter, today. Big OEMs like Ford and General Motors have also placed limits on their EV ambitions, with GM putting a priority on shareholder returns. Yet, one of the biggest risks that investors are forgetting is likely the most important one. I believe that most EV companies will see thinner margins as China boosts its EV production to exponential levels. Early this month, it was reported that Byd had overtaken Tesla to be the biggest EV seller in China. This happened even as Tesla slashed prices hard in 2023 in a bid to maintain its market share. The reality is that China is doing for EVs what it did for the steel industry. Most experts believe that China helped to kill many Western steel companies as it flooded the market with them. China’s EV companies, which are equally good than their western competitors, are now in an exponential growth that will lead to lower prices. For example, Byd, a company that counts Warren Buffett as an investor made over 3 million cars in 2023 and analysts believe that it will hit over 5 million in the next two years. Other Chinese EV companies like Li Auto, Xpeng, and Nio have also boosted their production in the past few years. Nio made over 160k vehicles in 2023, a 30% increase from the same period in 2022. Similarly, Xpeng made over 140k cars while Li Auto made over 250k vehicles. Remember that there are over 100 EV companies in China, most of which are ramping up production. Chinese authorities have noted this. In a statement, a vice minister said that the administration will look to resolve the disorderly competition in the EV industry. He noted that companies made 9.5 million vehicles and there was insufficient demand. Remember that other Asian and Western companies like Hyundai, Kia, Toyota, and General Motors are also building EVs. Taken together, this means that EV prices will continue falling, hitting margins. Copy expert traders easily with Plus500. Invest in stocks like Tesla & Apple. Instantly trade ETFs like FTSE 100 & S&P 500. Sign-up in minutes. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.  Should you buy Bitcoin before the halving? Should you buy Bitcoin before the halving?  Use Invezz APP Get a better user experience Allow notifications? Allow us to send you updates You must agree to the privacy policy. "
}