{
    "title": "Tesla Chicken & Pizza Loses Trademark Dispute to Musk's EV Co",
    "date": "2/20/2024",
    "url": "https://www.entrepreneur.com/business-news/tesla-chicken-pizza-loses-trademark-dispute-to-musks-ev/469991",
    "text": "Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            Beatrice Nolan\n          \n                                                    •\n            \n            \n              Feb 20, 2024 Share This article originally appeared on Business Insider. A chicken shop owner in Northern England has lost a lengthy legal dispute with Elon Musk's Tesla. Amanj Ali's takeaway in Bury, Greater Manchester, called Tesla Chicken & Pizza, was at the center of a trademark dispute with the EV company. Last November, Ali was ordered to pay £4,000, or $5,053, to Tesla after the UK's Intellectual Property Office eventually sided with the auto giant. Ali had registered the trademark for the takeaway in May 2022, citing the inventor Nikola Tesla as his inspiration for the name, the BBC reported. When asked about the unusual inspiration, he told the outlet: \"He was a kind of intelligent guy... in my young age, I was... reading about him, looking at his pictures.\" While Tesla did not originally object to the trademark, Ali was notified in November 2021 that the auto company had requested international protection for trademarks in the U.K. food and drink category, documents released by the IPO showed. Ali opposed the request, fearing the company would try to invalidate his trademark for the takeaway. Almost a year later, Tesla did just that, claiming Ali's trademark would take unfair advantage of the EV company's established reputation. Representatives for Tesla did not immediately respond to a request for comment from Business Insider, made outside normal working hours. After another year of back-and-forth arguments, Ali eventually lost the case. He told the BBC he would have appealed the decision but had already spent around £8,000 in legal fees and was struggling with the stress of the dispute. Ali added that the fight with Tesla had affected his sleeping and working habits. \"Imagine, I'm just a small businessman running one chicken shop, and there is a big company coming which is owned by the richest man in the world,\" he told the outlet. This is not the first time small businesses have tried to do battle with big-tech companies over trademark issues. In October last year, Meta's Threads ran into issues with a small UK software company called Threads Software Limited. Its lawyers told Meta to stop using the Threads name in the UK as it owned the British trademark. The company claimed Meta made four offers to purchase the \"threads.app\" domain, which it declined. Want to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join. Southern District of New York Judge Lewis Kaplan said that the loss amount to the victims of Bankman-Fried's crimes surpassed $550 million. With Headway Premium, you can gain knowledge at a rapid rate. Elenor Mak, now founder of Jilly Bing, didn't plan to start a business — but the search for a doll that looked like her daughter inspired her to do just that. Instead of zeroing in solely on disruptive innovation, embrace a pragmatic approach to innovation, recognizing and leveraging the potential within ongoing industry shifts. When you're trying to make a name and a mark for yourself and your business, it's really important to get on the media's good side — and stay there. Recently unsealed court documents detail \"Project Ghostbusters,\" Meta's project to work around Snapchat's end-to-end encryption to intercept data. Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  "
}