{
    "title": "Expert works out the salary you need to afford a Cybertruck",
    "date": "2/2/2024",
    "url": "https://supercarblondie.com/cybertruck-price-breakdown-versus-salary/",
    "text": "Published on Feb 2, 2024 at 1:18PM (UTC+4) Last updated on Feb 7, 2024 at 1:32PM (UTC+4) Buyers have been making a lot of noise about the fact that the Cybertruck is more expensive than they hoped. It’s a fair point, considering the truck is nearly twice as expensive as Musk originally predicted. READ MORE: Man who reserved a Cybertruck shares what surprised him most after finally seeing it in person Musk himself explained the reason why it would be impossible to make the Cybertruck as affordable as he hoped when it was first unveiled. Still, most reservation holders went ahead with their purchase, despite the extra cost, and literally shared their receipt to show what said extra cost looks like. However, TikTok user Humphrey Yang went one step further. Yang worked out how much you realistically have to make to afford the Cybertruck, and he came up with two scenarios. In the first scenario, the buyer puts 20 percent down and finances the rest. At a six percent interest rate, which is pretty average, the Cybertruck would cost $1,294 a month for four years, $1,065 for five years, or $913 a month if you finance it for six years. Yang also reminds us that the average car payment in the US is $729 a month. In the other scenario he mentions, he uses the so-called ’10 percent rule’. The rule states that your car payment should not be more than 10 percent of your gross income. In this case, he estimates that a potential Cybertruck buyer would have to make between $91,300 and $129,400 to afford the truck. This is interesting because the average annual salary nationwide in the US is $59,428, according to Forbes. Even if we take the four states with the highest average salary – Massachusetts, New York, California and Washington – it’s still not even close to the salary that’s needed to afford the truck. For reference, the average salary in those states is between $76,600 (Massachusetts) and $72,350 (Washington). Ford CEO, Jim Farley, once said the Cybertruck is not for people who “do real work”, but it is for “Silicon Valley” – and he may have a point. The average salary in California in $73,220. However, the median salary in San Francisco and Oakland, both located around the area that’s known as Silicon Valley, is above $100,000. So perhaps Farley was right after all. Cybertruck debuts in China and the hype level there is off the charts Leaked Tesla report shows the Alpha Cybertruck had basic issues Instagram\nFacebook\nTwitter\nLikedin Copyrights ©2024 SB Media Holding Limited "
}