{
    "title": "How EVs became such a massive disappointment",
    "date": "2/26/2024",
    "url": "https://finance.yahoo.com/news/no-electric-vehicle-sales-aren-150023362.html",
    "text": "Tesla has been slashing prices. Ford just cut the price of its Mustang Mach-E, too, plus it cut back production of its electric pickup. And General Motors is thinking about bringing back plug-in hybrids, possibly taking a step back from GM’s earlier commitment to shifting straight to pure EVs. And now the EPA is considering slowing down requirements for automakers to sell more electric vehicles, dialing back what had been aggressive plans to move away from gas powered cars and SUVs. To be clear: The American market for EVs is not collapsing. In the last quarter of 2023, EV sales were up 40% from the same quarter a year before, according to Cox Automotive. In fact, EV sales in the United States hit a record last year, topping 1 million for the first time. But the EV market has nevertheless become a major disappointment. There is a troubling gap between expectations and reality. Bloomberg New Energy Finance, for instance, had projected sales of 1.7 million plug-in vehicles in 2023, but only 1.46 million ultimately sold. (BNEF’s figures include plug-in hybrids, but the large majority are fully electric vehicles.) The trend line isn’t slanting upward as sharply as many had predicted so the industry is lowering future estimates. Industry experts cite a number of reasons for this, including vehicle price, lack of charging capacity and confusing tax credit rules. Most electric vehicles currently on sale in America are on the more expensive side of the automotive market. “Between $50,000 and $60,000 now we get Kia and we get Cadillac,” said Tyson Jominy, an industry analyst with J.D. Power, referring to the Kia EV9 and Cadillac Lyriq electric vehicles. “Those two don’t normally face each other.” Besides being too expensive for the average buyer, selection is limited in terms of body style, said Corey Cantor, an industry analyst with Bloomberg New Energy Finance. The vast majority are relatively expensive SUVs, and there are few sedans or compact cars for customers who want something different. The target customer is also changing as selling more EVs means reaching outside a core of knowledgable EV enthusiasts. “As the COVID shock retreated, we learned that as you scale EVs to 5,000, to 7,000 units a month and you move into the early majority customer, they are not willing to pay a significant premium for EVs,” Ford chief executive Jim Farley. “This is a huge moment for us.” This is why Ford recently cut prices for the Mach-E SUV and why Farley created a team to work on a less expensive EV engineering platform that will be the basis for future models. Then there’s the continued lack of public charging. The National Renewable Energy Laboratory, part of the US Department of Energy, estimates that the US will need 182,000 fast chargers for electric vehicles by 2030. There are currently fewer than 40,000, according to the DOE, with about a quarter of those in California. Besides raw numbers, the EV chargers that are currently available tend to rate low with consumers in terms of reliability, according to J.D.. Power surveys. The two issues of vehicle price and public charging are related, Jominy said. People who can afford to buy luxury-priced vehicles are also more likely to have a home in the suburbs with a garage where they can charge their car overnight. Public chargers are more important to people who can afford neither an expensive vehicle nor a house with private parking. Automakers are finally taking major steps to do something about that, tapping into newly available federal funds, plus their own money, to install more chargers. BMW, GM, Honda, Hyundai, Kia, Mercedes-Benz, and Stellantis have come together to create a joint venture that plans to install about 30,000 chargers across the United States and Canada. Also, to make things simpler for drivers, every major automaker in the US has agreed to switch over to the same charging standard used by Tesla, still the largest seller of EVs. That means that, in a few years, almost all EVs sold in America will have the same type of charging port and use the same type of charger. There’s a long way to go, said Carlos Tavares, chief executive of Stellantis, the company that makes Jeep and Dodge vehicles. In the words of the Portuguese auto executive, who spoke to journalists in New York recently, public EV charging needs to “jump on your face” before most customers will consider an electric vehicle. “It means when you go to the mall, when you go to the supermarket, when you go to the restaurant, when you go to gym, when you park your car, you have charging units waiting for you,” he said. “You don’t have to look for them.” EV chargers in the US are nowhere near that level, yet but things will improve, said Valdez Streaty. “I think, in the next couple of years, we’re going to start to see exponential growth of charging,” she said, “and hopefully, with that comes reliability, because that’s the other big aspect of it.” Many substantial tax credits are available to help offset the cost of purchasing electric vehicles, but the rules are complex. Some come with restrictions on where the vehicle is built, where the battery pack and its parts are from, the price of the vehicle, and the household income of the buyer. More models are becoming eligible as automakers go through the complex application process. Also, starting this year, customers can claim the tax credit as a rebate at the time of purchase rather than waiting until they file their taxes. Leasing also provides a way for more consumers to get tax credits. Because of the way tax laws are written, leased vehicles are exempt from most restrictions on federal tax credits, so many automakers offer the tax credit as a lease incentive. “We’re going to see leasing take off and that’s because of the loophole,” said Valdez Streaty, “but also because consumers are not sure if they want to buy, or if they’re ready to buy, electric.” This story and its headline have been updated to reflect context about EV sales expectations. For more CNN news and newsletters create an account at CNN.com Related Quotes "
}