{
    "title": "World Street | Tesla cuts prices, Cisco plans layoffs, Bezos sells $2 bn in \nAmazon, Google Bard renamed",
    "date": "2/12/2024",
    "url": "https://www.moneycontrol.com/news/business/markets/world-street-tesla-cuts-prices-cisco-plans-layoffs-bezos-sells-2-bn-in-amazon-musk-summoned-google-bard-renamed-gemini-12243811.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now The International Monetary Fund (IMF) notes Middle East economic struggles amid global resilience. Tesla slashes Model Y prices in the US. Cisco plans layoffs in restructuring for growth focus. The EU relaxes fiscal rules preliminarily. Bezos sells $2 billion Amazon shares, Musk under SEC scrutiny over Twitter buy. Disney profits soar in Q1FY24. SAP and Renjen part ways. Bitcoin nears $49,000 amid ETF excitement. Google renames chatbot Bard to Gemini. All this and more on this edition of World Street. Growth Pangs The IMF said that the Middle East economies were lagging below growth projections due to oil production cuts and the Israel-Gaza conflict, even as the global economic outlook remained resilient. Despite uncertainties, \"the global economy has been surprisingly resilient,\" IMF Managing Director Kristalina Georgieva told the Arab Fiscal Forum in Dubai. Charged Up Tesla Inc has temporarily cut prices of some of its Model Y cars in the US until February 29, less than a month after the carmaker cut Model Y prices in Germany, reports Reuters. Tesla reduced prices for its Model Y rear-wheel drive and Model Y Long Range by $1,000 to $42,990 and $47,990 respectively, representing a discount of 2.3 percent and 2 percent from previous prices. Job Cuts Network giant Cisco is planning to restructure its business which will include laying off thousands of employees, as it seeks to focus on high-growth areas, according to Reuters. The San Jose, California-based company has a total employee count of 84,900 as of fiscal 2023, according to its website. Fiscal Boost EU member states struck a preliminary deal to ease the bloc's stringent fiscal rules, giving governments more time to reduce debt as well as incentives to boost public investments. The latest revamp of two-decades-old rules known as the Stability and Growth Pact came after some EU countries racked up record-high debt as they increased spending to help their economies recover from the pandemic. Tech Talk Amazon.com founder Jeff Bezos sold around 12 million shares of the online retail and cloud services firm for roughly $2 billion, according to a company filing. Bezos, who stepped down as the company's chief executive and took over as executive chairman in 2021, founded Amazon as a bookseller in 1994. Legal Limelight Elon Musk has been summoned by a federal court in California to provide testimony before the US Securities and Exchange Commission concerning potential breaches of federal securities laws linked to his acquisition of Twitter, now known as X. The court ruled the evidence gathered is relevant and material to the SEC’s investigation and the testimony required of Musk is not unduly burdensome. Both parties have been instructed to convene within a week to finalize the details of when and where Musk will testify. Disney's Dollar Delight Disney's Q1FY24 results were a mixed bag compared to analyst forecasts; however, a significant surge in profit led investors to drive up the stock. The company's adjusted earnings per share (EPS) soared by 23 percent year-on-year to $1.22, with expectations of at least a 20 percent EPS growth throughout FY24. Anticipated free cash flow for the year stands at around $8 billion. With this enhanced cash generation, Disney aims to boost its dividend payouts and resume share repurchase programs. SAP's Chair Change Europe’s largest software company SAP SE said it had mutually agreed to part ways with Punit Renjen, the Deloitte Touche Tohmatsu executive it had nominated for the chairman role a year ago. Renjen and SAP had a “difference in perspective on the role,” the German company said in a statement. Renjen was due to succeed SAP’s Hasso Plattner at the end of his term in May. BTC Bounce Bitcoin is making a run toward the $49,000 high reached last month when a batch of US spot exchange-traded funds began trading, supported by signs of steady inflows as well as growing attention on the so-called halving due in April, reported Bloomberg. The largest digital asset rose about 5.6 percent on Friday after climbing as high as $48,187. Bitcoin is now up 12 percent so far this year, beating even the 'Magnificent Seven mega-cap tech stocks'. Bard's Big Rebrand Google has rebranded its chatbot Bard, which was its answer to OpenAI’s ChatGPT, to Gemini, and rolled out a new subscription plan that will give people access to its most powerful artificial intelligence model, placing it squarely in competition with rival OpenAI. A version will continue to be available for free, but people willing to pay $19.99 for a monthly subscription will gain access to Google’s most advanced tool in its Gemini family of AI models, the Ultra 1.0. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}