{
    "title": "Tesla Sweden stays firm amid IF Metall strike",
    "date": "2/22/2024",
    "url": "https://www.teslarati.com/tesla-sweden-if-metall-strike-recap/",
    "text": "Tesla Sweden is staying firm against collective agreements amid IF Metall’s strike. The Swedish union has gained support through sympathy strikes, but now, where it matters most: with Tesla’s employees. Some have started to wonder if IF Metall should accept Tesla Sweden’s stance against collective agreements for its employees. After all, collective agreements in Sweden are common but not mandatory. Tesla should be able to say no to collective agreements if that is the case. “Collective agreements are not mandatory, and then a no must be allowed to be a no. It is also possible to question the legitimacy of the union’s actions if even their members do not listen to the strike,” said Lise-Lotte Argulander, Företagarna’s expert on employment law. A recent report from Sweden’s Mediation Institute revealed that IF Metall has received underwhelming support from Tesla employees. According to Tesla, over 90% of its 300 workers in Sweden have chosen to remain in their positions and continue working. IF Metall has sought support from other unions in Sweden and Nordic countries in its strike against Tesla. These sympathy strikes have affected employees from other companies and Tesla customers in Sweden more than they are affecting the actual company. Customers in Sweden have been unable to get their Teslas properly serviced since the strike. IF Metall temporarily eased restrictions on Tesla Sweden’s workshops so customers could get their cars repaired. Meanwhile, in Vetlanda, 20 employees have lost their jobs due to their company supporting IF Metall through a sympathy strike. The company, Hydro Extrusions, used to supply aluminum parts to Giga Berlin. IF Metall wanted to hold Giga Berlin production, and Hydro Extrusions supported the Swedish union’s goals. However, the company ended up losing its contract with Tesla, resulting in 20 redundant jobs. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}