{
    "title": "Elon Musk's Tesla sold only 1 electric car in South Korea in January. \nHere's why",
    "date": "2/9/2024",
    "url": "https://www.hindustantimes.com/car-bike/elon-musks-tesla-sold-only-1-electric-car-in-south-korea-in-january-heres-why-101707453971344.html",
    "text": "Subscribe Now! Get features like Tesla Inc. sold just one electric vehicle in South Korea in January as a raft of headwinds, from safety concerns to price and a lack of charging infrastructure, weigh on demand. The company’s sale of a solitary Model Y SUV was its worst month since July 2022, when the Austin, Texas-based automaker sold no vehicles at all, according to data from Seoul-based researcher Carisyou and the Korean trade ministry. Across all carmakers, the number of new EVs registered in Korea fell 80% in January from December, Carisyou data show.ALSO READ: Hyundai's $3 billion IPO bid may cut down Tesla's potential EV market in India Carmakers are facing a slowdown in enthusiasm for EVs in South Korea as higher interest rates and inflation prompt consumers to rein in spending, while concerns about battery fires and a dearth of fast chargers are also damping demand. Tesla’s low-selling January marks a major shift for the brand as its China-made Model Y was one of the top sellers last year. Many early adopters have already bought EVs and mass-market consumers aren’t looking to purchase yet, according to Lee Hang-Koo, head of the Jeonbuk Institute of Automotive Convergence Technology. Tesla’s popularity is also hurt by its links to China, he said.ALSO READ: Tesla ordered to pay $1.5 million over alleged hazardous waste violations “Most Koreans who wanted to buy Tesla’s cars have bought one,” Lee said. “Some people don’t like Tesla recently after finding some of them are made in China,” with consumers concerned about the quality of manufacturing, he said. Korea’s EVs sales are also affected by strong seasonal swings in demand. Many people avoid buying vehicles in January because they want to wait for the government’s announcement of subsidies, according to Lee. In a statement to Bloomberg News, a spokesperson for Tesla in Korea said consumers delayed EV purchases before the confirmation of subsidies. Tesla faces headwinds there, too. In July 2023, the company set the selling price of the Chinese-made Model Y at 56,990,000 won ($43,000), bringing it under the threshold of 57 million won that allows cars to qualify for a full government subsidy. In the plan for 2024, announced Tuesday, the level has been lowered to 55 million won, reducing the subsidy for Tesla’s Model Y by half.   "
}