{
    "title": "Why Tesla May Settle in Texas, While X Found Its Spot in Nevada",
    "date": "2/23/2024",
    "url": "https://news.virginia.edu/content/why-tesla-may-settle-texas-while-x-found-its-spot-nevada",
    "text": " (Illustration by Warren Craghead, UVA School of Law)  Immediately after a Delaware court in January declared Elon Musk’s lucrative $56 billion Tesla compensation package illegal, the X and SpaceX owner pivoted to marketing two other states as business-friendlier havens for corporate charters. “Never incorporate your company in the state of Delaware,” Elon Musk posted. “I recommend incorporating in Nevada or Texas if you prefer shareholders to decide matters.” He then polled X users, asking them whether the car company should move to Texas, where Tesla is physically headquartered – and suggested that the 87% “yes” vote had decided the matter. University of Virginia School of Law professor Michal Barzuza, whose scholarship has exposed how Nevada deliberately structured its corporate law to protect executives like Musk, has a different explanation for Musk’s apparent preference for Texas over Nevada: The Delaware court decision on his compensation doomed his initial plan to move the company to Nevada. Musk incorporated his X holding company in Nevada, then brought Twitter there after he took it private. He’s made it clear in the past that he would like to move Tesla there as well, Barzuza said. But because Tesla is a publicly traded company, Barzuza said reincorporation in Nevada would still require shareholders’ approval, and Delaware’s courts might not count Musk’s shares in that vote tally. “Since Nevada has significantly more protections on directors and officers, a move to Nevada may be considered self-dealing and thus may trigger the entire fairness standard, the same standard that [Delaware Court of Chancery Judge Kathaleen] McCormick applied to Musk’s compensation package,” Barzuza said. In the Tesla compensation case, the court said Musk was a controlling shareholder. In Delaware, a conflicted controller transaction triggers the heightened scrutiny of the “entire fairness standard.” As part of that standard, a “majority of the minority” shareholders had to approve the compensation plan. They did, but the judge ruled they were not properly informed about their decision. “The standard also requires that independent directors conduct arms-length negotiations with the controlling shareholder, and the court found that Tesla directors lacked independence, and ran a flawed process,” she said. Musk is seeing a similar scenario play out as shareholders ask the Delaware courts to intervene in TripAdvisor Inc.’s attempt to reincorporate in Nevada, Barzuza added. TripAdvisor’s move was instigated by controlling shareholder Greg Maffei. TripAdvisor shareholders are currently asking the Delaware court to refuse to count Maffei’s votes for the move, and to scrutinize the board approval of the transaction under the entire fairness standard. Musk is likely backing off moving to Nevada to avoid triggering such analysis.  Professor Michal Barzuza’s expertise in corporate law and the Musk issue was just featured in the Washington Post. (Contributed photo) “Given Musk’s compensation result in Delaware, it would be too risky for him to attempt a reincorporation to Nevada,” Barzuza said. “A move home to Texas would be an easier sell to shareholders than a move to Nevada and is less likely to trigger an entire fairness review, given that Texas is not as protective to management and directors as Nevada is.” There is another advantage Musk sees in Texas: Tesla employs more than 20,000 people at an Austin factory, roughly the same-sized workforce as that of the neighboring University of Texas. With some projections that the company could soon hit the 60,000-employee mark, Tesla would become one of the largest employers in the state. On Valentine’s Day, Musk announced he was reincorporating SpaceX, a privately held company, to Texas – a gift that Gov. Greg Abbott received with a warm greeting on X. “When you provide income to so many employees, you have political clout,” Barzuza said. “So in the future, if he needs something, he may be seeing the home state as a place that he could influence more.” She cited a trend in the 1980s when firms that were incorporated and headquartered in other states lobbied their legislatures to get some protections from takeovers. One prominent New York corporate lawyer famously circulated a client memo urging companies to consider leaving Delaware for states that supported companies’ ability to fight off takeovers. “The companies were able to use their political clout within the state where their headquarters were to lobby for these rules,” Barzuza said. This all begs the question of why half of all public companies, and two-thirds of Fortune 500 companies, have incorporated in Delaware in the first place. The state offers favorable tax laws, a flexible incorporation law and 230 years of specialized corporate precedent to draw on when sorting out disputes, according to experts. So would a Tesla move to Texas be bad for shareholders? “I’m not that concerned about a mass migration of firms from Delaware, but I am concerned about the pressure that would create on Delaware courts,” Barzuza said. “So now when the court does its job, there’s a risk of firms leaving for the states where they are headquartered, or to Nevada.” Although Musk is frustrated with corporate law in Delaware, Barzuza sees its protections as a boon to the shareholders and market integrity. In an earlier paper, she and David Smith from UVA’s McIntire School of Commerce found that Nevada attracts firms that are 30% to 40% more likely to report erroneous financial results that later require corrections than firms incorporated in other states, including Delaware. Such accounting errors can be red flags indicating fraud or incompetence, and overstatements can inflate share prices that may later crash. “Delaware offers a balanced law with some protections and some accountability, but Musk wants more protection from shareholder litigation,” Barzuza said. “It seems like he would have preferred Nevada over Texas. We can see that from the way he established the X holding company there and then merged Twitter into X. But given how he came out of his compensation case, he doesn’t want to go through what TripAdvisor is going through now.” Melissa Castro Wyatt  mwyatt@law.virginia.edu 434-243-5716 March 30, 2024  "
}