{
    "title": "Elon Musk Teases New Roadster. There Won't 'Be Another Car Like This.'",
    "date": "2/28/2024",
    "url": "https://www.investors.com/news/tesla-stock-elon-musk-teases-new-tesla-roadster/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     The Roadster was Tesla's original production vehicle. On Thursday, Elon Musk said Tesla has \"increased the design goals\" for the long-delayed next-generation Roadster, \"aiming\" to start deliveries in 2025. (Tesla) Elon Musk touted the long-awaited reintroduction of the Tesla Roadster, claiming on X early Wednesday that the production design is complete and Tesla (TSLA) will unveil the vehicle at the end of 2024. TSLA stock rose Wednesday. The Tesla chief executive wrote on X, formerly Twitter, Wednesday that the EV giant is \"aiming\" to ship the new electric sports car in 2025, teasing the design as a collaboration between Tesla and SpaceX. Musk said Tesla is targeting 0-60 miles per hour in less than 1 second and \"that is the least interesting part.\" \"We radically increased the design goals for the new Tesla Roadster,\" Musk wrote early Wednesday morning. \"There will never be another car like this, if you could even call it a car.\" The Roadster was Tesla's first production car, back in 2008. Musk promised nearly a decade later to revamp the original offering. In 2017, Tesla outlined how the new Roadster would come out in 2020. However, that timeline has been pushed back repeatedly, with Tesla holding $250,000 reservations for several years. TSLA shares rose more than 1% to 202 during Wednesday's market action. On Tuesday, the stock edged up a fraction to 199.73. Tesla stock is up more than 6% in February. Musk's decision to highlight progress on the Roadster Wednesday comes as Morgan Stanley analyst Adam Jonas, a Tesla bull, wrote on Feb. 19 there is \"seemingly overwhelming bearish institutional investor sentiment\" on TSLA. So far in 2024, Tesla stock has retreated around 18%, falling below key levels of support. Tesla stock ranks eighth in the 35 member IBD Auto Manufacturers industry group. The stock has a 44 Composite Rating out of a best-possible 99. Tesla stock also has a 17 Relative Strength Rating and a 68 EPS Rating. Please follow Kit Norton on X, formerly known as Twitter, @KitNorton for more coverage. Is Tesla A Buy Or A Sell? Get Full Access To IBD Stock Lists And Ratings Learning How To Pick Great Stocks? Read Investor's Corner Is Rivian A Buy Right Now With The Cybertruck Hype? Futures Fall As Dow Giant Slides Amid Big Earnings Moves; Inflation Data Due 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}