{
    "title": "Tesla Executive Sheds Light On Cybertruck Availability In Canada: 'Have To \nFile Some Routine Paperwork'",
    "date": "2/25/2024",
    "url": "https://www.tradingview.com/news/benzinga:e76e7fb2a094b:0-tesla-executive-sheds-light-on-cybertruck-availability-in-canada-have-to-file-some-routine-paperwork/",
    "text": "A Tesla Inc TSLA executive confirmed on Saturday that the EV giant would sell its stainless steel Cybertruck in Canada owing to the increased interest. What Happened: “No doubt we will sell Cybertruck in Canada- insanely huge interest,” Rohal Patel wrote on X, formerly Twitter. “Have to file some routine paperwork, but hoping that can be wrapped up soon,” he added. Patel is vice president of Public Policy and Business Development at Tesla. No doubt we will sell @cybertruck in Canada – insanely huge interest. Have to file some routine paperwork, but hoping that can be wrapped up soon. Last week, Tesla displayed its entire lineup at the Canadian auto show in Toronto including its latest stainless steel Cybertruck. The auto show started on Feb. 16 at the Metro Toronto Convention Centre and ended on Sunday evening local time. The booth experienced high traffic as shown by videos on social media. Other Geographies For The Cybertruck: In January, Tesla CEO Elon Musk dampened hopes of Cybertruck launching in China. Getting approvals for the stainless steel vehicle on roads would be difficult in China, the CEO said, without explaining why. In December, Tesla's chief engineer Lars Moravy told TopGear that the vehicle would find it hard to get approval in Europe. They said the external protrusions on the vehicle will hinder getting through EU safety rules aimed at pedestrian protection. Currently, the truck is only available in the U.S. with a starting price of $79,990 for the all-wheel drive variant. Photo courtesy: Tesla Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read Next: Nikola Eyes Selling 100 BEV Trucks In 2024 After A Few Caught Fire Last Year © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}