{
    "title": "Elon Musk Invites Chinese Suppliers To Mexico Defying Uncle Sam",
    "date": "2/14/2024",
    "url": "https://www.carscoops.com/2024/02/elon-musk-invites-chinese-suppliers-to-mexico-defying-uncle-sam/",
    "text": "Despite concerns over Chinese EV makers threatening U.S. automakers, Tesla's boss is working to establish the nation's car parts suppliers in Mexico Last year, during his trip to China, where he met with a series of government officials, Tesla CEO Elon Musk praised the country’s manufacturing industry and the workers at his company’s Shanghai plant for achieving top productivity levels globally. Now, reports indicate that the company is working to relocate the suppliers supporting its Shanghai factory closer to the United States by establishing operations in Mexico. However, the company may start facing resistance from the American government, the UAW, and a trade group representing Canada’s auto parts manufacturers, all of which are looking for ways to prevent Chinese companies from establishing themselves too comfortably in Mexico. Read: US Worried About Chinese Smart Cars Spying On Americans Despite earlier concerns over Chinese automakers’ access to the U.S. market, Musk has reportedly invited suppliers from across the Pacific to Mexico in order to duplicate the supply chain Tesla’s Shanghai plant currently uses, unnamed sources told Bloomberg. This move is part of a larger initiative to produce more cost-effective EVs at a facility in Nuevo Leon, Mexico, which would subsequently serve Tesla’s plant in Austin, Texas. However, Tesla isn’t the sole automaker benefiting from parts sourced from Chinese-owned facilities in Mexico, as this segment of the industry saw a 15 percent growth in value in 2023. Experts argue that it’s logical for American automakers to leverage China’s highly efficient and cost-effective supply chain. America is looking at tariffs Nevertheless, a separate report from last week suggests that the U.S. is looking to control the flow of products coming from China through Mexico. The White House is reportedly looking at ways to modify the existing tariffs against imports of Chinese-made vehicles, and is also looking at how it can limit the amount of data being gathered by Chinese vehicles, as the country’s automakers look to establish themselves in Mexico, too. As a result of this resistance, companies based in China are racing to establish themselves as suppliers in Mexico, and to set up shell companies in America’s southern neighbor. In response, the U.S. Treasury Secretary Janet Yellen went to Mexico in December to work on an agreement to strengthen Mexico’s screening of foreign investment. While economists believe that the U.S. should not close itself off completely to foreign trade with China, the Automotive Parts Manufacturers’ Association in Canada fears that a flood of Chinese suppliers could displace investment in North American companies. Follow Carscoops on \n                                Google News "
}