{
    "title": "German town votes against Tesla plans to expand ‘gigafactory’",
    "date": "2/21/2024",
    "url": "https://www.theguardian.com/technology/2024/feb/21/german-town-votes-against-tesla-plans-to-expand-gigafactory-carmake-industrial-action-sweden",
    "text": "Bosses promise to go back to drawing board while carmaker faces industrial action from another union in Sweden The people of a small German town where Elon Musk has built a Tesla factory have thrown a spanner in the works by rejecting plans to expand the complex. The majority of residents of Grünheide in Brandenburg, an hour’s drive south-east of Berlin, voted against proposals to build new infrastructure intended to improve access to the site and allow easier transport of the finished vehicles, including a freight depot and warehouses. A kindergarten for employees’ children was also part of the plans, which propose expanding the 300-hectare (740-acre) factory site by 170 hectares and felling about 100 hectares of pine forest in the process. Voter turnout was 76%, with 3,499 people voting against the plans, 1,882 in favour. The referendum is not legally binding, but should “serve as an orientation” for local decision-makers and Tesla bosses who have lobbied hard for the “gigafactory”. The mayor of Grünheide, Arne Christiani, and bosses of the carmaker said the vote result would now prompt them to return to the drawing board. Plans for the original plant were first announced by Musk in November 2019. Vehicle production began in March 2022, with the first electric cars rolling off the conveyor belt almost immediately. Central to objections from the start, led by a local citizens’ initiative, is the estimated 1.8m cubic metres of groundwater required by the plant to produce between 300,000 and 500,000 cars a year. The Brandenburg region has been beset by drought for several years. Tesla has repeatedly pledged to keep water use to a minimum and to recycle its water rigorously. But local people say they fear in particular the contamination of drinking water if groundwater levels drop too low. The citizens’ initiative, which is backed by ecologists, point out that part of the planned area of expansion is in a water protection area. Christiani, an independent, told the German broadcaster RBB that he regretted the referendum’s outcome and blamed negative publicity for the result. “Seemingly it has not been possible to convey to people that further important infrastructure projects, such as a new B-road or a railway station forecourt, [need the Tesla expansion]. Now the municipality has the considerable task of trying to find solutions to this.” Alexander Schirp, the managing director of the Berlin-Brandenburg business association (UVB), also expressed his disappointment, saying: “The Tesla investment is a lucky break for Grünheide and the whole of the state of Brandenburg. “We think that rather than the risks involved, it should be the chances this investment brings with it which should be the main focus, and that includes environmental concerns.” The gigafactory, the first Tesla operation of its kind in Europe, employs about 12,500 workers. In a statement after the announcement of the referendum result, Tesla described its expansion plans as “a big win for the community”, adding that it would “seek dialogue with all participants to decide on further steps”. The company said its goal was to “enable a significant transfer of the HGV-traffic on to rail as well as generally ensuring a speedy expansion of existing infrastructure around the factory”. Tesla added that the increase in warehouse capacity would help to increase the efficiency of delivering its cars. The company had to stop production for about two weeks recently because of supply chain delays caused by attacks by Houthi rebels on commercial shipping in the Red Sea. Last month, a strike by Tesla workers in Sweden over collective bargaining rights became the country’s longest-running stoppage in nearly 80 years. The strike by members of the IF Metall trade union is being portrayed as the largest attempt to save Sweden’s union model from global labour practices in decades. IF Metall has more than 300,000 members across various industries in Sweden. According to the National Mediation Office, about a third of Tesla workers in the country have taken part in the strike since it began on 27 October, resulting in the loss of an estimated 1,936 days of Swedish labour. The industrial action has attracted multiple secondary, or sympathy, strikes by unions representing among others postal workers, dock workers, electricians and painters. It has been described as “insane” by Musk and prompted Tesla to launch legal action. In neighbouring Denmark, Norway and Finland, Tesla cars have been blocked at ports. On Wednesday, the Swedish trade union Seko also announced sympathy measures, saying it would stop maintenance, repairs and service of Tesla charging stations and block new connections, preparation and planning. Seko’s president, Gabriella Lavecchia, said: “IF Metall’s fight is also our fight. By refusing to comply with the rules of the game here in Sweden, Tesla is trying to gain competitive advantages by giving the workers worse wages and conditions than they would have with a collective agreement. It is of course completely unacceptable. “The fight that IF Metall is now taking is important for the entire Swedish collective agreement model. That is why we have chosen to issue another sympathy notice and increase the pressure on Tesla.” "
}