{
    "title": "Tesla Investor Relations Head Thinks Baby Blue Wrap Is A 'Brave Choice' On \nCybertruck",
    "date": "2/27/2024",
    "url": "https://www.benzinga.com/news/24/02/37329071/tesla-investor-relations-head-thinks-baby-blue-wrap-is-a-brave-choice-on-cybertruck",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla Inc Investor Relations Vice President Martin Viecha thinks a baby blue wrap on the Cybertruck would be a brave choice. What Happened: “Brave Choice,” Viecha said in response to pictures of a baby blue-wrapped Cybertruck shared on X, formerly Twitter. They were reportedly captured in California. The Cybertruck’s body is made of stainless steel, limiting color options. “Cybertruck can have any color you want, so long as it's nothing,” company CEO Elon Musk previously said. However, the vehicle can be wrapped for those who want to customize their vehicle. Wrap Options: Tesla offers wrap options at its online shop- both clear and color. The color wrap options available at the Tesla shop include satin rose gold, satin abyss blue, slip grey, satin stealth black, and satin ceramic white. The clear wrap is priced at $5000, the neutral shades of color at $6000 and the rose gold and abyss blue at $6500. Users can also rely on third parties to wrap their trucks in different shades. Tesla started deliveries of Cybertrucks to customers in November 2023. It is unclear as to how many Cybertrucks have been delivered to date. Check out more of Benzinga’s Future Of Mobility coverage by following this link. Read More: Tesla A ‘Partner' And Not Competition, Says BYD — Chinese Firm Not Eyeing US Market Just Yet Photo courtesy: Tesla © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}