{
    "title": "Elon Musk's antics are weeding out Tesla's nonbelievers",
    "date": "2/7/2024",
    "url": "https://finance.yahoo.com/news/elon-musks-antics-are-weeding-out-teslas-nonbelievers-110024633.html",
    "text": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with: The chart of the day What we're watching What we're reading Economic data releases and earnings The Elon Musk noise machine has been in hyperdrive lately. There’s the Delaware court ruling voiding his pay package as Tesla CEO. The report alleging that Tesla board members felt pressured to take illegal drugs to stay in Musk’s good graces. And the drumbeat of negative analyst chatter from the likes of Daiwa and Piper Sandler this week. Separating noise from fundamentals is always tricky. It’s uniquely so at Tesla. Investors have historically been rewarded for ignoring Musk’s shenanigans. But with the stock down 27% this year — and off more than 50% since its record high in 2021 — it’s useful to take another look. The main reason that the shares are down has little to do with Musk’s off-campus activities. As he said on Tesla’s last conference call, the company “is currently between two major growth waves.” At the very least, it’s in the aftermath of one. So should investors continue to ignore the noise and wait to catch the next wave, if and when it happens? Some longtime Tesla holders are hanging in. Ross Gerber’s firm, Gerber Kawasaki, had 398,000 shares as of the last filing in December. He’s trimmed that holding, he told Yahoo Finance, but has held on to the bulk of shares on behalf of clients in part for tax reasons, in part because he sees the long-term opportunity. \"The cost of Elon's behavior is really hurting shareholders, and it's really unfortunate because the reason we're holding the stock is the long-term potential of Tesla is immense,” Gerber told Yahoo Finance. “So, you know, it's this catch-22.” Colin Rusch of Oppenheimer, who has a Market Perform rating on the shares, is waiting for margins to improve and stabilize before he gets more bullish on Tesla. “The second thing we want to see is evolution of the FSD [full self-driving] technology and real adoption. We still have a fluid environment around the regulatory backdrop. As we get clarity, I think we’ll have a better sense of how this technology performs and how they’ll be able to monetize it,” he told Yahoo Finance. In the meantime, whether the noise around the board’s independence becomes a fundamental issue remains to be seen. Longtime Tesla fanboys’ attitudes have typically been nonchalant: If Musk does drugs, who cares? If the board pays him astronomical sums (and are themselves paid more than board members at other companies), who cares? So he posts a lot on X, so what? He’s building the future! The real question is how much more consistent that future could be, or even how expansive, if Musk got challenged from within once in a while. As Gautam Mukunda, a lecturer at Fletcher School of Law and Diplomacy and author of “Picking Presidents,” put it: “There is no such thing as a person so brilliant that they’re not made better by having people around them who can challenge their ideas and test them and stop them from making mistakes in the worst case.” Related Quotes "
}