{
    "title": "A major auto supplier for Tesla, VW, Ford to slash 10K jobs",
    "date": "2/19/2024",
    "url": "https://electrek.co/2024/02/19/a-major-auto-supplier-for-tesla-vw-ford-to-slash-10k-jobs/",
    "text": "Forvia, a major supplier for Stellantis, Volkswagen, Tesla, and Ford, plans to cut as many as 10,000 jobs in Europe over the next five years. The news falls days after major auto supplier Continental announced that it too was cutting its workforce by 7,150 jobs. Forvia, the eighth-largest automotive supplier in the world, said it plans to shrink its 75,500 workforce by 13%, including cutting jobs at Hella, its subsidiary that makes lighting, among other parts, for automobiles. It’s all part of a new “EU-Forward” plan to cut costs and boost competitiveness, according to Le Monde. Forvia, which formed when auto supplier Faurecia took over German auto supplier Hella, reported sales of €27.25 billion for 2023, against €24.57 billion a year prior, according to a press release. It has returned to profit since COVID-19 but remains in debt. Headquartered in Nanterre, France, the company makes interiors, exhaust systems, and headlights, among other equipment for cars. The move is part of a plan to reduce its dependence on China, where the company makes 27% of its sales and the bulk of its earnings, the report said. Forvia said it would cut jobs across Europe, namely in France, Germany, Poland, Spain, and the Czech Republic, but warned that all sites would not be affected the same way. “It’s going to affect all sites, but not in the same way,” Forvia CFO Olivier Durand said at a press conference, Le Monde reported. “We’ve had a downturn in the European market, and we don’t see any possible progress in the short or medium term. And we have a number of sites that are not operating at full capacity.”The group plans to cut jobs over the next five years via attrition and drastically reduced recruitment in Europe. “Our attrition rate is 2,000 to 2,500 people a year. So, in fact, the plan does not mean making 10,000 people redundant,” he added.The “EU-Forward” plan will be presented to trade unions as of today, with a focus on accelerating the deployment of AI, optimizing R&D investments and costs, and developing new tech. For this year, Forvia is targeting sales of between €27.5 and €28.5 billion. There is a lot of restructuring happening as automakers are reducing their production and shifting to EVs, and suppliers are left with excess capacity – a scenario that Forvia says benefits China. In Forvia’s case, it says it has overcapacity primarily in seating and interiors and some lighting. Of course, Forvia isn’t alone in heavy staff reductions, with Continental, Bosch, and  ZF Friedrichshafen following suit – the latter has even warned that it might have to reduce as much as 20% of its total staff. Automotive suppliers, too, have made hefty investments in the shift to electric, and now they are seeing their markets being hit due to slower uptake than expected and the fact that car sales are “historically low,” reports the FT. ZF reported a net debt of €11.5bn at the end of last June, which led to around 800 jobs being axed. FTC: We use income earning auto affiliate links. More. Subscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast. Jennifer is a writer and editor for Electrek. Based in France, she has worked previously at Wired, Fast Company, and Agence France-Presse. Send comments, suggestions, or tips her way via X (@JMossalgue) or at jennifer@9to5mac.com. "
}