{
    "title": "Tesla Gets Rejected in S&P 500 Reshuffle, Shares Plummet",
    "date": "3/24/2024",
    "url": "https://au.lifestyle.yahoo.com/lifestyle/tesla-gets-rejected-p-500-120012967.html",
    "text": "Tesla’s TSLA shares cratered around 21% yesterday to close the session at $330.21, marking the biggest daily percentage drop on record, as the company missed out on inclusion in the S&P 500 Index. Expectations of Tesla’s addition to the S&P 500 list was quite high after the company reported the fourth consecutive quarterly profit in July, which made it eligible to be included in the elite index. In fact, the possibility of its inclusion in the blue-chip index was a major driver of the company’s insane rally of late. Shares had been bidding up ever-higher partly on the expectation that the major index would be including the electric car giant, which would have put it in position to be picked up by various ETFs and other funds that track indexes, thus leading to more shares bought overall. Nonetheless, the red-hot electric vehicle maker was dismissed by the S&P 500 committee, which instead decided to add arts and crafts marketplace Etsy, testing equipment maker Teradyne, and pharmaceutical firm Catalent as a part of the quarterly reshuffle. Various speculations have been made as to why the company couldn’t make it to the S&P 500 list. Questions have been raised about the automaker's profitability calculation method, as a major portion of it came from selling regulatory credits to other carmakers. The reliance on these credits implies that bulk of Tesla’s profits resulted from regulatory arbitrage and not from manufacturing and selling cars. Others view that the firm’s relentless rally in share price could have also played spoilsport. Tesla’s crazy run on the bourses of late had pushed its valuation to lofty levels despite cash burn concerns. Recently, Tesla’s market capitalization soared higher than the combined value of several auto biggies including Toyota, Volkswagen, General Motors, Ford F and Fiat Chrysler. With such high market cap, the stock would have provided unjustifiable weightage to the company’s sector on the index. Notably, Tesla split its shares in a 5-for-1 exchange at the end of the last month. On Sep 1, it announced its intention to raise up to $5 billion via share offering, capitalizing on the recent 5-for-1 stock split, which made the shares more affordable for individual investors. Yesterday, the company announced that it has completed $5 billion capital raise through equity financing. While equity financing could lead to initial share price decline as it dilutes the stock's value for the existing shareholders, the firm aims to use the proceeds to solidify financials. The capital raise is also timely as the company is busy with expansion plans including investments in new factories. Meanwhile, competition is also rising for Tesla. Hydrogen-truck upstart Nikola NKLA has partnered with General Motors GM, which is set to give a tough competition to Tesla’s overhyped and super stylish Cybertruck. Per the deal, General Motors will help Nikola build its electric pickup trucks in exchange for an 11% stake. Nonetheless, Tesla still has a lot going in its favor including robust Model 3 demand, ramp up of Model Y production, Shanghai Gigafactory success, ambitious Berlin Gigafactory, amazing line-up of upcoming products and aggressive expansion efforts. It will also be interesting to see how the stock trades in the coming days ahead of its Battery Day on Sep 22. While the company missed out on S&P 500 inclusion this time around, there’s still plenty of optimism surrounding the company and it might get added to the index in the next quarterly rebalance. Presently, Tesla carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. From thousands of stocks, 5 Zacks experts each picked their favorite to gain +100% or more in months to come. From those 5, Zacks Director of Research, Sheraz Mian hand-picks one to have the most explosive upside of all. With users in 180 countries and soaring revenues, it’s set to thrive on remote working long after the pandemic ends. No wonder it recently offered a stunning $600 million stock buy-back plan. The sky’s the limit for this emerging tech giant. And the earlier you get in, the greater your potential gain. Click Here, See It Free >> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Ford Motor Company (F) : Free Stock Analysis Report General Motors Company (GM) : Free Stock Analysis Report Tesla, Inc. (TSLA) : Free Stock Analysis Report Nikola Corporation (NKLA) : Free Stock Analysis Report To read this article on Zacks.com click here. This food habit is linked to a specific type of dementia. Abby Hensel officially tied the knot in 2021, it has been revealed  The dreaded pest also displaces wildlife and can blind pets. Find out more. The fashion mogul and former Spice Girl is holidaying on a multi-million-pound yacht in Florida The British monarch will not host an Easter lunch after the service, either.  The actress is soaking up every moment of 'paradise.' 'We love a girly that shreds,' one fan said of the very 'Barbie' moment. Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret.  Benny Larkin and daughter Taylor Larkin, 14, were boating down Dora Creek, New South Wales, Australia, when they broke down and were approached by a fuming kayaker. Pictures have captured the moment a 20-year-old man was arrested in front of shocked onlookers at the entrance to the Sydney Royal Easter Show. MSNBC's Nicolle Wallace asked ex-White House communications director why it's \"so hard\" for people to speak out against the former president.  The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’ The person who wrote on the road has been called a \"top bloke\" by motorists.  ‘I guess turning 29 isn’t so bad,’ the ‘American Idol’ alum joked. King Charles and Queen Camilla will sit apart from the main congregation at St. George’s Chapel’s Easter service \"I mean, is there no depth to which he will not descend?\" asked Andrew Weissmann.  Jacqui Lambie has responded after Senator Tammy Tyrrell announced she was leaving the Jacqui Lambie Network to sit as an independent. ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says ‘Once I saw the payment screen, I would have called and cancelled my RSVP’ "
}