{
    "title": "Toyota Stock is Trouncing Tesla. Really. - Barron's Streetwise Barron's \nPodcasts",
    "date": "3/29/2024",
    "url": "https://www.barrons.com/podcasts/streetwise/toyota-stock-is-trouncing-tesla-really/49C1BA9B-24C1-4F25-B9FA-D4A7310AEEDA",
    "text": "Jack talks with Barron’s senior writer Al Root about the slowdown in EV growth and the takeoff in hybrids. This transcript was prepared by a transcription service. This version may not be in its final form and may be updated. Al Root: At the beginning of '23, there was a ton of terrible things going on at Tesla. Elon was taking over Twitter and they were cutting prices, and they still didn't have a low price car, but it was $100 and it was to the point where it was like, I think this is as bad as it can get. Jack Hough: Hello and welcome to the Barron's Streetwise Podcast. I'm Jack Hough, and the voice you just heard, that's our pal, Al Root, senior writer at Barron's, my colleague. He's going to talk with us about cars. Tesla, Toyota, electric, hybrid, New York car show. What else, Jackson? Jackson Cantrell: VW Bus. Jack Hough: The new one, there's a new one. We'll get to it. Jackson Cantrell: Not the Mystery Machine. Jack Hough: Was that a VW Bus? No. Now, I got to Google it.\nListening in is our audio producer, Jackson. Hi Jackson. Jackson Cantrell: Hi Jack. Jack Hough: What did you learn about the Mystery Machine? Jackson Cantrell: It's based on a mid-'60s Chevy G body panel, or a Dodge A100. Both seem similar in appearance. Jack Hough: That was my next guess. We're talking about cars. We've got a question from a listener, let's get to that right away. Who do we have? Jackson Cantrell: Yeah, we have Tom. Tom: Hey Jack, it's Tom of the Car Stuff Podcast with a car-related question for you. With the dollar at near all-time highs relative to the end, is this a good time to invest in a company like Toyota, which does a great deal of business in the US, but is headquartered in Japan?\nI ask not just because this makes imported Toyota vehicles more profitable, though I realize that the company builds most of its American market products here in the States, but because this would seem like a great time for Toyota to repatriate funds accumulated in the US and earn some additional revenue because of the exchange rate cap. Anyway, I love your show and I learn a lot from it. Thanks a lot. Jack Hough: Thanks for the great question, Tom. I wrote a little bit about Toyota stock this past week in Barron's. It was a comparison of Toyota and Tesla. Toyota stock has outperformed Tesla by more than 90 percentage points over the past two years. That might be surprising to people who still think of Tesla as a perpetual high-flying stock, it's really not lately. Over the past couple of years, Tesla's down more than 40%.\nIt's to the point where you know how we've been talking about the magnificent seven, the big seven tech companies that have been driving the market? Well, now people say the big six, 'cause they don't include Tesla among the seven anymore. Jackson Cantrell: Ouch. Jack Hough: So Tom, I'll tell you a bit about what's happening for Tesla and then I'll come to Toyota. Basically electric vehicles have been losing some of their umph, some of their growth. Mizuho Securities just cut its 2024 electric vehicle growth projection to 15%. It was at 25%, and I've seen industry forecasts that were much higher than that. Mizuho says that EV inventories look bloated and they say affordability's a challenge. They've cut subsidies in the US and Europe, insurance costs they say are 25% higher for electric vehicles than for comparable gasoline cars. So, it seems as though early adopters already have their EVs and the folks who are next in line to buy them are more cost-conscious.\nWhen it comes to cheap EVs, China is leading the way. One of its manufacturers, BYD, recently passed Tesla in volume. Tesla has cut costs, but it won't introduce a new cheaper model until next year, and so that has created an air pocket for growth at Tesla. If you look at projections for deliveries, they're down. If you look at projections for free cash flow, they are way down. So, that's Tesla.\nNow Toyota, kind of the opposite is going on there. There has been what J.P. Morgan calls a title change in the US car market with hybrid vehicle demand taking off. Hybrid has recently been growing faster than electric vehicles and J.P. Morgan predicts more of the same, 22.6% hybrid vehicle growth this year, especially small SUVs and Toyota dominates there with its RAV4. This year, Toyota's going to introduce its popular Camry sedan in the US in a hybrid version only, which gives you an idea of how confident it is about demand for hybrid going forward.\nHybrids get 50+ miles to the gallon on some models. That's not going to impress plugin purists, but it is profitable. The Prius that Toyota makes, that's been profitable for more than two decades and Toyota says it earns higher margins on today's hybrid vehicles than it does on non-hybrid versions. The company gets more than a third of its revenue from hybrid vehicles and it has very little exposure to pure electric vehicles, so its sales mix is really just about perfect for this moment and that's why the stock has been doing so well.\nThe stock was recently up 115% over the past year, that's for the ordinary shares that trade in Japan. There are also American depository receipts, ticker TM on those, they were up 84% and the difference between those two returns gets to something that you had asked about Tom, the currency.\nThe yen recently hit a 34-year low versus the dollar. Basically, Japan has held its interest rates near zero for decades to try to boost its economy. Many developed economies joined it for a while there, but they've since begun raising rates. Japan was a holdout, but it recently raised interest rates for the first time in 17 years. It went from, and brace yourself for this change, from an overnight borrowing rate of minus 0.1% to a range of between zero and positive 0.1%. It went from barely perceptible negative to barely perceptible positive. Jackson Cantrell: Sounds like a turnaround story. Jack Hough: Well, we'll see what's next for rates, but there's been for the longest time this carry trade where traders have taken advantage of the differential between the very low rates in Japan and the higher rates elsewhere. So, is this the beginning of the end for that? Well, I guess not quite yet, but it is an interesting development. We'll see.\nSo if you're a US-based investor who's held Toyota shares over the past year, you had great timing on the stock, you were in the right place at the right time, you've gotten quite a haircut on the currency exchange. But for Toyota, as you point out, Tom, that cheap currency could help it with exports, but that's offset by cases where it manufactures overseas goods in those same overseas markets making Toyotas in the US, for example.\nSo, the answer to your question about should you buy Toyota stock for the currency effects is I don't know. It's always a tricky thing to do, because you have to factor in to what extent companies are taking actions to manage currency swings, but maybe you buy Toyota stock for how well Toyota's doing. For a while there Toyota was in the industry's naughty corner, because it was the only company that hadn't really detailed a plan for plugin electric vehicles. It was not as all-in as the others. While Ford was out there talking about its Lightning pickup truck and GM was talking about its Vault and Tesla was leaving all of them in its dust, Toyota just kept making hybrids and it seemed like they were a few steps behind.\nBut now that the early adopters have their EVs and growth there has slowed, hybrids are hot. You don't have to worry about range anxiety or new wiring in your house and you can save a bit on gasoline, do a little better for the environment. The switch over to all electric vehicles still feels somewhat inevitable, so Toyota will eventually need a plan, but it thinks that the change will take longer than people suppose. I've seen industry forecasts that electric vehicles will be half the market by the end of the decade, Toyota says it's more like 30%.\nNow that's what I can tell you, but I think what we should do is bring in Al Root from Barron's who writes a lot about cars and who's just back from a preview of the New York Auto Show. He can tell us about what he saw there. Jackson, anything to add? Jackson Cantrell: I have a Tesla and there's a supercharger right near my house and there's also a hydrogen fueling station right near the supercharger, and I've noticed there's just been lines of cars of these, they almost look like Lexuses, but they're Toyota Mirais. They run on hydrogen power, but everyone seems to be upset, because, one, it costs around $100 to fill up those things, and two, there's only one pump in it appears all of West LA that's working. Jack Hough: What they need is right in between the two, a helium station, so while they're waiting for the hydrogen, they could at least do the funny voices. Jackson Cantrell: I think you're onto something. Jack Hough: Okay, let's take a quick break and we'll be right back with Al.\nAl Root joining us from Barron's where you are a senior writer where you often write about cars. By the way, how's your mouth? Al Root: So the mouth update, no more numb tongue. Jack Hough: Good. Al Root: A little bit of a sore throat. You know they jam their hands in there for an hour. It's not good, but I'm feeling good. Jack Hough: We should explain. We were just on television together. Barron's does a TV show, it's called Barron's Roundtable. It airs Fridays at 7:30 PM and Saturday and Sunday at both 9:30 AM and 10:30 AM. I was guest hosting, you were on the show, you were talking about cars. You had just come from the dentist and you said you had a numb tongue, but you bravely did the show anyhow and I don't think anyone could tell, except for the fact that I told everyone. Al Root: Yeah, I don't know if it's a good thing or a bad thing no one can tell, I sort of slur everything. If you slur everything, you have no problems. Jack Hough: Tell us about the car show. There's a New York car show and you got kind of a sneak peek of it. What are you seeing there? First of all, tell me about some jazz ... let's start with the ear candy first. Tell me about some jazzy vehicles, something expensive. Al Root: Yeah, okay, I'll give you three. I like car shows, car shows for the public more than for investors per se. You're more likely to talk about ceramic breaks than free cash flow, but always good to see the product. The best one, this Rimac Nevera hypercar, $2.2 million car, all electric. They're only going to make 150 of those, but it's still fun to see on the- Jack Hough: I'm not sure my audio's working. I thought you said 2.2 million bucks. Is that the Novocaine? Did I hear that correctly? Al Root: No, I mean, you know how some of these cars get made, they're only going to make 150. The market for $2.2 million cars is wildly small, but it's fun to look at them. They don't ever impact stock prices. But what do you get, your Bugatti Veyron and you got your Rimac. There's a million dollar Lotus. Jack Hough: It's not a good deal for a car, but it might be a good deal for showoffy stuff, because if you're super rich, you can spend $2.2 million on a lot of things where you won't raise an eyebrow, but if you spend it on this car, there are only 150 of them, I mean, maybe that's something. Al Root: Yeah, that's the deal. Jack Hough: All right, put me down for two. Al Root: It's funny, when you're at the shows and stuff and the higher end cars, you don't get to walk up to them and sit in them really, because they have people, and they're like, \"Whoa, whoa, whoa, you don't get to sit in this. This is just for show, don't touch it little guy,\" and then you have to move on.\nMy favorite of the supercars, it's a $300,000 Mustang GTD. It's kind of like a street legal race car. This is like Vin Diesel's car in Fast & Furious 11 or something like that. Ford's big presentation this year is it's the 60th anniversary of the Mustang, we have a Mustang for everybody. $30,000 Mustang is the base price and you can go all the way up to $300,000 if you want something with 800 horsepower, and you want to drag race down the streets of, I don't know, Westport or Westchester County. Jack Hough: You learned a fascinating fact about the Mustang. We haven't really been able to get a second source on this, but go ahead and share it with folks anyhow. Al Root: One of the people associated with Ford at the auto show made the line, \"One in five Americans have been conceived in a Mustang.\" I'm pretty sure he was joking. It was just to point out how long the Mustang has been around and how American the Mustang muscle car is. Jack Hough: Well, speaking of Americans being conceived in vehicles, what about the VW Bus? The classic bus is coming back and what does it look like? What did you see? Tell us about it. Al Root: So, that stubbed nosed no hood VW Bus is back in all electric form. It's on sale in Europe, it's coming on sale in the US this year, they brought it to the show. It is pretty cool, it's called the ID. Buzz. We rode around midtown in it. I'd like to point out we probably went eight tenths of a mile and spent about 40 minutes in the car, 'cause we're going across town, so that's your New York- Jack Hough: Midtown Manhattan, this is not the place to go for a joyride. I think there were four current and former presidents in town around that time, so it might've been some sticky traffic. Al Root: Yeah, no, it was one of those days, but it was fine. So many people stopped, took pictures of this thing. So it's two-tone color, it has an electrochromic roof, it's all glass so you can make the roof clear or you can make the roof opaque.\nThe thing about from a business perspective, this is a different form factor for an EV, true seven seater, very comfortably seat seven, huge seats. It's a van and it was a pretty cool car, so we'll see how it does, but that was a highlight. That's not in the hypercar range. It'll be more modestly priced, probably in the 40 to 50. Jack Hough: I wonder if that'll sell well. I mean, it's too weird maybe to sell well, right? Al Root: It's a little too weird to sell well. Success in the car business, the car people will say, \"You need to sell 120,000 units to justify anything in a mass market vehicle.\" Tesla sells hundreds of thousands of Model 3s in the US a year, they sell about twice as many Model Ys as they sell Model 3s. So this is not $100,000 seller, it's probably more of a niche vehicle, tens of thousands of units a year. But when people see them, they'll think they're cool. Jack Hough: It's quirky, and my sense is that a typical family doesn't want to be quirky with their $40,000 vehicle. Maybe your socks, start with your socks, buy some quirky socks and show those off at work, but your vehicle, keep that more mainstream. That's my sense. Al Root: It's a great point, actually. You see these things, maybe even a Cybertruck and you're like, \"Oh, that's so cool, it'll sell a gazillion units.\" Then you say to yourself, \"Well, maybe not everybody wants to drive around in a stainless steel tank or a VW Bus.\" Jack Hough: What did you see in terms of the mix at the auto show? Do you feel like car makers are going to have the right mix of vehicles for this moment or are they over electrified? Al Root: I think to answer the mix question in two ways, I don't think they have the right mix, because one of the big problems in the US is there's too many expensive electric vehicles. Depending on how you count Teslas and all these sorts of things, which is officially a luxury brand, 25% of all the luxury cars sold in America are all electric. These are cars that are $50,000, $60,000, so that is problematic for the US market.\nIn terms of the mix of electric, hybrid and traditional vehicles, automaker by automaker, it's a little different. Ford has a complete lineup, General Motors is a little light on the hybrids, Toyota, way more focused on hybrids, not really focused on electrics. They do have a couple of models. For the country at large, the mix is fine, for each individual automaker, it's a little bit more of a nuanced story. Jack Hough: I'm going to slip in what was going to be my next question here, because you're starting to get to it, which is Tesla. Tesla has sold off and I want to know what's next. I want to know how long this lull is going to continue, or is this a case where the stock will not come back to its former glory or what's going to happen? That's wrapped very much up in the electric vehicle cycle that you're talking about. So, where are we and where are we headed? Al Root: Tesla's an interesting one. If you look at it just like a car company, Tesla, the car maker, and the older they get and the more cars they sell, the more like a car maker they look, its product lineup is old. The Model Y came out in 2020, the Model 3 came out in 2017, the Cybertruck is more of a niche vehicle. So their biggest sellers are very good cars and they're very good at making electric vehicles, but they're all older than all of this new competition.\nTesla has very high market share where they compete. They have very high market share of the US luxury vehicle market, they have very, very high share, 60%, 70% of the overall market for electric vehicles in the US, but they don't serve all the segments, they need more cars. Jack Hough: You were talking about the hype cycle and what comes next for electric vehicles. My sense is that if you're an early adopter, if you're someone who was at the front of the line to buy a plugin electric vehicle, you've already got yours, but now we're getting to the customers who are more price-conscious and they want a good deal. They don't want to do this at any cost, and so you have to have the vehicles for them, and Tesla won't have that for a little while, right? Al Root: No, Tesla's lower priced model is due to hit roads at the end of '25 or some point in 2025. Tesla, I mean, you can just plot it, they tend not to hit their target, so 2025, 2026 for a lower price model. A year and a half to two years away, I mean, that's a long time to wait. And oh, by the way, while that's happening, depending Europe or China, and even the US to a certain extent, you're going to have a lot more electric vehicles trying to fill up that space before Tesla gets there. I mean, Tesla- Jack Hough: China's BYD passed Tesla to become the largest electric vehicle maker recently and they're making cheap cars, right? Al Root: Yeah, Tesla's average price for a car is still in the $45,000 range, BYD's is in the $25,000 range. We're rounding, so BYD became the largest basically by serving that lower end segment and sales exploded. So if you think back, if you think about Tesla's strategic mistakes, which I like to say sometimes, because the emails flood in when I say Tesla has made a mistake, they were first with the S and the X in this high end luxury segment. They were first in this lower end luxury segment, they led, and then in the mass market segment, they're going to be a distant follower in terms of timing. Now they're very good at making these cars and they have good charging infrastructure and all of that sort of stuff, but there's just no way to put it, other than this lower price Tesla has been too late. Jack Hough: I was looking at some of the estimates for Tesla and I think that they're expected by Wall Street to deliver just over two million vehicles this year, but if you go back a couple of years, the estimate was way higher, it was 2.7 million. If you look at the free cash flow estimate, that has collapsed from a peak of $17 billion. At one point, that's what they were expected to produce this year in free cash flow, now it's closer to $4 billion. It's not a company that was always driven by the financial fundamentals, that stock, but the numbers have come down pretty harshly. Al Root: It's interesting. On that estimate point, I'll just throw this in quickly, Tesla's down 30% this year, its 2024 earnings estimates are down just about 25% this year, so to some extent maybe earnings estimates are driving. The market, the growth investors say this thing should trade at 60 times earnings, but as earnings estimates have fallen, the stock has fallen along with it. Jack Hough: Do you feel like the stock is a good deal here? Al Root: We picked it at the beginning of '23. At the beginning of '24, we said you shouldn't buy it, but you could sell half of your position and basically keep your original position, 'cause the stock had doubled, and just let it ride. So that was my view of the stock, it was a hold. I don't like holds, 'cause you either buy stocks or sell stocks, but we called Tesla a hold at the beginning of '24. There's too much going on to make me super bullish on Tesla.\nAt the beginning of '23, there was a ton of terrible things going on at Tesla. Elon was taking over Twitter, which was causing issues of management distraction and they were cutting prices, and they still didn't have a low price car, but it was $100, and it was to the point where it was like, I think this is as bad as it can get, and so we picked it. Jack Hough: Al, if I understand correctly, Tesla has cut prices on its existing vehicles, but it has also said that it's reaching the natural limit of how far it can bring down costs to manufacture those vehicles. So, maybe the cost-cutting is done for now and we're waiting for that next cheap vehicle. Have I got that right? Al Root: Yeah, I think so. I mean, their operating profit margins fell 10 percentage points year over year in the fourth quarter. They're below 10%, they're below Toyota, so you would expect them to say, \"Well, we're getting to the limits of pricing.\" But another reason they say that is because you cut prices by 10,000 bucks, and oh look, 100,000 more fly out the door. You cut prices by another 5,000 bucks and nothing happens, right? It becomes ... and I think that is as important as what's happening in Tesla.\nAgain, let's get the Elon emails flowing to Al. I think he almost learns on the fly. So when he cut prices by $7,000, $8,000 in one fell swoop, it created this stir in the auto industry. Why you do that? Car companies tend to do things in a little more measured way. Elon started saying things like, \"I can sell as many cars as I want, I just have to modify the price. Demand is infinite if my price is zero.\" He was making these I just went to Economics 101 class, and I think he sort of learned that it's not actually exactly like he thinks. There's a mix of pricing and incentives, and even, dare I say, advertising that's better than just slashing prices every day. Jack Hough: Is it al.root@barrons.com for those angry emails? Have I got that right? Al Root: Dow Jones. Tesla famously does no advertising, and these price cuts have cost it 25, $30 billion in sales revenue. You could spend a lot on ads that is less than 25 or $30 billion. Jack Hough: I want to ask you the flip side of that Tesla stock question, which is Toyota stock. We had a listener of this podcast who was asking about Toyota, and that stock has charged higher on all of a sudden soaring hybrid demand. It seems like at the same moment that people decided we want to cool it a little bit on the electric vehicles or we want to wait and see, they said, \"We want hybrid vehicles, we're willing to pay extra for them.\"\nToyota makes better margins on its hybrid vehicles than its regular vehicles, so there's not this issue of eating huge costs upfront, it's been doing this for decades. So, what do you think? Is that something that can continue to power Toyota stock? I mean, I saw it at 11 times earnings even after this big run up. Where do you think Toyota stock is headed, or is that going to go back to being just a boring car stock? Al Root: I think everything you said's right. At this moment, hybrids are doing better than all electric vehicles. I think part of it is this affordability issue. A hybrid isn't a luxury car. You can go in and get a good deal on a hybrid and you get 50 miles a gallon, and you say to yourself, \"Hey, this is great and I'm doing something good for the environment.\"\nThing number two is, listen, I do think it's a boring car company, all of these car companies in my world. We had the pixie stick of Tesla growing, we hadn't had growth in my sector for 100 years. We had single digit PE ratios and we would write stories about like, oh, the new Explorer can boost sales by 5%. So it's still a boring car company, it's still Toyota.\nNow I came armed with a statistic, because ... and I'm guilty of many, many things, I don't get everything right. I am very wary of Toyota up here. So Toyota, you said 11 times earnings. In the last decade, it has never traded at 12 times earnings. To me, it feels like about as good as it gets. It's a wonderful company, it changed the world of manufacturing. It is Toyota, they will continue to sell wonderful vehicles. I have one. I don't know if the stock works from here. I mean, it's had a great run. Do I wish I recommended it six months ago to people? I absolutely do. Jack Hough: So 11 times earnings might be a good deal for a regular stock, but it's a glamorous valuation for a legacy car maker. Al Root: Oh my goodness, it's a glamorous valuation. I get questions about GM and Ford, why do they never trade better than five, six times earnings? They don't grow. If you look at sales at General Motors and Ford over long period of time and you take out the, oh, this was a good year, this was a bad year, their sales grow 1% a year on average, and it's a very competitive market. So in the good old-fashioned car companies, you're never going to get a market multiple, because earnings don't grow at market rates. Jack Hough: Al, you can really help the American consumer here, because you own both a Tesla and a hybrid vehicle, right? A Prius, is it, a Toyota Prius? So in addition to talking Tesla versus Toyota stock, you've got them both in the garage. What do you like more? Which one is your true love? Al Root: Oh, no doubt the Tesla. It's the nicest car I've ever owned and I did the exact same thing as Jackson. They cut prices and then they gave me 1,000 bucks off and then you get another discount in Connecticut, so I got basically $11,000 off. The car cost me brand new about $31,000, so it's not outrageous.\nMaybe this story can make it in, maybe it won't. When I was at the stoplight with a Prius and the kids were in the back, and there was a Tesla beside me, I used to joke with the kids, \"Okay, we're going to race this thing.\" I would floor the Prius and it goes zero to 60 conservatively in about a minute and a half. So the Tesla would be way down the road, and you'd be like, \"Oh, we lost girls,\" and they would laugh. The Tesla is a much more fun vehicle to drive than my beloved Prius. Jack Hough: Al Root, you've done it again. You've brought us up to speed on what's going on in the automotive world. The New York car show, what's next for Tesla, how about Toyota stock. Glamorously priced at 11 times earnings you say, and hold off on the Tesla shares for now.\nThanks as always, and since you're on loan to us this week from the TV show, I'm going to give it a second plug. It's called Barron's Roundtable. I should have said it airs on Fox Business, but you have to know the channel to go to. Fox Business, Fridays at 7:30 PM and Saturday and Sunday 9:30 AM and 10:30 AM.\nI want to thank Tom for the question and everyone please keep your questions coming. You can tape on your phone, use the voice memo app, send it to jack.hough, that's H-O-U-G-H@barrons.com. I also want to thank Al Root for the car chat and thank all of you for listening.\nJackson Cantrell is our producer. If you need him, he'll be bogarting the helium near the hydrogen charging station. Subscribe to the podcast on Apple Podcast, Spotify, or wherever you listen to podcasts, and if you listen on Apple, you can write us a review. Jackson Cantrell: See you next week. Jack Hough: Hold on, you're just jumping in and saying it now? Jackson Cantrell: Yeah, I just thought I'd ... you got to take what you can get. Jack Hough: All right. Jackson Cantrell: It's about time I get more airtime on this show. Soon I'll take thanks for listening. "
}