{
    "title": "Apple Set Out To Make An EV Much More Than A 'Tesla Clone' And Let Slip Of \n'Multibillion-Dollar Moneymaker,' Says ...",
    "date": "3/3/2024",
    "url": "https://www.tradingview.com/news/benzinga:e513e9d01094b:0-apple-set-out-to-make-an-ev-much-more-than-a-tesla-clone-and-let-slip-of-multibillion-dollar-moneymaker-says-gurman/",
    "text": "Apple, Inc. AAPL was in the news last week for pulling the plug on its self-driving car project, and Bloomberg columnist Mark Gurman on Sunday delved into the potential reasons. Wrong Bet: “Apple's belief that it could create a better car than Tesla and the rest of the automotive industry ultimately led to the downfall of the project,” said Gurman in his latest installment of the “Power On” newsletter. When Cupertino set out to make a car roughly a decade ago, it was toying with the idea of either building a less ambitious electric vehicle with autonomy features in line with Tesla models or change the world with a “full-blown self-driving vehicle,” said the columnist. The latter option would mean having a car that could go from one point to another with zero driver intervention, he added. Apple went with the second approach and that proved to be a setback, Gurman said. “All those years ago, the company thought it could solve a problem (full self-driving) that the auto industry is still struggling to crack today — all while introducing a groundbreaking design. That challenge proved too difficult for even Apple to overcome,” he said.’ Although introducing a “Tesla clone” wouldn’t have revolutionized the industry, such a car would have still “reflected Apple's design chops and be fully integrated into the company's ecosystem of products,” Gurman said. Apple realized its mistake a little too late and by that time the design work had already been focused on a car without steering wheels or pedals, and billions of dollars had already been plowed into developing a Level 5 self-driving system, the Apple columnist said. Instead of developing a good-enough car with an Apple user interface, slick Jony Ive-designed interior and exterior and an iPhone-like buying experience, the company bet on autonomy, Gurman said. See Also: Everything You Need To Know About Tesla Stock Problems Galore: Gurman said Apple faced other major problems as well in its self-driving car pursuit. The project cost was hefty, which suggested a potentially high price tag for consumers as well. The company would have also had to contend with “razor-thin” profit margins that is typical of the auto industry, he said. “All of this was compounded by indecisiveness among Apple's executive team and the inherent production challenges in manufacturing a car,” Gurman said. The auto market, the columnist said, is harder to crack than smartphones, computers and MP3 players. It is characterized by far more competitors and complex supply chains, with a huge capital requirement, he said. “It was a gamble to even try creating a Tesla clone, let alone a vehicle that would transform the industry,” Gurman said. Still, Apple could have worked on the Tesla clone, he said. “With the car, Apple could have gotten something out on the market, sold hundreds of thousands of vehicles and then collected as much data as necessary to build up a viable self-driving platform,” he added. With Apple looking at a pricing of $100,000 per unit, it could have had a “multibillion-dollar moneymaker on its hands” even if these sales did not translate to big profits, Gurman said. Apple ended Friday’s session down 0.60% at $179.66, according to Benzinga Pro data. Check out more of Benzinga’s Future Of Consumer Tech by following this link. Read Next: Apple Sinks After Wall Street Titan Pulls Magnificent 7 Stock From Conviction List Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}