{
    "title": "Insider Selling: Tesla, Inc. (NASDAQ:TSLA) SVP Sells $121674.57 in Stock",
    "date": "3/10/2024",
    "url": "https://www.americanbankingnews.com/2024/03/10/insider-selling-tesla-inc-nasdaqtsla-svp-sells-121674-57-in-stock.html",
    "text": "Posted by ABMN Staff on Mar 10th, 2024 Tesla, Inc. (NASDAQ:TSLA – Get Free Report) SVP Xiaotong Zhu sold 687 shares of the stock in a transaction on Wednesday, March 6th. The shares were sold at an average price of $177.11, for a total transaction of $121,674.57. Following the completion of the sale, the senior vice president now directly owns 63,171 shares of the company’s stock, valued at $11,188,215.81. The sale was disclosed in a filing with the SEC, which is available through the SEC website. Shares of TSLA opened at $175.34 on Friday. The company has a market cap of $558.42 billion, a price-to-earnings ratio of 40.68, a PEG ratio of 3.07 and a beta of 2.41. Tesla, Inc. has a 1-year low of $152.37 and a 1-year high of $299.29. The company’s fifty day simple moving average is $203.28 and its 200 day simple moving average is $228.84. The company has a current ratio of 1.73, a quick ratio of 1.25 and a debt-to-equity ratio of 0.05. Tesla (NASDAQ:TSLA – Get Free Report) last issued its earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share for the quarter, missing analysts’ consensus estimates of $0.74 by ($0.03). The firm had revenue of $25.17 billion for the quarter, compared to analyst estimates of $25.64 billion. Tesla had a return on equity of 16.62% and a net margin of 15.50%. Tesla’s quarterly revenue was up 3.5% on a year-over-year basis. During the same quarter in the previous year, the firm posted $1.07 earnings per share. On average, research analysts forecast that Tesla, Inc. will post 2.49 earnings per share for the current fiscal year. Several large investors have recently modified their holdings of the stock. ICA Group Wealth Management LLC raised its position in shares of Tesla by 5.6% in the fourth quarter. ICA Group Wealth Management LLC now owns 7,828 shares of the electric vehicle producer’s stock valued at $1,945,000 after purchasing an additional 413 shares during the period. Brown Shipley& Co Ltd raised its position in shares of Tesla by 0.4% in the fourth quarter. Brown Shipley& Co Ltd now owns 27,442 shares of the electric vehicle producer’s stock valued at $6,819,000 after purchasing an additional 109 shares during the period. Objective Capital Management LLC raised its position in shares of Tesla by 10.6% in the fourth quarter. Objective Capital Management LLC now owns 1,780 shares of the electric vehicle producer’s stock valued at $442,000 after purchasing an additional 170 shares during the period. SageView Advisory Group LLC raised its position in shares of Tesla by 93.7% in the fourth quarter. SageView Advisory Group LLC now owns 19,170 shares of the electric vehicle producer’s stock valued at $4,763,000 after purchasing an additional 9,271 shares during the period. Finally, Fisher Asset Management LLC raised its position in shares of Tesla by 38.5% in the fourth quarter. Fisher Asset Management LLC now owns 21,119 shares of the electric vehicle producer’s stock valued at $5,248,000 after purchasing an additional 5,874 shares during the period. 41.87% of the stock is owned by institutional investors. A number of analysts have weighed in on TSLA shares. Truist Financial reduced their price target on shares of Tesla from $227.00 to $193.00 and set a “hold” rating for the company in a report on Thursday, January 25th. Daiwa Capital Markets downgraded shares of Tesla from an “outperform” rating to a “neutral” rating and reduced their price objective for the stock from $245.00 to $195.00 in a report on Tuesday, February 6th. Barclays reduced their price objective on shares of Tesla from $250.00 to $225.00 and set an “equal weight” rating for the company in a report on Thursday, January 25th. Canaccord Genuity Group reduced their price objective on shares of Tesla from $267.00 to $234.00 and set a “buy” rating for the company in a report on Thursday, January 25th. Finally, Wells Fargo & Company reduced their price objective on shares of Tesla from $223.00 to $200.00 and set an “equal weight” rating for the company in a report on Thursday, January 25th. Nine research analysts have rated the stock with a sell rating, sixteen have issued a hold rating and nine have issued a buy rating to the company’s stock. According to MarketBeat.com, Tesla currently has an average rating of “Hold” and an average target price of $218.04. Check Out Our Latest Stock Report on Tesla (Get Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.    Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter. O Shaughnessy Asset Management LLC Raises Stock Position in Invesco S&P 500 Equal Weight Health Care ETF (NYSEARCA:RYH) Insider Selling: Hims & Hers Health, Inc. (NYSE:HIMS) COO Sells $164,396.49 in Stock "
}