{
    "title": "Ford EV owners can use Tesla’s network, but they’ll need an adapter",
    "date": "3/1/2024",
    "url": "https://www.mercurynews.com/2024/03/01/ford-electric-vehicle-owners-can-now-charge-on-teslas-network-but-theyll-need-an-adapter-first/",
    "text": "Today's e-Edition Get Morning Report and other email newsletters  Get Morning Report and other email newsletters Today's e-Edition Trending: Owners of Ford electric vehicles can now use much of Tesla’s charging network in the U.S. and Canada, but there’s a hitch. They’ll need to get an adapter that Ford will provide for free, although the company won’t start shipping those until the end of March. Last May, Ford became the first automaker to reach an agreement with the Austin, Texas-based Tesla to charge on its network, which is the largest and most well-placed in the U.S. Tesla has more than 26,000 plugs and nearly 2,400 Supercharger stations across the U.S. and Canada. Ford said its owners will have access to about 15,000 Tesla fast-charging plugs that are located strategically along travel corridors. Ford owners won’t be able to use some older Tesla plugs. Most other automakers followed Ford in joining Tesla’s network and agreeing to switch to Tesla’s plug, called the North American Charging Standard, which is smaller and easier to use than the current plugs on most other EVs sold in the two countries. Related Articles\nBusiness |  \n\n\t\t\tProposal would change how California power bills are calculated, aiming to relieve summer spikes\t\t\n\n\nBusiness |  \n\n\t\t\tTesla’s $25,000 car means tossing out the 100-year-old assembly line\t\t\n\n\nBusiness |  \n\n\t\t\tLetters: People in need | Section 8 oversight | PG&E rates | Charging network | Votes for climate | Trump contrast\t\t\n\n\nBusiness |  \n\n\t\t\tJoby Aviation to deliver three more electric aircraft to US Air Force\t\t\n\n\nBusiness |  \n\n\t\t\tPrices are falling on used EVs. Here’s how to get a deal\t\t\n\nFord said adding the Tesla plugs will double the size of the network that can be used by Ford EV owners. There are nearly 166,000 Ford EVs in the U.S. Ken Williams, director of charging and energy services, said a top concern of its EV owners is charging, even though they charge 80% of the time at home. “We wanted to make sure we are meeting that need,” he said. Ford is offering the adapters for free to the owners, who can sign up on the Ford.com website to reserve them between Thursday and June 30. The company will provide one free adapter per vehicle. Tesla’s network was turned on Wednesday morning, and software enabling the Ford vehicles to charge at Tesla stations was to be sent out around the same time. Ford will switch to Tesla’s charging connector with its second-generation EVs starting next year. Customers will pay Tesla for the electricity, and Williams said they can find out the price at Ford’s mobile app and on public charging apps on vehicle touch screens. Copyright © 2024 MediaNews Group "
}