{
    "title": "Regarding The Investment Plan, Tesla Reportedly Has Sent A Team To \nIndonesia And Is Amazed By Vale Indonesia's Nickel Mine In Morowali",
    "date": "3/21/2024",
    "url": "https://voi.id/fr/economie/177196",
    "text": " Partager: JAKARTA - Coordinating Minister for Maritime Affairs and Investment Luhut Bisar Pandjaitan opened his voice regarding Tesla Inc's investment plan. According to Luhut, talks with Elon Musk's company are still ongoing. Luhut said, cooperation must be applied equally. This means that each party gets the same result. Including in this case electric car investment, Luhut emphasized that Indonesia does not want to be regulated by other countries. \"We are still negotiating the car (to enter Indonesia), we need patience,\" he said during a Working Meeting at the DPR RI's Budget Agency (Banggar), Thursday, June 9. The Tesla team has also visited Indonesia, specifically to the nickel mine in Morowali and PT Vale Indonesia Tbk (INCO). Luhut said they were amazed. \"Yesterday when the Tesla Team came to Morowali and in Vale, they were beyond amazed, he said I've never had anything like this outside of China, that's great,\" he said. \"Employees in Morowali have reached 75 thousand, there are still many under construction, there is 30 billion US dollars of investment there, our exports have increased, up from 1.5 billion US dollars,\" he continued. Luhut also offered to start a company with clean energy, so the best place is in Indonesia. \"In North Kalimantan we make 256 gigawatt hours to produce energy and produce 3 million cars. That's end-to-end clean energy. Elon Musk is very aware of that,\" he said. The English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. \n                                    (system supported by DigitalSiber.id) Tag:\n                                                                                                    ekonomi\ntesla\nkemenko marves\ntambang\ninvestasi\ninvestasi tesla di indonesia\nluhut binsar pandjaitan © 2024 VOI - Waktunya Merevolusi Pemberitaan  "
}