{
    "title": "Moody National Bank Trust Division Lowers Holdings in Tesla, Inc. \n(NASDAQ:TSLA)",
    "date": "3/20/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsla-sec-filing-2024-03-20/",
    "text": "Moody National Bank Trust Division trimmed its holdings in Tesla, Inc. (NASDAQ:TSLA - Free Report) by 53.6% in the 4th quarter, according to its most recent disclosure with the SEC. The firm owned 25,406 shares of the electric vehicle producer's stock after selling 29,354 shares during the period. Tesla makes up about 0.5% of Moody National Bank Trust Division's holdings, making the stock its 21st largest holding. Moody National Bank Trust Division's holdings in Tesla were worth $6,313,000 as of its most recent SEC filing. Several other hedge funds also recently added to or reduced their stakes in the business. Contravisory Investment Management Inc. acquired a new stake in shares of Tesla in the third quarter valued at $25,000. Wyrmwood Management LLC acquired a new stake in Tesla in the fourth quarter valued at $25,000. Halpern Financial Inc. raised its stake in Tesla by 1,111.1% in the third quarter. Halpern Financial Inc. now owns 109 shares of the electric vehicle producer's stock valued at $27,000 after buying an additional 100 shares in the last quarter. Alpha Paradigm Partners LLC acquired a new stake in Tesla in the third quarter valued at $27,000. Finally, MayTech Global Investments LLC acquired a new stake in Tesla in the fourth quarter valued at $30,000. 41.87% of the stock is currently owned by hedge funds and other institutional investors. Analyst Upgrades and Downgrades Several equities analysts have issued reports on the company. Piper Sandler dropped their price objective on Tesla from $295.00 to $225.00 and set an \"overweight\" rating on the stock in a report on Monday, February 5th. Canaccord Genuity Group dropped their price objective on Tesla from $267.00 to $234.00 and set a \"buy\" rating on the stock in a report on Thursday, January 25th. Citigroup lowered their price target on Tesla from $255.00 to $224.00 and set a \"neutral\" rating on the stock in a report on Thursday, January 25th. Wells Fargo & Company lowered Tesla from an \"equal weight\" rating to an \"underweight\" rating and lowered their price target for the stock from $200.00 to $125.00 in a report on Wednesday, March 13th. Finally, The Goldman Sachs Group lowered their price target on Tesla from $220.00 to $190.00 and set a \"neutral\" rating on the stock in a report on Monday. Ten research analysts have rated the stock with a sell rating, fourteen have assigned a hold rating and nine have issued a buy rating to the stock. According to MarketBeat, the stock currently has a consensus rating of \"Hold\" and an average price target of $211.93. Check Out Our Latest Stock Analysis on TeslaTesla Trading Up 2.5 % Tesla stock traded up $4.34 during mid-day trading on Wednesday, hitting $175.66. The stock had a trading volume of 83,260,627 shares, compared to its average volume of 104,865,063. The company has a current ratio of 1.73, a quick ratio of 1.25 and a debt-to-equity ratio of 0.05. Tesla, Inc. has a 12 month low of $152.37 and a 12 month high of $299.29. The stock has a market capitalization of $559.44 billion, a PE ratio of 40.76, a P/E/G ratio of 3.91 and a beta of 2.41. The stock has a 50-day simple moving average of $193.48 and a two-hundred day simple moving average of $225.06. Tesla (NASDAQ:TSLA - Get Free Report) last posted its quarterly earnings results on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share for the quarter, missing analysts' consensus estimates of $0.74 by ($0.03). Tesla had a net margin of 15.50% and a return on equity of 16.62%. The company had revenue of $25.17 billion during the quarter, compared to the consensus estimate of $25.64 billion. During the same quarter in the prior year, the business earned $1.07 earnings per share. The firm's revenue for the quarter was up 3.5% compared to the same quarter last year. As a group, sell-side analysts forecast that Tesla, Inc. will post 2.45 EPS for the current year. Insider Activity at Tesla In other Tesla news, SVP Xiaotong Zhu sold 687 shares of Tesla stock in a transaction on Wednesday, March 6th. The stock was sold at an average price of $177.11, for a total value of $121,674.57. Following the completion of the transaction, the senior vice president now directly owns 63,171 shares of the company's stock, valued at approximately $11,188,215.81. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this hyperlink. In other news, SVP Xiaotong Zhu sold 687 shares of the business's stock in a transaction on Wednesday, March 6th. The stock was sold at an average price of $177.11, for a total transaction of $121,674.57. Following the completion of the transaction, the senior vice president now owns 63,171 shares of the company's stock, valued at approximately $11,188,215.81. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this link. Also, Director Robyn M. Denholm sold 93,706 shares of the business's stock in a transaction on Wednesday, February 21st. The stock was sold at an average price of $194.73, for a total value of $18,247,369.38. Following the transaction, the director now directly owns 15,000 shares of the company's stock, valued at approximately $2,920,950. The disclosure for this sale can be found here. Insiders sold 198,598 shares of company stock worth $36,952,434 in the last ninety days. 20.90% of the stock is owned by company insiders. About Tesla (Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.Featured StoriesFive stocks we like better than TeslaStock Trading Terms - Stock Terms Every Investor Needs to KnowIs Ollies Bargain Outlet a Smart Buy-On Post-Release Weakness?What is a Special Dividend?Chipotle Stock Shoots Higher, Announcing 50 for 1 Stock SplitWhat is a Bond Market Holiday? How to Invest and TradeGeneral Mills Stock Price Reversal Gains Momentum on Good NewsThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ I tried to warn you  (From Porter & Company) (Ad)Should you invest $1,000 in Tesla right now?Before you consider Tesla, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list.While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here Ten Starter Stocks For Beginners to Buy NowJust getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Tesla, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list. While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. If the last year of price cuts and sluggish sales weren’t enough to tip off the market to the fact the EV bubble has burst, Tesla’s NASDAQ: TSLA Q4 results and outlook for 2024 should do it. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}