{
    "title": "Elon Musk kills Don Lemon's new X show before it ever began",
    "date": "3/13/2024",
    "url": "https://ca.movies.yahoo.com/elon-musk-kills-don-lemons-new-x-show-before-it-ever-began-205608734.html",
    "text": " X has canceled a high-profile partnership with former CNN host Don Lemon to stream a video talk show on the platform. Lemon said that the company canceled his contract hours after he interviewed X’s billionaire owner Elon Musk for the first episode of “The Don Lemon Show,” which was scheduled to stream on the platform this Monday. “Elon Musk is mad at me,” Lemon said in a video posted to X on Wednesday. “Apparently, free speech absolutism doesn’t apply when it comes to questions about him from people like me.” Lemon’s announcement came a day after company CEO Linda Yaccarino declared that X was becoming a “video first” platform. It announced the partnership with Lemon in January as part of a larger strategy to stream more original content on the service. This included striking deals with former representative Tulsi Gabbard and sports radio commentator Jim Rome to stream their own shows on the platform. Last year, X reportedly made a similar deal with Tucker Carlson after he was fired from his hosting duties at Fox News. X’s decision to cancel Lemon’s show raises questions about the company’s strategy. “The Don Lemon Show is welcome to publish its content on X, without censorship, as we believe in providing a platform for creators to scale their work and connect with new communities,” X said in a statement. “However, like any enterprise, we reserve the right to make decisions about our business partnerships, and after careful consideration, X decided not to enter into a commercial partnership with the show.” Lemon said that he will now stream the first episode of “The Don Lemon Show” on X, YouTube and other podcast platforms, and is preparing for a legal fight in case X refuses what is reportedly a multi-million dollar payout. “Don has a deal with X and he expects to be paid for it,” a spokesperson for Lemon told Variety. “If we have to go to court, we will.” However, two anonymous sources claimed to Semafor that Lemon may not have actually signed a contract with X. Musk has a history of withholding payments. A group of former Twitter executives including the company’s ex-CEO Parag Agrawal are suing Musk and X over millions of dollars in unpaid severance benefits. Lemon’s interview with Musk, which was recorded on Friday, spanned a wide range of topics including the presidential election, and, reportedly, the billionaire’s alleged ketamine use, the subject of a Wall Street Journal story published earlier this year. “Hardcore questions were asked,” Lemon told an X user. In a written statement, Lemon said that he had a “good conversation” with Musk, but the billionaire clearly didn’t seem to think so. Musk wrote that Lemon’s approach was “basically just ‘CNN, but on social media’, which doesn’t work, as evidenced by the fact that CNN is dying,” in response to a user asking X about specific reasons for terminating the partnership with Lemon. “And, instead of it being the real Don Lemon,\" Musk sniped, \"it was really just [former CNN President] Jeff Zucker talking through Don, so lacked authenticity.” Lemon was fired from CNN nearly a year ago after making on-air remarks against former Republican presidential contender Nikki Haley that many considered sexist and ageist, as well as reports showing he engaged in misogynistic behavior over his 15-year tenure at CNN. Money can't buy you happiness, but what about working with a financial advisor? Hollie AdamsAccording to London’s Metropolitan Police and social media footage, a pedicab burst into flames directly in front of Buckingham Palace on Saturday, leaving behind only charred, melted remains. Explosion and fire outside Buck Palace! pic.twitter.com/nUWojD8Ji8— Michael Wright (@Michael_HiFi) March 30, 2024 In video of the incident on X, captioned “Explosion and fire outside Buck Palace,” the pedicab can be heard cracking and popping as it burns, emitting billowing clouds of black smok  “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by … The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences. Follow all the action from Stamford Bridge Play this game for 1 minute and see why everyone is addicted. I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. The Blues sit 11th in the Premier League table heading into the match SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x … You will never turn off your computer again. Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story.  Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action. Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset. ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said  If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset. St Michael and All Angels Church in Tirley was \"marooned\" by water in January. The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics. April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off A Dyson-rivaling hair dryer for just $30, a rare markdown on classic Levis and an Emeril-approved air fryer for $100-plus off await. "
}