{
    "title": "NIO Stock Forecast: Can the ‘Tesla of China’ Live Up to the Hype?",
    "date": "3/12/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/TXCE/pressreleases/24730893/nio-stock-forecast-can-the-tesla-of-china-live-up-to-the-hype/",
    "text": "Shanghai-based electric vehicle (EV) maker NIO (NIO) is quite popular among U.S. investors, and is among the most heavily traded Chinese stocks, with average trading volumes of over 56 million. Once hailed as the “Tesla of China,” NIO is currently struggling with perennial losses and tepid deliveries. What’s the forecast for NIO stock, and can the Chinese EV company live up to this hype? We'll discuss in this article. NIO stock hit an all-time high closing price of $62.84 in February 2021, and its market cap was once more than $100 billion. That said, it was almost the industry standard for startup EV companies to command those kinds of inflated valuations between 2020 and 2021. For instance, Rivian’s (RIVN)market cap topped $150 billion shortly after its 2021 IPO, while Lucid Group's (LCID) market cap was within striking distance of $100 billion at its peak. However, the EV industry’s joyride ended in 2022, when the Fed embarked on its most aggressive rate-hike campaign in decades. This effectively pulled the plug on the supply of easy money which was the lifeline for almost all of the companies in the startup green energy ecosystem, given their massive cash burn and the need for frequent cash infusions. As for the EV space, specifically, it turns out that the demand for electric cars is not rising as fast as automakers had anticipated. As a result, we now have dealer lots overflowing with EV inventories. And for NIO in particular, the de-rating of Chinese stocks amid the country’s economic slowdown, coupled with souring relations between China and the Western world, have only added to industry-wide pressures. NIO stock has fallen in every year since its breathtaking 1,100% rally in 2020, and the outlook is no better in 2024; the EV company has already lost nearly a third of its market cap. NIO’s recent operating and financial performance has been underwhelming. It delivered just 18,187 vehicles in the first two months of 2024 - and even if we account for the Lunar New Year Holidays in China, the report does not look encouraging. The company’s growth has been faltering, and revenues rose just 6.5% in Q4 - while the Q1 2024 guidance implies a low single-digit rise in revenues at the upper end, and a YoY fall in revenues at the lower end. Bernstein analyst Eunice Lee pointed out that NIO’s market share in the Chinese EV market has fallen to around 2% in recent months, down sharply from 5% in early 2021. The fall in market share comes despite the company nearly tripling the models that it offers. But it's not all gloom and doom for NIO, and the company’s vehicle margin improved to 11.9% in Q4 2023, up from 6.8% in the corresponding quarter last year. The company expects margins to rise to between 15%-18% beginning in Q2, and eventually hit its long-term goal of 20%. Crucially, the company had $8.1 billion in cash, restricted cash, and investments at the end of 2023. With multiple startup EV companies staring at bankruptcies in response to rapidly depleting cash piles, NIO offers some small measure of financial stability here. Analysts have been getting less bullish on NIO stock’s forecast - and some are now outright bearish. Currently, only 38% of brokerages covering the Chinese EV company rate it as a “Strong Buy” or “Buy,” down from 50% three months ago. Recently, Morgan Stanley analyst Tim Hsiao lowered NIO’s target price from $13 to $10, while Bernstein analyst Eunice Lee slashed her price target from $7.50 to $5.50 - more than 12% below the stock’s current levels, and 46% below the mean target of $10.28. Meanwhile, NIO is attempting a turnaround, and intends to debut its low-cost platform Alps in Q2. During the Q4 2023 earnings call, NIO said that the first model from Alps “will have head-on competition with the most popular model of Tesla that is Model Y.” The company emphasized that the additional advantage of the model would be that it would support battery swapping, like other NIO cars, and the company expects its bill of materials (BOM) to be 10% lower than Tesla's (TSLA) Model Y. A lower cost base has become imperative for EV companies amid the ongoing price war, which has pressured margins industry-wide, and been a key driver behind TSLA's year-to-date losses. NIO also intends to launch a third brand next year, with starting prices below 200,000 yuan (around $27,870). Its business strategy going forward will be to chase higher margins with the NIO brand, where it won’t sell cars cheaper than its current ET5 model, while relying on mass-market brands to drive volumes. While I have been a NIO bull for quite some time, I will admit that the company has disappointed, and hasn’t lived up to the hype - even as other Chinese EV companies have raced ahead. BYD (BYDDY), for instance, became the largest EV seller globally in Q4, while Li Auto’s (LI) monthly deliveries now easily dwarf those of NIO and Xpeng Motors(XPEV). That said, I won’t give up on NIO stock just yet, even as the EV industry’s woes look far from over amid continued pricing pressures and overcapacity. NIO has a good product proposition with a strong brand, a strong balance sheet, and more recently, backing from CYVN Holdings - which is majority-owned by the Abu Dhabi government. NIO looks to be among those names that can survive the current EV industry slump, even as many startup EV companies seem doomed. However, investors should brace for more volatility ahead, as EV companies navigate a tough macro environment that's only made more difficult by the ever-rising competition. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}