{
    "title": "India Cuts EV Import Taxes, Meeting Tesla's Lobbying Goals - TeslaNorth.com",
    "date": "3/15/2024",
    "url": "https://teslanorth.com/2024/03/15/india-cuts-ev-import-taxes-tesla/",
    "text": " India, in a strategic move to boost electric vehicle (EV) manufacturing within its borders, announced on Friday a reduction in import taxes for EVs. This policy adjustment is contingent on automakers committing to an investment of at least $500 million and starting local production within three years. The move significantly benefits Tesla, aligning with the company’s long-sought objectives in the Indian market, reports Reuters. Tesla and CEO Elon Musk have been eyeing the Indian market for years. The company’s entry was contingent upon New Delhi’s requirement for a commitment to local manufacturing. This policy change follows Musk’s engagement with Prime Minister Narendra Modi and multiple visits by Tesla officials to India. In July, sources revealed Tesla’s proposal to build a $24,000 car in a new Indian factory, contingent on reduced import taxes. India’s new policy, effective immediately, permits qualifying companies to import up to 8,000 EVs annually, priced at $35,000 or above, at a reduced tax rate of 15%. The current tax rate stands at 70% or 100%, based on the vehicle’s value. India’s Commerce Minister Piyush Goyal, addressing the press, invited global companies to India, expressing confidence in India becoming a global hub for EV manufacturing. This move is expected to create jobs and boost trade. The Indian EV market, though currently small, is rapidly growing, with domestic player Tata Motors leading sales. EVs accounted for about 2% of total car sales in 2023, with a government target of 30% by 2030. The lowered tax rate will be available for a maximum of five years, with the duty foregone capped at the company’s investment or around $800 million, whichever is lower. India is the world’s third-largest auto market and offers a huge opportunity for EV carmakers. Tesla’s upcoming next-gen $25,000 EV could play a huge role in sales in India. The introduction of this policy has been a contentious issue, facing opposition from domestic manufacturers like Tata Motors and Mahindra & Mahindra. Following the announcement, the Nifty Auto index saw a decline, with Mahindra and Tata Motors experiencing notable stock drops. "
}