{
    "title": "Novo valuation surpasses Tesla on experimental obesity drug data",
    "date": "3/8/2024",
    "url": "https://www.businesstoday.in/technology/news/story/novo-valuation-surpasses-tesla-on-experimental-obesity-drug-data-420589-2024-03-08",
    "text": "Feedback Novo Nordisk NOVOb.CO on Thursday surpassed Tesla Inc TSLA.O in market valuation after the maker of the popular weight-loss drug Wegovy announced positive early trial data for a highly anticipated new obesity drug. Shares surged more than 8% to record highs, shooting Novo Nordisk up in global rankings to the 12th most valuable company from 14 previously, after it told investors a Phase I trial of the pill version of experimental drug amycretin showed participants lost 13.1% of their weight after 12 weeks. That compares to a weight loss of about 6% after 12 weeks and 15% after 68 weeks in trials for Wegovy, its blockbuster obesity drug. Investors welcomed the news as indicating Novo had more in its pipeline beyond its hugely successful Wegovy. Its shares have soared since launching the weekly injections in the United States in 2021. Novo's shares have risen more than three-fold since June 2021 when it launched Wegovy in the United States, last year becoming Europe's most valuable listed company, ahead of LVMH. On Thursday, its market valuation reached $566 billion, ahead of Tesla and Visa V.N, according to LSEG data. \"Novo has made clear that the amycretin molecule likely will form the foundation of the company's rapidly growing pipeline,\" said Guggenheim analyst Seamus Fernandez. Nearly half of Novo's current valuation is based on the company's pipeline of new experimental drugs such as amycretin, according to calculations by Berenberg analysts last week. Markus Manns, a portfolio manager at Union Investment in Germany and Novo shareholder, said the early read-out also compared favourably with other weight-loss pills in development, such as rival Eli Lilly's LLY.N orforglipron. Lilly's mid-stage trial showed its experimental pill led to 14.7% weight loss after 36 weeks for people who were obese or overweight. The U.S. drugmaker's shares slipped on the upbeat Novo update while shares in Zealand Pharma ZELA.CO, which is testing a similar treatment, jumped more than 9%. Wegovy belongs to a class of drugs known as GLP-1 agonists, originally designed to treat type 2 diabetes, that have been shown to reduce food cravings and empty the stomach more slowly. Following the success of these drugs, companies are working on other promising weight-loss therapies such as amycretin which targets a hormone called amylin in the pancreas that affects hunger. Wegovy was the first of a new group of highly effective weight-loss drugs to be launched. Novo and Lilly are so far the leaders in the obesity drug market, forecast by analysts to be worth $100 billion by 2030.  HEART DISEASE Novo Nordisk Chief Executive Lars Fruergaard Jorgensen said the obesity drug roll-out will be dominated  by injectable medicines, with oral versions introduced later in higher-priced markets. Pills require large amounts of active ingredients, making them costly to produce. Earlier in the day, he also announced the company was expanding its focus on diabetes and weight-loss therapies to include cardiovascular disease treatments. The change comes after the drugmaker last August said a large study. had shown Wegovy also had a clear cardiovascular benefit, boosting efforts by the company to move Wegovy beyond its image as a lifestyle drug. \"Any company that is so heavily exposed to one therapeutic area needs to try to develop other pillars to stand on,\" said Wolfgang Lickl, portfolio manager at KB-Vermögensverwaltung. \"The sheer success in diabetes and obesity will make that difficult, but the cardiovascular field makes sense because of the many synergies,\" he said. Following the August trial, Novo has been trying to convince sceptical medical insurers that the long-term benefits of Wegovy are enough to reduce the overall burden on healthcare systems and the cost of treating heart disease in overweight and obese people. It expects Wegovy to be approved  for sale in China as soon as this year, which would be its second-biggest market after the United States. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}