{
    "title": "Watch: Elon Musk shares Tesla's new FSD tested at night",
    "date": "3/26/2024",
    "url": "https://interestingengineering.com/transportation/watch-elon-musk-shares-teslas-new-fsd-v12-3-1-tested-at-night",
    "text": "The latest iteration of FSD, version 12.3.1, has garnered positive user feedback, citing significant performance improvements. By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time.  Elon Musk is doubling down on Tesla’s Full Self-Driving (FSD) Beta software aiming for a wider adoption. The controversial autopilot system, still in the testing phase, has received a recent confidence boost from Musk, leading to a multi-pronged promotional strategy. Musk-led Tesla is giving away the $12,000 worth of driver-assistance system as a one-month free trial for every customer in the US. The latest iteration of FSD, version 12.3.1, has garnered positive user feedback, citing significant performance improvements. This positive reception is a driving force behind Musk’s renewed enthusiasm for FSD Beta. The timing of this push also coincides with Tesla’s typical end-of-quarter sales drive, potentially adding another incentive for potential buyers. Under your supervision, FSD V12.3 can drive your Tesla almost anywhere https://t.co/saGGYNr05i Musk took to X (formerly Twitter) to reshare a Tesla video showcasing the FSD Beta’s capabilities. The video endorsed by Musk, highlights the system’s performance in handling nighttime obstructions. A user featured and who originally posted the video compliments the FSD Beta’s capabilities, stating, “FSD V12 handles a chaotic construction section like an expert, achieving smoothness I couldn’t have managed even on my first attempt.” This user testimonial, amplified by Tesla’s official platform, further underscores the company’s confidence in the improved FSD Beta. As per software tracker Teslascope, Elon Musk reportedly took a big leap forward with Tesla’s Full Self-Driving (FSD) Beta software. Musk fired off emails to Tesla staff in the early morning hours. These emails mandated two key changes. First, all new vehicles delivered in North America must now have FSD V12.3.1 installed and activated. Second, Tesla staff are required to take customers on a “short test ride” showcasing the FSD features before handing over the car. Musk acknowledged this could slow down deliveries but insisted it’s a non-negotiable requirement. His commitment to the FSD rollout continued with a follow-up email just minutes later. This email extended the requirement to install and test FSD on vehicles returning from service as well. This delay allows Tesla to gather additional data and ensure a seamless delivery experience. FSD Beta V12.3.1 is currently incompatible with the 2024 software builds used in newly manufactured Teslas. Additionally, all new Teslas require approximately 50-100 miles of driving for camera calibration before FSD Beta becomes available. First, let's talk about Full Self-Driving!This morning, Elon communicated his interest in making Full Self-Driving V12.3.1 immediately available to customers, even offering a short test ride before delivery.There are a couple of temporary roadblocks to this, which you'll be… pic.twitter.com/MKDnRFVJQL These obstacles force Tesla to find workarounds to implement Musk’s vision of pre-delivery FSD Beta demos. Teslascope also reports that a compatible version, FSD Beta V12.3.2, is being developed, it will be available for wider release next month. Tesla is also reportedly working on integrating FSD Beta into factory builds for the Model S, X, and Y. The refreshed Model 3 will also benefit from this update, marking its first inclusion of FSD Beta. Beyond logistical hurdles, Tesla’s FSD Beta pre-delivery demos raise unanswered questions. Tesla hasn’t clarified how they would handle potential accidents during test drives. Furthermore, they haven’t specified whether these test drives will be mandatory or optional. Mandatory test drives could frustrate customers who aren’t interested in FSD Beta and significantly lengthen delivery times. Tesla’s aggressive push for FSD Beta underscores Musk’s belief in the software’s progress. However, the success of this strategy hinges on resolving technical limitations, addressing customer concerns about liability during test rides, and ensuring transparency regarding the mandatory nature of these pre-delivery demonstrations.Tesla is also weeks away from a civil trial concerning the 2018 Autopilot-related death of Walter Huang. While Huang was distracted before the crash, his family’s lawsuit questions how Tesla marketed Autopilot’s functionality and whether enough was done to prevent its misuse. The NTSB, while only able to offer recommendations, found Tesla’s preventative measures insufficient. "
}