{
    "title": "Direxion Daily TSLA Bull 1.5X Shares (NASDAQ:TSLL) Shares Gap Down to $8.40",
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/direxion-daily-tsla-bull-1-5x-shares-nasdaqtsll-shares-gap-down-to-8-40.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Shares of Direxion Daily TSLA Bull 1.5X Shares (NASDAQ:TSLL – Get Free Report) gapped down before the market opened on Thursday . The stock had previously closed at $8.40, but opened at $8.23. Direxion Daily TSLA Bull 1.5X Shares shares last traded at $8.26, with a volume of 2,532,916 shares. The stock has a 50-day moving average price of $9.09 and a 200 day moving average price of $12.38. The company also recently declared a quarterly dividend, which was paid on Tuesday, March 26th. Shareholders of record on Wednesday, March 20th were given a dividend of $0.0788 per share. This represents a $0.32 annualized dividend and a yield of 3.89%. The ex-dividend date  was Tuesday, March 19th. A number of institutional investors and hedge funds have recently added to or reduced their stakes in TSLL. Renaissance Technologies LLC increased its holdings in shares of  Direxion Daily TSLA Bull 1.5X Shares by 134.0% in the 2nd quarter. Renaissance Technologies LLC now owns 234,000 shares of the company’s stock valued at $4,061,000 after acquiring an additional 134,000 shares during the period.  Jane Street Group LLC purchased a new position in  Direxion Daily TSLA Bull 1.5X Shares during the 4th quarter worth $836,000.  Simplex Trading LLC increased its stake in  Direxion Daily TSLA Bull 1.5X Shares by 122.1% in the third quarter. Simplex Trading LLC now owns 95,631 shares of the company’s stock valued at $1,479,000 after purchasing an additional 52,579 shares during the period.  Clarity Capital Partners LLC purchased a new stake in shares of  Direxion Daily TSLA Bull 1.5X Shares in the fourth quarter valued at about $1,058,000.  Finally, First City Capital Management Inc. acquired a new stake in shares of  Direxion Daily TSLA Bull 1.5X Shares during the third quarter worth about $1,053,000. (Get Free Report) Featured Stories\n\nFive stocks we like better than Direxion Daily TSLA Bull 1.5X Shares\nESG Stocks, What Investors Should Know\n3 Value Stocks Too Small For Buffett’s Portfolio\nThere Are Different Types of Stock To Invest In\nFoot Locker Builds Up Another Head of Steam; Gains Imminent\nWith Risk Tolerance, One Size Does Not Fit All\nDisney Stock Catches 3 Upgrades In a Single Week\n\n\n\n\n\n\n\nReceive News & Ratings for Direxion Daily TSLA Bull 1.5X Shares Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Direxion Daily TSLA Bull 1.5X Shares and related companies with MarketBeat.com's FREE daily email newsletter.  Receive News & Ratings for Direxion Daily TSLA Bull 1.5X Shares Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Direxion Daily TSLA Bull 1.5X Shares and related companies with MarketBeat.com's FREE daily email newsletter. Vanguard Russell 2000 Growth ETF (NASDAQ:VTWG) Sees Unusually-High Trading Volume Matterport (NASDAQ:MTTR) Sees Large Volume Increase "
}