{
    "title": "If Tesla is looking to invest in a progressive state, TN is the answer: TRB \nRajaa",
    "date": "1/9/2024",
    "url": "https://www.moneycontrol.com/news/technology/if-tesla-is-looking-to-invest-in-a-progressive-state-tn-is-the-answer-trb-rajaa-12019421.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Tamil Nadu offers American automotive giant Tesla the perfect Indian investment destination, said State Minister for Industries, Investment Promotions and Commerce TRB Rajaa. On Monday, the 47-year-old spoke to Moneycontrol in an exclusive interview on the sidelines of the third edition of Global Investment Meet (GIM) in Chennai. The two-day GIM that concluded on January 8, brought Rs 6.64 lakh crore in proposed investments along with 26.9 lakh prospective jobs in the state. This well surpasses the expected investment of 5 lakh crore. Rajaa said he hopes to see 70 percent of them being converted into actual investments as opposed to 15-25 percent under the previous AIADMK government. Son of former Union cabinet minister TR Baalu, Rajaa was sworn in as the Tamil Nadu Industries minister in May 2023 and GIM was the first major test of his administrative and organisational skills. Excerpts from the interview: Your government appears to have timed GIM ahead of the Vibrant Gujarat summit. There are reports that Tesla may invest in Gujarat… If Tesla's Elon Musk is interested in manufacturing in a green, clean, and progressive state with upcoming policies on diversity, equity and inclusion (DE&I) policy, transgender, and LGBTQI inclusion, and a commitment to diversity in the workforce, Tamil Nadu is the answer. Our talent pool is diverse, and we are the most inclusive, equitable, and sustainable state. Investing in Tamil Nadu also allows businesses to tap into our talented workforce, ensuring a quick return on investment. With such a conducive environment, why would you want to go elsewhere? But it’s being said that Gujarat could be the frontrunner… We are delighted as long as they (Tesla) invest in India. We welcome every major company to establish a presence in our country. If a company recognises the value here (Tamil Nadu) and believes there's potential, we extend an invitation. However, we are not in a desperate state; we judiciously utilise our incentives. We prioritise spending funds responsibly and are particularly keen on creating specific types of employment. We value relationships built on mutual respect with all industries, especially in manufacturing, where we proudly hold the title of the manufacturing capital of India, with 45,000 factories and many more in the pipeline. Also, read: TN GIM 2024: Tamil Nadu pulls all stops to woo investors ahead of Vibrant Gujarat meet How do you assess the response to the Global Investment Meet? The response has been beyond our expectations, with lakhs of crores of investments and jobs. Every hall was overflowing with diverse participants, including youngsters, college students, young entrepreneurs, new investors, and homegrown investors. This is the third edition of the GIM in the state. What has been the conversion rate of previous GIM editions? Earlier editions of GIM conducted by the previous AIADMK government were largely for publicity purposes. What we’re doing now is business. The conversion rate of those GIM promises/MoUs was only 15- 25 percent. So, I wish to see 70 percent of the investment promises of this GIM being converted into reality. Every company has its problems, and the market situation might change. Everybody will be happy with anything above a 50 percent conversion rate, but I'm looking at 70 percent. I’m very bullish about that; I think we’ll come close. What do you think are Tamil Nadu’s roadblocks/ weaknesses? We have always been a very reserved state. It’s a weakness. We weren’t open about our strengths. But now things are changing, we have started to communicate more, and people are beginning to understand the true significance of Tamil Nadu. We are not just about culture, heritage or tourism. We take pride in being the manufacturing behemoth of India, driving the country's industrial power. Tamil Nadu plays a crucial role in powering India, yet this fact may not be widely known because it hasn't been marketed effectively. Experts cite the lack of social infrastructure in the cities of Tamil Nadu and argue that the state’s liquor policy is outdated. How would you respond? Contrary to perception, the social infrastructure in our region is fantastic, and we take great pride in our responsible and cosmopolitan community. It's not a place where people laze around; life here is very hectic. We have become the second-biggest economy through hard work, and there is still much more to accomplish. We are actively focusing on enhancing women's participation in the workforce, developing technical expertise, and investing in research and development. This progressive approach is at an advanced stage, and we believe that social infrastructure will naturally follow. Expect to see more progressive policies being implemented in the future. Also read: TN GIM 2024: Tata Power, Adani Green and Sembcorp announce major investments in energy sector How do you view competition from other states? We don’t measure ourselves against other states; our comparisons are with Scandinavian countries. By abiding by global standards, we project to become the 45th largest economy worldwide. Our scale is on par with countries, not just states, and the numbers speak volumes. When you consider the workforce, 43 percent of all working women in India are from Tamil Nadu, a figure unmatched elsewhere. So, how do you plan to take this forward? This marks the start of a journey; it doesn’t end today or tomorrow. It’s just the beginning. Our next stop is Davos (World Economic Forum), where we will present a substantial pitch. Subsequently, we plan to expand our outreach to Europe and Australia.  DAILY-EVENING DAILY-EVENING Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}