{
    "title": null,
    "date": "1/6/2024",
    "url": "https://www.businessinsider.com/tesla-board-director-worried-elon-musk-drug-use-wsj-2024-1",
    "text": "       A former director at Tesla was so concerned about Elon Musk's drug use and unpredictable behavior that she chose not to stand for reelection to the electric car company's board, according to a new report from The Wall Street Journal. Linda Johnson Rice, who served a two-year term on the company's board ending in 2019, confided in Tesla board members on more than one occasion about her worries related to his substance use, The Journal reported. Rice also informally asked if the board should investigate Musk's drug use — which includes ketamine, LSD, cocaine, and ecstasy, according to people familiar with the matter — but her concerns were ignored, per the outlet. Related stories The extensive report from The Journal details how executives across Musk's companies have grappled with how to manage his drug use and erratic public appearances and statements. At Tesla, some current directors have sought out help from Musk's brother, Kimbal, over his behavior, but The Journal reported they have been careful not to use the word \"drugs\" when relaying their concerns. According to the outlet, others have speculated the billionaire businessman was under the influence when he tweeted in 2018 that he had \"funding secured\" to take the car company private at $420 a share. The tweet, which shot Tesla shares up 6% the following day, triggered an SEC investigation that resulted in $40 million worth of fines against Musk — though he did not admit wrongdoing. Musk, who told biographer Walter Isaacson that he \"really\" doesn't like taking illegal drugs, has also told people he microdoses ketamine, has been seen using the drug recreationally, and publicly stated that, taken occasionally, ketamine \"is a better option\" than treating depression with SSRIs. He also famously smoked weed with Joe Rogan while filming an episode of Rogan's podcast, prompting NASA to launch a safety review of SpaceX that Musk has said resulted in the whole of the company needing to take drug tests for a year. Representatives for Musk did not immediately respond to a request for comment from Business Insider, but an attorney for the world's richest man told The Journal that Musk is \"regularly and randomly drug tested at SpaceX and has never failed a test.\"  Read next Jump to "
}