{
    "title": "Warren Buffett Backed BYD Overtakes Tesla As World's Largest EV Maker",
    "date": "1/4/2024",
    "url": "https://www.indiatimes.com/worth/news/tesla-shares-fall-warren-buffett-backed-byd-worlds-largest-ev-maker-624717.html",
    "text": "Despite being just about one-tenth the size of Tesla (in terms of market capitalization), its rival BYD has done something not many around the world would have expected. getty Warren Buffett-backed BYD has just pulled ahead of Tesla to become the world’s largest manufacturer of electric vehicles. Not even record sales could prevent Elon Musk’s Tesla from losing the crown. Its Chinese rival BYD, in the final months of 2023, overtook Tesla for the first time ever in a quarter. And given the fast pace of growth at BYD, it doesn’t seem likely that Musk will reclaim the title easily. The vast volume of its sales in China, combined with a growing number overseas, has meant that BYD overtook its American rival Tesla in the December quarter. The 526,409 EVs sold over the period by BYD pipped Tesla’s December quarter sales of 484,507, as per a Bloomberg report. Also, Elon Musk's Tesla sold nearly 1.81 million cars in 2023, which is higher than BYD's number, which delivered 1.59 million fully electric vehicles in 2023. The news of BYD overtaking Tesla has resulted in not only Elon Musk's net worth falling $7 billion in a single day, but even Tesla stock has bled too. Tesla shares fell 4% yesterday on NASDAQ, which hurt its CEO Musk's net worth too. Tesla's market cap stands at $747 billion currently, whereas BYD's market cap stands at $78 billion (CNY 558.19 billion). fortune To many, BYD still remains a little-known car brand, more familiar from media coverage citing Warren Buffett’s 2008 investment in the Chinese EV maker. A subsidiary of Warren Buffett’s Berkshire Hathaway had made a $230 million investment in BYD in 2008, buying a 10 percent stake in it. Fast forward to 2023; after the partial stake sale in the October quarter, Berkshire Hathaway's holdings in BYD's shares stood at 7.98%. it had sold 820,500 Hong Kong-listed shares of BYD for HK$201.73 million ($25.78 million) back then. It's noteworthy that Warren Buffett has not yet invested in Elon Musk's Tesla, despite the world's richest person once hinting at his conglomerate Berkshire Hathaway to invest in Tesla. getty Also Read: How Elon Musk Had Almost Sold Tesla To Google For $6 Billion If its current growth trajectory continues, BYD’s relatively little-known status outside China seems set to change drastically. In 2024 and the coming years, BYD certainly holds the potential to join the ranks of Tesla, Hyundai, Toyota, Ford, and Volkswagen in the league of big brands in the auto sector. For the latest and more interesting financial news, keep reading Indiatimes Worth. Click here Get the NEWS that fits your groove. Subscribe to Indiatimes Newsletter and get handpicked updates based on your interests! Connect With Us On "
}