{
    "title": "Tesla's updated Model 3 sedan comes to the US",
    "date": "1/10/2024",
    "url": "https://finance.yahoo.com/video/teslas-updated-model-3-sedan-221458799.html",
    "text": "Tesla (TSLA) is finally bringing its updated Model 3 sedan to the United States and Canada. Until now, the first major revamp of the Model 3 was only available in China, from which it was exported to other parts of the world. The updated Model 3 will cost the same as the old Model 3. Yahoo Finance's Pras Subramanian, Madison Mills, and Josh Schafer discuss the news. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich PRAS SUBRAMANIAN: Tesla finally gave its US and Canadian-based customers and fans the updated Model 3 we'd all been waiting for. This was dubbed Project Highland, came out in Europe and China earlier this year. I've been waiting for it earlier last year. It's got a revamped exterior, new suspension, which, I heard, is a big deal, rides better, better control, better handling, a new screen in the back, better seats, things like that, all for the same price at $38,900. So I'm actually surprised it kept that same price. But I don't know, but I think it might actually move the needle there for Tesla. Model 3 was getting long in the tooth. I think it's going to help for Q1. JOSH SCHAFER: I'm curious if this is just something that people that already own Teslas are excited about, and maybe they go out and buy a new Tesla, versus does this bring new consumers into the Tesla market, right? Because it seems like right now, at least from what I saw online today, a lot of the Tesla community is excited about this. And we know the Tesla community is very outspoken online. And I'm glad that they're excited. That new car looks pretty similar to the old model 3 to me. It still got that big, fat back that I never really liked. MADISON MILLS: I'm fascinated about how much you hate the look of this. JOSH SCHAFER: I think it's just a little ugly. MADISON MILLS: It looks like every other car to me. JOSH SCHAFER: I just think it's pretty ugly. MADISON MILLS: That looks like a car to me. I don't understand. JOSH SCHAFER: I mean, it looks like a car. That's great. MADISON MILLS: Like, what about the look is that bad? JOSH SCHAFER: And I think it's going to sell like a car. And like Tesla probably needs it to sell better than a normal car, is sort of my point. I don't know. I expect more out of Mr. Musk and Tesla from a design standpoint. MADISON MILLS: That's fair. That's fair. I'm still waiting on the cheaper version. That's what I feel like, Pras. I'm coming to you looking for them to get that market share on, is if they can have the cheaper model out. PRAS SUBRAMANIAN: Well, that big fat back, I mean, maybe that'll help the-- your numbers. JOSH SCHAFER: All right, we got to go find one of these new model 3's to take a spin in with Pras. Related Quotes "
}