{
    "title": "Judge voids Elon Musk's 'unfathomable' $56 billion Tesla pay package",
    "date": "1/30/2024",
    "url": "https://bdnews24.com/technology/k1sd69tog0",
    "text": "A Delaware judge tossed out Elon Musk's record-breaking $56 billion Tesla TSLA.O pay package on Tuesday, calling the compensation granted by the EV maker's board \"an unfathomable sum\" that was unfair to shareholders. Shares of Tesla dropped about 3% in extended trade, and some investors seized on the ruling in hopes it might prompt Tesla to overhaul its governance. The Tesla board has been criticized as failing to provide oversight of its combative, headline-making CEO, who has fought regulators and led several other companies at the same time. The ruling, which can be appealed, nullifies the largest pay package in corporate America. The judge found the share-based compensation was negotiated by directors who appeared beholden to Musk, currently ranked by Forbes magazine as the world's richest person. \"Swept up by the rhetoric of 'all upside,' or perhaps starry eyed by Musk’s superstar appeal, the board never asked the $55.8 billion question: Was the plan even necessary for Tesla to retain Musk and achieve its goals?\" wrote Kathaleen McCormick of Delaware's Court of Chancery. McCormick directed the Tesla shareholder who challenged the pay plan to work with Musk's legal team on an order implementing the decision. It can be appealed to the Delaware Supreme Court once the parties agree on a final order and on fees for the shareholder's attorneys, which will be paid by Tesla. The decision comes as Tesla warns of slowing growth and the electric vehicle industry is re-evaluating demand. Tesla has become the world's most valuable automaker under Musk, but much of that value is based on expectations of future breakthroughs, such as self-driving robotaxis. \"Never incorporate your company in the state of Delaware,\" Musk said in a post on X, the social media platform he bought in 2022. Musk's lawyer did not immediately reply to an email seeking comment. \"Good day for the good guys,\" said an email from Greg Varallo, an attorney for Tesla shareholder Richard Tornetta, who brought the lawsuit in 2018. CEO COMPENSATION \"The incredible size of the biggest compensation plan ever - an unfathomable sum - seems to have been calibrated to help Musk achieve what he believed would make 'a good future for humanity',\" wrote McCormick in her 201-page opinion. Musk testified during the week-long compensation trial in November 2022 that the money would be used to finance interplanetary travel. \"It's a way to get humanity to Mars,\" he testified. \"So Tesla can assist in potentially achieving that.\" Tesla's 10-year pay agreement with Musk reached in 2018 would be worth around $51 billion at Tuesday's closing price for Tesla stock, accounting for the cost to Musk to exercise the options. That would be about a quarter of his $210.6 billion fortune, as calculated by Forbes magazine, which currently ranks about $2 billion ahead of LVMH LVMH.PA CEO Bernard Arnault of France and his family. The ruling comes as Tesla is preparing another round of compensation negotiations with the CEO. Musk said in a post on X this month that he was uncomfortable leading Tesla unless he had 25% of the voting control. The billionaire owned around 13% of the company at the time and he said negotiations would not start until McCormick had ruled. \"Given the way she describes the board process - through the testimony of the directors - there is no way that his most recent demand for 25% can get approved,\" Brian Quinn, a professor at Boston College Law School, said. \"It's dead on arrival.\" McCormick wrote that many of the directors on Tesla's board, including current members Kimbal Musk, Elon Musk's brother, and James Murdoch, son of media tycoon Rupert Murdoch, lacked independence because of their close personal ties with the CEO. Two of Tesla's other current directors, Robyn Denholm and Ira Ehrenpreis, showed a lack of independence in the pay decision, she said. The board currently has eight members including its CEO. Ross Gerber, president and CEO at Gerber Kawasaki Wealth & Investment Management and a Tesla investor, told Reuters the ruling showed the company needed to replace at least three directors with independent board members before it can negotiate a new pay package for Musk. \"Essentially, the entire corporate structure of Tesla has been deemed, like not appropriate for a public company,\" Gerber said. Tesla directors argued during the trial that the company was paying to ensure one of the world's most dynamic entrepreneurs continued to dedicate his attention to the electric vehicle maker. Antonio Gracias, a Tesla director from 2007 to 2021, called the package \"a great deal for shareholders\". Tornetta's lawyers argued the Tesla board never told shareholders the goals were easier to achieve than the company was acknowledging and that internal projections showed Musk was quickly going to qualify for large portions of the pay package. The plaintiff's legal team also argued the board had a duty to offer a smaller pay package or look for another CEO and that they should have required Musk to work full-time at Tesla instead of allowing him to focus on side projects, like SpaceX and X. Kristin Hull, founder of Tesla investor Nia Impact Capital, described the board as beholden to Musk, a problem she said is common at other big technology companies. \"This is the bro-show,\" she said of the situation. The pay package granted stock option awards for approximately 304 million shares that Musk can buy at about $23.33 each, well below $191.59 where it closed on Tuesday. Musk earned all 12 tranches of stock option awards as Tesla hit escalating financial and operational goals. Musk has not exercised any of the options and once he does he is required to hold the shares for five years before selling, according to McCormick. He was not guaranteed any salary. Tesla's value ballooned to briefly top $1 trillion in 2021 from $50 billion when the package was negotiated. Amit Batish at Equilar, an executive pay research firm, estimated in 2022 that Musk's package was around six times larger than the combined pay of the 200 highest-paid executives in 2021. Editor-in-Chief and Publisher: Toufique Imrose Khalidi Copyright © 2023, bdnews24 "
}