{
    "title": "Hertz sheds EVs after 100,000-Tesla order in 2021",
    "date": "1/11/2024",
    "url": "https://fortune.com/2024/01/11/hertz-sheds-evs-after-100000-tesla-order-in-2021/",
    "text": "Hertz Global Holdings Inc. plans to sell a third of its US electric vehicle fleet and reinvest in gas-powered cars due to weak demand and high repair costs for its battery-powered options. The sales of 20,000 EVs began last month and will continue over the course of 2024, the rental giant said Thursday in a regulatory filing. Hertz will record a non-cash charge in its fourth-quarter results of about $245 million related to incremental net depreciation expense. The dramatic about-face, after Hertz announced plans in 2021 to buy 100,000 Tesla Inc. vehicles, underscores the waning demand for all-electric cars in the US. EV sales growth slowed sharply over the course of 2023, rising just 1.3% in the final quarter as consumers were put off by high costs and interest rates. “The elevated costs associated with EVs persisted,” Hertz Chief Executive Officer Stephen Scherr said in an interview. “Efforts to wrestle it down proved to be more challenging.” Hertz’s shares fell 4.3% to $8.95 as of 10:01 a.m. in New York. The stock declined 32% last year. Going forward, Hertz will keep a close eye on EV demand both at dealerships and within its own operations to decide whether the company should buy more vehicles, Scherr said. That means its agreement to buy 175,000 EVs from General Motors Co. over the next four years and another 65,000 from Polestar may take much longer to complete, he said. Hertz plans to use some of the money raised by selling off EVs to buy gas-powered vehicles. “The company expects this action to better balance supply against expected demand of EVs,” it said in the filing. The shift back to more conventional cars marks a reversal of a strategy centered on EVs, which the company hoped would fetch higher prices at the counter and hold their value. Tesla’s price cuts over the past year lowered the value of the cars in Hertz’s fleet and with EV sales growth slowing, it’s not clear if consumers will have an appetite for them in the used-car market. Hertz is keen on GM’s plan to sell cheaper EVs, like a future redesign of the Chevolet Bolt, which sold for under $30,000 before ending production last year, and a $35,000 Chevy Equinox that is going into production. Those vehicles could be easier to rent profitably, Scherr said. “We’re committed to the strategy” Scherr said. “It will take more time to execute it.” The plan to unload EVs should improve Hertz’s cash flow and earnings this year and next. By year-end 2025, the company expects improved financial results driven by higher revenue per day and lower depreciation and operating expenses. The company sees incremental free cash flow of as much as $300 million in the aggregate over 2024 and 2025. Scherr had signaled this shift would come, saying in October that the company would scale back on EVs, which had made up 11% of its total fleet. Teslas represented 80% of that. Tesla’s price cuts raised his company’s depreciation costs, Scherr said. EVs also come with higher repair costs compared to the rest of its cars, which has hurt its bottom line and played a big role in missing third-quarter earnings estimates. “EV’s will be slower than our prior expectations,” he said during the company’s third-quarter earnings call. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}