{
    "title": "Forming RAM - Ram Mandir craze peaks: US Tesla owners hold car light show, \nsee pics",
    "date": "1/15/2024",
    "url": "https://m.economictimes.com/nri/latest-updates/ram-mandir-craze-peaks-us-tesla-owners-hold-car-light-show-see-pics-that-went-viral/forming-ram/slideshow/106866615.cms",
    "text": "A week before the grand opening of the Ram Mandir in Ayodhya, Ram Bhaktas organised car rallies in 21 US cities. The enthusiastic attendees in the nation's capital created a unique musical performance featuring Tesla cars, all in honour of Lord Ram. Over 100 Ram Bhakts, each owning a Tesla Car, gathered at Shri Bhaktha Anjaneya Temple in Frederick City -- a Maryland suburb of Washington DC -- on Saturday night. They used one of the key features of Tesla cars wherein the headlights and speakers of these Tesla cars synced with a popular number dedicated to Lord Ram. Introduced in 2022, the light-flashing-set-to-music feature is available in certain categories of its models with the particular software update. According to the organisers of the Tesla Music Show, Vishwa Hindu Parishad of America, more than 200 Tesla Car owners had registered for the event and they had to turn on a significantly large number of them. Drone pictures taken by the event organisers showed that these Tesla Cars created a \"RAM\" by placing these cars in such a way. \"Today we had the Tesla Ram Bhagwan musical event on the occasion of the inauguration of the Ram Temple in Ayodhya. We are grateful to the generation of Hindus over the last 500 years to have struggled for the Ram Temple in Ayodhya,\" said Mahendra Sapa, president of the DC chapter of VHP America, organisers of the Tesla musical event. \"The Tesla light show is just the beginning of the celebration of the Ram Temple inauguration,\" said Animesh Shukla, one of the volunteer organisers. VHPA plans to organise similar light shows on January 20, he said. VHP America, which is leading the Ram temple celebrations in the US, on Saturday held car rallies in as many as 21 cities: Atlanta, Austin, Boston, Carmel (Indiana), Cary and Charlotte in North Carolina, Chicago, Denver in Colorado, Edison in New Jersey; Houston, Austin and San Antonio in Texas' New York, Phoenix, Portland; Sacramento, San Francisco and Simi Valley in California; Seattle and St Louis. More such rallies were scheduled on Sunday as well. Trending Now Hot on Web In Case you missed it Top Calculators Follow us on: Log In/Connect with: Will be displayed Will not be displayed Will be displayed "
}