{
    "title": "Competition from China's EV players overwhelms Tesla – Scot Scoop News",
    "date": "1/29/2024",
    "url": "https://scotscoop.com/tesla-overwhelmed-by-competition-from-chinas-ev-players/",
    "text": "Chinese electric vehicle (EV) maker BYD poses significant competition for Tesla. BYD recently surpassed Tesla as the world’s top-selling EV brand during the final quarter of 2023 as it sold 526,409 pure electric vehicles, about 40,000 more than Tesla did during the same period. Around the same time, China became the largest car exporter in the world as it overtook Japan. Tesla shares fell 12% last week, their most significant drop over a year after the company reported earnings that fell short of expectations and warned that vehicle volume growth in 2024 may be lower than last year’s growth rate. Tesla failed to meet estimates as it reported a revenue growth of 3% in the fourth quarter and a minor increase of 1% in auto revenue from the previous year. On top of a slowing growth rate, Tesla can no longer compete with the amenities of Chinese EVs. The Huawei Aito M9, a popular Chinese EV, includes a refrigerator, collapsible front seats, and a projection capability that displays information on the road ahead. Huawei Aito M9 vs. Tesla Model Y  Chinese automakers, including BYD, Nio, and Xpeng, have also taken sales outside of China as they look to compete with other companies. Many Chinese automakers are lowering car prices, which has impacted their profit margins. According to data released by the Chinese Passenger Car Association, China’s automobile industry saw a profit margin of only 5% — a decrease from 5.7% in 2022 and 6.1% in 2021. China’s automobile industry can thrive with slim profit margins because of help from the government. According to the Vice Minister of Finance of China, over $28 billion was spent on EV manufacturing subsidies and tax breaks in China over the 2009-2022 period to develop a globally competitive industry. Many lawmakers are starting to investigate this government support. Last September, the European Commission initiated an investigation into subsidies for Chinese EV brands. A few months later, the Biden administration made vehicles utilizing Chinese-made battery parts ineligible for consumer tax credits. To further reduce heavy competition, the U.S. imposes a 25% levy on imported Chinese cars on top of a general 2.5% tariff on all auto imports. As of now, BYD does not sell cars in the U.S. because of tariffs, but they are sold commercially in Europe, Southeast Asia, Oceania, and South America. Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email *   Δ "
}