{
    "title": "Elon Musk seeks 25% voting share at Tesla",
    "date": "1/16/2024",
    "url": "https://m.economictimes.com/tech/technology/elon-musk-seeks-25-voting-share-at-tesla/articleshow/106880922.cms",
    "text": " 5 Stories 7 Stories 9 Stories 9 Stories 8 Stories 6 Stories  IPO report card: 2024 can be one of the best years by listing gains. But investors must be cautious. JSW’s EV juggernaut: Odisha gets an INR40k crore project, and MG an Indian touch From Leh to Varanasi, via Vikhroli: Sister takes Pepperfry’s Ambareesh Murty on his final journey No free gifts to doctors, but latest government diktat is still not effective Indians shell out as much as Americans on transportation. And it’s a worrying sign. Here’s why. Retail investors ride momentum in the hunt for multibaggers. How long will the party last? Trending Now Hot on Web In Case you missed it Top Calculators Top Commodities Top Slideshow Top Videos Top Definitions Top Prime Articles Private Companies Top Searched Companies Top Story Listing Follow us on: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin. Log In/Connect with: Will be displayed Will not be displayed Will be displayed Worry not. You’re just a step away. It seems like you're already an ETPrime member with Login using your ET Prime credentials to enjoy all member benefits Log out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.  To read full story, subscribe to ET Prime ₹34 per week Billed annually at \n                    ₹2499 ₹1749 Super Saver Sale - Flat 30% Off On ET Prime Membership Offer Exclusively For You Save up to Rs. 700/- ON ET PRIME MEMBERSHIP Offer Exclusively For You Get 1 Year Free With 1 and 2-Year ET prime membership Offer Exclusively For You Get 1 Year Free With 1 and 2-Year ET prime membership Offer Exclusively For You Get Flat 40% Off Then  ₹ 1749 for 1 year Offer Exclusively For You ET Prime at ₹ 49 for 1 month Then  ₹ 1749 for 1 year Stay Ahead in the New Financial Year Get flat 20% off on ETPrime     90 Days Prime access worth Rs999 unlocked for you Exclusive Economic Times Stories, Editorials & Expert opinion across 20+ sectors Stock analysis. Market Research. Industry Trends on 4000+ Stocks ​Get 1 Year Complimentary Subscription of TOI+ worth Rs.799/-​ Stories you might be interested in "
}