{
    "title": "Want $1 Million in Retirement? 4 Stocks to Buy Now and Hold for Decades",
    "date": "1/21/2024",
    "url": "https://www.fool.com/investing/2024/01/21/want-million-retirement-stocks-to-buy-and-hold/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More While inflation over the decades has reduced the value of $1 million, having that amount in your retirement account is still a great goal to strive for. It's still far more than the $87,000 the average American household has set aside for retirement. Upping your wealth-building game comes down to finding great companies, investing in them, and then letting years of growth compound and do the heavy financial lifting for you. Industrials are a great place to look. These four remarkable companies help build (and rebuild) the modern world. Consider buying them. They can bring you closer to a bright financial future as part of a diversified stock portfolio. Electric vehicles (EVs) have gone from a niche product to an entire industry, and could eventually overtake gas engines as the primary technology in automotive. Tesla (TSLA -2.25%) played a massive role in making this happen, and the stock rewarded shareholders with life-changing returns over the past decade. It wasn't always easy, but today, Tesla is a profitable company with over $95 billion in annual sales.  TSLA Total Return Price data by YCharts The EV giant delivered over 484,000 vehicles in the fourth quarter, while U.S. competitors like Ford Motor Company are struggling to grow their production numbers. According to J.D. Power, less than 1% of vehicles in America are electric. That leaves a long runway for Tesla to continue taking market share over the coming decades. That's not including Tesla selling EVs globally and having multiple other businesses, including artificial intelligence and energy storage. Construction never stops, and the constant need to move large amounts of rock and earth has made Caterpillar (CAT 0.49%) a remarkable investment that's beaten the broader market for years. Drive by any construction site, and you'll probably spot the company's famous Caterpillar yellow machinery. Caterpillar has become a diversified business that makes money by selling machines and financing and servicing them.  CAT Total Return Price data by YCharts Caterpillar is a cyclical stock, meaning it's sensitive to economic ups and downs. While not every cyclical business manages itself well enough to endure the volatility, Caterpillar's ability to pay and raise its shareholder dividend through multiple recessions, a streak at 30 years and counting, shows that it can. An endless need for worldwide construction and commodity mining should ensure years of robust demand for Caterpillar's machines. Diversity can help an industrial business get through the economic volatility that industrial companies face. Illinois Tool Works (ITW 0.04%) has mastered this. The company is a collection of smaller (but very lucrative) businesses in end markets like automotive, food and beverage, materials, construction, testing, welding, and more. When one segment slumps, another is usually doing well. Illinois Tool Works has grown enough to raise its dividend for 60 consecutive years and trounce the S&P 500 simultaneously.  ITW Total Return Price data by YCharts Illinois Tool Works is transitioning from a phase of being focused on efficiency, raising margins, and divesting some less profitable assets to a more aggressive approach that could see more acquisitions in the future. Management is targeting 9% to 10% annualized earnings growth for the remainder of the decade. The company's long track record means investors should feel optimistic that the stock will continue providing steady returns that compound into significant wealth over time. Lithium is a core material for everything with batteries, which sets up Albemarle (ALB 2.28%) for a bright future. It mines and refines lithium, as well as other specialty materials. A company like Albemarle that sells a commodity can be very volatile. For example, lithium prices have decreased over the past year, which has pressured Albemarle's business. However, a great company can navigate challenging waters, and Albemarle has paid and raised its dividend for 29 consecutive years, a testament to its resilience.  ALB Total Return Price data by YCharts Since commodity prices fluctuate, investors will likely experience ups and downs while holding Albemarle stock. But there is a clear path to long-term growth. The company is developing mines worldwide to expand its lithium output. It believes capacity could triple by 2030 to as much as 650 KTPA (thousand tonnes per annum). Given the expected multidecade transition to electric vehicles, Albemarle's business should remain strong for years. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}