{
    "title": "Tesla’s stock hasn’t fallen enough — this analyst sees a further 30% \ndownside",
    "date": "1/26/2024",
    "url": "https://www.marketwatch.com/story/teslas-stock-hasnt-fallen-enough-this-analyst-sees-another-30-downside-76e3f580",
    "text": "Although Tesla Inc.’s stock already took a sound beating after yet another disappointing earnings report this week, one analyst believes it wasn’t punished nearly enough. The EV giant’s stock \n        TSLA,\n        -2.25%\n       had tumbled 12.1% on Thursday, after the company reported a fourth-quarter profit and revenue miss and provided a downbeat 2024 outlook late Wednesday. That marked the fourth straight quarter the stock has suffered sharp one-day post-earnings-report selloffs; the stock has dropped an average of 10.2% on those days. Read: ‘Train wreck’ earnings call has even the bulls begging Tesla’s executives to behave like adults. But as longtime bear J.P. Morgan analyst Ryan Brinkman said, even after Thursday’s selloff, “the stock to us seems in comparison to have hardly noticed,” which to him suggests “plenty of further downside potential.” He reiterated the underweight rating he’s had on Tesla’s stock for at least the past three years, and trimmed his price target to $130 from $135. The new target implies 29% downside from Thursday’s closing price of $182.63. The stock bounced 1.2% in morning trading Friday. Brinkman’s biggest beef is that investors haven’t “criticized” Tesla’s stock enough for its strategy to cut prices, and sacrifice profit for vehicle sales. When traditional automakers did the same thing in the past, Brinkman noted they were “rightly criticized,” as discounting and “dumping” vehicles into rental car fleets to boost sales in effect destroyed residual values of used vehicles, future vehicle margins and brand equity. Read: Hertz’s stock gets downgraded, and Tesla has a lot to do with it. But when Tesla did the same thing, investors actually cheered. The stock rocketed 101.7% in 2023, even as the FactSet consensus for 2024 net income sank 45%, to $13.65 billion at the end of 2023 from $24.94 billion at the end of 2022. The consensus has fallen further in January, to $11.35 billion. And Brinkman argues that since October 2022, when 2024 profit expectations peaked just before Tesla adopted the price-cutting strategy, the stock has roughly been little changed while profit expectations have tumbled about 60%. Brinkman is certainly in the minority on Wall Street, as only seven of the 49 analysts surveyed by FactSet who cover Tesla are bearish. Among the others, 19 are bullish and 22 are neutral. Meanwhile, the average stock price target of those surveyed is $221.25, which implies 23% upside from Thursday’s close, and is 70% above Brinkman’s target. Tesla’s stock has declined 10.1% over the past three months, while Global X Autonomous & Electric Vehicles ETF \n        DRIV\n       has gained 10.1% and the S&P 500 index \n        SPX\n       has advanced 18.5%. In 2021, Glen Taylor agreed to sell the Minnesota franchise for $1.5 billion. The team is now likely worth at least $2.5 billion. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Visit a quote page and your recently viewed tickers will be displayed here. "
}