{
    "title": null,
    "date": "2/3/2024",
    "url": "https://investorplace.com/2024/02/3-stocks-to-avoid-at-all-costs-in-the-volatile-tech-sector/",
    "text": " These tech stocks aren't the best picks as the market gets more volatile Advertisement Source: shutterstock.com/Ink Drop Many investors gravitate toward the tech sector for innovative companies that can outperform the market. The internet, e-commerce, cloud computing, and artificial intelligence are some of the innovations that helped tech stocks march higher for several years. However, tech tailwinds don’t carry every stock. Former fan favorites can also lose their charm as they report decelerating revenue and earnings growth. Not every tech stock is worth buying, and you may want to steer clear of these investments. Snap (NYSE:SNAP) has all of the makings of an equity right before the fall. Shares have almost doubled since the end of September resulting in a 60% gain over the past year. However, the stock is more than 80% down from its all-time high, and things are likely to stay that way if they don’t get worse. Snap has a $27 billion market cap and continues to burn through cash. The company reported a $368 million net loss in the third quarter of 2023. Sure, adjusted EBITDA shows a profit of $40 million, but the acronym is nicknamed “Earnings Before I Tricked the Dumb Auditor” for a reason. That’s a big net loss from $1.19 billion in revenue, and profit margins haven’t been improving by much. It’s normal for companies in growth mode to report high net losses and offer investors hope about narrowing net losses and a convincing path to profitability. However, Snap simply can’t provide any of those promises to investors. Revenue only crawled up by 5% year-over-year. It’s an unacceptable growth rate given the company’s valuation and inability to make meaningful processes while narrowing its net losses. 5% year-over-year revenue growth is sadly a highlight given how badly the other quarters have been. These low growth rates come at a time when Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) and Meta Platforms (NASDAQ:META) have recovered. Many smaller adtech companies are pulling up better numbers while making profits and having lower valuations. It’s hard to feel optimistic about anything this stock has to offer. Etsy’s (NASDAQ:ETSY) P/E ratio has been rightfully lowered to 28 in a turn of events 2021 bulls may have never predicted. While the valuation makes the stock look more enticing at first glance, several valid concerns exist. The third quarter of 2023 highlighted a company that is struggling to grow. The company only reported 7% year-over-year revenue growth which is a far cry from the days the company could churn out 30% year-over-year revenue growth before the pandemic. During the pandemic, Etsy could achieve revenue growth exceeding 80% year-over-year. The number that concerns me the most is the company’s consolidated gross merchandise sales (GMS). This figure hit $3.0 billion and was up by 1.2% year-over-year. GMS is Etsy’s ceiling. This growth rate impacts the company’s total revenue which extends to net income. Since revenue growth outpaced GMS growth, it means Etsy is charging more for its buyers and sellers to fill in the gap between 1.2% GMS growth and 7.0% revenue growth. Higher costs may entice buyers and sellers to use other platforms. It wouldn’t be enough to take out the company, but it may be enough to keep GMS growth in the low single digits or even result in a year-over-year decline. Even worse, GMS was flat on a currency-neutral basis. Etsy’s leadership cited macroeconomic conditions as a headwind to consolidated GMS. A lot of other companies reported good earnings in 2023. That suggests there’s more to Etsy’s slowing sales than macroeconomic conditions. If Etsy’s GMS continues to remain flat, then it should trade closer to eBay’s (NASDAQ:EBAY) P/E ratio. Etsy shares would have to drop by more than 50% from current levels to reach eBay’s P/E ratio. Etsy’s GMS growth is the company’s most important metric to follow at this time. It’s easier to go after Tesla (NASDAQ:TSLA) after the company warned investors about a slowdown in 2024. The bad news resulted in shares falling by 12% in a single day. That brings the one-year gain to 14%, but long-term investors must still be happy with their five-year gain of 778%. However, investors may want to heed caution, especially if they take a deeper look at the recent quarter. Q4 2023 painted a gloomy picture that features 3% year-over-year revenue growth which isn’t what you want to see from a growth stock. Chinese EV companies seem to be eating Tesla’s lunch and challenging its dominance in China. Bullish investors will point out that Tesla is more than just a car company. However, its other two revenue segments don’t make up a large enough percentage of total revenue to make meaningful impacts. The “energy generation and storage revenue” segment grew by 10% year-over-year and represents less than 7% of the company’s total revenue. The “services and other revenue” segment increased by 27% year-over-year but barely made up 10% of the company’s total revenue. Tesla has other revenue streams that go beyond selling cars, but automotive revenues still make up 85.7% of the company’s Q4 2023 revenue. The “non-car” segments make up a small percentage of revenue and are experiencing growth deceleration. Tesla shares are trading at a premium based on the idea of it being a tech company. Only 14.3% of Tesla’s total revenue can be considered tech. Some investors may wait out the storm and see what happens, but better opportunities are available. On the date of publication, Marc Guberti did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Marc Guberti is a finance freelance writer at InvestorPlace.com who hosts the Breakthrough Success Podcast. He has contributed to several publications, including the U.S. News & World Report, Benzinga, and Joy Wallet. Consumer Discretionary, Automotive, Electric Vehicles, Communications, Media, Social Media, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/3-stocks-to-avoid-at-all-costs-in-the-volatile-tech-sector/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}