{
    "title": "Musk pushes to incorporate Tesla in Texas as new state business courts \nbecome active",
    "date": "2/4/2024",
    "url": "https://okcfox.com/news/nation-world/elon-musk-pushes-to-incorporate-tesla-in-texas-as-new-state-business-courts-become-active-gigafactory-shareholders-state-of-incorporation-delaware-pay-package-spacex-ceo-twitter-x-owner",
    "text": "Clear 55 73 48 Today 73 48 Thursday 62 53 Friday 67 52 Latest Weathercast Interactive Radar Now 55 Thu 62 Fri 67 by ADELA UCHIDA | KEYE Staff AUSTIN, Texas (KEYE) — Austin, Texas, might soon be home to more than Tesla’s Gigafactory.  Billionaire Elon Musk posted on X this week that he's asking Tesla shareholders to move the company's state of incorporation from Delaware to Texas. This comes on the heels of a Delaware judge invalidating his $56 billion pay package this week. But Texas is starting up its own business courts this year, active on September first of this year. While this is a first in the Lone Star State, it's actually the 31st state to create courts specially for big business matters. It comes at a time when high-profile businesses, like Tesla, may end up incorporating there. Last year, the state legislature passed House Bill 19, which created the Texas business courts – a new system of courts that is expected to begin taking cases later this year – but only certain complex business cases. “Such as shareholder derivative actions, breaches of duties by certain managers or excuse me, directors, security actions and certain business transactions over $10 million,” Saba listed as examples. In a nutshell, it is some of the more complicated dealings of big businesses. As of last September, there have been judges in Austin, Houston, Dallas, Waco and San Antonio, and within a few years, including 11 judges across the state. Those judges will be appointed by Gov. Greg Abbott, not elected by voters. “Would you say it’s more a matter of having a specialized court system where issues will be understood better and maybe track through faster versus any political intention?” KEYE asked Saba. “Yeah, I think it’s the former. I think there will be more efficient and economical for large dispute resolutions,” he answered. Saba says it will lighten the dockets in district courts as well, making regular civil matters move more quickly. But as for how much of a role is House Bill 19 playing in big business decisions right now: “I think you’d have to ask Elon.\" There can be jury trials, and cases filed after the courts are active that fit the criteria can be removed to the business courts, and cases can be appealed. "
}