{
    "title": "'Next Tesla' Electric Car Startups Hit Demand Speed Bumps",
    "date": "2/26/2024",
    "url": "https://www.entrepreneur.com/business-news/next-tesla-electric-car-startups-hit-demand-speed-bumps/470287",
    "text": "Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            Sherin Shibu\n          \n                                                    •\n            \n            \n              Feb 26, 2024 Share Even though a record 1.2 million electric vehicles were sold in the U.S. last year, the reality of the EV market isn't meeting industry expectations. EV growth has slowed this year in the U.S. — and, as evidenced by recent moves by several companies, automotive giants and startups alike are adjusting to the road ahead. For example, EV industry leader Tesla warned investors about \"notably lower\" growth on Saturday after slashing prices on its EVs in an attempt to boost demand last year. Ford is delaying a planned $12 billion in EV investments, pushing back some planned EV launches, and shifting its strategy to new, more affordable EVs. Meanwhile, startups such as Rivian and Lucid haven't been able to pivot as quickly as Tesla or Ford, even though both of these startups have wealthy backers (Amazon has a 17% stake in Rivian, and Saudi Arabia's Public Investment Fund owns 60% of Lucid, according to Bloomberg). On Wednesday, these relatively new companies forecasted that they would produce EVs at numbers below analyst estimates. Rivian expects to produce 57,000 vehicles in 2024, according to Reuters, which is far below analyst estimates of 81,700 EVs and less than the 57,232 EVs it produced last year. An R1T model electric truck on the pilot production line at Rivian's headquarters in Irvine, California, US, on Wednesday, July 5, 2023. Photographer: Alisha Jucevic/Bloomberg via Getty Images Lucid expects to make 9,000 units this year, though Wall Street estimates anticipated 22,594 EVs. Lucid predicted it would make ten times that amount (90,000 units) by 2024 when it went public three years ago. Employees at EV startups are dealing with the consequences of smaller profit margins and lower-than-expected demand. Rivian cut its workforce by 10%; the company lost about $2 billion last year. Polestar, another EV startup, cut 450 jobs globally last month. \"For these car manufacturers, investors want to see demand,\" said David Wagner, portfolio manager at Aptus Capital Advisors, told Fortune. Though the all-electric market may be slowing down, sales could continue to go up. Cox Automotive predicts that EVs will make up 10% of the U.S. vehicle market by the end of 2024 — an increase from 7.6% last year. Entrepreneur Staff News Reporter Want to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join. Melissa Weaver was applying for a VP of HR job at a tech company via video. If you'd like to be happier or more successful this year, then ask yourself if you're truly exuding these five attributes. The happiest and most successful people I know execute on these game-changers exceptionally well. The real estate mogul says that playing the waiting game is not the best strategy. Hiring for cultural fit is the best way to create a mutual partnership between employer and employee. A LinkedIn post by Braden Wallake, the CEO of HyperSocial, is making the rounds for being out of touch. Complex industries offer opportunities in market needs, potential profitability and expansion opportunities — but the key to being successful is developing and supporting a clearly differentiated value proposition that separates your organization from potential competitors. Here's how to do it. Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  "
}