{
    "title": "Tesla rivals Rivian and Lucid receive harsh prediction from Elon Musk",
    "date": "2/22/2024",
    "url": "https://www.teslarati.com/elon-musk-tesla-rivals-rivian-lucid-outlook/",
    "text": "Elon Musk’s Tesla has survived through a tough, long, and treacherous road to profitability and electric vehicle dominance. Unfortunately for rivals Rivian and Lucid, Musk does not see the same bright light at the end of the tunnel, based on comments made on his social media platform X last night. As both Rivian and Lucid reported earnings for Q4 2023 last night, Musk took to Twitter to discuss his impressions of both companies and how long they might last before things could come to a crashing halt. In short, it does not look like an optimistic sentiment shared by Musk was in the plans. Both predictions seem to indicate eventual bankruptcy and potentially the end of operations, which would bring Tesla’s lead in the EV movement in the U.S. to a point of overwhelming dominance. Rivian and Lucid are two pure EV companies that continue to fight through tough economic times and challenging growth periods. Rivian and Tesla are somewhat complementary to one another, both contributing to the EV movement with a focus on expanding product lines, offering cheaper vehicles, and creating somewhat of a “brand,” specifically catering to those interested in supporting companies hellbent on bringing EVs to the forefront. While the two have had a tumultuous past, including an employee poaching lawsuit, Tesla and Rivian are widely considered the two best EV companies in the United States, and there seems to be mutual respect there. Rivian sets 2024 goals, including a 57,000 production target  However, Rivian is still navigating through tough times, ramping production and trying to race to profitability as fast as possible. During its earnings call last night, it did indicate that it is still losing money on every car it builds, which is not uncommon in early operations. Musk believes, based on data, that Rivian would have roughly six quarters left before bankruptcy would have to be considered: Current trajectory has them bankrupt in ~6 quarters. Maybe that trajectory will change, but so far it hasn’t. pic.twitter.com/tNNijQ3KwT — Elon Musk (@elonmusk) February 22, 2024  The problem with Rivian, according to Musk, is not their product. “Their product design is not bad,” Musk said, “but the actual hard part of making a car company work is achieving volume production with positive cash flow.” Lucid and Tesla are a different story entirely. Evident from comments made by Musk for several years about Lucid CEO/CTO Peter Rawlinson’s job title with the Model S program at Tesla, there is still hostility between the two. Musk has said that Rawlinson left Tesla when things got truly difficult, and it seems he still holds a bit of a grudge because of it. Lucid posts Q4 2023 results, posts conservative FY 2024 target  Rawlinson’s Lucid is still alive mostly due to a strong investor in the Saudi Arabian Public Investment Fund, or PIF, which is the reason the company built a production facility in the country. It also is building cars for certain government organizations in Saudi Arabia. Musk was sure to point out that Lucid’s survival is purely because of the PIF’s involvement: Their Saudi sugar daddy is the only thing keeping them alive — Elon Musk (@elonmusk) February 22, 2024  While Tesla fans might see it as a way to dominate EV sales figures once again, and as a feather in their cap that the company they invested in survived, it would be bad to see both of these companies cease operations. In reality, competition in the market is a positive. It pushes companies to innovate and creates product diversity, giving a wide variety of options for customers. Additionally, the EV movement would take a huge blow if two major companies could not stay afloat. Rivian is the company with the better outlook because it is showing growth and progress in its EV efforts, but Lucid has heavy financial backers with essentially limitless money. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}