{
    "title": "Nvidia surpasses Tesla as Wall Street's most traded stock amid AI fervour",
    "date": "2/20/2024",
    "url": "https://www.republicworld.com/business/international-business/nvidia-surpasses-tesla-as-wall-street-s-most-traded-stock-amid-ai-fervour/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated February 20th, 2024 at 19:03 IST Nvidia's ascent to the top spot in daily stock trading reflects its recent milestone as the third-most valuable US company. Chipmaker Nvidia has overtaken Tesla as the most traded stock, underscoring the growing prominence of artificial intelligence (AI) investments in the market. Nvidia's ascent to the top spot in daily stock trading reflects its recent milestone as the third-most valuable US company, highlighting the increasing significance of AI-related bets for investors. The California-based semiconductor company's surge in trading volume raises the stakes for investors, particularly if Nvidia's revenue growth fails to meet lofty expectations, potentially impacting the broader market rally driven by optimism surrounding AI. Market observers expect Nvidia's upcoming quarterly report, scheduled for Wednesday, to be a pivotal event, with the company's performance likely to influence investor sentiment significantly. Analysts caution that anything short of stellar results could dampen the fervent rally that has propelled Nvidia's stock price by an impressive 47 per cent in 2024. Over the past 30 trading sessions, approximately $30 billion worth of Nvidia shares have been exchanged daily on average, surpassing Tesla's average daily turnover of $22 billion during the same period. Tesla, which had been a dominant force in daily US stock trading since 2020, has ceded its leading position to Nvidia amid the latter's meteoric rise. Nvidia's trading volume, alongside that of Super Micro Computer—a company benefiting from the AI boom—accounted for over 40 per cent of the total turnover among the 10 most traded US stocks. The trend underscores the growing influence of AI-related stocks in shaping market dynamics and investor sentiment. While some herald Nvidia's dominance in trading as indicative of a new era akin to the dawn of the internet, concerns linger regarding the reliance on momentum-driven trading strategies rather than fundamental factors like future revenue growth. Super Micro's recent volatility, for instance, underscores the market's susceptibility to fluctuations driven by valuation concerns and analyst assessments. Despite these uncertainties, Nvidia remains a formidable force in the AI chip market, controlling approximately 80 per cent of the high-end segment. The company's staggering market capitalisation, surpassing that of tech giants like Amazon and Alphabet, underscores its growing influence and investor appeal. In contrast, Tesla's stock has faced headwinds, declining by 20 per cent in 2024 amid challenges such as tepid demand for electric cars and intensifying competition. (With Reuters inputs) Published February 20th, 2024 at 16:45 IST Send us your views, we’ll publish them. This section is moderated. 'To Share Grief': Husbands in Jail, Mrs Kejriwal And Mrs Soren Meet Hostages in Dutch Town Ede Rescued, Man Arrested UP: Portion of Under-Construction Bridge Collapses in Bulandshahr Upset Over Relationship Issues, B.Tech Student Dies by Suicide in Noida Daughter-in-Law of Former Lok Sabha Speaker Shivraj Patil Joins BJP Google's timeline for RCS support on iPhone Han So Hee-Ryu Jun Yeol Call It Quits Within Two Weeks Amid Controversy Zodiac Signs That Are Born To Be Rebels And Challenge The Status Quo 'Received I-T Notice Last Night', Claims DK Shivakumar AAP's Bharadwaj, Atishi to Address Press Conference at Noon Today | LIVE © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}