{
    "title": "Govt says no separate policy framed for Tesla",
    "date": "2/10/2024",
    "url": "https://www.newindianexpress.com/business/2024/Feb/10/govt-says-no-separate-policy-framed-for-tesla",
    "text": "NEW DELHI: No separate policy has been framed by the Centre for providing incentives to US-based electric carmaker Tesla, said Krishnan Pal Gurjar, Minister of State for Heavy Industries, on Friday. Tesla has the option to apply for incentives under the National Programme on Advanced Chemistry Cells (ACC) Battery Storage while the window for the PLI scheme for automobile and auto component industry has been closed, he said. “Under PLI scheme, ‘National Programme on ACC Battery Storage’, request for proposal (RFP) has been released for 10GWh on 24.01.2024 in which any interested bidder including US-based Tesla can apply,” Gurjar said while answering a question in the upper house. While Tesla so far has not proposed setting up a manufacturing facility in the world’s third-largest passenger vehicle market, its closest rival Chinese EV maker BYD’s investment proposal is still pending owing to changes in India’s FDI amid worsening relation between India and China. “One proposal under government route is pending with this ministry, which is received from M/s BYD Hong Kong Co. Limited, Hong Kong, a wholly owned subsidiary of M/s BYD Company Limited, China,” Gurjar said. “Investments, guided by FDI policy in the automobile sector, are permissible through the automatic route, except in respect of entities of border sharing nations. These entities are required to invest only under the Government route,” Gurjar added. Last year it was reported that BYD told its India joint-venture partner Megha Engineering and Infrastructures that it would shelve plans for a new $1-billion investment to build electric cars in the country. Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest  Copyright - newindianexpress.com 2024. All rights reserved.  "
}