{
    "title": "Tesla: Is Elon Musk actually bad for EV maker's business?",
    "date": "2/12/2024",
    "url": "https://finance.yahoo.com/video/tesla-elon-musk-actually-bad-161337372.html",
    "text": "Tesla (TSLA) CEO Elon Musk has been ordered by a California judge to comply with a SEC subpoena regarding Musk’s 2022 purchase of X.com, the social media platform formerly known as Twitter. The tech exec has made headlines recently for challenges to his exorbitant pay package and other controversies — are Musk's actions as of late impacting Tesla's general investor appeal? ROTH Capital Partners Senior Research Analyst Craig Irwin and Columbia Law School Professor Eric Talley join Yahoo Finance Live to weigh in on Musk’s relationship with Tesla's stock as the EV environment faces challenges. The EV giant’s competitive edge, according to Irwin, has “eroded” due to minimal technological innovation and various other factors. Irwin sees the Tesla stock as a “hopes and dreams stock.” Furthermore, Talley views Musk’s “antics” as a “distraction” that could have been avoided if Musk had followed advice from the company’s board. \"Musk is Tesla,\" insists Irwin who does not see any possibility of Musk being removed as CEO. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim - Can investors still look at Tesla as something to look at long term as perhaps some of their competitive edge starting to wean away when you look at what's happening with EV demand? CRAIG IRWIN: Oh, my God. I mean BYD's already overtaking them. So the competitive edge is being severely eroded. And there's a hopes and dreams stock. People don't really look as much at the fact that it's really about the cars. The people that are along this and trying to accumulate shares, even though it's going down. We're looking at AI and robotics. But his robots are state of the art for 2014. And AI, Musk is threatening to put it in another company. So I have a hard time with the stock. I think there's a lot of exciting things going on in EVs and Musk deserves tremendous credit for basically creating the market. There was a lot of pushback from others. But the trajectory here is tricky for Tesla. It needs as much attention from Mr. Musk as possible. He is a highly talented executive and I wholeheartedly agree with him pushing back on the SEC, trying to delete days off his calendar when he needs that time. - Certainly, Eric, would love to bring you back in here. As you think about the legal aspects of all the different arguments that Elon Musk has to make in any of these appearances or any of his defenses. What is perhaps the most pressing one that he will need to make to ensure that he's still able to balance time between X and Twitter, and balance time over at Tesla as Craig was talking about earlier? ERIC TALLEY Well, a couple of things. First of all, I think the antics about Elon Musk deciding when it's appropriate for him to come in front of the SEC and when it's not, that has actually proven to be more of a distraction than another four hours worth of a deposition. And quite frankly, this opinion never would have occurred had Elon Musk followed through with his entire team's plans to show up on September 15th, at which point they just decided to not show up. And so I think part of the challenge for Musk is just making sure that these are pretty simple rules of the road to play by. I know that he believes himself to be somewhat exceptional within them. But this is not going to be a very large issue. Probably, still won't be a very large issue. I think Tesla is the more interesting issue by a long shot and it's not just a car company, remember, it's also a solar roof company. And it's also a battery company and it's also a technology company. And there's a big question about where that next growth area is going to be. Part of the reason for the large compensation package, at least ostensibly, was to keep Mr. Musk on task and creative and putting all new growth opportunities inside Tesla. Is that going to change now depending on the outcome of this case? Does that bring about more possible litigation if Mr. Musk is perceived as funneling new ideas out of Tesla and into some of his other companies? - So Craig, to Eric's point there, when you think of Musk and his leadership, obviously, impossible to separate it from Tesla here. But even some Musk fans and some Tesla Bulls really starting to get frustrated here. Do you see ever a position where Tesla would do better without having him as CEO? CRAIG IRWIN: No. I think Musk is essential for the valuation. He's essential for the equity following of retail investors and he's been the visionary. You talk to senior executives out at Tesla, senior engineers out of Tesla and they say Musk is absolutely impossible to please. He is unstoppable. He will not take no for an answer. And that's how he's getting these tremendous results years faster than anyone else in the industry. He's a very demanding CEO and extremely intelligent about the way he looks at some of these fundamental problems that people just assume are unsolvable or that the conventional solutions, the right solution. Musk is Tesla, that is the challenge here over the next many years. How do you backfill him? I think if Musk was gone for Tesla, the valuation would change radically in a very short period of time. Related Quotes "
}