{
    "title": "Nxu Achieves Historical NACS Charging Milestone with Tesla Cybertruck",
    "date": "2/29/2024",
    "url": "https://www.globenewswire.com/news-release/2024/02/29/2838476/0/en/Nxu-Achieves-Historical-NACS-Charging-Milestone-with-Tesla-Cybertruck.html",
    "text": "February 29, 2024 17:15 ET\n\n\r\n            | Source:\r\n            \nNxu Inc.\n\n\n\n\n\nNxu Inc. MESA, Ariz., Feb.  29, 2024  (GLOBE NEWSWIRE) -- Nxu, Inc. (NASDAQ: NXU) (“Nxu”, “the Company”), a domestic technology company developing and manufacturing innovative EV charging and energy storage solutions, successfully charged a Tesla Cybertruck (“Cybertruck”) on Feb. 26, 2024; possibly the first-ever successful Cybertruck NACS (North American Charging Standard) charging session performed on a non-Tesla DC fast charging station. One of the first Cybertruck owners in Arizona joined the Nxu team to test the compatibility of the NxuOne™ Charging System, the only universal, dual-technology solution available for public charging, with a Cybertruck. The collaborative effort resulted in the seamless and successful completion of multiple charging sessions. Nxu, known for its innovative, fast, and reliable charging solutions, has consistently pushed the boundaries of EV charging limits. The successful Cybertruck charge not only highlights the adaptability of the NxuOne™ system, but also paves the way for future advancements in the EV charging ecosystem. \"We are thrilled to announce this significant milestone in the world of electric vehicles. Showcasing the ease with which Nxu’s charging technology charged the Cybertruck exemplifies our commitment to improve EV technology and provide EV owners with efficient, reliable, and cutting-edge charging solutions,\" said Nxu Founder, Chairman and CEO Mark Hanchett. As Cybertrucks begin to roll out into new markets, Tesla Superchargers have been the only public charging option for Cybertruck owners to date. The successful NxuOne™ Cybertruck charging sessions signifies possibly the first time a third-party NACS charger could accommodate a Cybertruck. As the automotive industry develops more electric mobility options, the Nxu remains dedicated to creating solutions that accommodate all EVs, regardless of make, model, or size. The successful implementation of the NxuOne™ charging system with the Cybertruck emphasizes the importance of interoperability and availability of plentiful user-friendly charging solutions. To learn more about the NxuOne™ Charging System, visit www.nxuenergy.com, or charge your EV 24/7 at the Mesa location, 1828 N Higley Road, Mesa, Arizona 85205. About Nxu, Inc.Nxu, Inc. is a domestic technology company leveraging its intellectual property and innovations to support e-Mobility and energy storage solutions. Driving the energy future, Nxu is developing an ecosystem of industry-leading grid level energy storage solutions, charging infrastructure and over-air cloud management – encompassed by Nxu’s seamless subscription-based models. For more information, visit www.nxuenergy.com. Forward-Looking StatementsThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements regarding our future areas of focus and expectations for our business. These forward-looking statements are based on our current assumptions, expectations and beliefs and involve substantial risks and uncertainties that may cause results, performance or achievements to materially differ from those expressed or implied by these forward-looking statements. Such forward-looking statements include statements regarding, among other things, Nxu’s expectations about its long term growth strategy, future growth trajectory, revenue and operations; Nxu’s technology and alignment with broader trends in the EV market; opportunities presented by electrification; beliefs about the general strength, weakness or health of Nxu’s business; and beliefs about current or future trends in EV battery materials or other markets and the impact of these trends on Nxu’s business. A detailed discussion of these factors and other risks that affect our business is included in filings we make with the Securities and Exchange Commission (SEC) from time to time, including our most recent report on Form 10-K, particularly under the heading “Risk Factors.” Copies of these filings are available online from the SEC or on the SEC Filings section of our Investor Relations website at www.nxuenergy.com. All forward-looking statements in this press release are based on information currently available to us, and we assume no obligation to update these forward-looking statements in light of new information or future events. CONTACT:Media Contactpress@nxuenergy.com Investor ContactInvestors@nxuenergy.com "
}