{
    "title": "Cathie Wood Just Keeps Buying More of This Magnificent AI Stock",
    "date": "2/11/2024",
    "url": "https://finance.yahoo.com/news/cathie-wood-just-keeps-buying-130000233.html?prefer_reader_view=1",
    "text": "She's at it again: Cathie Wood, the head of Ark Invest, is snapping up shares of Tesla (NASDAQ: TSLA) with purchases worth more than $160 million so far in 2024. Is it a brilliant move or a huge mistake? Here's what you need to know. As noted above, Wood and her team have purchased over $160 million worth of Tesla stock since the start of the year. Wood's flagship fund, the ARK Innovation ETF (NYSEMKT: ARKK), now owns about $640 million of Tesla stock, making the company the fund's second-largest holding behind Coinbase. Ticker Company Name Market Value (in millions) Weight COIN Coinbase Global $628.1 8.11% TSLA Tesla $626.7 8.09% ROKU Roku $625.1 8.07% PATH UiPath $490.1 6.33% SQ Block $489.6 6.32% Data from ARK-funds.com as of Feb 7, 2024. ARK Invest remains bullish that Elon Musk and the rest of Tesla's management team will find a way out of the predicament they've found themselves in following a disappointing fourth-quarter earnings report and weak guidance. To recap, Tesla's gross margins continue to crater, reducing its appeal over rival automakers. Furthermore, the company issued lackluster guidance for vehicle volume growth in 2024, blaming the ramp-up to its next-generation model, which is due in 2025. At any rate, Wood's massive bet on Tesla shows that she believes brighter days are ahead for the company. But what's her exact thesis? In short, Wood and her team are taking the long view on Tesla. ARK Invest has a price target of $2,000 on the stock owing to its ability to perfect and monetize its full self-driving (FSD) software. Moreover, Wood believes the company can parlay its FSD breakthroughs into a fleet of robotaxis that could revolutionize transportation, allowing society to rethink how people and cargo move from place to place. In any event, Wood is placing a big bet on a company with an expensive valuation. Tesla's shares trade with a price-to-earnings (P/E) multiple of 43, despite the recent sell-off. Data by YCharts. Given its valuation, Tesla is not a stock for value investors or those who are income-oriented. Rather, it's a stock for growth investors with a long time horizon. However, for those inclined to that investing style, the current dip in Tesla shares may offer an opportunity, one that Wood has already pounced on in the past several weeks. If Musk has proven one thing on his way to becoming the world's richest person, it's that he knows how to rally when the chips are down. Where to invest $1,000 right now When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.* They just revealed what they believe are the 10 best stocks for investors to buy right now… and Tesla made the list -- but there are 9 other stocks you may be overlooking. See the 10 stocks *Stock Advisor returns as of February 6, 2024 Jake Lerch has positions in Tesla. The Motley Fool has positions in and recommends Block, Coinbase Global, Roku, Tesla, and UiPath. The Motley Fool has a disclosure policy. Cathie Wood Just Keeps Buying More of This Magnificent AI Stock was originally published by The Motley Fool Related Quotes "
}