{
    "title": "Tesla To Kick-Off Construction Of Giga Mexico Next Week, Nuevo León \nGovernor Confirms - Tesla (NASDAQ:TSL",
    "date": "2/25/2024",
    "url": "https://www.benzinga.com/news/24/02/37305137/tesla-to-kick-off-construction-of-giga-mexico-next-week-nuevo-le-n-governor-confirms",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The construction of Tesla Inc.’s TSLA Gigafactory in Mexico is set to commence next week, confirmed the governor of the state where the factory will be located. What Happened: The groundbreaking ceremony for the factory, to be located in Santa Catarina within the Monterrey metro, is scheduled for March 3, according to Teslarati, which cited a report from the Mexican publication Milenio. The factory’s construction was delayed due to environmental permitting issues, but the work has already begun in the area. Governor Samuel García Sepúlveda of Nuevo León confirmed the new groundbreaking date. He expressed his enthusiasm for the positive impact the Tesla factory will have on the local community. See Also: Elon Musk Says ‘Saudi Sugar Daddy’ Is Only Thing Keeping Lucid Alive, Warns Of Possible Rivian Bankruptcy “See you also from this Sunday to the other in Terralta, because we started the construction of Tesla,” García Sepúlveda said. “Tesla starts next Sunday, there will come a lot of investment, a lot of development, a lot of spillover.” The factory will produce Tesla’s next-generation, lower-cost electric vehicle, expected to begin by the second half of 2025, according to CEO Elon Musk. Why It Matters: The construction of the Tesla Gigafactory in Mexico is a part of the company’s expansion strategy. This development comes at a time when Chinese EV maker BYD Co is also reportedly contemplating establishing a new production facility in Mexico, potentially to bolster its presence in the U.S. market. Reports in December 2023 suggested that the Gigafactory Mexico could be built in record time. The factory is expected to produce Tesla’s Model Y, batteries, and the Cybertruck. Read Next: Tesla Bull Gary Black Says Elon Musk Added ‘Fuel To The Fire,’ But Clarifies That Billionaire’s Comments Engineered by\n        Benzinga Neuro, Edited by\n        \n\n              Ramakrishnan M The GPT-4-based Benzinga Neuro content generation system exploits the\n        extensive Benzinga Ecosystem, including native data, APIs, and more to\n        create comprehensive and timely stories for you.\n        Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}