{
    "title": "Will AMD Be Worth More Than Tesla by 2025?",
    "date": "2/5/2024",
    "url": "https://www.fool.com/investing/2024/02/05/will-amd-be-worth-more-than-tesla-by-2025/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Twenty years ago, General Electric was the fifth-largest American company, with a market cap of $243 billion. By 2014, it had fallen to the 11th largest, and, as of this writing, it has fallen all the way to 52nd. The lesson? The pecking order can change quickly on Wall Street. And, for investors, it's always wise to examine whether your investments are rising or falling -- and why. So, let's dive in and explore how the market caps of Advanced Micro Devices (AMD 0.50%) and Tesla (TSLA -2.25%) compare and see whether AMD could grow larger than Tesla by 2025. Image source: Getty Images. As of this writing, Tesla is roughly twice the size of AMD. Tesla's market cap stands at $598 billion, while AMD's is $274 billion.  TSLA Market Cap data by YCharts However, as you can see, that hasn't always been the case. At its peak valuation of $1.2 trillion, Tesla was more than six times the size of AMD, which was less than $200 billion. Yet, as recently as 2020, the two companies had an almost identical market cap of nearly $65 billion. Moreover, until 2012, AMD was the larger company.  TSLA Market Cap data by YCharts At any rate, as all this history proves, valuations change. And at the moment, AMD is once again gaining ground on Tesla. Here's why. In short, the reason is Artificial Intelligence (AI). In my opinion, both companies are AI companies. AMD designs semiconductors that serve as the \"brains\" behind AI. Tesla, on the other hand, wants to use AI to develop features like full self-driving (FSD) and robotics. To put it another way, AMD is further along in the AI adoption cycle -- meaning organizations are already snapping up its AI product (AMD designs AI chips that consumer-facing AI giants like Microsoft and Meta Platforms can't buy enough of right now). However, Tesla hasn't crossed the AI adoption threshold yet. It is still working on the research and development of its key AI software. In the meantime, it must focus on selling vehicles that will act as a platform for the company's AI-powered software. This development gap is why its stock is currently giving up ground to AMD. The next big catalyst for Tesla stock should be the completion and rollout of FSD and robotaxis. Management, including Elon Musk, has been promising it for years. However, it's not here yet. Therefore, investor focus remains on the company's declining gross margins and lackluster production estimates.  TSLA Gross Profit Margin (Quarterly) data by YCharts AMD's stock, meanwhile, is soaring as the demand for AI chips is through the roof. Hyperscalers like Microsoft, Alphabet, and Amazon are in a frenzy to buy AI chips, and AMD has just debuted a new series of accelerators designed to challenge Nvidia's market dominance. The result? AMD's market cap has grown by 49% over the last six months, and Tesla's has decreased by 29%. If that trend were to continue, the two companies' market caps would be nearly identical by the end of summer 2024.  TSLA Market Cap data by YCharts Granted, trends don't always hold, and they alone shouldn't be what people base their investments on. Nevertheless, it is worth noticing that AMD's and Tesla's market caps seem to be on a path to parity if current conditions persist. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Jake Lerch has positions in Alphabet, Amazon, and Tesla. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Meta Platforms, Microsoft, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}