{
    "title": "What Makes Meta Magnificent Makes Tesla Terrible (For Now)",
    "date": "2/23/2024",
    "url": "https://www.investors.com/research/ibd-stock-analysis/meta-stock-magnificent-tesla-terrible/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     Even the Magnificent Seven stocks can lose their luster sometimes. Just ask Tesla (TSLA). But as Meta Platforms (META) shows, the return of a prodigal stock can be glorious. While Tesla struggles to correct its long slide off a string of downturns since 2021, Meta stock has now skyrocketed as much as 461% from its lows in November 2022 to another record it just hit Friday. The Facebook, Instagram and WhatsApp parent has set up a new launchpad for even more gains. Holding most of its surge from a gap-up on Q4 earnings, Meta stock traded sideways to form a three-weeks-tight pattern. The top of that formation around 485.96 sets the buy point. After Meta gapped up past that entry in rising and above-average volume Thursday, the stock eased off its intraday highs Friday to close in buy range at 484.03. Note that a three-weeks-tight pattern is typically considered a place to add shares to an existing position rather than start a new one. The number of shares purchased for add-on buys should be less than for earlier positions to keep the average share price down. Nvidia Delivers Another Beat-And-Raise Quarter Fueled By AI Chips Tesla's recent turmoil does not mean the EV pioneer cannot rebound. It certainly can, and Wall Street forecasts for 2025 call for the company to recharge and deliver a spike to 38% earnings growth in 2025. But a quick comparison of both the fundamentals and technical action in Meta and Tesla paints a clear picture. After a severe slump of its own from 2022 to early 2023, Meta has generated three straight quarters of accelerating earnings growth. In Q4, the Mark Zuckerberg-led social media giant posted earnings of $5.33 per share, a 203% jump over the prior-year quarter. Tesla, on the other hand, has seen profits decelerate in three of the last four quarters. Earnings for the fourth quarter slowed 40% to 71 cents a share. Revenue for Tesla has declined over the last two quarters, sliding to just 3% year-over-year growth in Q4. Meanwhile, Meta continues to build on its growth trajectory. From 3% sales growth to $28.6 billion in Q1, Meta Platforms drove a 25% year-over-year gain to $40.1 billion in Q4. The powerful action in the chart for Meta stock reflects that turnaround in the company's fundamentals. The reverse is true for the troubles in Tesla stock. Institutional demand plays another key role in the Tesla vs. Meta stock story. Along with Nvidia, Microsoft and Alphabet, Meta made this month's list of new buys by the best mutual funds. In fact, Meta, Microsoft and Nvidia each took in over well over $1 billion from these top money managers. Tesla has not made this list since August. The ratings for all the Magnificent Seven stocks further highlight the gap between Meta and Tesla. For example, while Meta joins Nvidia in sporting the highest-possible 99 Composite Rating, Tesla earns a lowly 43. The up/volume ratio is another key measure of interest among investors. Where anything above 1.0 points to demand, Meta scores a 1.6, while Tesla rates 0.8. Follow Matthew Galgani on X (formerly Twitter) at @IBD_MGalgani. YOU MAY ALSO LIKE: EV Evisceration: Elon Musk Says A Bankruptcy May Be Looming Yes, Nvidia Is One. But These Aren't The Mag 7 You Expect. Magnificent Seven Stocks: Latest News & Market Cap Weighting Stock Picks: Google, Nvidia Reveal 7 Telltale Traits To Monitor Identify Bases And Buy Points With This Pattern Recognition Tool  3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}