{
    "title": "Ionna EV charging network rivals Tesla, first US stations in 2024",
    "date": "2/9/2024",
    "url": "https://fox59.com/automotive/internet-brands/ionna-ev-charging-network-rivals-tesla-first-us-stations-in-2024/amp/",
    "text": "EV road trips might soon be getting a little bit easier, thanks to thousands of highway fast-chargers starting this year from a network called Ionna. Ionna, as it’s called, is an EV charging network jointly backed by seven automakers, including an undisclosed amount from BMW Group, General Motors, Honda, Hyundai, Kia, Mercedes-Benz, and Stellantis. The network, which previously called itself out under the banner of “We Charge North America,” revealed its name Friday, along with a confirmation that it has received regulatory approval and is officially starting up. Led by Seth Cutler, formerly of EV Connect and GE, Ionna aims to establish a minimum of 30,000 high-power EV fast-chargers, strategically located throughout North America to facilitate long-distance journeys. With last summer’s announcement, however, it emphasized that there will be charge points both at urban and highway locations. GM and Pilot Company’s EV charging network The network was announced last July, with plans for 350-kw connectors as a starting point for its experience. At that time, the charging network told Green Car Reports that it aims for reduced charging times, and for “having the best charging power available on the market and technological state-of-the-art charging at all times.” Amenities and an “elevated customer experience” will be a focus of the network, with appealing locations offering restrooms, food service, and retail “nearby or within the same complex.” The first locations will open in the U.S. in 2024, it says, with Canada to be added later. The network also says that stations are “intended” to be powered by renewable energy, so expect more details as this may play a role in automakers’ sustainability efforts. Both GM and Mercedes-Benz have announced separate significant charging-network efforts of their own, and both companies at that time confirmed that those networks are unaffected and independent of this one. Some stations in the Ionna network may be vying for federal NEVI funding alongside those other efforts—and jointly competing with the Tesla Supercharger network, with that network soon more widely open to CCS-standard EVs from other brands. Mercedes-Benz EV Charging Hub in Sandy Springs, Georgia Ionna will be accessible to “all electric vehicles with NACS or CCS connectors,” according to the network, and it will “facilitate seamless integration with participating automakers’ in-vehicle and in-app experiences, encompassing reservations, intelligent route planning and navigation, payment applications, transparent energy management, and additional features.” To that point, Ionna hasn’t yet disclosed how overtly it will be branding the network itself, and how “up front” it will be with its own name at charging locations. The network appears to have much in common with Europe’s Ionity, which was launched by BMW, Mercedes-Benz, Ford, VW, and Audi in 2017—eventually gaining Hyundai and Kia. In that market, the network and its reliability helped build Europe into a stronger EV market than the U.S. 2022 Hyundai Ioniq 5 Limited AWD For the U.S., there’s been no such rival with multiple automaker stakeholders up until now. Electrify America was created with $2 billion from the Volkswagen Group as required by the VW’s diesel-emissions-cheating settlement, and thus far Siemens is its only other corporate investor. Last year, Walmart itself—EA’s earlier venue of choice for its locations—parted ways, announcing its own ambitious coast-to-coast EV charging network. In recent months, Electrify America has instead been also pivoting toward a more upscale experience—with this week’s urban fast-charging location as a template. Put off by failed charging sessions, nearly half of shoppers see public charging as an EV dealbreaker, and an open Tesla Supercharger network is unlikely to fix those issues alone. Upscale experience or not, reliability may ultimately be the factor that determines Ionna’s success—and whether automakers are able to jumpstart EV adoption with it. "
}