{
    "title": "Proč se Tesla ocitla na začátku dlouhodobého poklesu?",
    "date": "2/18/2024",
    "url": "https://medium.seznam.cz/clanek/burzovnisvet-cz-proc-se-tesla-ocitla-na-zacatku-dlouhodobeho-poklesu-47257",
    "text": "Tlačítkem Sledovat můžete odebírat oblíbené autory a témata. Články najdete v sekci Moje sledované. Zdá se, že akciím TSLA náhle hrozí, že jejich mateřská společnost podlehne svým problémům… A že jich není málo… Výhled akcií Tesla (NASDAQ:TSLA), které letos klesly o 25 %, není fantastický. Zdá se, že společnost stojí na počátku dlouhodobého poklesu, protože v prostředí rostoucí konkurence v oblasti elektromobilů ztrácí podíl na trhu. Tesla byla více než deset let jediným masovým výrobcem plně elektrických vozidel. Díky této výhodě Tesla prodávala špatně navržené elektromobily za prémiové ceny. Pokud zákazníci chtěli elektromobil, museli si koupit Teslu; dnes už ne. Vzhledem k tomu, že společnosti od General Motors (NYSE:GM) po Toyota Motor (NYSE:TM) a Volkswagen (ETR:VOW3) rozšiřují své vlastní elektromobily za dostupnější ceny, Tesla zůstává v prachu. Monopol Tesly už není tak výrazný Navzdory problémům ve společnosti zůstaly akcie Tesly a její generální ředitel Elon Musk nedotčeni. Navzdory špatnému hodnocení kvality, smrtelným nehodám, stahování vozidel z trhu, kontrole ze strany regulačních orgánů a kontroverzím na sociálních sítích akcie TSLA nadále rostly. Mezi lety 2011 a 2021 vzrostly akcie TSLA o ohromujících 20 250 % a z pouhých 2 dolarů za akcii na bázi očištěné o dělení vzrostly na více než 400 dolarů. Společnost Tesla se stala přední růstovou akcií, které fandili drobní investoři. Výkonnost akcií Tesla byla tak silná, že analytici zařadili společnost do skupiny dalších technologických akcií s těmi největšími kapitalizacemi, které se začalo říkat „Velkolepá sedmička“. Ve skutečnosti však akcie TSLA zaostávaly za výkonností druhé Magické sedmičky, do které patří společnosti Nvidia (NASDAQ:NVDA) a Microsoft (NASDAQ:MSFT). Od dosažení historického maxima v listopadu 2021 se cena akcií společnosti Tesla propadla o 54 %. Na znamení měnícího se sentimentu. Společnost Tesla dnes prakticky nikdo neoznačuje za špičkovou růstovou akcii. Výhled akcií TSLA: Revoluční automobilka trácí půdu pod nohama. Toyota nejlépe ilustruje konkurenční hrozbu, které Tesla čelí. Nejprodávanější japonská automobilka plánuje do roku 2030 prodávat 3,5 milionu plně elektrických vozidel ročně. Nakonec Toyota plánuje přestavět všechna svá vozidla na plně elektrické verze. Toyota v současnosti prodává přibližně 10 milionů osobních a nákladních automobilů a SUV ročně. Tesla v roce 2023 prodala 1,85 milionu vozidel. Pěknou ironií je, že akcie Toyoty od začátku roku vzrostly o 25 %, zatímco cena akcií Tesly od začátku roku klesla o 25 %. Toyota je sice poučným příkladem, ale je jednou z více než tuctu automobilek, které přecházejí na plně elektrická vozidla, z nichž většina nabízí vyšší kvalitu a nižší ceny než Tesla. Podíl společnosti Tesla na domácím americkém trhu klesl z 62 % na 50 % v roce 2023, což je rekordně nízká hodnota. To je velká ztráta tržního podílu v krátkém čase, což pro výhled akcií TSLA nevěstí nic dobrého. Zdá se nepravděpodobné, že by se to mohlo zvrátit, protože konkurence v nadcházejících měsících a letech zesílí. Složité problémy na obzoru Mezi další problémy, které táhnou akcie TSLA dolů, patří ekonomický propad v Číně, který poškodil prodeje. Po celém světě také dochází k agresivnímu snižování cen a slevám, které poškozují marže společnosti Tesla. Navíc se společnosti Tesla nepodařilo představit žádné nové elektromobily, které by byly lépe vyrobené a cenově dostupnější. Cybertruck, který se začal prodávat koncem loňského roku, vypadá zajímavě, ale také se zdá být nepraktický a jeho počáteční cena přesahuje 60 000 dolarů. Proslýchá se, že Tesla vyvíjí nový elektromobil pro masový trh s kódovým označením „Redwood“. Tento nový elektromobil však pravděpodobně nebude k dispozici dříve než v polovině roku 2025. Tesla mezitím zveřejnila hrozivý výsledek hospodaření za čtvrté čtvrtletí loňského roku a nabídla chmurný výhled, přičemž vedení uvedlo, že růst objemu elektromobilů v roce 2024 bude pravděpodobně „výrazně nižší“. Měli by snad akcionáři Tesly prodávat…? Zdá se, že to všechno Teslu dohnalo a kdysi zdánlivě neporazitelná automobilka se nyní zdá být zranitelná. Společnost již není schopna vystačit s nedostatkem konkurence. Poptávka oslabila, tržní podíl je ve volném pádu a marže se snižují. Zdá se, že vedení společnosti postrádá kreativitu a nové produkty nedokázaly nadchnout. Vzhledem k klesající ceně akcií by investoři udělali nejlépe, kdyby si vzali veškeré zisky, které mají, a hned z nich vystoupili. Akciím TSLA jednoduše došla šťáva. Máte na tohle téma jiný názor? Napište o něm vlastní článek. Texty jsou tvořeny uživateli a nepodléhají procesu korektury. Pokud najdete chybu nebo nepřesnost, prosíme, pošlete nám ji na medium.chyby@firma.seznam.cz. Reklama Reklama Stačí mít účet na Seznamu a můžete začít psát. Ty nejlepší články se mohou zobrazit i na hlavní stránce Seznam.cz Reklama Copyright © 1996–2024, Seznam.cz, a.s. "
}