{
    "title": "Here's How Much Elon Musk's Tesla And SpaceX Have Made From Their Bitcoin \nHoldings",
    "date": "3/8/2024",
    "url": "https://www.tradingview.com/news/newsbtc:cdf9f5f5f094b:0-here-s-how-much-elon-musk-s-tesla-and-spacex-have-made-from-their-bitcoin-holdings/",
    "text": "A new report has revealed the total Bitcoin assets held by Elon Musk’s Tesla and SpaceX companies and how much profit they’re seeing so far. Tesla And SpaceX Bitcoin Holdings Unveiled On Thursday, March 7, Arkham Intelligence, an AI-based blockchain analytics platform, revealed the Bitcoin holdings of SpaceX and Tesla, two companies co-founded by X (formerly Twitter) owner, Elon Musk. The comprehensive report also outlined Tesla’s BTC transactions spanning from 2021 to 2024. According to Arkham, Tesla had purchased about $1.5 billion worth of BTC in January 2021. Subsequently, the automotive company initiated multiple transfers, opting to sell off its Bitcoin holdings valued at $272 million in the first quarter of 2021 and about $936 million in the second quarter of 2022. Arkham has claimed that the automotive company currently possesses a staggering 11,510 BTC, valued at $780 million. Furthermore, Tesla’s substantial Bitcoin holdings are reportedly spread across 68 wallet addresses. On the other hand, SpaceX, a private space exploration and technology company, currently holds about $8,290 BTC worth approximately $560 million. These assets are reportedly distributed across a total of 28 wallet addresses. The combined BTC holdings of these two companies place them in a league comparable to the BTC holdings of major financial institutions. Tesla has secured the third position among the largest Bitcoin holders, with MicroStrategy leading the list, possessing around 190,000 BTC worth over $8 billion. Despite the considerable amount of BTC held by Musk’s companies, the CEO has seemingly had a love-hate relationship with Bitcoin. Earlier in 2023, Bitcoin crashed below $25,000 after Musk’s SpaceX sold all its Bitcoin holdings. However, it seems the space company is showing more interest in BTC, as seen by its massive Bitcoin portfolio. Tesla May Be Buying More BTC A crypto community member, identified as “Definalist” on X, has shared insights, suggesting that Tesla might be increasing its involvement in Bitcoin. Referring to Arkham Intelligence’s report of Tesla’s BTC holdings, Definalist disclosed Tesla’s acquisition of an additional 1,790 BTC. Definalist has revealed that in 2023, Tesla’s BTC balance sheet had held about 9,720 BTC. Fast forward to 2024, the automotive company’s portfolio has expanded to 11,510 BTC, revealing an unreported acquisition of an extra 1,790 BTC. This significant Bitcoin purchase could be attributed to the growing enthusiasm for the cryptocurrency, driven by its recent bullish momentum and massive price increases. At the time of writing, Bitcoin is trading at a price of $67,279, according to CoinMarketCap. The cryptocurrency previously surged to an all-time high of $69,200 on March, 5, after which it retraced to its current price level. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}