{
    "title": "Musk said Tesla cars would rise in value, but the opposite happened",
    "date": "3/3/2024",
    "url": "https://www.cnn.com/2024/03/03/cars/musk-tesla-cars-value-ev-prices/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Back in 2019, Elon Musk made an astonishing claim for Tesla vehicles. Tesla cars, he said, would go up in value, not down, after purchase. The reason for that is Tesla’s full self-driving capability that, Musk has said, requires only some additional software updates and regulatory approval before Tesla vehicles on the road today will become fully independent. He repeated this claim as recently as June 2023. “You can think of every car we sell or produce that has full autonomy capability as something that in the future may be worth five times what it is today,” he said in the company’s third quarter, 2023, earnings call. And not only would the price of a used Tesla go up, but Musk also predicted a world in which Tesla’s driver assistance suite, which the company calls “Full Self-Driving” despite not fully self-driving the vehicle, would on its own be worth $100,000. Because, with regulatory approval, your self-driving Tesla would be able to go “work” as a taxi on your behalf. All you’d have to do is sit back and collect the cash. But four years after Musk’s 2019 prediction, the average used Tesla Model 3 is selling for $29,000. And regulatory approval for FSD has not arrived, either, as the company incrementally attempts to improve the software. To be clear, used cars do not generally rise in value. Except for that crazy time in the early 2020s when all automotive production virtually came to a halt and almost all cars became, for a year or so, appreciating assets. Beyond that market quirk, though, Musk has been wrong. Used Teslas have dropped precipitously in value over the past year or two, as Tesla has struggled to maintain its commanding dominance in the market for new electric vehicles. By aggressively slashing price of its own new cars and SUVs, Tesla has also created a domino effect, pushing down the values of other EVs, as well. In 2020, Tesla made 80% of all EVs sold in America, according to Cox Automotive. By 2022, its EV market share had fallen to 64%. Last year, it fell further to 55%. This was a natural development as more competitors entered the market. Car shoppers can now choose EVs from Ford, Hyundai, Kia, Audi, Volkswagen and others. Tesla’s response was, evidently, aggressive price cuts, as it tried to slow the erosion of its EV market share. Sticker prices for new Teslas dropped about 21% over the past year, according to Cox Automotive. During the past year, the price of a used 2021 Tesla Model 3 sedan has dropped, on average, about 29%, going from $40,522 in January of 2023 to just $28,700 in January 2024, according to data from Edmunds.com. In general, model year 2021 used vehicles of all types lost about 19.5% in value over that same period. Tesla generally does not respond to media inquiries and did not answer questions about its pricing strategy. Generally speaking, price changes in new vehicles have a direct impact on the price of used vehicles of the same make and model. Logically, people expect to pay less for a used car than they would for a new one. So when the price of a new car drops, the value of used versions of that model are pushed do﻿wn as well. Why buy a used car if you could get a brand new vehicle for only a little more or maybe even less, after all? “What were the most depreciated vehicles in the industry? It’s Tesla,” said Ivan Drury, an auto pricing analyst with Edmunds.com. “It’s an exorbitant amount of money.” Brayden Wall, who lives in Colorado, bought a used 2020 Tesla Model 3 about two years ago for $51,000. He recently offered it at a Tesla dealership as a trade in, he said, and was offered only $22,000 for it. Wall said he does not regret his decision to buy a Tesla, only his timing. “I understand vehicles drop in value and are not investments,” he said in a text message. “But losing well over 50% of a $50,000 purchase in 18 months is a huge kick in the ass.” The rapid drop in value of used Teslas was a big part of the reason that, in January Hertz announced it was selling 20,000 electric vehicles, the large majority of them Teslas. Rental car companies count on being able to sell cars on the used market after a certain time, which makes resale values critical to the business. Tesla’s cratering resale value hurt Herz’s bottom line. “[T]he deployment of Teslas has become a more expensive proposition because when the [manufacturer’s suggested retail price] came down, the residual came down and the depreciation went up,” Hertz chief executive Stephen Scherr said during an earnings call last month. The downward pressure on Tesla’s own car values has caused price competition throughout the market for used EVs. “Tesla doesn’t throw a pebble in the pond,” Drury said, “They’re throwing boulders and it does make waves. It does have repercussions that affect the entire used EV industry.” For instance, the average price of a used 2021 Ford Mustang Mach-E fell almost 37% over the past year. In terms of its size, price and specifications, the Mach-E is a very close competitor to the Tesla Model Y, which dropped 31% over that same period. Meanwhile, the average price of all other used model year 2021 EVs has dropped about 34%, although that figure can vary greatly, Drury said. This is what happens in the EV market when Tesla makes a move because, although it’s less dominant, it still has an outsized impact. Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}