{
    "title": "Lawyers who sunk Musk's pay package ask for $6B worth of Tesla stock",
    "date": "3/1/2024",
    "url": "https://www.businessinsider.com/elon-musk-delaware-tesla-pay-package-lawyers-six-billion-stock-2024-3",
    "text": "       Lawyers for a Tesla shareholder successfully argued in a Delaware court that Elon Musk doesn't deserve a $55-billion compensation package for his work at the EV company. Instead, some of that compensation package should go to them in attorney fees, the lawyers argued to a Delaware judge. The attorneys argued in a Friday court filing that the fee for their litigation work amounts to about 11% of the pay package. That amounts to about $5.96 billion worth of Tesla shares based on the current price of the company's stock at $202.64 per share. Chancellor Kathleen McCormick of the Delaware Chancery Court now has to decide how much of the compensation package can go to attorneys' fees. Tesla and Musk can still choose to appeal the overall decision to void the CEO's stock options. According to the Journal, plaintiff attorneys usually get one-third of a verdict or settlement amount. The attorneys argued in their filing that they were not asking for the \"33% of the quantifiable conferred benefit\" based on \"well-established precedent.\" \"Plaintiff's Counsel have not been paid for their work, nor have any of their costs or expenses been reimbursed, and litigating this Action required the allocation of a substantial amount of Plaintiff's Counsel's time and resources over six years, including considerable out-of-pocket expenses,\" the attorneys wrote. Related stories Musk, unsurprisingly, is not happy with the lawyers' demand. \"The lawyers who did nothing but damage Tesla want $6 billion,\" he wrote on X on Friday evening. \"Criminal.\" The lawyers who did nothing but damage Tesla want $6 billion. Criminal. https://t.co/JI6eQPTxQ2 In 2018, Richard Tornetta, a former heavy metal drummer and Tesla shareholder, sued the EV company, arguing that the Tesla CEO leveraged his close ties with the company's board members to secure a massive pay package and, as a result, the company breached its fiduciary responsibilities to its shareholders. McCormick agreed in January with Tornetta and struck down Musk's pay package. The decision infuriated Musk, who later proclaimed on X that one should \"never incorporate your company in the state of Delaware.\" Tornetta's lawyers, including lead attorney Greg Varallo of Bernstein Litowitz Berger & Grossman, wrote in the Friday court filing that his team is prepared to \"eat our cooking.\" Firms Andrews & Springer and Friedman Oster & Tejtel were also part of the plaintiff's team. The lawyers did recognize that the payday would be a record-breaking ask. \"We recognize that the requested fee is unprecedented in terms of its absolute size,\" he said in the filing. \"The size of the requested award is great because the value of the benefit to Tesla that plaintiff's counsel achieved was massive.\" Musk did not immediately return a request for comment sent outside working hours. Read next Jump to "
}