{
    "title": "Elon Musk vs. OpenAI: Every time the Tesla boss criticised the Sam \nAltman-led AI startup",
    "date": "3/2/2024",
    "url": "https://indianexpress.com/article/technology/artificial-intelligence/elon-musk-sues-openai-series-of-events-9192144/",
    "text": "Elon Musk has filed a lawsuit against OpenAI, the artificial intelligence research company he co-founded in 2015. Musk is accusing OpenAI of straying from its original nonprofit mission and instead focusing on generating profits. This latest legal action caps years of growing tensions between Musk and OpenAI. Here’s a look at the series of events that led up to the lawsuit. Musk has expressed dissatisfaction with OpenAI’s direction for years now. He officially stepped down from OpenAI’s board in 2018, citing potential conflicts of interest with his electric vehicle company Tesla. However, the real reason, according to reports, was Musk’s frustration with OpenAI falling behind rival AI labs. Musk even proposed taking over OpenAI himself so he could steer the organisation, but this idea was rejected by OpenAI CEO Sam Altman and other founders. After this rejection, Musk stopped providing further funding to OpenAI, reneging on a pledge to donate around $1 billion over time. This left OpenAI without Musk’s promised resources to pay for costly AI research. The nonprofit pivoted to for-profit status soon after to seek outside investment, with Microsoft emerging as a major backer. This corporate direction only further alienated Musk. In December 2022, shortly after OpenAI unveiled its viral ChatGPT chatbot, Musk revoked OpenAI’s access to Twitter data. Musk had granted OpenAI access to Twitter’s firehose of data before acquiring the social media company. Musk also called out OpenAI on Twitter in February 2023 for straying from its original open source nonprofit mission: “OpenAI was created as an open source (which is why I named it ‘Open’ AI), non-profit company to serve as a counterweight to Google, but now it has become a closed source, maximum-profit company effectively controlled by Microsoft.” Then in March 2023 Musk directly questioned the legality of OpenAI’s evolution from nonprofit to a highly valued for-profit: “I’m still confused as to how a non-profit to which I donated ~$100M somehow became a $30B market cap for-profit. If this is legal, why doesn’t everyone do it?” Musk’s lawsuit alleges that OpenAI and Altman have betrayed the company’s original nonprofit charter of developing AI to benefit humanity. Instead, Musk claims OpenAI is now laser-focused on maximising profits for investors like Microsoft, which has poured over $10 billion into the company’s for-profit arm. As evidence, Musk points to OpenAI refusing to share details of its powerful GPT-4 language model that builds on the ChatGPT technology. Musk is also demanding the return of the $44 million he donated to OpenAI before withdrawing support. He argues OpenAI induced these donations under false pretenses of remaining a nonprofit research organisation. The entire saga is rife with contradictions. Musk originally positioned OpenAI as a counterbalance to Google and big tech’s dominance in AI research. Yet now Microsoft has emerged as OpenAI’s biggest backer, granting it massive cloud computing resources. In effect, OpenAI has become part of the Big Tech complex Musk hoped it would keep in check. There’s also irony in Musk slamming OpenAI for a lack of transparency and openness. After acquiring Twitter, Musk has run the social media company in an opaque, chaotic fashion bitterly criticised by many.  Delhi Chief Minister Arvind Kejriwal's uncle, Girdhar Lal Bansal, speaks about his nephew's rise to power and his recent arrest. Locals in Kejriwal's ancestral village express disappointment with his lack of visits and the AAP's failure to make an impact in Haryana.    "
}