{
    "title": "Tesla tumbles on price cuts and reports of German protests",
    "date": "3/4/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1042340/tesla-tumbles-on-price-cuts-and-reports-of-german-protests-1042340.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Oliver has been writing about companies and markets since the early 2000s, cutting his teeth as a financial journalist at Growth Company Investor with a focusing on AIM companies and small caps, before a few years later becoming a section editor and then head of research. He joined Proactive after a couple of years freelancing, where he worked for the Financial Times Group, ITV, Press Association, Reuters sports desk, the London Olympic News Service, Rugby World Cup News Service, Gracenote... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 19:33 04 Mar 2024 GMT Tesla Inc (NASDAQ:TSLA, ETR:TL0) shares fell over 7% on the back a fresh round of price cuts launched in China and the US, as well as reports that it is facing growing opposition in Germany. A note from analysts at Deutsche Bank noted local reports that the electric vehicle manufacturer has started to offer incentives of up to around $5,000 in China on Model 3 and Model Y. Incentives in its home market include offering 5,000 miles of free use of its fast-charging network, in addition to offering full self-driving and other promotions through to the end of March. Last year, Elon Musk's company launched a series of price cuts in China to try and deal with fierce price competition from local rivals, while in the US it was seen as spicing up demand. Meanwhile, in Germany, there were reports of protesters outside its Berlin plant, a vote against the company's plan to expand the plant and calls from the local water authority to cut the Tesla Gigafactory off from the wastewater system as it was almost continually polluting it with discharges of excess phosphorus and nitrogen. These anti-Tesla Germans have camped out in the woods bordering the plant, some in treehouses and fed by communal kitchens, according to the Telegraph, with an impromptu piano concert held recently. At $188.34, Tesla shares are down over a third from their one-year high last July and have more than halved from their all-time high in late 2021. Sign up to receive alerts and news direct to your inbox Oriole Resources PLC (AIM:ORR) CEO Tim Livesey and chief financial officer Bob Smeeton join Proactive's Stephen Gunnion with details of the company's 2023 financial and operational performance.\r\n\r\nLivesey highlighted successful exploration programs in Cameroon, at the Bibemi and Mbe projects,... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}