{
    "title": "Tesla, French Partner Neoen, To Build Another Gigantic Lithium-Ion Battery \nIn Australia",
    "date": "3/29/2024",
    "url": "https://www.aol.com/tesla-french-partner-neoen-build-103130407.html",
    "text": "Advertisement For premium support please call: Tesla Inc (NASDAQ: TSLA) is partnering with Paris-based independent energy producer Neoen SA to set up a massive lithium-ion battery site in Australia. What Happened: Neoen will be responsible for handling the grid's system integrity, the Financial Times reports. Whereas, Tesla will supply its megapack technology. The battery plant could be operational sometime towards the end of 2021. The 300-megawatt Victorian Big Battery plant will be located in Geelong city in Australia’s second-most populous state — Victoria. The move is in sync with Australia’s renewable energy targets. Presently, the Australian government is aiming for 50% power generation from renewable sources by 2030. Why Does It Matter: Energy Minister for the Victorian State, Lily D’Ambrosio, told Bloomberg that the project would not only support the economy with reduced energy prices and increased jobs but also support the network grids during Australia’s extreme summers. The state’s energy grid is powered by coal-reliant energy plants, which failed in recent summers leading to power outages. Before the Victorian project, the Elon Musk-led electric vehicle maker partnered with the French company for the Hornsdale wind farm project, which was the largest facility supporting essential grid services when it began operations in 2017. It was dethroned from the top spot in August, with the opening of the 230-megawatt project in San Diego, California, Bloomberg reported separately. Price Action: Tesla shares traded 2.86% higher at $433 in the pre-market session on Thursday. See more from Benzinga Click here for options trades from Benzinga Why Qualcomm Shares Surged Over 12% After-Hours Wednesday Jeff Bezos Sells Another B Worth Of Amazon Shares © 2020 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}