{
    "title": "Hertz to replace CEO after 'disastrous' bet on Tesla and EVs",
    "date": "3/16/2024",
    "url": "https://finbold.com/hertz-to-replace-ceo-after-disastrous-bet-on-tesla-and-evs/",
    "text": "Car rental company Hertz Global (NASDAQ: HTZ) Chief Executive Stephen Scherr has been replaced as the firm seeks to boost its business after a disastrous bet on electric vehicles (EV) that involved brands such as Tesla (NASDAQ: TSLA). In a statement on March 15, Hertz stated that Scherr had decided to step down alongside quitting his position on the board and will be replaced by Gil West, a former executive at Delta Air Lines (NYSE: DAL). “We are thrilled to have Gil join Hertz as Chief Executive Officer. Gil’s experience as a successful leader in operationally intensive businesses will further strengthen the Company’s world class team.  We are appreciative of Stephen’s contribution over the last two years, including on a number of key strategic initiatives,” said Tom Wagner, Vice Chair of the Hertz Board of Directors. The leadership changes come at a critical juncture for Hertz, which has been grappling with rising repair costs and subdued demand for its electric vehicle rental offerings. It’s noteworthy that Scherr joined Hertz several months following its emergence from bankruptcy and initiation of ambitious ventures into electric vehicles. One of these ventures involved Hertz placing a significant order of 100,000 vehicles from Tesla. Under Scherr’s tenure, Hertz intensified its commitment to electric vehicles, securing substantial orders from Polestar, the electric car manufacturer under the ownership of China’s Geely and Sweden’s Volvo Car, as well as from General Motors (NYSE: GM). Interestingly, the electric vehicle strategy took a downturn in 2023 when Tesla drastically reduced prices across its product range to bolster sales volume. This action substantially depreciated the resale value of Hertz’s recently acquired fleet of used Model 3 sedans and Model Y crossovers. JUST IN : HERTZ HAS JUST FIRED ITS CEO AFTER HE MADE THE DISASTROUS DECISION OF BETTING BIG ON TESLA’S AND OTHER ELECTRIC VEHICLES HIS EV BET CAUSED HERTZ TO LOSE 100’S OF MILLIONS OF DOLLARS PER BLOOMBERG $HTZ As a result, the car rental firm reversed its course by revealing intentions to sell approximately one-third of its global electric vehicle fleet, attributing this decision to lackluster demand and escalating repair expenses. This action appears to align with the broader trend in the automotive industry, which has reconsidered its stance on electric vehicles following years of ambitious initiatives and forecasts. In conjunction with the divestment, Hertz announced its plan to reinvest some of the proceeds into purchasing internal combustion engine cars. However, this move will incur a $245 million incremental net depreciation expense. In the meantime, amidst the news, HTZ closed the week on a positive note at $7.58, reflecting a 24-hour gain of about 1.2%. However, overall in 2024, the stock continues to struggle, having lost 25.69% of its value year-to-date. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}