{
    "title": "Jessup Wealth Management Inc Invests $5 Million in Tesla, Inc. (NASDAQ:TSLA)",
    "date": "3/23/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsla-sec-filing-2024-03-23/",
    "text": "Jessup Wealth Management Inc bought a new position in shares of Tesla, Inc. (NASDAQ:TSLA - Free Report) during the fourth quarter, according to its most recent 13F filing with the Securities & Exchange Commission. The fund bought 20,116 shares of the electric vehicle producer's stock, valued at approximately $4,998,000. Tesla comprises approximately 2.5% of Jessup Wealth Management Inc's holdings, making the stock its 18th largest position. A number of other institutional investors have also added to or reduced their stakes in TSLA. Axiom Financial Strategies LLC boosted its position in Tesla by 9.8% during the first quarter. Axiom Financial Strategies LLC now owns 906 shares of the electric vehicle producer's stock worth $777,000 after purchasing an additional 81 shares during the period. Mirae Asset Global Investments Co. Ltd. boosted its position in Tesla by 19.7% during the first quarter. Mirae Asset Global Investments Co. Ltd. now owns 1,001,923 shares of the electric vehicle producer's stock worth $1,079,672,000 after purchasing an additional 164,789 shares during the period. MAS Advisors LLC boosted its position in Tesla by 25.7% during the first quarter. MAS Advisors LLC now owns 396 shares of the electric vehicle producer's stock worth $433,000 after purchasing an additional 81 shares during the period. Ergoteles LLC boosted its position in Tesla by 33.4% during the first quarter. Ergoteles LLC now owns 3,567 shares of the electric vehicle producer's stock worth $3,844,000 after purchasing an additional 893 shares during the period. Finally, Mackenzie Financial Corp boosted its position in Tesla by 6.8% during the first quarter. Mackenzie Financial Corp now owns 72,167 shares of the electric vehicle producer's stock worth $77,767,000 after purchasing an additional 4,593 shares during the period. 41.87% of the stock is currently owned by institutional investors and hedge funds. In other news, SVP Andrew D. Baglino sold 10,500 shares of the company's stock in a transaction that occurred on Thursday, February 29th. The stock was sold at an average price of $204.17, for a total value of $2,143,785.00. Following the completion of the transaction, the senior vice president now owns 31,230 shares of the company's stock, valued at $6,376,229.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this link. In related news, Director Robyn M. Denholm sold 93,706 shares of the company's stock in a transaction that occurred on Wednesday, February 21st. The stock was sold at an average price of $194.73, for a total value of $18,247,369.38. Following the sale, the director now directly owns 15,000 shares in the company, valued at $2,920,950. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, SVP Andrew D. Baglino sold 10,500 shares of the company's stock in a transaction that occurred on Thursday, February 29th. The shares were sold at an average price of $204.17, for a total value of $2,143,785.00. Following the completion of the sale, the senior vice president now owns 31,230 shares in the company, valued at $6,376,229.10. The disclosure for this sale can be found here. Insiders sold 198,598 shares of company stock valued at $36,952,434 over the last quarter. 25.10% of the stock is owned by company insiders. TSLA has been the subject of a number of recent research reports. The Goldman Sachs Group reduced their target price on shares of Tesla from $220.00 to $190.00 and set a \"neutral\" rating for the company in a research report on Monday, March 18th. Robert W. Baird reissued an \"outperform\" rating and issued a $300.00 target price on shares of Tesla in a research report on Thursday, January 25th. Wedbush reissued an \"outperform\" rating and issued a $315.00 target price on shares of Tesla in a research report on Wednesday, March 13th. Morgan Stanley reduced their target price on shares of Tesla from $345.00 to $320.00 and set an \"overweight\" rating for the company in a research report on Wednesday, March 6th. Finally, Guggenheim boosted their target price on shares of Tesla from $125.00 to $132.00 and gave the company a \"sell\" rating in a research report on Friday, December 15th. Ten equities research analysts have rated the stock with a sell rating, fourteen have given a hold rating and nine have given a buy rating to the company's stock. Based on data from MarketBeat, Tesla presently has an average rating of \"Hold\" and a consensus price target of $211.93. Get Our Latest Stock Report on Tesla NASDAQ TSLA traded down $1.99 during trading on Friday, hitting $170.83. 75,580,637 shares of the company's stock were exchanged, compared to its average volume of 98,103,592. The company has a current ratio of 1.73, a quick ratio of 1.25 and a debt-to-equity ratio of 0.05. The company has a market cap of $544.06 billion, a PE ratio of 39.64, a P/E/G ratio of 3.89 and a beta of 2.41. Tesla, Inc. has a fifty-two week low of $152.37 and a fifty-two week high of $299.29. The stock's 50 day moving average price is $190.26 and its two-hundred day moving average price is $223.61. Tesla (NASDAQ:TSLA - Get Free Report) last released its quarterly earnings data on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share (EPS) for the quarter, missing the consensus estimate of $0.74 by ($0.03). Tesla had a net margin of 15.50% and a return on equity of 16.62%. The firm had revenue of $25.17 billion during the quarter, compared to analyst estimates of $25.64 billion. During the same period in the prior year, the company earned $1.07 EPS. The business's quarterly revenue was up 3.5% compared to the same quarter last year. Research analysts expect that Tesla, Inc. will post 2.45 EPS for the current year. Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.Recommended StoriesFive stocks we like better than TeslaConsumer Discretionary Stocks ExplainedMarketBeat Week in Review – 3/18 – 3/22Stock Ratings and Recommendations: Understanding Analyst RatingsKB Home: Building on Strong Foundations During Volatile Times3 Monster Growth Stocks to Buy NowNike Stock and the 30% Rally That's Expected  Before you consider Tesla, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list. While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. If the last year of price cuts and sluggish sales weren’t enough to tip off the market to the fact the EV bubble has burst, Tesla’s NASDAQ: TSLA Q4 results and outlook for 2024 should do it. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}