{
    "title": "Elon Musk Knocks MacKenzie Scott, Blames 'Super-Rich Ex-Wives' For Downfall \nOf Civilization",
    "date": "3/25/2024",
    "url": "https://ca.news.yahoo.com/elon-musk-knocks-mackenzie-scott-210430606.html",
    "text": "Elon Musk was giving off bitter divorcé energy while going after Jeff Bezos’ ex-wife, MacKenzie Scott, in a now-deleted tweet. In a Wednesday post, Tesla CEO Musk seemed unreasonably invested in how Scott has been spending the billions she was awarded in her 2019 divorce from Amazon founder Bezos. Responding to an X user whining about Scott donating to organizations that focus on “issues of race and/or gender,” Musk declared, “Super rich ex-wives who hate their former spouse” should “be listed among ‘Reasons that Western Civilization died.’” By Thursday morning, the thrice-divorced father of eleven’s post had been removed, but was still available to be seen via the Internet Archive’s Wayback Machine. This wasn’t the first time Musk appears to have projected his anxieties onto Scott. In a 2022 tweet explaining why he planned to vote Republican, Musk accused Democrats of being cold to his businesses due to the influence of “Mackenzie’s donation to PACs posing as charities.” Suggesting her philanthropy was motivated by spite in another post, Musk said, “It’s safe to say that Mackenzie [ahem] Scott is not exactly a big fan of her ex-husband.” Painting himself as collateral damage, he added, “Unfortunately, a lot of others are getting caught in the crossfire.” Last December, Scott announced she had donated a total of $2.1 billion across 360 organizations during 2023. The list of organizations reveals a wide range of missions and includes groups that focus on early learning, access to affordable housing, race and gender equity, health equity, civic and social engagement and more. Jeff Bezos Jokingly Threatens Leonardo DiCaprio For Talking With His Girlfriend Donald Trump Reportedly Met With Elon Musk Amid Need For ‘Cash Infusion’ Jeff Bezos Bashes Biden's Agenda, Saying Manchin 'Saved' Dems From Themselves Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. Gypsy Rose Blanchard was recently released from prison after serving eight years. She married her husband while in prison in July 2022  Timothy Stephenson had an enviable life: He was married to a doctor, and they shared a $2 million home with their twin daughters in a peaceful California suburb. But Stephenson harbored a dark secret. Adam King was arrested following a sting operation where he allegedly said he had drugged and sexually assaulted his nieces and nephews, per investigators TORONTO — A Toronto woman facing multiple charges in a dog attack that seriously injured a child was previously deemed an “irresponsible” owner of dangerous dogs and subsequently ordered evicted from her apartment, according to court records and her former landlord. Patrycja Siarek, 38, was charged with criminal negligence causing bodily harm and other offences after an off-leash dog bit and dragged a child at a Toronto park last Saturday. Police have said the attack left the child with life-alt 褪黑激素已經使用了幾十年，因為它能夠幫助人們更快入睡並保持更長的睡眠時間。 現在，一種新的高品質褪黑激素正在展現出更大的前景。 TAXCO, Mexico (AP) — A mob in the Mexican tourist city of Taxco brutally beat a woman to death Thursday because she was suspected of kidnapping and killing a young girl, rampaging just hours before the city’s famous Holy Week procession. On the eve of Good Friday, men walk through the colonial streets of Taxco wearing hoods, whipping themselves or carrying heavy bundles of thorns in penitence. That and other Holy Week processions date back centuries in the old silver-mining town. The mob formed “The living conditions were horrendous, with bugs, feces and trash scattered throughout the home,” local police in California said McKinley Slone Hernandez, 25, has pleaded not guilty to charges of child abuse - cruelty  The largest crane on the East Coast will soon try to lift the treacherous, colossal wreckage that has hampered search crews from finding victims of this week’s catastrophic Baltimore bridge collapse. Forfeiting the merchandise is the price of losing, she said. BALTIMORE (AP) — A crane that can lift 1,000 tons, described as one of the largest on the Eastern Seaboard, appeared near the site of a collapsed highway bridge in Baltimore as crews prepared Friday to begin clearing wreckage that has stymied the search for four workers missing and presumed dead and blocked ships from entering or leaving the city's vital port. Maryland Gov. Wes Moore called the Francis Scott Key Bridge's collapse following a freighter collision an “economic catastrophe\" and desc Play this game for 1 minute and see why everyone is addicted. A roundup of some of the most popular but completely untrue stories and visuals of the week. None of these are legit, even though they were shared widely on social media. The Associated Press checked them out. ___ Video from 2022 misrepresented as footage of Baltimore bridge collapse CLAIM: A video taken on Baltimore’s Francis Scott Key Bridge shows a large explosion that occurred before the structure fell into the water below. THE FACTS: The video is not related to the Key Bridge collapse. It c Former President Donald Trump’s endorsement of a patriotic Bible during Holy Week has been challenged by some Christians who say it preys on people’s faith for profit. PATERSON, N.J. (AP) — Jameek Lowery entered the dimly lit lobby of the city’s police headquarters in a panic. He was having a mental breakdown — and needed help. Barefoot and wearing only pajama pants and a sweatshirt in the pre-dawn hours of Jan. 5, 2019, Lowery pulled out his cellphone and began a social media broadcast of an anti-police rant. “Why y’all trying to kill me?” Lowery asked several Paterson police officers on his Facebook Live video feed. “If I’m dead in the next hour or two, they 享受耕種、儲糧和交朋友的樂趣。塔恩加的世界裡充滿了精彩的冒險！ Shaunda Bizzell was killed by a man who drove his car into her and her husband minutes after he called 911 and made threats to bomb a building, police allege A Toronto police officer who has been the subject of multiple cases of misconduct in the workplace, including an incident where he was found guilty of assaulting a cyclist, is set to be fired. NEW YORK (AP) — Crypto entrepreneur Sam Bankman-Fried was sentenced Thursday to 25 years in prison for a massive fraud on hundreds of thousands of customers that unraveled with the collapse of FTX, once one of the world’s most popular platforms for exchanging digital currency. Though he described Bankman-Fried as “extremely smart,” U.S. District Judge Lewis A. Kaplan delivered a blistering analysis of Bankman-Fried and his crimes before announcing a sentence that was half of what prosecutors sou He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Valerie Owusu and Emmanuel Addae were convicted of murdering Owusu's son McALLEN, Texas (AP) — A Texas woman who was charged with murder over self-managing an abortion and spent two nights in jail has sued prosecutors along the U.S.-Mexico border who put the criminal case in motion before it was later dropped. The lawsuit filed by Lizelle Gonzalez in federal court Thursday comes a month after the State Bar of Texas fined and disciplined the district attorney in rural Starr County over the case in 2022, when Gonzalez was charged with murder in “the death of an individ Jimmy Chérizier - known as Barbecue - sets his price for ordering his armed group to lay down weapons. "
}