{
    "title": null,
    "date": "3/17/2024",
    "url": "https://www.teslarati.com/tesla-tsla-counters-bear-narrative-big-picture/",
    "text": "Tesla (NASDAQ: TSLA) has been the subject of several bearish narratives this week in analyst notes. However, Adam Jonas of Morgan Stanley countered those notes with a new communication to investors late this week that looks at the big picture. Of the three analyst notes we’ve covered this week, two have described lackluster outlooks for Tesla’s future. As demand begins to slightly reduce in speed and Tesla gears up for a “notably lower” growth phase due to its focus on the next-generation platform, which will be released next year, analysts are concerned about the stock’s future. However, not every analyst looks at Tesla’s story negatively. Wedbush’s Dan Ives said in a note to investors this week that the negative sentiments are “overdone” in their opinion. Adam Jonas believes that Tesla’s long-term picture is much bigger than just the automotive side of things, which is true. Many forget that Tesla is more than just a car company, offering energy storage, AI, and robotics projects. However, Jonas’s newest note does not take into account the robotics portion of Tesla’s story, at least from a price target perspective. With that being said, Morgan Stanley does believe it is part of the bigger picture for the company. “Our message to investors: Prepare for the theme of humanoid robotics to potentially accelerate in the months and years ahead for a number of factors,” Jonas writes. “WE recently discussed our thoughts in a December note where we discussed ‘mobile AI’ as akin to Cambrian Explosion that may profoundly impact our way of life.” It’s no secret that Tesla is pushing more time into robotics and AI, and Jonas believes that “Tesla CEO Elon Musk is spending increasing amounts of time” on developing the Optimus project, its humanoid robot. Tesla shares more footage of Optimus walking improvements  Jonas and Morgan Stanley said their $320 price target is comprised of automotive hardware, software, and energy-related businesses, leaving out the potential impact robotics could have. “While Tesla’s competencies in computer vision, machine learning, AI, and robotics may have a multitude of adjacent commercial applications, we have not included such revenue streams (including Optimus) in our model or valuation at this time.” Disclosure: Joey Klender owns Tesla stock. I’d love to hear from you! If you have any comments, concerns, or questions, please email me at joey@teslarati.com. You can also reach me on Twitter @KlenderJoey, or if you have news tips, you can email us at tips@teslarati.com. While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Tesla has rolled out a handful of new wrap colors for multiple of its... Copyright © TESLARATI. All rights reserved. "
}