{
    "title": "Tesla's Growth Engine Stuttering? Deliveries Miss Looms As Analyst \nQuestions High Valuation: 'Looks Vulne",
    "date": "3/24/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/03/37908015/teslas-growth-engine-stuttering-deliveries-miss-looms-as-analyst-questions-high-val",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Tesla, Inc. TSLA is set to report its first-quarter deliveries early next week, and on Sunday, a fund manager reiterated his warning that the figures may significantly miss the current forecast. What Happened: Gary Black, managing partner of Future Fund, highlighted the risk of Tesla’s first-quarter volume falling well below the consensus estimate, which currently stands at 468,000 units. Black anticipates the number to be around 425,000 units, roughly on par with the year-ago volume of 423,000 units. He mentioned that Tesla’s Investor Relations-compiled consensus would be released on Friday or Saturday, with the company likely to announce the number on April 2. See Also: Everything You Need To Know About Tesla Stock What About Soft Numbers? Black suggested that Tesla investors may overlook the first-quarter shortfall due to the Model 3 upgrade at the Fremont factory. He estimates the shortfall to be around 30,000 units compared to the previous year. However, Black expressed concern about the second quarter, which saw 466,000 units sold last year. He believes it may be challenging to surpass this figure, potentially leading the company to further reduce prices. Black’s firm, which manages the flagship exchange-traded fund Future Fund Active ETF FFND, recently significantly reduced its exposure to Tesla. Addressing Investor Concerns: Black delved into the key investor concern amidst the softness in Tesla’s performance. He raised questions about the price-to-earnings (P/E) multiple investors might assign to a company experiencing minimal or no volume growth. Despite being recognized as a tech company, Tesla’s earnings and volume growth outlooks for 2024 and 2025, respectively, appear “vulnerable,” he noted. “The issue becomes what P/E multiple do investors put on a company with little or no volume growth? This is not about whether TSLA is a car company or a tech company (it's clearly a tech company) but without earnings or volume growth, TSLA's 2024 P/E of 57x on WS 2024 EPS of $3.01, and 2025 P/E of 42x on WS 2025 of $4.02 looks vulnerable,” he said. Regarding the potential solution to the valuation issue, Black discussed the possibility of Tesla’s full self-driving technology achieving Level 4/Level 5 automation, where the company assumes liability for FSD injury or damage. However, he indicated that, in his opinion, Tesla’s management has not yet reached that point. Market Reaction: Tesla closed Friday’s session down 1.15% at $170.83, according to Benzinga Pro data, amidst rumors of production cuts at its Giga Shanghai factory. Year-to-date, the stock has experienced a decline of over 31%. Read Next: Tesla’s China Demand Woes, Ford Plans ‘Electric’ India Reentry, Canoo’s Shot At Improving Profit And More: Biggest EV Stories Of The Week Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}