{
    "title": "Tesla (NASDAQ:TSLA) Price Target Cut to $165.00 by Analysts at UBS Group",
    "date": "3/14/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-tsla-lower-price-target-2024-03-14/",
    "text": "Tesla (NASDAQ:TSLA - Get Free Report) had its price target decreased by stock analysts at UBS Group from $225.00 to $165.00 in a research report issued to clients and investors on Thursday, BayStreet.CA reports. The brokerage currently has a \"neutral\" rating on the electric vehicle producer's stock. UBS Group's target price would suggest a potential upside of 1.54% from the stock's current price. Several other equities analysts have also recently issued reports on TSLA. Guggenheim boosted their price objective on Tesla from $125.00 to $132.00 and gave the company a \"sell\" rating in a report on Friday, December 15th. JPMorgan Chase & Co. reduced their price target on Tesla from $135.00 to $130.00 and set an \"underweight\" rating for the company in a report on Friday, January 26th. Redburn Atlantic assumed coverage on Tesla in a report on Wednesday, January 24th. They issued a \"sell\" rating and a $170.00 price target for the company. Piper Sandler reduced their price target on Tesla from $295.00 to $225.00 and set an \"overweight\" rating for the company in a report on Monday, February 5th. Finally, Edward Jones cut Tesla from a \"buy\" rating to a \"hold\" rating in a report on Friday, January 26th. Ten investment analysts have rated the stock with a sell rating, fourteen have issued a hold rating and nine have assigned a buy rating to the stock. According to MarketBeat.com, the stock presently has a consensus rating of \"Hold\" and a consensus price target of $213.04. Get Our Latest Analysis on Tesla Shares of TSLA stock traded down $6.98 on Thursday, hitting $162.50. The company had a trading volume of 126,006,633 shares, compared to its average volume of 105,907,648. The firm has a market cap of $517.53 billion, a P/E ratio of 37.77, a price-to-earnings-growth ratio of 3.19 and a beta of 2.41. The company has a 50-day moving average price of $199.07 and a 200-day moving average price of $227.58. The company has a quick ratio of 1.25, a current ratio of 1.73 and a debt-to-equity ratio of 0.05. Tesla has a twelve month low of $152.37 and a twelve month high of $299.29. Tesla (NASDAQ:TSLA - Get Free Report) last issued its quarterly earnings data on Wednesday, January 24th. The electric vehicle producer reported $0.71 earnings per share (EPS) for the quarter, missing the consensus estimate of $0.74 by ($0.03). The company had revenue of $25.17 billion during the quarter, compared to analyst estimates of $25.64 billion. Tesla had a net margin of 15.50% and a return on equity of 16.62%. The business's quarterly revenue was up 3.5% compared to the same quarter last year. During the same period last year, the firm earned $1.07 EPS. As a group, equities research analysts predict that Tesla will post 2.49 earnings per share for the current fiscal year. In other Tesla news, SVP Andrew D. Baglino sold 10,500 shares of the company's stock in a transaction on Thursday, February 29th. The stock was sold at an average price of $204.17, for a total transaction of $2,143,785.00. Following the transaction, the senior vice president now directly owns 31,230 shares in the company, valued at $6,376,229.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. In other Tesla news, Director Robyn M. Denholm sold 93,706 shares of the company's stock in a transaction on Wednesday, February 21st. The stock was sold at an average price of $194.73, for a total transaction of $18,247,369.38. Following the transaction, the director now directly owns 15,000 shares in the company, valued at $2,920,950. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, SVP Andrew D. Baglino sold 10,500 shares of the company's stock in a transaction on Thursday, February 29th. The stock was sold at an average price of $204.17, for a total value of $2,143,785.00. Following the transaction, the senior vice president now owns 31,230 shares in the company, valued at $6,376,229.10. The disclosure for this sale can be found here. Over the last three months, insiders have sold 104,893 shares of company stock worth $20,512,829. Insiders own 20.90% of the company's stock. A number of large investors have recently added to or reduced their stakes in TSLA. Deuterium Capital Management LLC acquired a new stake in shares of Tesla in the second quarter valued at $1,314,000. Synergy Financial Group LTD raised its stake in shares of Tesla by 7.3% in the second quarter. Synergy Financial Group LTD now owns 6,432 shares of the electric vehicle producer's stock valued at $1,684,000 after acquiring an additional 438 shares in the last quarter. New Republic Capital LLC acquired a new stake in shares of Tesla in the second quarter valued at $429,000. Oak Ridge Investments LLC raised its stake in shares of Tesla by 4.6% in the third quarter. Oak Ridge Investments LLC now owns 32,230 shares of the electric vehicle producer's stock valued at $8,065,000 after acquiring an additional 1,405 shares in the last quarter. Finally, Charter Oak Capital Management LLC raised its stake in shares of Tesla by 8.9% in the third quarter. Charter Oak Capital Management LLC now owns 1,271 shares of the electric vehicle producer's stock valued at $318,000 after acquiring an additional 104 shares in the last quarter. 41.87% of the stock is currently owned by institutional investors and hedge funds. Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.Featured ArticlesFive stocks we like better than TeslaGolden Cross Stocks: Pattern, Examples and Charts Defense Contractor Stocks Explained, Plus Investment GuideWhat Investors Need to Know to Beat the MarketOracle's AI Cloud Demand Fuels Profitability SurgeMost active stocks: Dollar volume vs share volumeAnalysts Lead These Markets: The Most Upgraded Stocks in Q1  Before you consider Tesla, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Tesla wasn't on the list. While Tesla currently has a \"Reduce\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list. If the last year of price cuts and sluggish sales weren’t enough to tip off the market to the fact the EV bubble has burst, Tesla’s NASDAQ: TSLA Q4 results and outlook for 2024 should do it. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}