{
    "title": "Xiaotong Zhu Sells 687 Shares of Tesla, Inc. (NASDAQ:TSLA) Stock",
    "date": "3/10/2024",
    "url": "https://www.defenseworld.net/2024/03/10/xiaotong-zhu-sells-687-shares-of-tesla-inc-nasdaqtsla-stock.html",
    "text": "Posted by Defense World Staff on Mar 10th, 2024 Tesla, Inc. (NASDAQ:TSLA – Get Free Report) SVP Xiaotong Zhu sold 687 shares of Tesla stock in a transaction on Wednesday, March 6th. The stock was sold at an average price of $177.11, for a total value of $121,674.57. Following the sale, the senior vice president now owns 63,171 shares in the company, valued at $11,188,215.81. The transaction was disclosed in a legal filing with the SEC, which is available through the SEC website. Shares of NASDAQ TSLA opened at $175.34 on Friday. Tesla, Inc. has a 12 month low of $152.37 and a 12 month high of $299.29. The company has a current ratio of 1.73, a quick ratio of 1.25 and a debt-to-equity ratio of 0.05. The firm has a market capitalization of $558.42 billion, a price-to-earnings ratio of 40.68, a PEG ratio of 3.07 and a beta of 2.41. The business has a 50-day moving average of $203.28 and a 200-day moving average of $228.84. Tesla (NASDAQ:TSLA – Get Free Report) last issued its quarterly earnings data on Wednesday, January 24th. The electric vehicle producer reported $0.71 EPS for the quarter, missing the consensus estimate of $0.74 by ($0.03). The business had revenue of $25.17 billion for the quarter, compared to analysts’ expectations of $25.64 billion. Tesla had a return on equity of 16.62% and a net margin of 15.50%. The firm’s revenue for the quarter was up 3.5% compared to the same quarter last year. During the same period in the previous year, the firm posted $1.07 EPS.  Sell-side analysts expect that  Tesla, Inc. will post 2.49 earnings per share for the current fiscal year. TSLA has been the topic of a number of recent analyst reports. China Renaissance initiated coverage on Tesla in a research note on Monday, February 26th. They set a “hold” rating on the stock. Jefferies Financial Group lowered their target price on Tesla from $225.00 to $185.00 and set a “hold” rating on the stock in a research note on Monday, January 29th. Guggenheim lifted their target price on Tesla from $125.00 to $132.00 and gave the stock a “sell” rating in a research note on Friday, December 15th. Morgan Stanley lowered their target price on Tesla from $345.00 to $320.00 and set an “overweight” rating on the stock in a research note on Wednesday. Finally, Wedbush  restated an “outperform” rating and issued a $315.00 price objective on shares of Tesla in a research note on Wednesday, January 31st. Nine equities research analysts have rated the stock with a sell rating, sixteen have issued  a hold rating and nine have issued  a buy rating to the stock. According to data from MarketBeat.com, the stock  has a consensus rating of “Hold” and an average target price of $218.04. Get Our Latest Research Report on TSLA Several hedge funds and other institutional investors have recently bought and sold shares of the company. Vanguard Group Inc. boosted its stake in shares of  Tesla by 1.7% during the fourth quarter. Vanguard Group Inc. now owns 229,806,241 shares of the electric vehicle producer’s stock valued at $57,102,255,000 after purchasing an additional 3,866,230 shares during the period.  State Street Corp raised its holdings in shares of  Tesla by 4.4% during the second quarter. State Street Corp now owns 104,115,390 shares of the electric vehicle producer’s stock valued at $27,254,286,000 after acquiring an additional 4,431,570 shares in the last quarter.  Geode Capital Management LLC raised its holdings in shares of  Tesla by 3.2% during the second quarter. Geode Capital Management LLC now owns 51,656,526 shares of the electric vehicle producer’s stock valued at $13,484,212,000 after acquiring an additional 1,608,559 shares in the last quarter.  Norges Bank bought a new position in shares of  Tesla during the fourth quarter valued at approximately $7,844,757,000.  Finally, Morgan Stanley raised its holdings in shares of  Tesla by 7.8% during the third quarter. Morgan Stanley now owns 30,160,747 shares of the electric vehicle producer’s stock valued at $7,546,823,000 after acquiring an additional 2,177,397 shares in the last quarter. Hedge funds and other institutional investors own  41.87% of the company’s stock. (Get Free Report) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services.    Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter. Natixis Advisors L.P. Increases Stock Position in Kennedy-Wilson Holdings, Inc. (NYSE:KW) Matterport, Inc. (NASDAQ:MTTR) CEO Sells $134,905.66 in Stock "
}