{
    "title": "Automakers, airlines see stocks slide: Trending Tickers",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/video/automakers-airlines-see-stocks-slide-220858665.html",
    "text": "Tesla (TSLA) shares fell on Wednesday following reports that it cut prices for its Model Y vehicles in Germany after already reducing prices in China. The EV automaker also faces disruptions as vessels re-route away from the Red Sea—which analysts expect will likely lead to a halt in production at Tesla's Berlin facility from late January to early February. In the broader auto industry, Ford (F) shares also slid after a UBS downgrade to \"Neutral\"—UBS analysts cited limited upside, though also indicated more potential for earnings growth at rival General Motors (GM). JetBlue (JBLU) and Spirit Airlines shares continued to fall after a federal judge blocked JetBlue's acquisition of Spirit Airlines (SAVE), raising questions about the impact on JetBlue's new CEO and potential implications for other airline mergers like Alaska Air Group's (ALK) proposed acquisition of Hawaiian Holdings (HA). For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Eyek Ntekim JOSH LIPTON: Tesla shares sliding as the company slashes prices across Europe for its Model Y vehicles, this coming after already cutting prices in China. So listen, we know Elon Musk has made it very clear he is willing to play the volume game even at the expense of margins. If you're a Tesla investor, you're well aware of this. So Tesla cutting prices in Germany, it sounds like, Madison, for two versions of its Model Y. And that follows China, where Tesla cut the price of its entry-level Model Y and lowered the Model Y starting price as well. MADISON MILLS: Yeah, you have to wonder, if you are someone who is interested in buying a Tesla, why would you not wait for them to continue to cut prices? And that's what some folks on the street are saying today. Are they training the consumer to wait for a better deal? Also an interesting note from Bank of America earlier this morning, you know, Josh, I've been obsessed with what's going on in the Red Sea and the potential impact. The only company in their coverage that has announced disruptions from vessels rerouting is Tesla. Tesla expected to halt production at its Berlin facility from late June to early Feb. They expect other companies with a large footprint in Europe could be negatively affected. Not expecting huge downside, but it could be a temporary disruptor. So I think that's interesting to watch, with this name particularly, as so many investors are bullish on Tesla. You have to consider some of those geopolitical risks to come this year, Josh. JOSH LIPTON: Yeah. By the way, did you see that piece in the New York Times today, kind of, talking about how batteries for EVs can be less efficient, have shorter range when it gets very, very cold out. They were kind of MADISON MILLS: That's tough, yeah. JOSH LIPTON: They were kind of profiling, talking to these EV fans in Chicago who are dealing with all these headaches right now, right? They've got, like, depleted batteries and long lines at the charging stations. It was an interesting piece, just we talk about how consumer demand for EVs is kind of waning, at least here in North America. But it was a good piece to read. MADISON MILLS: Yeah, it's not as easy as you might think, at least when you are talking from the perspective of Hertz, for example, selling off 20,000 of their EV fleet because of the concerns from consumers, maybe overestimating some of that demand. Another auto stock that we're taking a look at here is Ford. Shares of that automaker sliding after UBS downgraded the stock to neutral. They're citing limited upside to expectations, and their price target for that name is at $12. They said they see more potential for earnings upside at peer GM. They said they do like the CEO's vision and direction, but it could take a number of years for those benefits, the benefits of those plans to be realized. You're seeing that stock down over the past couple of months and in the past couple of days as well. Interesting to note, Josh, they say that the UAW deal costs Ford more than they originally thought, and that has been coming up since that deal happened. And I think that is a story that's going to be hovering over their shoulder for some time into the new year. JOSH LIPTON: Yeah, in terms of what the analyst likes, by the way, he says he sees the potential for more earnings upside at GM. So in terms of names that he still likes, that's what he's telling his clients. If you look at Ford since early November, Madison, the stock's up about 12%, though still down more than 10% over the past year. It is interesting, you're seeing these downgrades for the carmakers even as rates are set to decline here. They've got this new labor deal in place. But for some on the street, valuation just doesn't look attractive at these levels. MADISON MILLS: Yeah, but it's still interesting. I know you love to look at this. We've got 43% of analysts have a buy on this name. 46% have a hold. So it seems some mixed picture there from the analysts recommendations. JOSH LIPTON: For sure. All right, let's get a final one here, a check on JetBlue. Shares of JetBlue and Spirit Airlines continuing to fall after a federal judge blocked JetBlue's $3.8 billion acquisition of Spirit Airlines on Tuesday. So we know, Madison, the federal judge stepped in here, blocked the acquisition. And what does this mean for JetBlue is what I think investors are still trying to figure out. And also, what it means for JetBlue's new CEO, remember, who takes over-- I think it's just next month. We did speak to Elaine Becker over at TD Cowen about this. Remember, she expects JetBlue to consider placing orders for aircraft, so it can grow organically. Though she told us that's going to take years to do versus what Spirit could have done with them much more quickly. MADISON MILLS: Well, there's a potential read-through here outside of these two names to Alaska's proposed $1.9 billion acquisition of Hawaiian Holdings. Will that go through given that this deal did not, a judge blocking that merger, again on antitrust grounds. Hawaiian shares dropped a little over 3% today after declining yesterday on this news as well. The market pricing in about a 65% of this transaction going through. That was at about 70% before the news broke about JetBlue and Spirit yesterday. And it's interesting to see the market kind of pricing in less of a chance of that deal going through because they're very similar. So you have to wonder what Alaska and Hawaiian executives are going to do with this deal moving forward. JOSH LIPTON: Yeah, listen. The Biden administration has been aggressive here, moving in if it sees a deal that it thinks could harm consumers, they take action, for sure. MADISON MILLS: Absolutely. Related Quotes "
}