{
    "title": "Stock Market Rally Mixed As Yields Rise: Weekly Review",
    "date": "1/18/2024",
    "url": "https://www.investors.com/news/stock-market-rally-mixed-as-yields-rise-taiwan-semiconductor-tesla-in-focus-weekly-review/",
    "text": "BREAKING: Core PCE Inflation In Line With Views     The stock market rally has had a mixed week, with the Nasdaq reversing modestly higher and the S&P 500 little change, both within recent ranges. The Dow Jones and Russell 2000 lost ground amid weak market breadth. Taiwan Semiconductor (TSM) surged, leading chip stocks higher, while megacaps had a good week. Tesla (TSLA) continued to slide. Boeing (BA) added to big 2024 losses, though it did pare its weekly loss. Treasury yields rebounded, while Fed and ECB officials downplayed talk of quick, rapid rate cuts this year. The Nasdaq moved higher, fueled by chip and megacap techs, moving above the key 15,000 level. The Nasdaq 100 hit a record high. The S&P 500 was little changed. The Dow Jones and Russell 2000 fell, reflecting weak breadth. The 10-year Treasury yield ran above 4% decisively, amid generally positive economic data and more-cautious Fed officials. December retail sales rose 0.6%, both overall and excluding autos and gas, with consumers spending freely during the holidays. Weekly jobless claims fell to their lowest in more than a year. But the Philly Fed manufacturing index continued to signal contraction in January while the New York Empire State manufacturing index suffered a stunning decline. Fed Gov. Christopher Waller downplayed talk of aggressive rate cuts, with Atlanta Fed President Raphael Bostic expecting cuts to start in the third quarter. However, markets still see rate cuts starting in March, though less certain than before, while pricing in 150 basis points of easing this year. The world's largest contract chipmaker reported Q4 earnings per U.S. share fell 23% with revenue down 4% to $19.62 billion, both slightly topping views. It was the fourth straight quarter of declining sales and earnings. However, Taiwan Semiconductor (TSM) forecast a return to sales growth in Q1 and predicted 2024 revenue growth above 20%, thanks to AI chips. TSM stock surged with many other chip stocks up solidly. Tesla (TSLA) continues to cut prices early in 2024 as the EV giant attempts to shore up demand. The latest round of price cuts in Europe Tuesday night put the focus squarely on Tesla margins and potential 2024 profit struggles with fourth-quarter and full-year earnings looming. The global EV giant's decision to slash prices in Europe follows modest price cuts in China in the prior week. China EV makers Li Auto (LI) and Nio (NIO) announced discounts of around $4,600 and $5,560, respectively, as they gear up to roll out 2024 models. Meanwhile CEO Elon Musk posted on X that he needs substantially more voting control or he would favor building AI and robotics products \"outside of Tesla.\" Elon Musk has repeatedly said Tesla is not an EV company but is an AI and robotics operation, a line echoed by many investors and bullish analysts. TSLA stock fell solidly, suffering its fifth straight weekly decline. The Chinese EV and battery giant touted its intelligent-car systems as it begins to roll out advanced driver-assist systems, starting with its premium brands. BYD needs strong ADAS to compete in an ever-advancing China EV market. Meanwhile, BYD said it would begin selling EVs in Indonesia, along with plans for a factory there. Finally, BYD's first car carrier ship departed for Europe, boosting export capabilities. But BYD stock fell solidly, hitting a 10-month lows, amid China EV price cuts and general concerns about the Chinese economy and stock markets. Goldman Sachs (GS) reported a 65% EPS gain with revenue up 7%, beating views. But rival Morgan Stanley (MS) missed on earnings amid big charges. Superregional banks PNC Financial (PNC), Truist (TFC) and U.S. Bancorp (USB) reported mixed results. A slew of regional banks also turned in quarterly financials. GS stock fell modestly while Morgan Stanley tumbled. Charles Schwab (SCHW) earnings fell for a sixth straight quarter, though less than expected. Revenue edged lower, missing views. Interactive Brokers revenue tumbled 25% but narrowly beat views, while a 17% EPS gained fell short. IBKR edged higher, briefly breaking out Wednesday in an upside reversal. Schwab fell, but did pare losses. Synopsys (SNPS) plans to buy Ansys (ANSS) in a cash-and-stock deal worth $35 billion. They'll combine Synopsys' semiconductor electronic design automation technology with Ansys' simulation and analysis portfolio to create a leader in silicon-to-systems design. SNPS was little changed on the official news, after tumbling on Ansys deal buzz. ANSS retreated after big recent gains. Microsoft (MSFT) expanded the availability of its Copilot AI assistant software to consumers and small businesses. It also announced a 10-year strategic partnership with U.K.-based Vodafone (VOD) to deliver generative AI and cloud services to customers in Europe and Africa. MSFT stock rose slightly to fresh all-time highs. Birkenstock (BIRK) reported better-than-expected Q4 results, its first earnings report since coming public in October. But BIRK stock sold off as the sandal maker warned of margin pressures. J.B. Hunt Transport Services (JBHT) earnings fell more than expected, down for a fifth straight quarter. The trucking firm's revenue slid for a fourth quarter in a row, but slightly beat. Discover Financial Services (DFS) badly missed Q4 earnings views as its credit-loss provision jumped and the credit-card operator wrote off more bad loans. Revenue growth slightly beat at 13% but slowly for a third straight quarter. DFS stock dived. Fastenal (FAST) narrowly topped Q4 views with a 7% EPS gain and 4% revenue rise. The industrial and construction supply store operator was upbeat on 2024. It also hiked its dividend by 11%. Shares gapped up to a record high. Spirit Airlines (SAVE) tumbled more than 60% for the week after a federal judge blocked the JetBlue Airways (JBLU) takeover on antitrust grounds. JetBlue first announced the Spirit acquisition in July 2022. Spirit Air reportedly is mulling financing options amid bankruptcy fears. Boeing (BA) on Thursday secured an order for 150 737 Max jets from budding India-based airline Akasa Air for an undisclosed sum. The orders provide a much-needed boost for the Dow Jones behemoth as it faces increased scrutiny following a fuselage panel blowout on a 737 Max 9 jet during an Alaska Airlines (ALK) flight on Jan. 5. BA stock bounced on Thursday but still fell for the week after two big weekly losses. Super Micro Computer (SMCI) gave preliminary fiscal Q2 results well above consensus. SMCI stock jumped, slashing weekly losses and back near highs. YOU MAY ALSO LIKE: Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Futures Rise; This AI Play Surges 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/30/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}