{
    "title": "Tesla: Sell-Off Likely To Accelerate On Weak Q4 Reporting",
    "date": "1/21/2024",
    "url": "https://seekingalpha.com/article/4664060-tesla-sell-off-likely-to-accelerate-weak-q4-reporting",
    "text": "Robert Way Robert Way Following Tesla, Inc. (NASDAQ:TSLA) (NEOE:TSLA:CA) results for the September quarter, I argued that the U.S. leading EV maker is a Sell, as I have pointed out slowing growth and weakening margins. Since my argument got published, TSLA shares have returned negative 4%, while the S&P 500 gained 13%. Looking ahead to Tesla's Q4 earnings release, which is expected to be published on the 24th of January after the market closes, I am gaining more and more confidence in my bearish skew on Tesla, expecting the sell-off for shares to accelerate. In this article I explain why. While I expect Tesla to report Q4 2023 results broadly in line with consensus estimates, referencing $25.75 billion in revenues and 0.75 cents EPS, I see a large downside risk for commentary on 2024 guidance. There are multiple variables to my negative thesis: Firstly, I point out a broader macro weakness for EVs, with volumes for electric vehicles trailing lofty expectations. Specifically for Tesla, the 50% CAGR expectation for deliveries should be crushed in 2024, with volumes likely growing below 20%. Secondly, competition against Chinese EV manufacturers appears to be intensifying, as BYD starts to see booming international demand, while Tesla has once again lowered prices of Model 3 in China to compete with more cost-conscious alternatives. Thirdly, Tesla is likely seeing more margin pressure on wage increases in the U.S. Fourthly, I point out fading investor confidence as a concern, following Elon Musk's suggestion that he may need new incentives to develop AI technologies. On that note, sentiment should also suffer from the recent Hertz announcement sharing plans to rebalance its vehicle fleet back to ICEs. In recent days, Tesla has experienced a series of developments that suggest negative implications for investors heading into 2024. Most notably, I point out broader macro weakness for the global EV market, with demand trailing lofty expectations. To support this thesis, I highlight that Ford has recently scaled down production in the electric F-150 model to push more production volume in favor of the ICE-powered sport-utility vehicles Bronco and Bronco Raptor, as well as the Ranger and Ranger Raptor pickups. The thesis of lower-than-expected consumer demand is also confirmed by Tesla itself, with the EV maker delivering about 200k vehicles below previously established expectations of 2 million. Interestingly, Tesla fell short of its own target despite numerous price cuts throughout the year and easing supply-chain pressure, as evidenced by rapidly falling production wait lists across geos. Demand for EVs is certainly becoming an increasing problem for Tesla, especially as mass consumer sentiment appears to reject the aggressive electrification push promoted by politics and large institutions, such as Hertz. On this note, Hertz, a major player in the car rental industry, has recently announced plans to sell 20,000 electric vehicles from its U.S. fleet. This number constitutes about a third of its global EV fleet. The sales process began in December 2023 and is expected to continue throughout 2024. An interesting aspect of the decision by Hertz relates to the company's plan to reinvest a portion of the proceeds from the EV sales into ICE vehicles. This strategy is likely a response to meet specific \"customer demands\", as suggested by management. Moreover, Hertz's CEO had previously highlighted in October 2023 that repair costs for EVs, particularly collision and damage repairs, can be nearly twice as high as those for ICE vehicles. While Tesla's fourth-quarter delivery numbers were ok, delivering 484,000 cars, there's a growing consensus that 2024 could present significant challenges to the company's vehicle volume projections. Specifically, the expectation that Tesla could maintain a 50% compound annual growth rate in deliveries into 2024 and beyond is increasingly becoming questionable and farfetched, due to factors highlighted in earlier arguments. One key issue is the ability of Tesla to both increase demand for its vehicles and build them. Scaling up 2023 deliveries to a 50% increase would mean selling 2.7 million cars in 2024. On that note, consensus projection according to Refinitiv currently suggests delivery numbers for 2024 to be 2.19 million units, a year over year growth of about 17%. Meanwhile, Barclays projected Tesla's delivery numbers for 2024 to be around 1.97 million units only, suggesting a year over year growth of less than 10%. Personally, I expect Tesla might set its delivery guidance for 2024 in the range of 2.0 - 2.1 million units, aiming to establish reasonable projections early in the year to build a buffer for multiple disappointments throughout 2024. And while Tesla's Elon Musk likely won't formally wave good-bye to the 50% CAGR projection, the markets will certainly read this statement between the lines accordingly. Looking beyond 2024, Tesla is in dire need of a new growth driver like the previously teased next-generation platform. Talking about price cuts, it is also disappointing to learn that Tesla has reportedly once again lowered the retail selling price for the Model 3 and Y in China, crushing investors' hope that the price-driven margin pressure may fade. In detail, Tesla has recently announced that the base MSRP for the standard-range Model 3 and Model Y should be cut by 5.9% and 2.8%, respectively. Additionally, prices for long-range variants of both models were lowered by 2%-4%. Meanwhile, outside of China, Tesla is facing an increasing supply push from low-cost competitors such as BYD and Xpeng. In fact, in December 2023, BYD even managed to take Tesla's crown as the world's leading EV manufacturer. While, Tesla delivered 484,000 cars in the fourth quarter, surpassing analysts' expectations, BYD shipped a record-breaking 526,000 BEV units to customers. Outside of China, BYD delivered 36,000 units in December alone, bringing the volume of international sales to 243,000 units for the entire year. Compounding the challenges from the demand side, Tesla is also increasingly facing margin compression due to escalating cost pressure. Specifically, I point out that in Q4 Tesla announced pay increases for its U.S. production workers, following growing unionization efforts and a historical win for the United Auto Workers (UAW) against the Big Three in Detroit, Stellantis, General Motors and Ford. The wage increase announced by Tesla suggests a roughly 10% wage increase for production staff in the United States. While the wage increase is significantly lower than what has been achieved by UAW workers, the EBIT headwind for Tesla is nevertheless significant. In act, assuming that Tesla employs about 45,000 production workers in the United States, and the average annual compensation, including benefits, is around a reasonable $75,000 and $85,000, then a 10% increase would translate to an additional annual labor cost of approximately $340 - $380 million, or a notable 3% headwind to 2024 consensus EBIT. Meanwhile, I also point out that Tesla is poised to suffer a negative margin impact from the Cybertruck ramp-up as commented on by Elon Musk:  I mean, we dug our own grave with Cybertruck ... the Cybertruck is one of those special products that comes along only once in a long while. And special products that come along once in a long while are just incredibly difficult to bring to market, to reach volume, to be prosperous.\" I do want to emphasize that there will be enormous challenges in reaching volume production with the Cybertruck, and then in making a Cybertruck cash flow positive According to consensus estimates collected by Seeking Alpha, Tesla's EPS projection has started to fall throughout 2023. However, I argue that estimates may still be too high. Most notably, EPS expectations have not yet fallen on the announced wage increases. Personally, I expect a fresh downward revision cycle for EPS estimates following the Q4 reporting, on disappointing 2024 delivery guidance and cost projections. Seeking Alpha Seeking Alpha Tesla's Q4 earnings release is expected to show in-line results, but there are strong downside risks for guidance. As a broader theme going into 2024, the demand for EVs, including Tesla's vehicles, is facing challenges and may not meet lofty expectations. On that note, margin pressure is increasing for Tesla due to wage increases and competition from low-cost competitors. In line with my bearish sentiment on Tesla's growth story, I am highly concerned about the valuation backdrop, with the company's enterprise value trading at 7x EV and 71x EBIT. That said, I expect negative momentum on Tesla shares to accelerate post Q4 reporting, with shares accelerating their path toward a more reasonable valuation, which I see at minimum 20% lower. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Not financial advice. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}