{
    "title": "Tesla: Buy, Sell, or Hold?",
    "date": "1/2/2024",
    "url": "https://www.fool.com/investing/2024/01/02/tesla-buy-sell-or-hold/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Electric vehicle (EV) stocks had a rough 2023. Most stocks, that is. One that continued to provide strong returns to shareholders was Tesla (TSLA -2.25%). There are several reasons why Tesla stock doubled in 2023 even as its profit margins dropped. One reason was that fears of growing competition didn't badly impact Tesla's volume growth. Another was its global diversity. But investors might now wonder whether locking in those gains makes sense, or if it's still time to buy more shares of the EV leader. Tesla stock didn't double in 2023 because of its financial performance. Through the first nine months of the year, Tesla's profits actually dropped by 20% compared to 2022. Data source: Tesla. Chart by author. The combination of declining profits and a rising stock price has made the stock that much more expensive now. While it's always been richly valued, Tesla's price-to-earnings (p/e) ratio is back in the high 70s based on 2024 expectations. But CEO Elon Musk probably isn't too concerned with the year-over-year drop in earnings. That's because he intentionally caused it. Tesla lowered vehicle pricing to spur sales as competition emerged in higher volumes from EV start-ups, as well as the big global automakers. The plan worked. Automotive revenue jumped 21% year over year through the first three quarters of 2023 even as lower profit margins caused net earnings to drop. That growth is what investors focused on to help drive Tesla stock higher in 2023. Another interesting thing happened too. Other EV makers including Ford and General Motors throttled back on production growth plans as losses mounted on every vehicle they tried to sell. And those automakers, as well as global giant Volkswagen, also conceded that they would need to pay to let their potential EV customers use Tesla's dominant fast-charging network. With Tesla's valuation as high as it is, several things really have to happen for shares to continue to rise. Investors will be looking for it to recoup some of the profit margin it lost in 2023. That could come from raising vehicle prices, cutting costs, or, more likely, a combination of the two. Tesla also needs to continue to grow its ancillary businesses. Those include the aforementioned charging network, but also its energy businesses. Tesla's energy generation and storage revenue has been growing consistently. While it's already a multi-billion dollar business segment, it still just represented about 6% of total revenue in the first nine months of 2023. But if it continues on its growth trajectory, it should become more and more meaningful to Tesla. Data Source: Tesla. Chart by author. Perhaps the most important factor for Tesla shareholders, though, is whether mass EV adoption truly materializes. Investors have been debating that point, especially as Ford and GM have tempered expectations for EV volume growth. But while sales growth has slowed in the U.S., other parts of the world continue to see a rapid transition to electrify transportation. According to early data from research firm GlobalData, EVs only represented 8% of U.S. car sales in the third quarter. But in China and Europe, EV sales were 27% and 15% of the market in that period, respectively. Tesla is already geographically diversified, with manufacturing plants in all three of those major markets. It will likely use its strong cash generation to continue to fund investments in new facilities. That EV adoption data is where investors deciding on whether to buy Tesla stock should focus. If the transition to electric cars stalls, Tesla stock will likely suffer. But if EVs continue to grow market share globally, Tesla is the stock to own for the long term. Howard Smith has positions in Tesla. The Motley Fool has positions in and recommends Tesla and Volkswagen Ag. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}