{
    "title": "Elon Musk's Urgent Advice to Rivian as Tesla Rival Faces Severe Struggles",
    "date": "2/23/2024",
    "url": "https://www.techtimes.com/articles/301988/20240223/elon-musks-urgent-advice-rivian-tesla-rival-faces-severe-struggles.htm",
    "text": " Rivian's subpar performance made news this week. Amid this trouble, Elon Musk, the CEO of its rival Tesla, offered some advice that might save the struggling EV maker from bankruptcy. Elon Musk warned about Rivian's problems and commented on Rivian's poor financial results on social media platform X on Wednesday. The corporation reported an unsatisfactory quarter, a gloomy forecast, and a 10% salaried personnel reduction. After Rivian's disclosure, shares fell up to 26% after markets opened on Thursday. The company's greatest drop and lowest point since coming public in 2021. Musk said Rivian's present track has the company at risk of bankruptcy within six quarters. Musk stressed Rivian's need to minimize costs and suggested that the leadership team dwell at the facility to navigate the next few years. \"They need to cut costs massively, and the executive team needs to live in the factory or they will die,\" the Tesla CEO posted on X. Elon Musk has warned Rivian before. In June 2022, the tech mogul recommended the corporation make drastic expense cuts across the board, warning of dire consequences if they did not. Reacting to Musk's advice for Rivian, one Tesla fan tweeted, \"This isn't a criticism from Elon. It's advice from experience. Do it @Rivian. We want you to survive.\" (Photo: Omar Marques/Getty Images) SpaceX, X (formerly known as Twitter), and Tesla CEO Elon Musk speaks during a live interview with Ben Shapiro at the symposium on fighting antisemitism on January 22, 2024, in Krakow, Poland. Rivian CEO RJ Scaringe cited high interest rates as a major issue, echoing Elon Musk's worries about Tesla's operations. Scaringe stressed that economic and geopolitical uncertainty, notably high interest rates, had hurt electric vehicle demand, according to Fortune. EV sales growth has slowed, presenting a larger problem. Ford and GM are cutting output to counter this tendency. Early EV adopters have bought, but mainstream buyers may be repelled by greater pricing, range anxiety, and EV resale value. During a call with investors, Tesla warned of notably lower sales growth for the upcoming year after a disappointing fourth quarter. Musk mentioned Tesla being \"between two major growth waves\" as the company aims to start production of a more affordable model late next year. Read Also: Cruise's Comeback: Robotaxi Testing Set to Resume in Houston and Dallas Meanwhile, Rivian prepares to launch its R2, a midsize SUV to compete with Tesla's Model Y, but issues remain. The R2, at about $50,000, addresses the absence of competitive $45,000-$55,000 electric vehicle options. As reported by TechTimes, Rivian recently announced the March 7 launch of its next-generation electric cars, beginning with the R2. This follows Rivian's R1 series, which comprised the R1T electric pickup truck and the R1S clean energy SUV. In a recent announcement on Rivian's platform X, the company shared a teaser video featuring an animated \"R2 Reveal\" message. The teaser did not include any visual representations or silhouettes of the upcoming electric vehicles.  Rivian has set the official unveiling of the R2 series for March 7. This event promises to showcase Rivian's latest developments since its initial electric vehicle lineup was introduced. In January, Rivian announced the appointment of Jonas Reinke, a former executive at Apple and Porsche, as the company's new Vice President of Product Management. Reinke's role is crucial in steering the company's efforts to introduce innovations like the R2 to the market. Related Article: Chinese EV Maker Announces Ambitious Plans with 4,000 New Hires, $486M AI Investment  Sign up for our free newsletter for the Latest coverage!   "
}