{
    "title": "Elon Musk says the people have spoken, and he'll make moves to shift Tesla \nto be incorporated in Texas",
    "date": "2/1/2024",
    "url": "https://www.businessinsider.in/tech/news/elon-musk-says-the-people-have-spoken-and-hell-make-moves-to-shift-tesla-to-be-incorporated-in-texas/articleshow/107317487.cms",
    "text": "Liked the article? Share it with your friends... or copy link Elon Musk, the CEO of Tesla, says he's going ahead with plans to shift the company's state of incorporation to Texas. \"The public vote is unequivocally in favor of Texas!\" Musk wrote on X Wednesday night, referencing the poll he conducted on Tuesday. Over a million users responded to Musk's poll on whether he should shift Tesla's state of incorporation to Texas, where its headquarters already are. Musk's poll had 1,102,554 votes cast on it, of which 87.1% of respondents voted \"yes.\" \"Tesla will move immediately to hold a shareholder vote to transfer state of incorporation to Texas,\" Musk wrote on X. The public vote is unequivocally in favor of Texas!Tesla will move immediately to hold a shareholder vote to transfer state of incorporation to Texas. https://t.co/ParwqQvS3d Musk's announcement comes after a Delaware judge voided his $55 billion compensation package at Tesla. Musk isn't paid a salary for his work as the Tesla CEO. Instead, his pay package is based on a series of goals tied to Tesla's financial growth. According to the package, Musk would be granted stock equivalent to 1% of Tesla's outstanding shares whenever he met the 12 tranches of growth targets. The ruling in Delaware could threaten Musk's title as the world's richest person, given that most of his wealth is tied to his equity in Tesla. \"Never incorporate your company in the state of Delaware,\" Musk wrote on X on Tuesday. Musk appears to have a strong affinity for the Lone Star State. Bloomberg reported in December that the billionaire was planning to create his own university in Austin. And in January, Musk's social-media platform X told Bloomberg that it would be hiring 100 employees for a new content-moderation center in Austin. Representatives for Tesla did not immediately respond to a request for comment from Business Insider sent outside regular business hours. Advertisement "
}