{
    "title": "There Is A Black Cloud Around Tesla's Stock",
    "date": "2/8/2024",
    "url": "https://jalopnik.com/there-is-a-black-cloud-around-teslas-stock-1851238638",
    "text": "Tesla has had a rough twelve months. The company failed to act on its first mover advantage in the U.S., and its market share dropping like a stone. Chinese EV makers are coming on strong, pushing Tesla out of many European and Asian driveways. It has been fraught with massive recall after massive recall. The company’s CEO is in the news for his alleged drug abuses, and his antisemitic, racist, and borderline-eugenic tweets have brought critical eyes in the direction of the electric car company. As a result, Tesla stock is going down the proverbial tubes. The S&P 500 is performing fairly decently right now, as the index has returned 4 percent growth as a whole since January 1. This growth is buoyed double-digit percentage performance from companies like Nvidia, Meta, Chipotle, and Netflix. We’ve all seen Boeing inadvertently doing just about everything it can to sow distrust in its future, but even the airplane giant’s decline has been calm in comparison to the absolute tanking that Tesla has seen on the stock market. In just a bit over one month, the value of TSLA on the open market has declined by an incredible 24.51 percent. A quarter of the company’s value has disappeared in a month. Tesla has been kicked out of the S&P 500 club before, and it might happen again if the stock continues its downward trend. “The cost of Elon’s behavior is really hurting shareholders and it’s really unfortunate because the reason we’re holding the stock is the long-term potential of Tesla is immense,” Ross Gerber, head of the heavily Tesla invested Gerber Kawasaki wealth management company told Yahoo Finance. “In order to turn around Tesla’s stock slump, Musk needs to first correct his US$44-billion mistake—which was Twitter,” Dan Ives, the managing director of equity research at Wedbush Securities, said in a phone interview with Bloomberg. “There’s been a brand deterioration around Musk and that’s what’s created a black cloud around Tesla,” he continued. Elon Musk seems to be headed for a fall, and he’s taking Tesla down with him. Shareholders are proving unwilling to stick around and see how low the company’s value will go. The company reached a high share value of $409.97 on November 4, 2021, and today it is less than half that at $189 per share. Missed earnings and revenue in the fourth quarter of 2023 really hurt the company, and warnings of an even softer 2024 aren’t helping. Wall Street also sees issue with the potential unionization of Tesla employees, sending the stock further downward. With layoff fears mounting, and Musk blackmailing shareholders for a bigger slice of the pie, it doesn’t seem like investor confidence will return to $TSLA any time soon. "
}