{
    "title": "Stellantis CEO: Chinese EVs danger to his carmaker, Tesla",
    "date": "2/17/2024",
    "url": "https://fortune.com/2024/02/17/stellantis-ceo-chinese-evs-byd-automotive-threat-elon-musk-tesla/",
    "text": "One major problem for automakers as they transition to electric vehicles is that traditional cars still generally cost less. That matters to everyday car shoppers trying to make ends meet. In China, however, EVs are actually more affordable than gas guzzlers. And increasingly, Chinese EVs are being exported to markets around the world and sold for prices that are tough to match. That has leaders of automakers outside China worried. This week, Stellantis CEO Carlos Tavares likened China’s automotive emergence to the arrival of Japanese carmakers in the U.S. in the 1970s, followed by South Korean rivals three decades later. Now it’s China’s turn to make its mark, he suggested, and that poses a threat to existing carmakers like Stellantis, whose brands include Dodge, Chrysler, Jeep, Ram, and Maserati. “The Chinese offensive is possibly the biggest risk that companies like Tesla and ourselves are facing right now,’’ Tavares said. “We have to work very, very hard to make sure that we bring out consumers better offerings than the Chinese.” The most-feared Chinese carmaker is probably BYD—backed by Warren Buffett’s Berkshire Hathaway—which recently topped Tesla in global EV sales. “No one can match BYD on price. Period,” Michael Dunne, CEO of Asia-focused car consultancy Dunne Insights, recently told the Financial Times. “Boardrooms in America, Europe, Korea, and Japan are in a state of shock.” BYD keeps its costs low in part because it owns the entire supply chain of its EV batteries, from the raw materials to the finished battery packs. The battery accounts for roughly 40% of a new electric vehicle’s price. Chinese EVs are not flooding American roads today thanks to protectionist measures—a 25% tariff on Chinese-made cars on top of a regular 2.5% one on imported cars. But American lawmakers fear that Chinese carmakers will use factories in Mexico to avoid such tariffs, taking advantage of the North American free trade agreement. “So do we want that the Chinese carmakers take a significant share of the U.S. market in the next 20 years, or the next 10 years? I don’t know. That is the question,” Tavares said. “So how do we prevent that from happening beyond all the protectionist decisions, which are out of my reach? Well, by making our consumers happy.” Tavares said that while Stellantis will launch 18 new EVs this year, eight in North America, the “job is not done” until prices for EVs match those of traditional cars. In Europe—where carmakers are less protected from Chinese competition—Stellantis is taking orders for the new electric Citroen e-C3. It’s priced to take on budget models from Chinese rivals like Great Wall Motor. The e-C3 sells for 23,000 euros ($25,100) and has a range of 320 kilometers (199 miles). It will hit showrooms in the second quarter. An entry-level version slated for 2025 will sell for 19,990 euros. Both models will be sold at a profit, Tavares noted. Last month, he warned about the perils of getting drawn into a damaging price war. “If you go and cut pricing disregarding the reality of your costs, you will have a bloodbath. I am trying to avoid a race to the bottom,” he said. “I know a company that has brutally cut pricing and their profitability has brutally collapsed.” He didn’t elaborate on which company he was referring to, but his comments came shortly after Tesla cut prices on its Model Y across Europe and both its Model Y and Model 3 in China. Read more: Ford CEO, who’s been worrying about China’s EV dominance for years, says ‘the world has changed’ and he’d work with rivals on a cheaper battery Tesla, in a call with investors last month, warned of “notably lower” sales growth this year after a disappointing fourth quarter. CEO Elon Musk said his EV maker is “between two major growth waves.” Hoping to better compete against both Chinese rivals and cheaper gas-powered cars, Tesla plans to start producing an entry-level EV starting at $25,000 next year. Musk, too, is warily watching BYD and other Chinese carmakers. “If there are no trade barriers established,” he told investors last month, “they will pretty much demolish most other car companies in the world. They’re extremely good.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}