{
    "title": "Hyundai's $3 billion IPO bid may cut down Tesla's potential EV market in \nIndia",
    "date": "2/5/2024",
    "url": "https://www.hindustantimes.com/business/hyundais-3-billion-ipo-bid-may-cut-down-teslas-potential-ev-market-in-india-heres-why-101707150369407.html",
    "text": "Subscribe Now! Get features like Hyundai Motors' India unit is planning to list itself on the stock market with a bid the launch a $3 billion initial public offering (IPO), the biggest the country has seen till now. However, this IPO has the potential to hurt Tesla's future EV sales in India. Hyundai is planning to raise $3 billion through an IPO in India at a valuation of $30 billion, Reuters reported quoting people aware of the matter, as the South Korean automaker doubles down in the key growth market ahead of a widely expected entry by Tesla. The fundraising by Hyundai, the second-biggest automaker in India with a 15% market share, would value its Indian operation at up to $30 billion, which is more than half its market capitalisation of $42 billion in Seoul. Shares of the company soared 5% on Monday, to their highest in nearly three years. Not only does this have the potential to hamper the expansion of Elon Musk's Tesla in India, but a valuation of $30 billion would also make Hyundai a bigger competition to Tata Motors and Maruti Suzuki, both with a valuation of over $40 billion. The company is exploring \"value unlocking for its India business\" through the IPO. \"They want to make use of India's IPO boom. India's capital markets have hardly stood out like this before compared to other countries,\" Reuters quoted people aware of the matter. For its India IPO, Hyundai has held talks with investment banks JP Morgan, Morgan Stanley, Citi and Bank of America though no formal appointments have been made. Before this, India's biggest IPO was the 2022 listing of Life Insurance Corporation (LIC) of India, with the company raising $2.7 billion. Elon Musk's Tesla has been mulling entering the Indian auto market for a couple of years now, with talks of opening its first EV plant in Gujarat. However, Hyundai IPO can further threaten the expansion of Tesla in India. Analysts told Reuters that Hyundai's India unit IPO talks come amid Tesla's plan to enter India and if Hyundai's unit manages to go public in the country, it might help Hyundai better compete with Tesla in the Indian EV market in the future. Hyundai has said it plans to invest close to $4 billion in the Indian market in parts over the next decade to launch new EVs, charging stations and a battery pack assembly unit. Hyundai has emerged as a trusted brand in India over the past two decades, while other foreign automakers like Ford Motor and General Motors have folded their India business. Tesla could likely face the same fate if the Hyundai IPO performs as per initial expectations. (With inputs from Reuters)   "
}