{
    "title": "Mercedes dethrones Tesla as world's most valuable car brand",
    "date": "2/22/2024",
    "url": "https://www.timeslive.co.za/motoring/news/2024-02-22-mercedes-dethrones-tesla-as-worlds-most-valuable-car-brand/",
    "text": "Mercedes-Benz has overtaken Tesla to regain its position as the world’s most valuable  car brand in 2024, according to a new report from Brand Finance. Brand value is the net economic benefit  a brand owner would achieve by licensing the brand in the open market, according to Brand Finance, which compiles and publishes the survey. The consultancy attributed Tesla’s drop to second position to controversies  about Elon Musk which have affected the electric carmaker’s reputation. This has reduced the electric car pioneer’s brand value by 12% to $58.3bn (R1.1-trillion). Alex Haigh, MD of Brand Finance Asia Pacific, said: “The decline in Tesla’s brand value is made all the more compelling against the backdrop of an automotive industry increasingly focused on electric vehicles (EVs). However, Tesla’s brand strength persists, a sign that the company’s core identity is resilient.” Meanwhile, Mercedes-Benz’s brand value grew 1% to $59.4bn (R1.13-trillion), regaining the top spot it lost to Tesla in 2023. Brand Finance identifies the keys to Mercedes-Benz’s brand value success this year as  its adept cost control measures and a well-curated product mix, both of which have propelled its earnings before interest and taxes (ebit) and revenues upward. This focus, particularly on high-end passenger cars and premium vans, has been instrumental in driving revenue growth without resorting to excessive expansion, demonstrating a sustainable approach to scaling. This is particularly important as the company (and many traditional European brands)  is facing a significant challenge from Chinese electric car brands,  said Brand Finance. Third-placed Toyota’s brand value has remained steady at $52.7bn (R995.58bn). Porsche, rising in brand value from $38.3bn (R723.56bn) to $43.1bn (R814.27bn), has moved up to fourth place this year, displacing BMW which dipped slightly to $40.1bn (R757.63bn). Hyundai experienced a substantial gain from $15.9bn (R300.38bn) to $22.9bn (R432.61bn) to overtake Ford for eighth place. The Chinese  car sector continues to grow, fuelled by strong global EV interest which is driving investments and exports. BYD is China’s most valuable  car brand, with its brand value increasing by 20% to $12.1bn (R228.74bn). While Chinese  brands experienced fluctuations in  value, brand strength is rising — Brand Finance research reveals  19  of the 22 Chinese brands featured in the 2024 Brand Finance  ranking improved in brand strength. Bosch is the most valuable  car components brand, with a valuation of $14.6bn (R275.9bn). The Brand Finance survey puts 5,000 of the biggest brands to the test annually and publishes more than 100 reports, ranking brands  in all sectors and countries. Would you like to comment on this article? Sign up (it's quick and free) or sign in now. Please read our Comment Policy before commenting. "
}