{
    "title": "How Chinese tech company BYD overtook Tesla in electric vehicles sales",
    "date": "2/12/2024",
    "url": "https://www.wbfo.org/2024-02-12/how-chinese-tech-company-byd-overtook-tesla-in-electric-vehicles-sales",
    "text": "There’s been earthshaking news in the global automotive world. Chinese electric vehicle manufacturer BYD, or Build Your Dream, overtook Tesla to be the world leader in the sale of electric cars in 2023. Back in the 1990s, BYD was just making cell phone batteries. The company created its first EVs in 2010, including buses that are now running in China, Canada and American cities. The company’s cars are ubiquitous in large Chinese cities, but they aren’t sold in the U.S. yet. Tu Le is an automotive consultant and managing director of Sino Auto Insights. He says BYD and other Chinese EV manufacturers are eager to compete on the international market and are watching events unfold in the US. “I think most Chinese EV makers are going to wait at least through the election in November,” Le says, “and then assess who the administration is in 2025 and beyond, and then make a final assessment. But I do anticipate at least two or three, maybe a handful of Chinese EV players announcing they’re entering the market by 2025.” Le says for now, a typical BYD car design may not be exactly what American consumers are looking for. “The Western consumer might not like some of the features or some of the kitschy colors,” he says, “because in China, there’s a lot of lights going on, a lot of neon, just sensory overload sometimes.” But he says BYD is a quick learner, evidenced by the company dominating global all-electric car sales. “It still depends on how successful their premium brands will be,” he says, “but I do see BYD taking global share on the mass market side all over the world over the next several years.”  Adeline Sire produced and edited this interview for broadcast with Todd Mundt. Sire also adapted it for the web. This article was originally published on WBUR.org. Copyright 2024 NPR. To see more, visit https://www.npr.org.  Follow WBFO On Social Media "
}