{
    "title": "Analyst weighs in on Tesla stock after short sellers pounce",
    "date": "2/14/2024",
    "url": "https://finance.yahoo.com/news/analyst-weighs-tesla-stock-short-001100755.html",
    "text": "Tesla  (TSLA)  shares closed firmly higher Wednesday but could remain vulnerable to a growing bearish sentiment among institutional investors amid its sharp 2024 decline, a top Wall Street analyst indicated. Tesla was once the market's star performer and a stock that took just 11 years to reach a $1 trillion market capitalization amid a surge in popularity for its signature electric vehicles and a broader investment zeitgeist surrounding its mercurial CEO Elon Musk. This year, however, the stock has found itself in a $200 billion rut amid fading EV demand, intensifying competition from China-based rivals, and supply-chain disruptions tied to the conflict in the Middle East have combined to turn investors against the group. Shares have fallen nearly 26% over the past two months and the stock has lost nearly $642 billion in market value from its November 2021 peak. Morgan Stanley analyst Adam Jonas, a longtime Tesla bull with an overweight rating and $345 price target, detailed a chorus of that sentiment change in a note published Wednesday. FREDERIC J. BROWN/Getty Images “Just back from easily the most bearish of our Tesla bull bear lunches … but for admittedly understandable reasons,\" Jonas wrote. \"We expected bearishness from institutional investors given recent negative sentiment on the name, but there was barely any attempt to argue for a near-term bull case.\" \"From our read of the room, it seemed that everyone felt the stock would underperform over six months,\" he added. \"Almost everyone felt the stock would underperform over 12 months.\" That view is also reflected in the level of short bets lining up against the stock. Short-sellers bet against a company by borrowing shares and selling them. If the price of the stock declines, the short-sellers will buy back the shares at a lower price, return the borrowed stock (while paying a fee), and pocket the difference. Data from S3 Partners, which tracks a host of short-selling data across all the major U.S. indexes, suggest that bets against Tesla have been the most profitable market play this year. Related: Tesla unveils latest move to offset demand slump as stock extends slide Bets against Tesla have short-sellers earning around $4.54 billion, S3 Partners noted, while those betting against its much smaller EV rival Rivian Automotive  (RIVN)  have earned around $710 million. Overall, however, U.S. short-sellers are down more than $16.7 billion (before yesterday's broad-market slump) and have trimmed their exposure by around $3.55 billion over the past 30 days. Short interest in Tesla remains elevated, though, with bets against the group estimated at around $16.4 billion, or just under 85 million shares. That's around 3.07% of Tesla's float outstanding. Tesla has displayed some concern for the coming year, warning investors in January that vehicle-delivery growth rates would be \"notably lower\" than 2023 levels while unveiling a series of price cuts in major markets worldwide. The group also hinted at pending U.S. layoffs last week amid reports that performance reviews for some employees have been canceled, and managers have been asked to make a \"binary\" assessment of roles across the company. But Jonas remains bullish on Tesla for a reason, noting that only a fifth of his $345 price target – which he lowered from $380 last month – is based on the group's core automotive division. \"Negative developments in the global EV market very much matter to Tesla and should reasonably have a negative near-term impact on the price of the stock,\" Jonas said. Related: Elon Musk's Tesla delivers harsh warning to workers \"At the same time, however, we believe investors should not ignore the continued developments of Tesla's other plays, many of which are auto-related (i.e., the recurring revenue opportunity from the Tesla fleet, which is embedded in our Tesla Network Services valuation),\" he added. Musk seemed far more animated when speaking about his ambitions for Tesla's development of full self-driving and AI technologies. He described the company as sitting in the midst of \"two major growth waves,\" the latter of which will be \"driven by next-gen vehicle, energy storage, Full Self-Driving, and other projects.\" More Tesla: Tesla strategic move could test Musk's market-share focus Musk's latest Tesla announcement could shake up the EV industry Musk has a 'purity' around motivation for game-changing EV deal Piper Sandler analyst Alexander Potter is also concerned about the impact of Tesla's price cuts and the group's \"aging product lineup.\" Last week, he trimmed his price target on Tesla by $70 to $225 a share, but he sees value in the potential revenue generation from its growing energy business. Potter values Tesla's automotive division, excluding its Full Self-Driving driver-assistance system, at around $135 a share, with the rest of his $225 target tied to Tesla energy. Tesla's energy division, which sells energy storage and solar energy systems, saw fourth-quarter revenue rise 10% from 2022 to around $1.31 billion. The full-year tally was just over $6 billion, a 54% gain from 2022 levels. Jonas at Morgan Stanley also noted that investors at the investment bank's lunch meeting said artificial intelligence is \"off the table\" for now as a driver of Tesla's value, given that \"an improving EV narrative is seen as a prerequisite for investors to underwrite the AI story.\" Musk has made no secret of his longer-term vision for Tesla and its ability to leverage AI technologies. Last month, he said he would need to build his AI and robotics vision outside the Tesla structure unless he could acquire at least a 25% voting stake in the group. Tesla shares rose 2.55% higher Wednesday, against a 1.3% advance for the Nasdaq benchmark, to close at $188.71 each, trimming the stock's one-month decline to around 14.2% and valuing the Austin, Texas-based carmaker at around $591 billion. Related: Veteran fund manager picks favorite stocks for 2024 Related Quotes "
}