{
    "title": "Heartland Bank now a Tesla preferred finance provider",
    "date": "2/29/2024",
    "url": "https://evsandbeyond.co.nz/heartland-bank-now-a-tesla-preferred-finance-provider/",
    "text": "Heartland Bank is now one of Tesla’s preferred finance providers in New Zealand, offering an online finance solution to help more Kiwis drive EVs. “Heartland Bank has a strong synergy with Tesla, with its emphasis on innovative technology, digitalisation and sustainability – all of which align to our strategic focus as a New Zealand bank,” says Heartland Bank consumer general manager Darryl Harnett. The bank’s simple online finance application, accessible from the Tesla website, can provide Tesla’s consumer customers a decision on their vehicle loan application in minutes. Through Heartland Bank’s platform, Kiwi businesses also have simple and affordable access to EVs to improve their own sustainability footprint, the bank says. Heartland Bank provides a user-friendly mobile app that allows borrowers to manage their loan repayments easily, anytime and anywhere. “We understand that New Zealanders are looking for simplicity when applying for and managing their finance,” says Harnett. “We are continuously enhancing our Motor Finance digital capabilities to enable faster and easier access to vehicle finance through online application platforms.” Drive Electric’s 2023 State of the Nation report shows New Zealand has one of the highest rates of car ownership in the Organisation for Economic Cooperation and Development (OECD), and transport, which makes up 37% of a typical household’s carbon footprint in New Zealand, is responsible for 39% of New Zealand’s CO2 emissions. “As one of Tesla’s two preferred finance providers in New Zealand, we’re proud to support Tesla drivers in their transition to sustainable transportation, with a simple online EV finance solution at a competitive rate,” says Harnett. Heartland Bank’s vehicle finance offering is available now for Tesla consumer and business customers throughout New Zealand, at a fixed rate of 8.90% per annum. The bank’s responsible lending criteria, terms, conditions and fees apply, including an establishment fee of $249 and a personal property securities register (PPSR) fee of $7.39. Heartland Bank says it is waiving establishment and PPSR fees until the end of March 2024, and that interest rates are subject to change. Click here for more Heartland Bank information. Geoff Dobson is an 'old-school journo' thriving in a world of new technology. With 40-years of journalism experience already behind him, Geoff joined Auto Media Group three years ago to lead its EVtalk titles. A keen cyclist, he puts his Auckland commute to good use testing ebikes and scooters along the North Western cycleway. Hello there, In this issue, we review the all-new battery-electric Jeep Avenger SUV and learn what it's like to live... https://youtu.be/mV4uI0lUJdc We put the Volvo EX30 to the test. It is an impressive small SUV with a few quirks that... Lakes Marina Projects and Electric Wave have approval to put electric boat charging on part of the Frankton marina. Two... Jolt has opened 10 streetside EV charging stations across Christchurch. The international charging company also reports 250% customer growth nationwide.... © 2021 EVs&BEYOND © 2021 EVs&BEYOND Login to your account below   Remember Me  Fill the forms below to register    Please enter your username or email address to reset your password.    - Select Visibility -PublicPrivate "
}