{
    "title": "Germany's SAP Opts Out Of Tesla Fleets — But Back Home, New Hampshire's \nDartmouth College Embraces Model",
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/news/24/02/36948919/germanys-sap-opts-out-of-tesla-fleets-but-back-home-new-hampshires-dartmouth-college-embraces-model",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW German multinational software company SAP SE SAP has reportedly ceased acquiring its company vehicles from electric vehicle giant Tesla Inc TSLA, citing price fluctuations and issues with deliveries. What Happened: According to a report from the German newspaper Handelsblatt on Monday, SAP, a large fleet operator with approximately 29,000 vehicles in its fleet, will no longer procure Tesla cars, aligning with Germany-headquartered car rental company Sixt SE. The report indicated that SAP’s fleet manager, Steffen Krautwasser, highlighted the frequent price fluctuations of Tesla vehicles compared to those of other automakers, posing challenges in company planning. Additionally, Tesla vehicles are often delivered earlier than agreed upon, leading to operational disruptions. Why It Matters: Despite notable players like Sixt, SAP, and U.S. car rental firm Hertz announcing intentions to discontinue Tesla EV acquisitions, other entities are actively considering incorporating Tesla vehicles into their fleets. For instance, Dartmouth College’s Department of Safety and Security aims to transition over half of its current fleet to Tesla Model Y vehicles, as reported by the college’s student newspaper. However, with only seven vehicles currently in their fleet, the department plans to introduce four Tesla Model Y SUVs while retaining three Ford vehicles. The report further suggested that the department may eventually explore transitioning to a fully electric fleet. Check out more of Benzinga's Future Of Mobility coverage by following this link. Read More: Rivian Confirms R2 EV Launch Date, Will Unveil Second-Generation Platform In March Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}