{
    "title": null,
    "date": "2/3/2024",
    "url": "https://ragingbull.com/editorial/new-2k-saj-curriculum/",
    "text": "Real Experts. Real Trades. Real Profits  Good afternoon. If you missed today’s Facebook LIVE I announced starting a new curriculum for the $2,000 Small Account Journey service. I will create a Google document organizing all the new video lessons. 100% of them will be on Facebook. Here’s the 4 I did today. Opening a trade: Closing a trade: My goal is to address any of your questions so if you post something under any of these videos I will attempt to answer it in future videos. [Last night’s email summarizing the week if you missed it] I’ve been teaching subscribers my options trading blueprint for small accounts. This week I went 7 for 7 in Journey. All trades alerted to subscribers’ smartphones before entry and exit. +38% +$590 on COST +21% +$330 on TSLA +24% +$615 on TSLA +31% +$872 on NVDA +27% +$510 on NVDA +5% +$135 on TSLA +29% +$780 on TSLA My results aren’t typical. I’ve been working very hard at this. And I’m happy to teach you. The $2,000 balance is now up to $14,729 or 636% since November 13. Winning 49 out of 55 trade alerts. What a few subscribers had to say in chat as we closed Friday’s session. You’ll know within a week if you love it or not. I’m teaching the $2,000 Small Account Journey blueprint this Saturday and Sunday morning at 11 AM ET. Both sessions will be LIVE on my Facebook. Don’t worry, I’ll send you a reminder each morning. Eat, sleep & trade! Jason Bond DISCLAIMER: To more fully understand any Ragingbull.com, LLC (“RagingBull”) subscription, website, application or other service (“Services”), please review our full disclaimer located at https://ragingbull.com/disclaimer. FOR EDUCATIONAL AND INFORMATION PURPOSES ONLY; NOT INVESTMENT ADVICE. AnyRagingBull Service offered is for educational and informational purposes only and should NOT be construed as a securities-related offer or solicitation, or be relied upon as personalized investment advice. RagingBull strongly recommends you consult a licensed or registered professional before making any investment decision. RESULTS PRESENTED NOT TYPICAL OR VERIFIED. RagingBull Services may contain information regarding the historical trading performance of RagingBull owners or employees, and/or testimonials of non-employees depicting profitability that are believed to be true based on the representations of the persons voluntarily providing the testimonial. However, subscribers’ trading results have NOT been tracked or verified and past performance is not necessarily indicative of future results, and the results presented in this communication are NOT TYPICAL. Actual results will vary widely given a variety of factors such as experience, skill, risk mitigation practices, market dynamics and the amount of capital deployed. Investing in securities is speculative and carries a high degree of risk; you may lose some, all, or possibly more than your original investment. RAGINGBULL IS NOT AN INVESTMENT ADVISOR OR REGISTERED BROKER. Neither RagingBull nor any of its owners or employees is registered as a securities broker-dealer, broker, investment advisor(IA), or IA representative with the U.S. Securities and Exchange Commission, any state securities regulatory authority, or any self-regulatory organization. WE MAY HOLD SECURITIES DISCUSSED. RagingBull has not been paid directly or indirectly by the issuer of any security mentioned in the Services. However, Ragingbull.com, LLC, its owners, and its employees may purchase, sell, or hold long or short positions in securities of the companies mentioned in this communication. RagingBull.com, LLC shall be entitled to recover attorneys’ fees, costs and disbursements. In the event that any suit or action is instituted as a result of doing business with RagingBull.com, LLC and/or its affiliates or if any suit or action is necessary to enforce or interpret these Terms of Service, RagingBull.com, LLC shall be entitled to recover attorneys’ fees, costs and disbursements in addition to any other relief to which it may be entitled.   Learn More   Save my name, email, and website in this browser for the next time I comment.   Δ Results may not be typical and may vary from person to person. Making money trading stocks takes time, dedication, and hard work. There are inherent risks involved with investing in the stock market, including the loss of your investment. Past performance in the market is not indicative of future results. Any investment is at your own risk. Accessibility Tools "
}