{
    "title": "Elon Musk got bashed by the heavy metal drummer who cost him $56 billion",
    "date": "2/4/2024",
    "url": "https://www.autoblog.com/2024/02/04/elon-musk-got-bashed-by-the-heavy-metal-drummer-who-cost-him-56-billion/",
    "text": "WILMINGTON, Delaware — Elon Musk suffered one of the biggest legal losses in U.S. history this week when the Tesla CEO was stripped of his $56 billion pay package in a case brought by an unlikely opponent, a former heavy metal drummer. Richard Tornetta sued Musk in 2018, when the Pennsylvania resident held just nine shares of Tesla. The case eventually made its way to trial in late 2022 and on Tuesday a judge sided with Tornetta, voiding the enormous pay deal for being unfair to him and all his fellow Tesla shareholders. Tornetta could not be reached for a comment and his attorney declined to comment. Until Tornetta's case, Musk prevailed in a string of trials accusing him of defamation, of breaching his duty to shareholders and of violating securities laws. Based on his online presence, Tornetta seems to have more of an interest in creating audio gear for car-customizing enthusiasts than going after corporate excess and malfeasance. He has posted light-hearted videos about gadgets he has created or mishaps, including describing how he torched his eyebrows. Tornetta also turned up in videos drumming at the legendary former New York club CBGB with his now-defunct metal band \"Dawn of Correction\", which described its sound as \"a swift kick to the face with a steel-toed work boot.\" On social media, fans of Tesla and Musk seemed to find the case a travesty of justice and speculated about Tornetta's intentions and political affiliations, asking how an investor with such miniscule holdings could wield such power. Delaware corporate case law is full of cases bearing the names of individual investors with tiny shareholdings who wound up shaping America's corporate law. Many law firms that represent shareholders keep a stable of investors they can work with to bring cases, says Eric Talley, who teaches corporate law at Columbia Law School. They might be pension funds with a broad range of stock holdings but they are also often individuals like Tornetta. The plaintiff signs paperwork to file the lawsuit and then generally gets out of the way, says Talley. The investors don't pay the law firm, which takes the case on contingency, as the lawyers did in the Musk case. Tornetta benefits from winning the case the same way other Tesla shareholders benefit: saving the company billions of dollars that a subservient board of directors paid to Musk. Business groups have long criticized cases brought by individuals as an indication of potentially abusive litigation. Delaware 10 years ago was plagued with lawsuits led by retail investors owning a few shares challenging merger deals. The cases were often quickly resolved with meaningless settlements that always included payments to the attorneys bringing the cases. Delaware judges and lawmakers eventually reined in the practice. Experts said people like Tornetta are vital for policing boardrooms. Lawmakers and judges have long wanted large investment firms to lead such corporate litigation since they are better equipped to keep an eye on their lawyers' tactics. But experts said fund managers do not want to jeopardize relationships on Wall Street. So it was up to Tornetta to take on Musk. \"His name is now etched in the annals of corporate law,\" Talley said. \"My students will be reading Tornetta v Musk for the next 10 years.\"  Toyota teases the 2025 4Runner 2025 Volkswagen ID. Buzz GTX is one wooly Bulli Nissan considering Xterra revival; 'it's got to be authentic' 2024 Ford Mustang Mach-E reportedly gets another price adjustment to keep it competitive 2025 Honda Pilot Review: Well-rounded three-row SUV adds Black Edition Six-pack of identical Ford Pinto Wagons for sale, in case you were looking    Please enter a display name Please sign in to leave a comment. "
}