{
    "title": "Tesla Struggles To Keep Up With A Chinese EV Rival In Europe — No, It's Not \nBYD",
    "date": "2/20/2024",
    "url": "https://www.tradingview.com/news/benzinga:fe5649892094b:0-tesla-struggles-to-keep-up-with-a-chinese-ev-rival-in-europe-no-it-s-not-byd/",
    "text": "American EV giant Tesla Inc. TSLA saw new vehicle registrations in the European Union surge by nearly 67% year-on-year in January. However, its growth was outpaced by a surprising contender: Chinese state-owned automaker SAIC Motors. What Happened: Data from the European Automobile Manufacturers Association (ACEA) reveals Tesla registered 14,466 new vehicles in January, representing a 66.9% increase year-on-year. Meanwhile, SAIC reported a year-on-year jump of 69.5% with 9,746 new registrations. Headquartered in Shanghai, SAIC features on the Fortune Global 500 list and sold over 5 million vehicles in 2023, including 1.1 million New Energy Vehicles (NEVs). In China, NEV refers to vehicles primarily powered by electricity, encompassing battery-electric vehicles (BEVs) and hybrid electric vehicles, among others. Notably, Tesla only manufactures BEVs and reported 1.81 million vehicle deliveries for 2023. See Also: Best Electric Vehicle Stocks Why It Matters: Tesla ceded the title of the world’s top-selling BEV maker to BYD Co Ltd BYDDY BYDDF last year. The Chinese player sold 526,000 BEVs, surpassing Tesla’s 485,000, consolidating its position as a major global competitor. In December, BYD said it would build a new factory in Hungary. The company currently has over 230 retail stores across countries and multiple models in the European region. However, SAIC Motors demonstrates that BYD is not the only Chinese company challenging Tesla’s dominance. China’s impressive exporting power is another factor to consider. The country exported 5.2 million vehicles last year, potentially overtaking Japan as the world’s largest auto exporter. During Tesla’s fourth-quarter earnings call, CEO Elon Musk even acknowledged that “without trade barriers, Chinese EV makers will pretty much demolish most other car companies in the world.” Check out more of Benzinga's Future Of Mobility coverage by following this link. Read Next: Rivian Says It Will Drive Into Europe — R2 Reservations To Open In Future © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @tradingking_victor @mytradingsetup @jordforex @rajbuzzz @austinedal @dacryptotrader @TradingView @sabaisabai_fx @neo_inversion @ketoryfx @frankchevai_fxt1 @rok_trader @forex.alex @anna_mcmorrin_ @WaltherCrypto @twobrokeboystrading @youngtraderwealth @chriskane.fx Whatever the trade "
}