{
    "title": "Tesla stiffed a small Black-owned bakery on a big Black History Month order",
    "date": "2/26/2024",
    "url": "https://qz.com/tesla-bakery-order-black-history-month-1851285938",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters A bakery in San Jose, California is pissed at Tesla after employees at the automaker placed a massive pie order to celebrate Black History Month, only to cancel it after the Black-owned business worked to meet the huge request. The Giving Pies owner, Voahangy Rasetarinera, said that the world’s most valuable automaker “hurt my small Black women-owned business,” because of the last-minute cancellation, according to Business Insider. She said on February 14 a Tesla representative called her and asked for 2,000 mini pies to be delivered the following week, and she started getting nervous when the payment for her invoice didn’t come through by the next day. Rasetarinera told ABC7 Bay Area that she wasn’t going to worry too much, since she knew Tesla is “a big company.” That evening, the same Tesla rep called her back and actually doubled the order – meaning The Giving Pies had to rush to make sure it could meet the demand. All in all, the order was worth $16,000. Here’s more information on how this whole ordeal went down, from Business Insider: “To fulfill the order, I had turned down other Black History Month catering inquiries, purchased supplies, and prepared for a demanding production schedule,” she wrote in her post. After chasing the representative on Friday, she said, she got a text message “CASUALLY informing me” that Tesla had changed its mind. ”This abrupt reversal left me reeling, realizing the extent of the impact on my small business,” she wrote. “I had invested time, resources, and effort based on assurances from Tesla, only to be left high and dry.” [...] The change of course cost The Giving Pies $2,000, ABC7 reported. Although the bakery has a cancellation policy, it could not recoup its costs because Tesla had not paid the invoice, NBC Bay Area reported. Following Rasetarinera’s interview with ABC, she said another Tesla employee reached out to her to say there had been a miscommunication, and that the original representative wasn’t authorized to promise any payment, according to BI. She said she “expressed her disappointment” at the situation directly with Tesla. “As I reflect on this ordeal, I am reminded of the resilience and determination that have propelled me forward as a Black woman entrepreneur,” she said, according to BI. This article originally appeared on Jalopnik. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}