{
    "title": "Pair accused of stealing battery manufacturing secrets from Tesla and \nstarting their own company",
    "date": "3/19/2024",
    "url": "https://auburnpub.com/article_bc9ccbe8-3673-5827-b87f-89a7a97e1b84.html",
    "text": "Get local news delivered to your inbox! FILE - The logo for the Tesla Supercharger station is seen in Buford, Ga, April 22, 2021. Two men are accused of starting a business in China using battery manufacturing technology pilfered from Tesla and trying to sell the proprietary information, federal prosecutors in New York said Tuesday, March 19, 2024. NEW YORK (AP) — Two men are accused of starting a business in China using battery manufacturing technology pilfered from Tesla and trying to sell the proprietary information, federal prosecutors in New York said Tuesday. Klaus Pflugbeil, 58, a Canadian citizen who lives in Ningbo, China, was arrested Tuesday morning on Long Island, where he thought he was going to meet with businessmen to negotiate a sale price for the information, federal authorities said. Instead, the businessmen were undercover federal agents. The other man named in the criminal complaint is Yilong Shao, 47, also of Ningbo. He remains at large. They are charged with conspiracy to transmit trade secrets, which carries up to 10 years in prison if convicted. A lawyer for Pflugbeil did not immediately return phone and email messages seeking comment Tuesday night. Tesla also did not immediately return an email message. The technology at issue involves high-speed battery assembly lines that use a proprietary technology owned by Tesla, maker of electric vehicles. The two men worked at a Canadian company that developed the technology and was bought in 2019 by “a U.S.-based leading manufacturer of battery-powered electric vehicles and battery energy systems,” authorities said in the complaint. Tesla then was sole owner of the technology. Prosecutors did not name either company. But in 2019, Tesla purchased Hibar Systems, a battery manufacturing company in Richmond Hill, Ontario. The deal was first reported by Electric Autonomy Canada. \"The defendants set up a company in China, blatantly stole trade secrets from an American company that are important to manufacturing electric vehicles, and which cost many millions of dollars in research and development, and sold products developed with the stolen trade secrets,” Breon Peace, U.S. attorney for the Eastern District of New York, said in a statement with officials with the Justice Department and FBI. In mid-2020, Pflugbeil and Shao opened their business in China and expanded it to locations in Canada, Germany and Brazil, prosecutors said. The business makes the same battery assembly lines that Tesla uses with its proprietary information, and it markets itself as an alternative source for the assembly lines, authorities said. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.  Get local news delivered to your inbox! New York is on track to become the first U.S. city with congestion tolls on drivers entering its central business district. Transit authoritie… A New York appeals court has agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if h… Kia is rolling out a revamped compact car in the U.S. even though sales of the small cars are dropping as the nation continues to favor SUVs a… FTX founder Sam Bankman-Fried has been sentenced to 25 years in prison for a cryptocurrency fraud that a prosecutor has described as one of th… New York City officials have announced a pilot program to deploy portable gun scanners in the subway system. Mayor Eric Adams said Thursday th…  Get up-to-the-minute news sent straight to your device. "
}