{
    "title": "Cathie Wood's Ark Invest Sees $28 Trillion Opportunity In AI: Tesla, Drones \nAnd More - NVIDIA (NASDAQ:NVD",
    "date": "3/10/2024",
    "url": "https://www.benzinga.com/markets/equities/24/03/37578131/cathie-woods-ark-invest-sees-28-trillion-opportunity-in-ai-tesla-drones-and-more",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The future of artificial intelligence (AI) is set to bring about a significant financial impact, with Cathie Wood’s Ark Invest analyst Tasha Keeney estimating a $28 trillion opportunity. Keeney has identified key sectors that stand to benefit, including Tesla Inc TSLA and drone technology. What Happened: Keeney, the director of investment analysis and institutional strategies at Ark Invest, has projected that the equity market capitalization linked to innovation will soar to $220 trillion by the end of the decade, largely driven by AI, reported CNBC on Sunday. Ark Invest, known for its focus on innovation, has investments in various sectors, including autonomous vehicles, drones, robotics, energy storage, 3D printing, and space exploration through its Ark Autonomous Tech & Robotics ETF (ARKQ). \"Autonomous cars are already driving in major cities today across the globe. We think that in the next 10 years, that will scale up. I think that opportunity alone could be worth $28 trillion in enterprise value because this will be very disruptive,\" she told CNBC's \"Street Signs Asia.\" She pointed to Tesla as a standout company in this field, citing its ongoing advancements in self-driving technology. Despite a 1.8% decrease in Tesla’s shares over the past year, Ark Invest has set a target price of $200 for the stock, which is currently trading at around $178. Keeney also highlighted the growing importance of drone technology, not only in the military but also across various industries. See Also: Stock Market Hits Record Highs As Powell Hints At Rate Cuts, Bitcoin And Gold Soar: This Week In The Markets Why It Matters: This article comes in the wake of a recent trend where Ark Invest has been unloading shares of Nvidia due to its stretched valuation. Despite this, the firm has been investing in key suppliers of the chipmaker, such as Taiwan Semiconductor Manufacturing Company Ltd. TSM. Ark Invest’s bullish outlook on AI and other transformative technologies has also been evident in its predictions of accelerated U.S. economic growth, with Chief Futurist Brett Winton forecasting a 7% annual real GDP growth on average in the current business cycle. Despite the recent sale of Nvidia shares, Ark Invest’s early recognition of the potential growth in AI for Nvidia has been acknowledged. However, the firm’s early exit from the position has resulted in a missed opportunity for the flagship Ark Innovation ETF. Read Next: Microsoft Says Russian Hackers Stole Code After Spying On Top Executives: Attack Still ‘Ongoing’ Image Via Shutterstock Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}