{
    "title": "Analysts update Tesla stock outlook after yet another EV price change",
    "date": "3/18/2024",
    "url": "https://finance.yahoo.com/news/analysts-tesla-stock-outlook-another-185250211.html",
    "text": "Tesla  (TSLA)  shares took an interesting turn on Monday: They went up. This might surprise some people, seeing as how the electric-vehicle maker's shares have been taking a beating recently, falling about 34% this year. Tesla shares were climbing 6.2% to $173.65 at last check, as Tesla announced a price increase for its Model Y midsize SUV. The company led by Chief Executive Elon Musk has been contending with a variety of challenges. Back in January, Tesla warned investors that vehicle-delivery growth rates would be \"notably lower\" than they were in 2023. Earlier this month, Tesla's Gigafactory in Berlin was the target of a left-wing arson attack, which brought work to a standstill. \"They can't stop us,\" Musk told employees during a March 13 visit, according to The New York Times. More broadly, after starting a price war at the end of 2022, Musk almost a year ago said Tesla would prioritize the number of cars the company sells over the profit it makes on each sale. This strategy, which entailed price cuts, was an effort to build market share. The stock rose on the same day that the former CNN anchor Don Lemon premiered the debut episode of his show, which featured a contentious interview with Musk, on the X microblogging platform. picture alliance/Getty Images Last week, Musk severed ties with Lemon on a partnership they had for \"The Don Lemon Show\" to be amplified on Musk's social-media platform. \"We're still here,\" said Lemon, who referred to the Musk interview as \"the one everyone is talking about.\" Related: Analysts unveil new Nvidia price targets ahead of 'AI Woodstock' conference Lemon maintained that his show wasn't canceled by X, adding that \"after months of begging me, wooing me, to offer some exclusive content on his platform, Elon Musk decided to scrap the deal.\" During the more-than-hour long interview, Musk responded to questions about politics, diversity, content moderation, and his use of ketamine to treat his the \"negative chemical state in my brain.\" Musk chided Lemon that \"it's pretty private to ask somebody about a medical prescription\" and said that he took a \"small amount\" of ketamine every other week. Musk's alleged drug use was the subject of a Wall Street Journal article in January that said he has used a variety of substances, including cocaine, ecstasy, LSD, ketamine and psychedelic mushrooms. Calling the article “comedy gold\" on X, Musk said that he agreed to “3 years of random drug testing” after he was seen smoking a cannabis blunt on an appearance on the Joe Rogan Experience in 2018. Lemon and Musk butted heads several times during the interview, with the billionaire saying at one point that \"you are upsetting me because the way you're phrasing questions is not cogent.\" Whatever the feelings people may have about Lemon's questions, the interview appears to have had no impact on Tesla's stock. Tesla, which had been cutting prices on its vehicles, said on March 16 that it would increase prices on the Model Y by $1,000 in the U.S. and €2,000 ($2,170) in the European Union on April 1 and March 22, respectively. Evercore analyst Chris McNally suggested the price hikes are likely a marketing push to sell production and inventory into the quarter-end as first-quarter deliveries appear weak. McNally, who has an in-line rating and $175 price target on the shares, says it “may also be logical to ponder whether constant price changes (primarily communicated over X) is confusing or even negative for brand sentiment.” Related: Analysts unveil new Nvidia price targets ahead of 'AI Woodstock' conference Deutsche Bank said in a note that in light of “persistently high” Model Y inventory, the investment firm viewed Tesla’s preview of future price increases as an attempt to boost sales this month rather than a sign of solid demand. Last week, Deutsche Bank analyst Emmanuel Rosner said he expected first-quarter deliveries and earnings to miss Wall Street’s current expectations “by a wide margin and [continues] to see material downside risk to full-year 2024.” Rosner cited several factors, including low Model 3 sedan production in the U.S. since the company's Highland refresh, a particularly slow Cybertruck ramp-up, and overall pressure globally from weak EV demand. The analyst also cut his full-year-delivery estimate to roughly 1.96 million units, which represents only high-single-digit-percent growth for the year, compared with a prior mid-teens forecast. Related: Veteran fund manager picks favorite stocks for 2024 Related Quotes "
}