{
    "title": "Tesla raises prices of some Model Y vehicles in US",
    "date": "3/3/2024",
    "url": "https://www.foxbusiness.com/markets/tesla-raises-prices-some-model-y-vehicles-in-us",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Automotive expert Lauren Fix joins ‘Cavuto: Coast to Coast’ to weigh in on Ford’s decision to offer EV owners free Tesla Superchargers until July. Elon Musk's Tesla on Friday raised prices on certain Model Y vehicles sold in the U.S. market by $1,000, according to the company's website. The electric vehicle maker raised the price of its Model Y rear-wheel drive and long-range vehicles to $43,990 and $48,990, respectively. Prices of the Model Y Performance variant and other models of the car remained unchanged as of Friday, according to the website. In February, Tesla temporarily cut prices of some of its Model Y cars in the U.S. until Feb. 29, nearly a month after it cut prices in Europe and China. \"This is the essential quandary of manufacturing: factories need continuous production for efficiency, but consumer demand is seasonal,\" Tesla CEO Elon Musk said last month when responding to a post from Tesla on X, formerly Twitter, that indicated prices would go up in March. ELON MUSK PROVIDES UPDATE ON TESLA ROADSTER TIMELINE Tesla raised prices for the Model Y rear-wheel drive and the long-range variant of the vehicle. (Photo by Peerapon Boonyakiat/SOPA Images/LightRocket via Getty Images / Getty Images) Car buyers in the U.S. have opted for hybrids over EVs in the past few months due to higher ownership costs and some EV models losing their eligibility for federal tax credits over battery sourcing requirements included in the Inflation Reduction Act. In January, Tesla warned of \"notably lower\" sales growth this year as it focuses on the production of its next-generation electric vehicle, which is code-named \"Redwood.\" Tesla's latest price hike may help the company's margins, which were strained over the last year as the company and other EV-makers engaged in a price war that impacted its profitability in a bid to preserve market share. LAWYERS WHO VOIDED ELON MUSK'S 'EXCESSIVE' TESLA PAY PACKAGE WANT $6 BILLION FEE Tesla had temporarily cut prices for certain Model Y vehicles in February to boost sales. (Photographer: Yuki Iwamura/Bloomberg via Getty Images / Getty Images) The company is bracing for competition from a growing number of cheap EVs, such as those made by China's BYD, which surpassed Tesla as the world's leading EV maker in the final quarter of 2023. BYD has begun selling vehicles in Europe and is eyeing a potential entry into the U.S. market. Tesla shares are down over 18% in 2024 so far and are up a little more than 4.5% over the past year. GET FOX BUSINESS ON THE GO BY CLICKING HERE Reuters contributed to this report. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}