{
    "title": "Tesla hit with new sexual harassment lawsuit alleging the company operates \nlike a 'frat house'",
    "date": "3/21/2024",
    "url": "https://ca.movies.yahoo.com/movies/tesla-hit-sexual-harassment-lawsuit-220123927.html",
    "text": "A Tesla factory worker filed a lawsuit against the company on Thursday, alleging sexual harassment. The worker said she was harassed verbally, as well as touched without her permission. Tesla did not respond to a request for comment about the lawsuit A Tesla factory worker alleges in a new lawsuit that female employees at the company face \"rampant sexual harassment.\" Jessica Barraza, a current worker at Tesla's Fremont, California factory, said Elon Musk's company fosters a \"nightmarish\" work culture, according to the suit filed Thursday. In court documents, Barraza, who works the night shift, said she was continually subjected to sexual harassment from co-workers and supervisors in the form of lewd comments and unsolicited physical touch. \"Tesla's factory floor more resembles a crude, archaic construction site or frat house than a cutting-edge company in the heart of the progressive San Francisco Bay Area,\" the lawsuit, filed in Alameda County, said. \"The pervasive culture of sexual harassment, which includes a daily barrage of sexist language and behavior, including frequent groping on the factory floor, is known to supervisors and managers and often perpetrated by them.\" According to Barraza's suit, she endured harassment for three years and repeatedly reported the issues to Tesla's human resources team to no avail. \"As far as Ms. Barraza was aware, Tesla did nothing to investigate or address the event,\" the lawsuit says. She and her lawyers say Tesla broke the law by failing to prevent sexual harassment at the plant, despite knowledge of the incidents. Tesla did not respond to a request for comment. Barraza said in the lawsuit that co-workers often shouted derogatory terms at her on the factory floor and when she would walk to her car, describing her as having a \"Coke bottle figure\" or an \"onion booty.\" The lawsuit said several of Barraza's superiors also propositioned her for sex on multiple occasions. The 38-year-old detailed several instances when co-workers touched her backside without permission, including when a male co-worker stuck his leg between her thighs. The incidents caused Barraza to feel unsafe at the factory and spawned frequent panic attacks, according to the lawsuit. \"She is afraid to return to work knowing that her body could be violated at any time with no repercussions,\" the complaint said. \"She is now afraid to be alone in public spaces around men she does not know. Her doctor has taken her off work, she is on medication and in therapy, and she is not the same person she used to be.\" Attorneys are seeking compensation for Barraza along with a court injunction to stop harassment at the factory. Barraza says the lawsuit is an effort to protect herself and female colleagues from future harassment. She told The Washington Post that CEO Elon Musk has helped breed a toxic workplace, referencing a recent tweet from Musk in which he said he planned to start a \"Texas Institute of Technology & Science,\" dubbing it \"TITS.\" \"That doesn't set a good example for the factory — it almost gives it like … 'he's tweeting about it, it has to be OK,'\" she told The Post. \"It's not fair to myself, to my family to other women who are working there.\" Musk did not immediately respond to a request for comment. The Post said three current and former Tesla workers at the Fremont factory confirmed several of Barraza's accounts and also witnessed or experienced sexual harassment at the site. Barraza is not the only worker that has taken issue with Tesla's company culture. Last month, a court ordered Tesla  to pay nearly $137 million to an employee after a federal court found an employee at the Fremont plant had been subjected to racist abuse and discrimination. Tesla is in the process of challenging the verdict. Read the original article on Business Insider Money can't buy you happiness, but what about working with a financial advisor? Hollie AdamsAccording to London’s Metropolitan Police and social media footage, a pedicab burst into flames directly in front of Buckingham Palace on Saturday, leaving behind only charred, melted remains. Explosion and fire outside Buck Palace! pic.twitter.com/nUWojD8Ji8— Michael Wright (@Michael_HiFi) March 30, 2024 In video of the incident on X, captioned “Explosion and fire outside Buck Palace,” the pedicab can be heard cracking and popping as it burns, emitting billowing clouds of black smok  “Long Live the Tyrant: Life and Times of Giancarlo DiTrapano,” a feature documentary about the independent book publisher, is being developed as an Italy-U.S. coproduction. DiTrapano is described by Ian Thornton, one of the film’s producers, as the “Basquiat of the New York literary scene.” The film is written by Guia Cortassa and directed by … The deputy First Minister has expressed her shock after Sir Jeffrey Donaldson was charged with historical sexual offences. Follow all the action from Stamford Bridge  I'm 73 and my 401(k) hasn't been doing well for the last few years. Would it be a good idea for me to withdraw my money from my 401(k) and pay the tax that I will have to pay eventually anyway, and then invest the rest of my money in CDs? -Archie Your desire for […] The post Ask an Advisor: I'm 73 and My 401(k) ‘Hasn't Been Doing Well.’ Should I Withdraw My Money and Invest in CDs? appeared first on SmartReads by SmartAsset. The Blues sit 11th in the Premier League table heading into the match SATURDAY AM WRITETHRU after Friday Night post : This is how a great box office weekend should be. A studio goes into the frame expecting ‘X’, and they wind up with a substantially higher ‘Y’. It was definitely a good Friday for Legendary and Warner Bros with more walk-up business than expected as Godzilla x …  In this piece, we will take a look at the ten best long term ASX stocks to invest in. If you want to skip our overview of the Australian stock market, then you can take a look at the 5 Best Long Term ASX Stocks To Invest In. Australia is one of the most prosperous […] Officials say the suspect was known to the authorities and entered the nightclub carrying knives and a suspicious bag The LSU Lady Tigers head coach was the subject of a lengthy feature from the Washington Post. Here's what to know about the story.  Nearly four in five NASUWT teacher members in England who took part in a consultative ballot voted against a formal ballot on industrial action. Is it wise to start converting my 401(k) into an IRA (and then Roth) by 10% per year in order to avoid having to claim too much income each year when converting and also avoid RMDs as much as I can? -Cathy It's definitely smart to be thinking about this, Cathy. Systematic Roth conversions like […] The post Ask an Advisor: Is it Wise to Convert 10% of My 401(k) into a Roth IRA Each Year to Avoid Taxes and RMDs? appeared first on SmartReads by SmartAsset. ‘The fire is not believed to be suspicious or deliberate,’ the Met Police said He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” If you’re investing successfully, then it might be nice to see the total value of those investments growing over time, but are you aware that significant growth can put you in a higher tax bracket? This is one way that many people end up owing a lot more tax than they anticipate. Long-term capital gains […] The post Can My Capital Gains Push Me Into a Higher Tax Bracket? appeared first on SmartReads by SmartAsset. St Michael and All Angels Church in Tirley was \"marooned\" by water in January. The French National Assembly was confronted with a demand this week to have the clouds in our skies protected by Unesco. The move comes amid concerns that weather systems could be scientifically manipulated for military or civilian use. Who owns the clouds? A group of high school students, fearing the potential weaponisation of weather systems, put this question to the French parliament.They were accompanied by French author and lawyer Mathieu Simonet who, in his book The End of Clouds, argues t  A rare and hidden Anglo-Saxon “rood” contained within a “medieval virtual reality box” has been conserved – and has excited academics. April will get off to a wintry start in Central Canada as a messy Colorado low will bring a bout of heavy rain and wet snow through the middle of next week, so hold off on taking your winter tires off A Dyson-rivaling hair dryer for just $30, a rare markdown on classic Levis and an Emeril-approved air fryer for $100-plus off await. "
}