{
    "title": "Tesla exec explains objection to Mexico’s proposed EV charging rules",
    "date": "3/27/2024",
    "url": "https://www.teslarati.com/tesla-exec-explains-objections-mexico-ev-charging-rules/",
    "text": "Recent reports have emerged suggesting that Tesla and the United States Government have objected to Mexico’s proposed electric vehicle charging station rules. A Tesla executive has provided some additional insights about the matter, particularly on why the EV maker is objecting to Mexico’s proposal. Mexico’s Energy Regulatory Commission (CRE) reportedly intends to adopt a rule that would require electric vehicle charging stations to have multiple connectors. This is quite different to the strategy being adopted in the United States, where the majority of electric vehicle makers have pledged to adopt Tesla’s North American Charging Standard (NACS). Tesla Mexico has reportedly issued a comment on the matter. “Requiring that a station offer different types of chargers adds technical complexity, creates additional entry barriers, increases the cost of the stations, and is an incentive for new participants interested in offering vehicles in the country not to carry out the necessary development and investment in its production for regional integration, mainly affecting the consumer experience,” the EV maker reportedly noted. In a comment on X, Tesla Vice President of Public Policy and Business Development Rohan Patel provided additional context behind the electric vehicle maker’s opposition to Mexico’s proposed EV charging rules. As per Patel, Tesla has already invested a substantial amount of resources building out a cross-country charging network in Mexico. He also noted that building out a charging network with multiple connector standards would only slow down EV adoption in the country. That article doesn’t accurately convey the message we sent the Mexican government. @TeslaCharging has invested heavily in a cross country charging network in Mexico, enabling travel throughout the country and North America. @tesla_na’s top priority in Mexico is the EV driver… https://t.co/4NFdwL8gkr “Tesla Charging has invested heavily in a cross country charging network in Mexico, enabling travel throughout the country and North America. Tesla North America’s top priority in Mexico is the EV driver experience. Having 5 different connector standards in Mexico where an operator just has to pick 2 of the 5 does not accelerate deployment and provide a good customer experience. Some of the connector types are being phased out (CCS1 and CHAdeMO) or would inhibit cross border travel with the US. We want to make sure Mexico has an accessible network that meets all vehicle needs,” Patel wrote in a post on X. As per Tesla’s official website, over 15,000 Supercharger stalls from its existing 27,000 Superchargers are currently open to non-Tesla vehicles that adopt the North American Charging Standard. Tesla is also working on expanding its NACS-compatible chargers, with the company stating that one new NACS-compatible stall is being opened every hour. “We’re just getting started,” Tesla noted on its official NACS webpage. Don’t hesitate to contact us with news tips. Just send a message to simon@teslarati.com to give us a heads up. Tesla CEO Elon Musk has provided an explanation for a rather alarming panel gap... While reports have emerged alleging that Giga Shanghai is slowing down on its electric... Tesla appears to be ready to roll out wireless EV charging, according to the... The hype surrounding the upgraded Tesla Model 3 Performance “Ludicrous” is becoming more notable,... Ferrari electric vehicles have yet to hit the market, but when they do, they... Copyright © TESLARATI. All rights reserved. "
}