{
    "title": "Tesla shares fall after Morgan Stanley cuts price target on weakening EV \ndemand",
    "date": "3/7/2024",
    "url": "https://today.thefinancialexpress.com.bd/stock-corporate/tesla-shares-fall-after-morgan-stanley-cuts-price-target-on-weakening-ev-demand-1709833947",
    "text": " / STOCK & CORPORATE March 08, 2024 00:00:00 Tesla, opens new tab fell for a third day on Wednesday after a closely watched analyst at Morgan Stanley lowered his price target on the stock, saying that electric-vehicle demand was continuing to weaken in key markets including China despite hefty price cuts, reports Reuters. Morgan Stanley joined other analysts in cutting Tesla's delivery outlook, after its weak China sales for February added to concerns about slowing growth and rising competition. \"China EV market is over-supplied, seeing a barrage of price cuts,\" Adam Jonas said, forecasting a persisting price competition this year. \"While Tesla may be the most technologically advanced car company in the world, its product line-up may be the oldest of any major OEM (original equipment manufacturer), with nearly all of its lineup launched prior to COVID,\" he said. He cut the price target on Tesla's shares to $320 from $345. The stock later trimmed losses and traded 1.3 per cent lower to $178.35. Tesla shares have fallen more than 11 per cent so far this week, wiping off more than $70 billion of its market value. Chinese electric vehicle giant BYD, which has unseated Tesla as the world's biggest EV seller, on Wednesday added fuel to the flames of a brutal price war in China by cutting the price of its cheapest car, the Seagull, by 5 per cent. Tesla will not launch its next-generation cheaper models until late next year. This year, it launched a refreshed Model 3 compact sedan in the United States, without major changes to its exterior styling. Tesla launched a Cybertruck which CEO Elon Musk said would not reach volume production until next year. \"To justify the valuation of the equity today, Tesla needs a mass market vehicle and the Cybertruck is obviously not going to be that solution,\" said Tudor Pickering analyst Matt Portillo. He also said Musk has not yet delivered his years-long promise of reaching full autonomy, which also weighs on the stock. Even though it has been more than a year since Tesla started lowering prices to spur demand, the company in January forecast \"notably lower\" deliveries growth this year. Demand has taken a hit in the past year as high interest rates force consumers to rethink big-ticket purchases such as electric vehicles, adding to the existing concerns around EV costs, charging and battery range. Tesla's first-quarter deliveries are also likely to be weighed down by Red Sea attacks-driven supply chain disruptions, suspected arson at its Berlin factory and downtime at its California plant to prepare for the production of the new Model 3, analysts have said. \"A series of one-time production disruptions added further complexity to the setup for Q1,\" Baird Equity Research analyst Ben Kallo said in a separate note. Share if you like Editor : Shamsul Huq Zahid Published by Syed Manzur Elahi for International Publications Limited from Tropicana Tower (4th\nfloor), 45, Topkhana Road, GPO Box : 2526 Dhaka- 1000 and printed by him from The Transcraft Limited, 229, Tejgaon Industrial Area, Dhaka-1208. Phone: 02223388153, 02223388154 and 02223380377 PABX : 9553550 (Hunting) Fax : 880-2-02223387049 E-mail : [email protected], [email protected] © 2024 - All Rights with The Financial Express "
}