{
    "title": null,
    "date": "3/9/2024",
    "url": "https://www.cnbc.com/2024/03/09/the-future-of-evs-in-the-collectible-cars-market-from-tesla-to-bmw.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article The term \"collectible vehicle\" might conjure up images of an elegant convertible from the 1930s, or maybe a souped-up muscle car. But time moves on. A new crop of all-electric vehicles and hybrid cars have begun to draw interest from collectors despite big price reductions on new EVs and a volatile used marketplace where five-year-old EVs depreciate almost 50% and used hybrids hold their value better than every vehicle category except trucks. So which EVs and hybrids may become collectible and possibly rise in value in the decades to come? \"What people like when they're younger becomes collectible when they're older,\" said Daniel Strohl, former editor of the collector car publication Hemmings Daily. \"We saw that with the muscle cars boomers collected, and we're seeing it now with 1980s trucks and Japanese imports that are popular with younger collectors.\" The biggest factors to collectability are design, performance and historical significance, noted John Wiley, manager of valuation analytics at Hagerty, which offers collector car insurance and car valuation data, among other auto market services. \"If the car did something important, looks great and is fun to use, it will be collectible.\" Here's a look at more stories on how to manage, grow and protect your money for the years ahead. Rarity and condition are also important factors, said Dietrich Hatlapa, founder of the Historic Automobile Group International, which tracks the market with several indexes. \"Small production numbers help,\" he said. \"With mass-produced cars, usually only the most pristine examples with low miles are collectible.\" As with most things, power and beauty add to a car's appeal. High-performance sports cars demand a premium over more pedestrian vehicles. \"It's about bragging rights, so cars that turn heads such as the Tesla Roadster and BMW i8 are getting interest,\" Hatlapa said. Some early EVs and hybrids are already highly collectible. This includes the historic Owen Magnetic hybrid of 1915 to 1921 and the sleek 1996 to 1999 EV1 that General Motors made available to lessees around the turn of the millennia. Here are some recent limited-production models from major automakers that meet all or most of the criteria for collectability cited by experts. A couple have already risen in value. The rest may, some day. Acura NSX (2017-2022) Honda's original NSX, introduced for the 1991 model year, showed the world that exotic mid-engine sports cars can be reliable and comfortable enough for daily driving. These original cars are highly collectible and that bodes well for the second-generation, an all-wheel-drive hybrid with up to 600 horsepower sold from 2017 to 2022. This newer NSX can hit 60 miles per hour in only 2.9 seconds and kept the reputation of its forebear alive with a comfortable interior and intuitive controls. The hybrid NSX had an initial MSRP of $157,000, and has already exceeded $230,000 at auction. BMW i8 (2014-2020) The i8 was a plug-in hybrid offered as both a 2+2 coupe and a two-seat convertible. The i8 isn't especially rare — BMW built more than 20,000 over seven model years — and a four-second 0-to-60 time was not especially quick considering its starting price was nearly $150,000. But the i8 has a couple of factors working in its favor: beauty and presence. It looks like a supercar with dramatic, \"Lambo-style\" butterfly doors. Plus, BMW is a storied enthusiast brand with a decades-deep lineup of cars that attract collector interest. Cadillac ELR (2014 and 2016) The ELR coupe was based on GM's mainstream Chevrolet Volt but featured more power and a seriously luxurious interior covered in leather, wood and carbon fiber. The initial run of ELRs featured 217 horsepower and 37 miles of electric range, increasing to 233 horsepower and 39 miles of range in 2016. Cadillac sold less than 3,000 in total, making it one of the brand's rarest cars. This scarcity, along with its sleek styling, could appeal to future collectors. However, while originally listed for $76,000, used ELRs have depreciated heavily, and generally sell for less than $20,000 today. Tesla Roadster (2008-2012) The Tesla Roadster was conceived back in 2003 by company founder Martin Eberhard. The targa-topped two-seater is not only beautiful, fast and rare, but it also has historical significance as the groundbreaking company's first production car. The Roadster's initial MSRP was $98,000, but well-kept examples have sold for more than $200,000 to collectors. With more than 200 miles of driving range and a 0-to-60 time as low as 3.7 seconds, the Roadster can still compete with more modern EVs. Fewer than 2,500 were produced through 2012. Tesla has a new Roadster in the works that is due to begin delivery in 2025. The four-passenger coupe is expected to start at $200,000, and CEO Elon Musk says it will accelerate to 60 miles per hour in less than one second, which would make it the quickest road-legal car sold in the U.S., if true. Volkswagen XL1 (2013-2016) Volkswagen is the largest automaker in the world, but it only built 250 of these spaceship-like hybrids. The XL1 remains the most efficient road car ever sold with a combustion engine. It could get more than 261 miles per gallon due to a unique diesel-electric plug-in hybrid system, extremely low weight and a highly aerodynamic shape. These sold for about $150,000 when new and can command more than $111,000 at auction. They were never imported to the U.S., but anyone wealthy enough to afford one might be able to swing it. While six- and seven-figure cars do depreciate, it's not uncommon for the rarest, fastest and most beautiful examples to become collectible and rise significantly in value over the long term. For instance, the 1992 to 1998 McLaren F1 sold for about $1 million when new, but has commanded up to $20.5 million at auction. It was the fastest production car of its day, topping out at over 240 miles per hour, and only 106 were produced. The very top of the car market operates by its own rules, which promote collectability. For instance, Ferrari has been known to have \"invite-only\" sales of special editions whereby only existing customers in good standing are allowed to make a purchase. That builds loyalty with existing customers, fuels envy among sales prospects and helps keep used Ferrari prices high. The Italian brand, along with other luxury makers such as Porsche and Aston Martin, also offers restoration and certification services for its classic cars. The business model works. Ferrari sold every one of the 1,398 SF90 XX Stradale plug-in hybrids it planned to produce prior to the car's official launch last June. Luxury automakers are also known to police their used sales, as seen last year when Rolls Royce threatened to blacklist any purchasers who flip its first all-electric vehicle, the Spectre coupe. One problem with collecting older EVs can be keeping them on the road. Internal combustion engines have been ubiquitous for more than a century and mechanics everywhere know how to fix them. By contrast, EVs are still relatively rare, and repairing them can require specialized knowledge. In addition, battery, charging and computer technology is still evolving rapidly and parts can be hard to come by. \"Batteries aren't designed to last more than 15 or 20 years, and the market for replacing or repairing (EV) batteries is only starting to develop,\" Strohl said. \"Plus, even if you can use a new battery in an older car, the software might not be compatible.\" People collect cars out of passion, nostalgia and to meet like-minded enthusiasts. These are all great things, but actually making money on a collector car is difficult. If financial gain is your main goal, you might be better off sticking with a diversified index fund. This holds true even with cars that have appreciated dramatically. For instance, a well-kept 1997 Toyota Supra Turbo that listed for $39,067 when it was new sold for $230,000 at auction in 2022 — a profit of nearly $191,000, minus upkeep, insurance and other costs. If that Supra's initial purchase price had instead been invested in an S&P 500 index fund at the beginning of 1997, it would have grown to $322,477 by the end of 2022, minus a few thousand in fees — a far larger profit of more than $283,000. For another example, the McLaren F1 mentioned above may have appreciated more than 20 times since its debut, but the S&P 500 has gone up nearly as much — 1,900% growth from January 1992 — and without incurring the F1's substantial additional insurance, storage, fuel and maintenance costs. Of course, you can't cruise around in an index fund, or show it off outside the corner coffee shop. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}