{
    "title": "Macy's shutters stores, Apple's pivot, Google's Gemini fail and Tesla's new \nmodel",
    "date": "3/2/2024",
    "url": "https://www.foxbusiness.com/markets/macys-shutters-stores-apples-pivot-googles-gemini-fail-and-teslas-new-model",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Fisher Investments Chairman and founder Ken Fisher argues it is important for investors to keep an eye on global inflation numbers during an appearance on ‘Varney & Co.’ — S&P 500, Nasdaq hit records; Bitcoin nearing previous all-time high — Macy's closing over 100 stores across the U.S. — Google takes hit after Gemini blowback — Elon Musk turns on OpenAI but teases new, delayed Tesla — Apple dumps electric car plans, surprising many — Inflation remains hot ahead of Fed Chair Powell's testimony next week — Regional banks rocked after NYCB disclosure GET FOX BUSINESS ON THE GO BY CLICKING HERE STOCKS AND CRYPTO WRAP WINNING WEEK: Investors ended the week with the S&P 500 and Nasdaq Composite sitting at record highs, helping kickoff the month of March. For Bitcoin, it topped $63,000, with gains of over 23% for the past seven days, as tracked by Dow Jones Market Data Group. The all-time high for the world's largest cryptocurrency by market value is $67,353. MACY'S SHRINKING: American retailer Macy's plans to be much smaller after it shutters 150 locations…continue reading here. VIDEO: Where does Macy's fit in the U.S. retail pie? GOOGLE'S MISSTEP: The search giant's AI tool, Gemini, was shown to have a bias against White people. CEO Sundar Pichai finally addressed the situation, but some wonder if this is the company's Bud Light moment…continue reading here. Shares of parent company Alphabet lost 5% this week. Google parent Alphabet  ( ) FRENEMIES?: Elon Musk is suing Sam Altman's Open AI, claiming it's lost its way under his direction…continue reading here. CLICK HERE TO READ MORE ON FOX BUSINESS Elon Musk and Sam Altman (Eric Lee/Bloomberg via Getty Images (AP Photo/Jae C. Hong)  / Getty Images) As for Musk's Tesla, the long-delayed new model is coming soon, he promised…continue reading here. VIDEO: How far ahead is Elon Musk in the electric vehicle race? The Tesla Roadster, the world's first highway-capable all-electric car available in the U.S., is displayed on its production debut in the Tesla flagship store May 1, 2008, in Los Angeles. (Vince Bucci/Getty Images / Getty Images) APPLE'S ABOUT FACE: Apple scrapped plans to develop an electric vehicle, good nighting what was known as \"Project Titan,\" per reports…continue reading here. VIDEO: Here's why Apple is dropping out of the EV business. REGIONAL BANKS ROCKED: Ahead of the March anniversary of the collapse of Silicon Valley Bank, NYCB is warning investors it's on shaky ground, sending chills through the regional banking industry…continue reading here. VIDEO:  Is another regional bank on the verge of collapse? FOLLOW THE FOX BUSINESS DEBT TRACKER: HERE INFLATION STICKS AROUND: The Federal Reserve's favorite data point on inflation didn't bring enough relief for policymakers and is making the timing for future rate cuts even murkier…continue reading here. VIDEO: Former Federal Reserve President James Bullard gives his take on inflation. UP NEXT: -Looking for more business and market-moving headlines? Find more from FOX Business here. -Want live updates? Get the FOX Business app here. -Did someone forward you this email? Subscribe to additional newsletters from Fox News and FOX Business here. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}