{
    "title": "EV Sales Boom, Tesla Stock Questions, Cybertruck & ID.4 Towing — 17 \nCleantech Stories Not To Miss!",
    "date": "3/25/2024",
    "url": "https://cleantechnica.com/2024/03/26/ev-sales-boom-tesla-stock-questions-cybertruck-id-4-towing-17-cleantech-stories-not-to-miss/",
    "text": " The cleantech revolution may get bumps and bruises, but it is constantly moving on. Below are 17 electric vehicle, solar energy, wind energy stories from the past week or so that I think are particularly noteworthy and worth checking out if you missed them or overlooked them. Enjoy, and tell us down in the comments if you think there are any other top cleantech stories to highlight from the past couple of weeks.  Why the Tesla Model Y & other EVs are so safe: Carolyn Fortuna, who recently wrote our report The EV Safety Advantage, explains why the Tesla Model Y and other EVs are safer than most other cars on the road. University of Pennsylvania a solar leader: Ivy League school University of Pennsylvania is going solar in a big way. Two solar power plants to power its massive and highly regarded educational and healthcare facilities have been built, using 485,000 solar panels for a combined 220 megawatts of power capacity.  Shell dumping gas stations for EV charging future: Shell made a big splash last week with the announcement that it would sell 1,000 fuel retail locations and put its money into new EV charging stations. About 500 of the gas stations will be closed in 2024 and 500 in 2025. EV chargers will be installed at all of its remaining stations.  Mexico EV sales grow 94%: The Mexican electric vehicle market is rising, with 94% more EV sales in 2023 than in 2022. 19,487 EVs were sold in the country, 1.3% of the country’s total auto sales. I know — there’s still a long way to go!   EV share in USA climbs up, up, up: Just north of the border, EV adoption in the US is much higher, but we were at the same level as Mexico five years ago. A recent report I created showed how EV market share in the states has climbed up, up, up in recent years — contrary to the current hype around sales “dropping” at the moment.  EV battery prices to fall, fall, fall: Sales have risen a lot, but we’re just getting started. EV battery prices are projected to fall significantly in the next couple of years, which should bring down electric vehicle costs, which should drive up electric vehicle sales. And the revolution rolls on!  EV market share in 17 countries: It may be exciting to see US EV market share rise up year after year, but we’re still far behind many other markets, specifically China and a bunch of European countries. Chip in a few dollars a month to help support independent cleantech coverage that helps to accelerate the cleantech revolution! More electric car stats: Haven’t gotten enough EV stats and charts yet? I pulled together 10 (or more) stats and 13 charts for you and others to appreciated, and as an easy resource page for these. Check it out and share with friends as well as strangers!  Wind turbines don’t hurt property values: There is so very little one can complain about when it comes to wind turbines. They are not smoke stacks or nuclear power plants spewing pollution into the air or bringing great risk to the region. But one thing that’s been claimed for years is that they hurt property values because they “ruin” the view. Turns out: that’s wrong. Rivan Supercharging: Rivian vehicles can now use Tesla Superchargers. Nuff said.  Carbon market pricing: Ever wonder exactly what voluntary market carbon pricing is? That’s what most people ponder on their way to work! (Or not.) Either way, if you’re curious about this or looking for an explainer, we’ve got you covered.  EV towing: There’s a lot of content out there now about towing with a Tesla Cybertruck, and there’s also a great account of a couple towing coast to coast with a Volkswagen ID.4. For the towing curious, these should be interesting — or even to those like me who have no interest in towing. Thanks to Jennifer Sensiba for bringing these stories to more people and summarizing them so well for us.  Unrealistic EPA range: Jennifer also did a great job digging into why EPA range is overly optimistic and how that problem could be fixed. Hopium hydrogen motorcycle: This is a fun but also quite a disappointing matter — it turns out some people are still convinced hydrogen is a great fuel option for small vehicles, like motorcycles. It’s not, and hopefully the Hopium bike we recently got pitched will not trick anyone into believing the future of motorcycles is hydrogen.  Tesla stock’s future: Tesla has been the standout winner in the stock world over the past decade, especially in the auto world. However, that big stock boom may have run its course. The stock has been tumbling all year, and it’s actually hard to make a case for why it should rise again. I give three potential reasons to believe in Tesla stock in that story above, but I also explain the potential issues with them.  Cheaper Tesla coming in 2025: That’s not to say Tesla won’t keep changing the world! And one key way it’s expected to keep shaking up the auto industry, growing, and cutting emissions is via the coming cheaper Tesla. Word on the street is that will go into production in 2025. We’ll see. This is part of CleanTechnica’s weekly newsletter. Sign up for the newsletter here! Zach is tryin' to help society help itself one word at a time. He spends most of his time here on CleanTechnica as its director, chief editor, and CEO. Zach is recognized globally as an electric vehicle, solar energy, and energy storage expert. He has presented about cleantech at conferences in India, the UAE, Ukraine, Poland, Germany, the Netherlands, the USA, Canada, and Curaçao.\r\n\r\nZach has long-term investments in Tesla [TSLA], NIO [NIO], Xpeng [XPEV], Ford [F], ChargePoint [CHPT], Amazon [AMZN], Piedmont Lithium [PLL], Lithium Americas [LAC], Albemarle Corporation [ALB], Nouveau Monde Graphite [NMGRF], Talon Metals [TLOFF], Arclight Clean Transition Corp [ACTC], and Starbucks [SBUX]. But he does not offer (explicitly or implicitly) investment advice of any sort. Zachary Shahan has 7324 posts and counting.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\tSee all posts by Zachary Shahan "
}