{
    "title": "How Much Longer Will Warren Buffett Top Dividend Stocks Apple, Coca-Cola, \nand Chevron Underperform the S&P 500?",
    "date": "40 minutes ago",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/24948313/how-much-longer-will-warren-buffett-top-dividend-stocks-apple-coca-cola-and-chevron-underperform-the-sp-500/",
    "text": "It's no secret that Warren Buffett-led Berkshire Hathaway's (NYSE: BRK.A)(NYSE: BRK.B) top public equity position is Apple(NASDAQ: AAPL) -- which has been the second worst-performing \"Magnificent Seven\" stock year to date (YTD), behind only Tesla. But what you may not know is that other top Buffett stocks, like Chevron(NYSE: CVX) and Coca-Cola(NYSE: KO), are also underperforming YTD. Combined, these three companies make up a staggering 54.8% of Berkshire's public equity portfolio. Here's why each dividend stock is underperforming the S&P 500 and what it can do to turn things around. Image source: Getty Images. Lee Samaha(Apple): This year's hot investing words are \"artificial intelligence,\" and Apple's stock may have fallen out of favor due to its relative lack of exposure to the theme. Still, value investors won't care much about that, as the stock's 10% decline in 2024 is moving it into value territory. While there are concerns over slowing smartphone sales growth, not least in China, and Apple's year-over-year growth in product sales was minimal in the first quarter of its financial 2024, the long-term value case for the stock is based on its higher-margin services growth. In Q1 2019, Apple's revenue share from services was just 13.8%, but that's up to 19.3% in the recently reported fourth quarter. That increase comes down to an 82% rise in services sales, compared to just 22% for products. Given that Apple's services come with roughly double the gross profit margin of its products (around 70%, compared to mid-35% for products), Apple's gross profit margin increased from 38.4% to 45.9% over the period outlined above. The increase highlights the value case for the stock -- long-term margin expansion from growing services revenue on the back of expanding its installed base of products, including iPhones, iPads, and Macs. That installed base stands at 2.2 billion devices , and its paid subscriptions grew at a double-digit rate in its recently reported quarter. As such, Apple looks set for excellent long-term sales growth with margin expansion leading to earnings and cash flow growth. Apple only has a 0.6% dividend yield, but it has raised its dividend every year since 2013. Because it is such a massive company, Apple pays the second most dividends of any U.S.-based company, ahead of ExxonMobil and behind only Microsoft. Trading on 24.7 times its estimated free cash flow in 2024, Apple is not a screaming value stock. But if the market keeps selling the stock off, then value investors will eventually step in. Scott Levine (Chevron): It's been a rough road for Chevron stock over the past year. While the S&P 500 has soared almost 34%, shares of Chevron have headed in the other direction, sinking almost 2%. Savvy investors know that sometimes when the market punishes a stock, it provides a great buying opportunity -- an insight that value investors understand well. This is clearly the case with Chevron. While shares may be out of favor now, those who are patient can pick up a quality stock at a discount. Plus, they can get paid while they wait for the stock to rebound, thanks to its forward dividend yield of 4.2%. Currently, shares of Chevron are sitting in the bargain bin. Priced at 7.5 times operating cash flow, Chevron stock is trading at a discount to its five-year average cash flow valuation of 8.4. Prefer the price-to-earnings ratio? No problem. The stock still seems inexpensive, trading at 13.6 times trailing earnings, while its five-year average P/E is 14.7. There are a few reasons why forward-looking investors will want to gas up on Chevron stock now. For one, management is taking a judicious approach to the payout. Over the past three years, Chevron's payout ratio has averaged a conservative 49.8%. Chevron is also developing assets in the Gulf of Mexico and the Permian, where it expects production to grow 10% in 2024 compared to 2023. While the price of oil has ebbed from when West Texas Intermediate, the North American oil benchmark, was trading over $100 per barrel in 2022, it has been rising lately, which may give Chevron stock a boost. Even if it doesn't, though, Chevron stock is a smart way to generate strong passive income -- a strategy of which the Oracle of Omaha is well aware. Daniel Foelber (Coca-Cola): Coke will generally underperform in a growth-led bull market and outperform during a bear market. Here's how the stock stacks up to the S&P 500 since 2020. Company/Index 2024 (YTD as of March 15) 2023 2022 2021 2020 Coca-Cola 1.6% (7.4%) 7.4% 8% (0.9%) S&P 500 7.3% 24.2% (19.4%) 26.9% 16.3% Data source: YCharts. Granted, these returns don't factor in dividends. But still, Coke has underperformed the market, which is expected because the market has done so well over the period. However, when growth stocks collapsed in 2022, and the market had a terrible year, Coke came through big time and outperformed the index by 26 percentage points. The best way to invest in Coke isn't to try to beat the market, but to collect a steady stream of passive income from a reliable company. With limited ways to expand the business beyond strategic mergers and acquisitions -- which Coke has done an excellent job of over the last few years -- it's pretty much impossible for the company to keep pace with a growth-fueled market. However, there are signs that Coke is becoming a higher-quality company. Its price raises were a massive success as the company navigated supply chain constraints and offset inflationary effects. Its operating margin is over 28.3%, which is impressively high. For context, Apple's operating margin is 30.8%. The main reason why Berkshire has held Coke for over 30 years is because of the company's growing dividend and buybacks, which reward shareholders without the need to sell stock. With a yield of 3.2% and a price-to-earnings ratio of 24.2, Coke isn't that expensive, and it yields more than double the S&P 500. Coke is a perfect fit for investors who are focused on capital preservation instead of capital appreciation, are looking to supplement income in retirement, or are risk-averse. Expect Coke to continue underperforming a growth-led market, but to outperform if the narrative flips. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 20, 2024  Daniel Foelber has no position in any of the stocks mentioned. Lee Samaha has no position in any of the stocks mentioned. Scott Levine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Berkshire Hathaway, Chevron, Microsoft, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Apple Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}