{
    "title": "Baldwin Brothers LLC MA Has $82.66 Million Stock Position in Apple Inc. \n(NASDAQ:AAPL)",
    "date": "36 minutes ago",
    "url": "https://www.defenseworld.net/2024/03/21/baldwin-brothers-llc-ma-has-82-66-million-stock-position-in-apple-inc-nasdaqaapl.html",
    "text": "Posted by Defense World Staff on Mar 21st, 2024 Baldwin Brothers LLC MA cut its stake in shares of  Apple Inc. (NASDAQ:AAPL – Free Report) by 1.9% during the fourth quarter, according to its most recent disclosure with the Securities & Exchange Commission. The firm owned 429,354 shares of the iPhone maker’s stock after selling 8,157 shares during the period. Apple makes up  about  6.5% of Baldwin Brothers LLC MA’s holdings, making the stock its biggest position. Baldwin Brothers LLC MA’s holdings in Apple were worth $82,663,000 as of its most recent SEC filing. A number of other hedge funds and other institutional investors have also modified their holdings of the stock. Vanguard Group Inc. lifted its holdings in shares of  Apple by 0.7% in the first quarter. Vanguard Group Inc. now owns 1,269,995,750 shares of the iPhone maker’s stock valued at $221,753,959,000 after purchasing an additional 8,734,393 shares in the last quarter.  State Street Corp lifted its stake in  Apple by 0.5% in the 2nd quarter. State Street Corp now owns 578,897,858 shares of the iPhone maker’s stock worth $112,288,818,000 after acquiring an additional 2,616,084 shares in the last quarter.  Moneta Group Investment Advisors LLC boosted its position in  Apple by 116,483.5% during the 4th quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock worth $74,002,245,000 after acquiring an additional 569,066,184 shares during the period.  Geode Capital Management LLC grew its stake in  Apple by 2.2% during the 2nd quarter. Geode Capital Management LLC now owns 291,538,165 shares of the iPhone maker’s stock valued at $56,396,763,000 after acquiring an additional 6,367,053 shares in the last quarter.  Finally, Price T Rowe Associates Inc. MD increased its holdings in shares of  Apple by 3.4% in the 1st quarter. Price T Rowe Associates Inc. MD now owns 234,017,381 shares of the iPhone maker’s stock valued at $38,589,468,000 after purchasing an additional 7,736,013 shares during the period. Institutional investors and hedge funds own  58.51% of the company’s stock. AAPL stock opened at $178.67 on Thursday. The company has a 50 day moving average price of $182.97 and a 200 day moving average price of $183.11. Apple Inc. has a fifty-two week low of $155.98 and a fifty-two week high of $199.62. The company has a debt-to-equity ratio of 1.28, a current ratio of 1.07 and a quick ratio of 1.02. The stock has a market capitalization of $2.76 trillion, a PE ratio of 27.83, a price-to-earnings-growth ratio of 2.09 and a beta of 1.29. Apple (NASDAQ:AAPL – Get Free Report) last announced its quarterly earnings data on Thursday, February 1st. The iPhone maker reported $2.18 EPS for the quarter, topping analysts’ consensus estimates of $2.09 by $0.09. Apple had a return on equity of 156.04% and a net margin of 26.16%. The firm had revenue of $119.60 billion during the quarter, compared to analyst estimates of $117.99 billion. During the same period last year, the company earned $1.88 earnings per share. The company’s revenue was up 2.1% on a year-over-year basis.  Analysts forecast that  Apple Inc. will post 6.55 EPS for the current year. The business also recently declared a quarterly dividend, which was paid on Thursday, February 15th. Stockholders of record on Monday, February 12th were given a $0.24 dividend. The ex-dividend date of this dividend  was Friday, February 9th. This represents a $0.96 annualized dividend and a dividend yield of 0.54%. Apple’s dividend payout ratio  is currently 14.95%. Several analysts recently commented on AAPL shares. Barclays decreased their price target on shares of Apple from $160.00 to $158.00 and set an “underweight” rating for the company in a report on Friday, February 2nd. Monness Crespi & Hardt upped their price target on shares of Apple from $189.00 to $200.00 and gave the stock a “buy” rating in a research note on Friday, February 2nd. DA Davidson initiated coverage on Apple in a research report on Wednesday, January 3rd. They set a “neutral” rating and a $166.00 price objective for the company. Robert W. Baird upped their target price on Apple from $186.00 to $200.00 and gave the stock an “outperform” rating in a research report on Monday, January 29th. Finally, The Goldman Sachs Group raised their price target on Apple from $223.00 to $232.00 and gave the stock a “buy” rating in a research note on Friday, February 2nd. One research analyst  has rated the stock with a sell rating, eleven have assigned  a hold rating, twenty-one have given a buy rating and one  has given a strong buy rating to the stock. Based on data from MarketBeat, the company currently has an average rating of “Moderate Buy” and an average target price of $205.27. Get Our Latest Stock Report on Apple In other Apple news, Director Arthur D. Levinson sold 100,000 shares of the firm’s stock in a transaction dated Thursday, February 29th. The stock was sold at an average price of $180.94, for a total transaction of $18,094,000.00. Following the transaction, the director now owns 4,434,576 shares in the company, valued at $802,392,181.44. The sale was disclosed in a document filed with the SEC, which is available through this link. 0.06% of the stock is owned by insiders. (Free Report) Apple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.    Receive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter. Vanguard Group Inc. Has $804.41 Million Stock Position in Clean Harbors, Inc. (NYSE:CLH) Founders Capital Management Sells 276 Shares of Apple Inc. (NASDAQ:AAPL) "
}