{
    "title": "Tim Cook is on a charm offensive in China to revive flagging iPhone sales",
    "date": "9 minutes ago",
    "url": "https://www.cnn.com/2024/03/21/tech/china-apple-tim-cook-shanghai-visit-intl-hnk/index.html",
    "text": "Markets Hot Stocks Fear & Greed Index Latest Market News Hot Stocks Follow: Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter which explores what you need to know about the country’s rise and how it impacts the world. Tim Cook is making a high-profile visit to China that coincides with Apple opening a huge new store in Shanghai — its second biggest in the world. It’s all part of a push by the company to reverse a decline in iPhone sales in its most important international market. The new $11.6 million outlet — located in Shanghai’s central district of Jing’an, which is named after a historic temple — is the biggest in China and the second only to Apple’s flagship store on New York’s Fifth Avenue, Chinese state media reported. “Nonghao Shanghai!” Apple CEO Cook said in a Weibo post on Wednesday, which means “hello” in Shanghainese. “I’m always so happy to be back in this remarkable city.” Cook said he had spent the morning enjoying a traditional breakfast of what appeared to be soup dumplings and soy milk and taking selfies along the city’s famous Bund waterfront with local actor Zheng Kai. In Shanghai, mainland China’s financial hub, Apple now has eight stores, the largest number of any city in the country. There are currently 47 Apple stores in 24 cities across mainland China. The new addition comes as Apple (AAPL) tries to fend off competitors and revive sales in a rocky market with growing headwinds, ranging from an economic slowdown to geopolitical tensions and rising nationalist sentiment. Related article\nApple iPhones sales fall 24% in China amid competition and headwinds In 2023, Apple grabbed the top spot in China’s smartphone market for the first time ever, with a record 17.3% market share, according to IDC Research. But during the first six weeks of 2024, iPhone sales in the country slumped 24% from a year ago, according to a separate report by Counterpoint Research from earlier this month. Apple’s market share slid behind that of Vivo, Huawei, and Honor in that period, it added, while rival Huawei’s sales soared 64%. Cook’s visit, his third to the country in a year, underscores China’s significance to Apple as its biggest overseas market and a critical part of its manufacturing supply chain. “China remains a critical market for Apple, particularly in the premium segment above $800, where it holds a dominant position,” said Ivan Lam, senior analyst from Counterpoint. “With Huawei’s resurgence and other Chinese [phone makers] gaining traction in offline sales, Apple is proactively strengthening its offline presence, leveraging flagship stores as a key tool to promote high-end smartphones,” he said. Earlier this month, Apple announced it would expand its research center in Shanghai to support all of its product lines and unveiled plans to open a new applied research lab in Shenzhen later this year. “China is the heart and lungs of Apple’s growth strategy as Cupertino doubles down on its China strategy with these moves,” said Daniel Ives, managing director and senior equity analyst at Wedbush Securities. On Wednesday, Cook hosted an information sharing session along with three of Apple’s suppliers — BYD, Lens Technology and Everwin Precision Technology — at its Shanghai office, according to state media reports. “There’s no supply chain in the world more critical to Apple than that of China,” Cook told a group of reporters. Related article\nHere’s what you need to know about BYD, the Chinese EV giant that just overtook Tesla He met with Wang Chuanfu, founder and chairman of BYD, the world’s largest electrical vehicle maker, at the session, according to a video he posted on his Weibo account. Cook praised Chinese suppliers as having “the most advanced manufacturing in the world,” according to China Daily. The Apple CEO also visited a film production studio, talked with mobile game developers and took photos with a crowd of shoppers and staff, according to his social media posts. “Cook is not taking a step back from China. It’s the opposite as competition from Huawei ramps up domestically,” Ives said. Apple still has many fans in the country. More than a hundred of them waited in line overnight to be among the first to enter the new store or to get a photo with Cook, according to videos and state media reports circulated on Weibo. Others told CNN they were planning to go. “I’ll go and kinda ‘worship’ the store,” said Dolores, a movie producer in Beijing. She has been using the iPhone, iPad and MacBook for years. “I’ve already grown used to its design and the system,” she said, calling the products “sleek and beautiful.” Wei, a Beijing resident, also said he would visit. “I’ve heard that it’s quite big,” he said. “I just want to have a look.” Both said they would stay loyal to the brand, despite rising calls on the Chinese internet for consumers to switch to homegrown brands to show their patriotism. “Some Chinese brands like Huawei are also doing well with their products. But [I won’t switch.] It should be about mutual achievement [for Apple and Chinese brands], rather than hostility,” Dolores said. “For international products, if you like a brand, there should be no geopolitical divisions,” Wei said. “Just look at the products.” Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. "
}