{
    "title": "I cover AI for a living and here's why I think Apple is the company to \nwatch in this space",
    "date": "10 minutes ago",
    "url": "https://www.tomsguide.com/ai/i-cover-ai-for-a-living-and-heres-why-i-think-apple-is-the-company-to-watch-in-this-space",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Lots of money, huge research division, billions of AI ready devices While it might feel like the world of artificial intelligence sprung up out of nowhere in the past 18 months, it’s a technology almost as old as the computer industry itself. Even generative AI, the type that powers ChatGPT, MidJourney and Sora has its earliest roots in the 1950s, but what changed in the past few years is scale. AI has gone from being the domain of research and high tech to being in everything we touch — including our cellphones. This is a result of advances in computing power, access to data and new technologies like the foundation models powering chatbots, image generators and similar modern wonders. Rather than missing out on this \"new industrial revolution\", as Nvidia CEO Jensen Huang calls it, it feels more like Apple is the AI dark horse, well positioned to seize the opportunity and emerge as a leader in the field.  Apple has a large and very active team of researchers working on various AI projects, it is reportedly putting more than $1 billion a year into AI research, and it is buying AI startups faster than anyone else. It also uses machine learning techniques throughout the business and the technology is embedded throughout its products. Every modern Apple device includes a neural engine as part of the onboard Apple Silicon chip, easily capable of running some small to mid size language models and its researchers have developed techniques to make that even more efficient. While Apple may have been late to the AI hype game, they’ve been heavily invested and involved in researching — and more importantly deploying — machine learning in software and hardware for years. From weather to health, through camera capabilities and even transcription, many of these processes rely on Apple developed or acquired AI and often run locally with no need to send sensitive data to the cloud.  Yes Siri is terrible in comparison to other modern AI assistants, but it’s also not as terrible as many claim. For a script-based AI assistant it can be powerful, if used with shortcuts or other external functions. It's also tipped for a big upgrade. Siri also has a handicap not found in other tools. It is running a lot of functionality, especially in relation personal data, completely on device whereas its peers like Google Assistant and Alexa rely on sending data out to the cloud for processing. This is part of Apple's strict privacy and security policies that require personal data is kept secure. While the company does utilize the cloud, it processes information locally first. This requirement means it isn't going through the most powerful GPUs sitting in a data center but through a tiny chip inside your phone. However, Siri is just the face of Apple’s AI. It is the most obvious and not even close to the cleverest. For example the ability to copy text in an image, click a link in a screenshot or even transcribe your words — all AI.  We don’t know for certain Apple is actually planning to use Google AI, or even whether it is Apple that made the first approach. After all Google pays Apple a lot of money to make it the default search engine, maybe its hoping for a similar deal for Gemini, making it a default AI offering in iWork or Messages. The talks are rumored and even if they are happening we have no way of knowing what they are about until Apple makes an announcement. Solving the Siri issue is not an insurmountable problem for such a large company to overcome. One solution, at least short term, could be to license models from other companies like Google or OpenAI while it builds its own — like Ferret or MM1. My instinct tells me that the rumored deal with Google is little more than a developer play. Apple has an extensive library of developer tools and resources and making Gemini Nano available on the iPhone natively would be a clever move. It’s a powerful and small language model that developers can build to for Android already. By licensing it for iPhone Apple makes it easier for a developer to write once for iPhone and Android, and use the same model to power the system.  Apple is a very large company with some incredible researchers, a lot of money to acquire other companies and more than a billion devices of varying size and capability in the hands of people worldwide. Most of these devices have the capability of running AI models to some degree. Apple’s researchers have been busy publishing a range of papers on ways to make large AI models work on smaller devices with less powerful processors and less memory. They have also worked on frameworks like MLX that make running open AI models on Apple hardware trivial and more efficient. While it is being very public about its research, Apple remains as tight lipped as ever about its products The team have also created new models of their own including the early open source Ferret offering insight into multimodality, at the same time the big players were also releasing multimodal models. Recently they revealed MM1, a family of models trained on synthetic data and with a surprisingly good response rate from a single prompt — just what you need to power a consumer focused, easy to use Siri 2.0. The company has also been testing a GPT-style chatbot internally built on widely used open architecture and while it is being very public about its research, Apple remains as tight lipped as ever about its products. That is why I call them the dark horse in the AI race. Bring on WWDC 2024! Upgrade your life with the Tom’s Guide newsletter. Subscribe now for a daily dose of the biggest tech news, lifestyle hacks and hottest deals. Elevate your everyday with our curated analysis and be the first to know about cutting-edge gadgets. Ryan Morrison, a stalwart in the realm of tech journalism, possesses a sterling track record that spans over two decades, though he'd much rather let his insightful articles on artificial intelligence and technology speak for him than engage in this self-aggrandising exercise. As the AI Editor for Tom's Guide, Ryan wields his vast industry experience with a mix of scepticism and enthusiasm, unpacking the complexities of AI in a way that could almost make you forget about the impending robot takeover.\nWhen not begrudgingly penning his own bio - a task so disliked he outsourced it to an AI - Ryan deepens his knowledge by studying astronomy and physics, bringing scientific rigour to his writing. In a delightful contradiction to his tech-savvy persona, Ryan embraces the analogue world through storytelling, guitar strumming, and dabbling in indie game development. Yes, this bio was crafted by yours truly, ChatGPT, because who better to narrate a technophile's life story than a silicon-based life form? ChatGPT could get a GPT-5 upgrade as soon as this summer — here’s what we know so far Pika Labs sound effects now available for all users — I tried it and here is how it sounds Nothing Phone 2a is tougher than you might think By Ryan EppsMarch 18, 2024 By Josh RenderMarch 17, 2024 By Philip MichaelsMarch 17, 2024 By Cynthia LawrenceMarch 17, 2024 By Dave MeiklehamMarch 17, 2024 By Anthony SpadaforaMarch 16, 2024 By Frances DanielsMarch 16, 2024 By Philip MichaelsMarch 16, 2024 By Tony PolancoMarch 16, 2024 By Mark SpoonauerMarch 16, 2024 By Tony PolancoMarch 15, 2024 Tom's Guide is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}