{
    "title": "3 Billionaires Are Selling Artificial Intelligence (AI) Stock Nvidia and \nBuying These 10 AI Stocks Instead",
    "date": "1 hour ago",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL-Q/pressreleases/24947702/3-billionaires-are-selling-artificial-intelligence-ai-stock-nvidia-and-buying-these-10-ai-stocks-instead/",
    "text": "For three decades, investors have been privy to no shortage of next-big-thing investment trends. Although nothing has been as transformative as the advent of the internet, innovations and trends that have included genome decoding, businesses-to-business commerce, 3D printing, blockchain technology, and the metaverse have captivated the attention of professional and everyday investors alike. At the moment, nothing is piquing the interest of investors quite like the artificial intelligence (AI) revolution. With machine learning, software and systems have the ability to evolve over time and become more proficient at their task(s). It's what gives AI such broad-scale appeal in virtually every sector and industry. It's also what's made semiconductor stock Nvidia(NASDAQ: NVDA) the hottest thing since sliced bread. Image source: Getty Images. Although Nvidia's graphics processing units (GPUs) have been popular with the personal-computing gaming community for well over a decade, and its GPUs have gained traction with cryptocurrency miners during major crypto bull markets, it's high-compute data centers where the company's infrastructure has shone brightest. Nvidia's A100 and H100 GPUs are nothing short of dominant in AI-accelerated data centers. Analysts at Citigroup opined last year that Nvidia could control upwards of a 90% share of GPUs deployed by enterprises in high-compute data centers in 2024. What's really helped Nvidia is the scarcity of its top-notch GPUs. Since demand has swamped supply, it's been able to meaningfully increase the price of the GPUs it has available, which led to its sales more than doubling in fiscal 2024 (Nvidia's fiscal year ended in late January). But not everyone is on board with the Nvidia growth story. Based on the latest round of Form 13F filings from the Securities and Exchange Commission, eight billionaire investors reduced their respective funds' stakes in this Wall Street darling. In particular, three billionaire money managers cut their funds' stake by more than 1 million shares, including: While some of this selling could be nothing more than benign profit-taking, Nvidia does have a growing list of headwinds to contend with this year. In addition to increasing external competition, the company is expected to contend with mounting internal AI-GPU competition from its top customers, the potential for margin cannibalization, and ongoing export restrictions to China. What's perhaps even more interesting is examining the collective 10 artificial intelligence stocks these three billionaires were buying as they were selling shares of Nvidia. Image source: Getty Images. No billionaire money manager dumped more shares of Nvidia during the fourth quarter than Millennium's Israel Englander. While he and his team were busy paring down their stake in Wall Street's top-performing megacap stock, they were mashing the buy button for a trio of \"Magnificent Seven\" components, including: The \"why?\" behind these buys is simple: They're respective industry leaders. Alphabet's Google has accounted for more than 90% of global monthly internet search share dating back nearly nine years. Meanwhile, Amazon's e-commerce marketplace is far-and-away the world's leading online retail site, while Amazon Web Services (AWS) holds the highest share of cloud infrastructure service spend. Lastly, Apple's iPhone controls more than half of the domestic smartphone market share. But these Magnificent Seven components are also counting on AI to fuel their future growth. Alphabet and Amazon are some of Nvidia's top customers that are currently developing their own AI chips. Both companies are incorporating generative AI solutions into their respective cloud infrastructure service platforms to help businesses build applications and tailor their message(s) to consumers. Apple is also developing AI infrastructure of its own, with the company's processors capable of running generative AI on MacBook. For the moment, Apple's AI ties are primarily its integration of solutions, such as predictive text on the iPhone. It's pretty clear that Israel Englander sees considerably more upside in Nvidia's peers within the Magnificent Seven. The second-biggest billionaire seller of Nvidia stock during the fourth quarter was Susquehanna's Jeff Yass. While Yass and his investment aides slashed their funds' Nvidia stake by 27%, they were purchasing a trio of time-tested businesses with artificial intelligence ties that should be able to withstand a potential bursting of the AI bubble, including: As noted, the key point about these AI stocks is that if the AI bubble were to burst, their core operations would, presumably, prevent them from getting caught up in any major downdraft. For example, Alibaba is China's No. 1 e-commerce platform, with Taobao and Tmall collectively accounting for a nearly 51% share of online retail sales. Alibaba Cloud is also No. 1 in market share in China (as of March 2023) and should continue to thrive given that enterprise cloud-service spending is still in its very early stages. Tesla is North America's largest electric-vehicle (EV) manufacturer and the only pure-play EV maker that's been generating a recurring profit. Though it incorporates AI solutions into its self-driving technology, the company's success is ultimately determined by its ability to sell or lease EVs. If history were to repeat itself and the AI bubble were to burst, Tesla's operating results would ultimately dictate where its share price heads over the long run. Meanwhile, Microsoft has its cash-cow legacy segments to fall back on, such as Windows and Office, as well as its high-growth initiatives, which include cloud infrastructure service platform Azure -- the worldwide No. 2 cloud infrastructure service provider by spend, behind only AWS. Although Microsoft is betting big on AI, arguably more so than Alibaba or Tesla, it would likely be just fine if AI expectations are tempered at some point in the not-too-distant future. The final billionaire that was an aggressive seller of Nvidia stock during the December-ended quarter was Steven Cohen at Point72 Asset Management. While Cohen and his team were busy paring down Point72's stake in AI infrastructure kingpin Nvidia by 66%, they were buying four ancillary beneficiaries of the AI movement, including: Similar to what Jeff Yass did at Susquehanna, Point72's investment team looks to be de-risking the fund by focusing on businesses that can benefit from AI but have less direct exposure if and when the bubble bursts. Whereas total sales for Oracle's recently reported quarter (ended Feb. 29, 2024) were up just 7%, infrastructure-as-a-service sales catapulted 49% from the prior-year period. While Oracle can easily lean on its legacy bread-and-butter segments if AI experiences a demand reset, it's well-positioned to be a long-term winner in AI infrastructure. Western Digital is a potentially sneaky play on AI-driven storage. Just as Western Digital experienced a surge in demand during the initial wave of enterprise cloud-service spending, the growing storage demand needs in AI-accelerated data centers should be music to the ears of management. It could pave a path for the company's high-transfer-rate NAND flash memory solutions to become standard in data centers. To keep with the theme, Dell Technologies has its core computing segments it can lean on if an AI bubble were to materialize. Nevertheless, it's witnessed exceptionally strong demand for customizable rack servers used by businesses operating AI-accelerated data centers. Though this makes up a small percentage of Dell's business at the moment, it positions the company to sustainably benefit over the long run as AI solutions proliferate. Cohen and his team also piled into robotic-assisted surgical systems developer Intuitive Surgical. This is a company that's utilizing AI to help surgeons study their own procedural data to improve patient outcomes. Ultimately, the company should enjoy sustained double-digit sales growth as the da Vinci surgical system gobbles up share in a variety of soft-tissue surgical indications. No company comes remotely close to the installed base of assisted-surgical systems that Intuitive Surgical has put in place since this century began. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 20, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Citigroup is an advertising partner of The Ascent, a Motley Fool company. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Sean Williams has positions in Alphabet, Amazon, Intuitive Surgical, and Western Digital. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Intuitive Surgical, Microsoft, Nvidia, Oracle, and Tesla. The Motley Fool recommends Alibaba Group and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Apple Inc stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}