{
    "title": "The Trend Of High Returns At Alphabet (NASDAQ:GOOGL) Has Us Very Interested",
    "date": "1/24/2024",
    "url": "https://simplywall.st/stocks/us/media/nasdaq-googl/alphabet/news/the-trend-of-high-returns-at-alphabet-nasdaqgoogl-has-us-ver",
    "text": "Stock Analysis If you're not sure where to start when looking for the next multi-bagger, there are a few key trends you should keep an eye out for.   Amongst other things, we'll want to see two things; firstly, a growing return on capital employed (ROCE) and secondly, an expansion in the company's amount of capital employed.  Basically this means that a company has profitable initiatives that it can continue to reinvest in, which is a trait of a compounding machine.    Speaking of which, we noticed some great changes in Alphabet's (NASDAQ:GOOGL) returns on capital, so let's have a look. Just to clarify if you're unsure, ROCE is a metric for evaluating how much pre-tax income (in percentage terms) a company earns on the capital invested in its business.  The formula for this calculation on Alphabet is: Return on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities) 0.26 = US$81b ÷ (US$397b - US$86b) (Based on the trailing twelve months to September 2023). Thus, Alphabet has an ROCE of 26%.  That's a fantastic return and not only that, it outpaces the average of 9.0% earned by companies in a similar industry. Check out our latest analysis for Alphabet Above you can see how the current ROCE for Alphabet compares to its prior returns on capital, but there's only so much you can tell from the past.  If you'd like to see what analysts are forecasting going forward, you should check out our free report for Alphabet. The trends we've noticed at Alphabet are quite reassuring.   Over the last  five years, returns on capital employed have risen substantially to 26%.  Basically the business is earning more per dollar of capital invested and in addition to that, 63% more capital is being employed now too.  The increasing returns on a growing amount of capital is common amongst multi-baggers and that's why we're impressed. To sum it up, Alphabet has proven it can reinvest in the business and generate higher returns on that capital employed, which is terrific.       Since the stock has returned a staggering 175% to shareholders over the last  five years, it looks like investors are recognizing these changes.   With that being said, we still think the promising fundamentals mean the company deserves some further due diligence. On the other side of ROCE, we have to consider valuation. That's why we have a FREE intrinsic value estimation on our platform  that is definitely worth checking out. If you'd like to see other companies earning high returns, check out our free list of companies earning high returns with solid balance sheets here. Find out whether Alphabet is potentially over or undervalued by checking out our comprehensive analysis, which includes fair value estimates, risks and warnings, dividends, insider transactions and financial health. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. Solid track record with excellent balance sheet. Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. "
}