{
    "title": "Mark Zuckerberg wasn't sure which AI breakthrough Google CEO praised",
    "date": "1/11/2024",
    "url": "https://www.businessinsider.com/mark-zuckerberg-wasnt-sure-which-ai-breakthrough-google-ceo-praised-2024-1",
    "text": "       AI may be a key priority for Meta chief Mark Zuckerberg, but that wasn't always the case. In 2021, Zuckerberg met Google CEO Sundar Pichai at an Allen & Co. conference in Idaho. During their meeting, Pichai expressed his admiration for an AI breakthrough that Facebook had accomplished. However, Zuckerberg didn't know what achievement Pichai was talking about, Bloomberg reported on Thursday, citing sources familiar with the meeting. The meeting ended up igniting Zuckerberg's interest in the field. Zuckerberg requested a briefing on his company's latest work on AI after talking to Pichai, per Bloomberg. Meta's former vice president for AI, Jerome Pesenti, told Bloomberg that Zuckerberg has now \"educated himself a lot more\" about the subject. Zuckerberg was, at one point, focused on his company's other fields of work. The Facebook founder flirted with cryptocurrencies in 2019 when the company announced that it was launching its cryptocurrency, Libra. Regulatory hurdles eventually caused interest in the project to peter out. Related stories Zuckerberg then decided to make a huge push into the metaverse. In October 2021, he renamed Facebook, rechristening it \"Meta.\" The strategy, unfortunately, has yet to pay off for Zuckerberg. The company division that works on virtual and augmented reality projects lost $4 billion in the first quarter of 2023. But Zuckerberg has been quick to pivot his company toward working on AI. \"In terms of investment priorities, AI will be our biggest investment area in 2024 for both engineering and compute resources,\" Zuckerberg said in an earnings call last year. \"We're going to continue deprioritising a number of non-AI projects across the company to shift people towards working on AI,\" he added. The increased focus seemed to have paid off for Zuckerberg's Meta, which has now become one of the leading players in the AI race. Meta has sought to distinguish itself from competitors like OpenAI by advocating for an open-source approach toward AI development. In July, the company released Llama 2, a mostly open-source AI model. Representatives for Meta and Google did not immediately respond to requests for comment from Business Insider sent outside regular business hours. On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Read next Jump to "
}