{
    "title": "Alphabet (GOOGL) Boosts Pixel Watch With Watch 2 Features",
    "date": "1/3/2024",
    "url": "https://www.zacks.com/stock/news/2205249/alphabet-googl-boosts-pixel-watch-with-watch-2-features",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    January 03, 2024 AAPL Quick QuoteAAPL GRMN Quick QuoteGRMN CAMT Quick QuoteCAMT GOOGL Quick QuoteGOOGL Better trading starts here. You follow Analyst Blog - edit You follow Zacks Equity Research - edit Zacks Equity Research Analyst Blog Alphabet’s (GOOGL Quick QuoteGOOGL  -  Free Report)     Google is making advancements to add features to its original Pixel Watch.A month ago, it was announced that this particular smartwatch would be upgraded with some of the features of the Pixel Watch 2. It has now started featuring DND and Bedtime Mode sync.Users can avail of these features by opening the Pixel Watch companion app.Alphabet’s solid efforts to strengthen its Pixel Watch series are expected to continue helping it bolster its presence in the booming smartwatch market.Per a Fortune Business Insights report, the global smartwatch market is anticipated to reach $77.22 billion by 2032, witnessing a CAGR of 14.8% between 2023 and 2030.The company’s growing prospects in this promising market are expected to aid it in gaining investors’ optimism in the days ahead.Growth promises associated with Pixel Watches are expected to contribute well to the performance of Google Services segment which has been the key growth driver of the company.Alphabet’s shares have gained 56.2% in the past year, outperforming the Zacks Computer & Technology sector’s growth of 53.1%.Growing Google Services segment is expected to continue driving its overall performance.The Zacks Consensus Estimate for 2024 total revenues is pegged at $283.39 billion, indicating year-over-year growth of 11.3%.The consensus mark for 2024 earnings is pinned at $6.74 per share, indicating year-over-year growth of 15.6%. The estimate has been revised upward by 0.7% in the past 30 days. Although Alphabet is a late entrant in this market, its growing smartwatch efforts are likely to intensify competition for other incumbents that are leaving no stone unturned to expand footprint in the smartwatch market, like Apple (AAPL Quick QuoteAAPL  -  Free Report)     and Garmin (GRMN Quick QuoteGRMN  -  Free Report)    .Apple, currently dominating the smartwatch market on the back of its expanding Watch family, is constantly making efforts to sustain its supremacy. The strong adoption of the Apple Watch on the back of useful and advanced features like Cycle Tracking, the Noise app and Activity Trends remains a major positive.The company recently announced the availability of watchOS 10 to further strengthen the Apple Watch series.More than two-thirds of the customers who purchased the Apple Watch during fourth-quarter fiscal 2023 were first-time customers.Garmin’s expanding product portfolio for the Fitness and Outdoor business, which has been built with both internal development efforts and acquisitions, makes the company a potential player in the wearable space.The launch of its new health and fitness smartwatch called vivoactive 5 and GPS smartwatches, namely the Venu 3 and Venu 3S, remains noteworthy.These devices are comprised of robust healthcare features like sleep coach, which offers a sleep score and personalized coaching that keeps track of different sleep stages, naps, Pulse Ox1 and heart rate variability (“HRV”) status; morning report, which provides an overview of sleep, recovery and HRV status; nap detection, which tracks or logs naps automatically and Body Battery enhancements, which monitor energy levels throughout the day. Currently, Alphabet carries a Zacks Rank #2 (Buy).Another top-ranked stock in the broader technology sector is Camtek (CAMT Quick QuoteCAMT  -  Free Report)    , carrying a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Camtek shares have returned 220.4% over the past year. The long-term earnings growth rate for CAMT is pegged at 12.26%. Apple Inc. (AAPL) - $25 value - yours FREE >> Garmin Ltd. (GRMN) - $25 value - yours FREE >> Camtek Ltd. (CAMT) - $25 value - yours FREE >> Alphabet Inc. (GOOGL) - $25 value - yours FREE >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}