{
    "title": "Alphabet's Moonshot X Lab Cuts Staff In A Push To Secure Investments \n01/23/2024",
    "date": "1/23/2024",
    "url": "https://www.mediapost.com/publications/article/392841/alphabets-moonshot-x-lab-cuts-staff-in-a-push-to.html",
    "text": "Username Password Remember me Forgot your password? Subscribe today to gain access to every Research Intelligencer article we publish as well as the exclusive daily newsletter, full access to The MediaPost Cases, first-look research and daily insights from Joe Mandese, Editor in Chief. If you're already a paid subscriber, please sign-in. Username Password  \n                                      Forgot?  Log in if you are already a member Username Password  \n                                      Forgot?  Google’s parent company Alphabet will adopt a new\nstructure for its X division, a research and development subsidiary focused on inventing and launching \"moonshot\" technologies. The organizational structure will enable its projects to spin out\nmore easily. Waymo, a self-driving car company; Loon, an internet-connectivity high-altitude balloon venture; Wing, which designs and manufactures delivery drones; Verily, which provides\nresearch for medical cures; and Malta, technology that provides a way to store electricity using molten salt, are some of the companies X has been responsible in creating. Any new spinoffs\nwill act as independent startups and gain support from Alphabet and outside backers, Bloomberg reported, citing one person and an email to staff obtained by the media outlet. The change means\nAlphabet will lay off dozens of employees and turn to outside investors to help fund the projects. advertisement advertisement Founded in 2010, X is the brainchild of Google founders Brin and Page. Astro\nTeller, who leads the Moonshot X lab, wrote in the email to Bloomberg that funding through market-based capital will help to spin off more projects as independent companies. The cuts are\nslowly taking place, pulling employees back into the unemployment pool, like high rip currents that have continued for weeks. Since the beginning of the year, Google has eliminated thousands of jobs\non teams such as hardware, software and engineering. Alphabet Chief Financial Officer Ruth Porat will step down and move to a new role as president and chief investment officer to oversee\nthe division, “other bets,” that includes X. Last week, Google CEO Sundar Pichai warned of more layoffs after eliminating thousands of jobs at Google and about 100 at YouTube. He\nsaid the company’s “ambitious goals” require some teams to\neliminate roles to “create the capacity” for investment in promising areas such as artificial intelligence (AI), which agencies believe will only make it more difficult to support brands. advertisement "
}