{
    "title": "Apple, Alphabet, Broadcom, Nvidia CEOs to meet with EU antitrust chief next \nweek",
    "date": "1/5/2024",
    "url": "https://seekingalpha.com/news/4052649-apple-alphabet-broadcom-nvidia-ceos-to-meet-with-eu-antitrust-chief-next-week",
    "text": "dem10/iStock via Getty Images The chief executives of Apple (NASDAQ:AAPL), Alphabet (NASDAQ:GOOG) (GOOGL), Broadcom (NASDAQ:AVGO) and Nvidia (NASDAQ:NVDA) are slated to meet with Margrethe Vestager, the Executive Vice President of the Commission next week. Vestager, who has led a strict line on mergers and acquisitions and investigations into the big tech companies during her time at the EC, will hold the meetings in San Francisco and Palo Alto, California, Reuters reported, citing her adviser. The meetings will focus on digital regulation and competition in the 27-country bloc. Alphabet and Apple are listed among the EC's \"gatekeepers,\" a group of six tech companies that are subject to the continent's Digital Markets Act. If the companies do not comply with the rules laid down by the DMA, they can be fined up to 10% of global annual turnover or 20% for repeated violations, the EC explained. Additional steps can be taken by the EC, including requiring a gatekeeper to sell a business or parts of it or banning the respective gatekeeper from acquiring additional services related to the non-compliance. In October, regulators in the European Union said there was no \"formal investigation\" into Nvidia despite speculation to the contrary. Broadcom recently closed its deal to acquire cloud virtualization company VMware, which raised some ire in Europe, before ultimately allowing the deal to close. Apple, Alphabet, Broadcom and Nvidia did not immediately respond to a request for comment from Seeking Alpha. In addition to meeting with the CEOs of the respective companies, Vestager will meet with Alphabet (GOOG) (GOOGL) chief legal officer Kent Walker and OpenAI Chief Technology Officer Mira Murati and Chief Strategy Officer Jason Kwon. "
}