{
    "title": "Google CEO Sundar Pichai tells employees to expect more job cuts in 2024: \nReport",
    "date": "1/19/2024",
    "url": "https://www.wionews.com/technology/google-ceo-sundar-pichai-tells-employees-to-expect-more-job-cuts-in-2024-report-681271",
    "text": "According to media reports, Google Chief Executive Officer (CEO) Sundar Pichai has told the employees of the Alphabet-owned company to expect more job cuts this year Google Chief Executive Officer (CEO) Sundar Pichai told the employees to expect more job cuts at the Alphabet-owned company this year, The Verge reported on Wednesday (Jan 17). The news comes after a recent round of layoffs that impacted 1,000 staff. The report mentioned that Pichai released a memo, telling the employees that \"some roles may be impacted\". he also mentioned that the company's divisions were undergoing changes. As per the memo, Pichai said that the job cuts this year were focused on removing layers to simplify execution and drive velocity in some areas. Also read: Apple watch patent row: As US upholds ban on sale, tech giant might disable oxygen display in some devices The tech giant continues to drive towards extending its artificial intelligence capabilities and automation to lighten workloads. These layoffs are clear indications that more jobs might get impacted this year. Pichai informed all employees that \"these role eliminations are not at the scale of last year's reductions, and will not touch every team\". \"We have ambitious goals, and will be investing in our big priorities this year,\" Pichai added. A Google representative confirmed to Reuters that an email was sent to all employees, but refused to disclose further contents of the memo. Also read: US university uses AI to prove our fingerprints are not unique: Report Google announced last week that it would lay off a number of individuals from its Voice Assistant groups, hardware teams responsible for Pixel, Nest, and Fitbit, advertising sales team, and augmented reality team. \"Throughout second-half of 2023, a number of our teams made changes to become more efficient and work better, and to align their resources to their biggest product priorities,\" the Google statement read. \"Some teams are continuing to make these kinds of organizational changes, which include some role eliminations globally,\" it added. In January 2023, Alphabet announced plans to cut 12,000 jobs, or 6 per cent, of its global workforce. As of September 2023, the company had 182,381 employees globally. Watch: Google, Meta, Amazon set to cut jobs this year Ever since the news came out, Google employees have started reacting on social media forums. In one of the posts, an employee wrote, \"Thank you, our corporate overlords, for our new annual tradition.\" A post on X (formerly known as Twitter), mentioned, \"As callous as Google's and other big tech layoffs have been by sending you an email saying you're unemployed, the viral Cloudflare layoff video is proof that it would be even worse optics for companies to do more. Best to realize we're all just numbers on a spreadsheet to them.\" (With inputs from agencies) "
}