{
    "title": "Are Hackers Gaining Access to Google Accounts Without Passwords? Here's \nWhat We Know - Alphabet (NASDAQ:G",
    "date": "1/8/2024",
    "url": "https://www.benzinga.com/news/24/01/36527736/are-hackers-gaining-access-to-google-accounts-without-passwords-heres-what-we-know",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The recent findings of a security analysis have unearthed a method for hackers to gain access to Alphabet Inc.'s GOOG GOOGL Google accounts without the need for a password. What Happened: Security firm CloudSEK has identified a new hacking technique that leverages third-party cookies to breach Google accounts. The malware used in this technique is reportedly under active testing by hacker groups, reported The Independent. First revealed in October last year, this vulnerability was shared by a hacker on the messaging platform Telegram. The exploit involves a glitch in cookies, often used by websites to track users and enhance their browsing experience. See Also: Facebook Now Monitors Your Browsing History In The App: Here’s What It Means For You And How You Can Disable It The authentication cookies of Google, designed to save users from frequent logins, are now the target of hackers aiming to evade two-factor authentication. Google’s Chrome browser, which claimed more than 60% of the market share last year, is currently focused on enhancing the security of third-party cookies. Google has responded by stating that it has taken steps to secure any breached accounts and is constantly improving its defenses against such techniques. It has urged users to activate Enhanced Safe Browsing in Chrome for effective protection against phishing and malware downloads, the report noted. \"We routinely upgrade our defenses against such techniques and to secure users who fall victim to malware. In this instance, Google has taken action to secure any compromised accounts detected,\" the tech giant said in a statement. Why It Matters: This news comes on the heels of a recent update to Google Chrome. In December 2023, Alphabet’s browser introduced various security and performance improvements. One of the key features was more proactive alerts from Safety Check, which notifies users about compromised passwords, potentially harmful extensions, outdated Chrome versions, or site permissions requiring attention. The emergence of this new hacking technique underscores the urgent need for such security enhancements. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: This AI Can Predict Your Passwords With A 95% Accuracy Rate Based On Your Keyboard Clicks This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}