{
    "title": "Google CEO says more layoffs expected 'throughout the year' in internal memo",
    "date": "1/17/2024",
    "url": "https://au.finance.yahoo.com/news/google-ceo-says-more-layoffs-expected-throughout-the-year-in-internal-memo-044016588.html",
    "text": "Following Google's recent rounds of layoffs affecting over a thousand jobs, CEO Sundar Pichai has reportedly told remaining employees to expect further downsizing later this year. According to The Verge, Pichai sent out an internal memo on Wednesday, in which he stated that \"to be upfront, some teams will continue to make specific resource allocation decisions throughout the year where needed, and some roles may be impacted.\" Google confirmed to Engadget that this email was sent out. The exec explained that the latest \"role eliminations\" are about \"removing layers to simplify execution and drive velocity in some areas.\" which is just another way of packaging the situation. What's a little more reassuring, perhaps, is Pichai saying that these won't match the scale of some 12,000 job cuts around this time last year, and that not every team will be affected. But numbers are all relative, of course. Google isn't the only notable tech company that has already made redundancies at the beginning of 2024. Earlier this month, the industry also saw Discord, Meta, Amazon, Twitch, Humane AI, Unity and Duolingo making similar moves at various scales. Here's hoping that LinkedIn's timely launch of its AI-powered \"Job Collections\" feature will help those impacted quickly land a new post. Update, January 18 2024, 10:27AM ET: This story has been updated with Google's response. Ever wondered what goes down at a tantric sex class? Here's your chance to find out. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Trade 24 hours a day on the world's most popular platform. An American living down under has shared his views on one “weird” rule Australia has at Easter time. Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ... An alleged plant thief who continued to come back to the same house has been stopped by the efforts of one very determined plant owner and technology. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 Daylight saving is coming to an end soon, here’s what you need to do to ensure you don’t sleep past your alarm. 'You can't park there mate'. Does bloody conquest, dark ritual or mercenary money explain a gold covered helmet found buried in a field?  \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" EXCLUSIVE: Eden Harper’s close friend has called out Jayden Eynaud after he was spotted looking very cosy with Lauren Dunn at a club. Read more. If you like your scrambled eggs soft and creamy, then there's one ingredient you need to start adding to your dish. Celebrity chefs swear by it.  Fears that Putin could emulate Stalin by trying to further consolidate Eastern bloc Saturday Night Live went with Donald Trump’s hawking of Bibles for its cold open, with James Austin Johnson returning as the former president to make the pitch. It was another case of the show trying to satirize something that hardly needs rewriting. “That’s right, it’s Easter. The time of year when I compare myself to … The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia.  The NSW schoolgirl has not been seen since being dropped at school on Thursday morning. Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more. Ukrainian president says Easter shows ‘life can prevail’  A Florida woman had a nasty surprise recently, when she woke up to find out that two dogs had torn parts off her car in the early morning of March 24, creating an estimated $3,000 worth of damage.Christie Barr told local media that she initially thought somebody had taken a gun and shot her car, and said that “no one believed it was dogs until after they saw the video”.In the security footage she provided, two dogs can be seen approaching the vehicle around 4 am and starting to tear the front bumper, front fender, and two tires.The damage was estimated at up to $3,000 by the insurance company, WAFB reported.Barr told Storyful that the dogs were trying to get to her neighbor’s cat, which she said jumped behind the engine at around 3 am. The duo could not reach the feline despite their aggressive approach, according to Barr.“There’s no doubt in my mind if they’d gotten that cat, she wouldn’t be here today,” Barr said.According to local media, the dogs are unaccounted for and neighbors have expressed concern for their safety. Barr said she had reached out to animal control but is yet to receive a response. Credit: Christie Barr via Storyful ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’ ‘This mental acuity test... is something to give to people who have been in traumatic accidents,’ Democratic strategist says "
}