{
    "title": "Alphabet Analyst Bumps Up Price Target Ahead Of Q4 Results — But Flags \nWeakness In This Key Segment",
    "date": "1/29/2024",
    "url": "https://markets.businessinsider.com/news/stocks/alphabet-analyst-bumps-up-price-target-ahead-of-q4-results-%E2%80%94-but-flags-weakness-in-this-key-segment-1033006776",
    "text": "Alphabet, Inc. (NASDAQ:GOOGL) (NASDAQ:GOOG) received a price-target boost Monday, a day ahead of its quarterly earnings. The Alphabet Analyst: KeyBanc Capital Markets analyst Justin Patterson maintained an Overweight rating on the stock and upped the price target from $153 to $165, suggesting 8.42% upside potential. The Alphabet Thesis: Q4 Outlook: Alphabet will likely report solid fourth-quarter revenue, with Google Search and YouTube more than offsetting a potential Cloud revenue miss, said Patterson in a note. For the fourth quarter, KeyBanc expects revenue of $85.62 billion which is 0.4% above the consensus. Cloud revenue will likely come in at $8.78 billion, about 2.2% below the consensus estimate, the firm said. This would mark 20% year-over-year growth for the segment, it added.  The analyst, however, models an earnings miss due to a $700 million Google Pay settlement and the ongoing trials as well as a higher NFL Sunday Ticket expense. The company began streaming the National Football League's Sunday Ticket games, beginning with the 2023 season. It secured broadcast rights by paying $2 billion per year for seven years. The legal charges could include charges related to the recent $5 billion Chrome incognito mode settlement, Patterson said. Analysts, on average, estimate fourth-quarter earnings per share of $1.59 and revenue of $85.33 billion for Alphabet, according to Benzinga Pro data. See Also: Best Artificial Intelligence Stocks Key Focus Areas: Delving into areas of interest,  Patterson said he would look for the segment commentary.   Retail and travel may have benefited Search spend and a stronger brand market may have boosted YouTube revenue, the analyst said.  The Cloud business appears to have “cost optimizations” later than peers, and Network and Play may have faced headwinds around industry shifts, he added. Patterson said he would also seek additional details on how Alphabet plans to scale AI products. Estimate Revisions: As such KeyBanc raised its fourth-quarter and 2023 revenue estimates by 0.2% and 0.1%, respectively, baking in stronger ad revenue and weaker Cloud revenue. It lowered its earnings per share estimates by 1.8% and 0.5%, respectively. KeyBanc is optimistic about Alphabet’s near- and mid-term. The firm raised its revenue and earnings per share estimates for 2024 and 2025 to reflect increased confidence in Search growth and moderating opex growth. It attributed the higher price target to the hiked earnings per share forecast. GOOG, GOOGL Price Action: At last check, Alphabet (GOOG) shares edged down 0.062% to $153.68, (GOOGL) shares were up 0.069% at $152.29, according to Benzinga Pro data.  Read Next: Despite Record Profits, Google Lays Off Over 1,000 Workers As Many Top DeepMind AI Scientists Leave To Start Their Own Startups Photo: Shutterstock Indices Commodities Currencies Stocks "
}