{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.benzinga.com/markets/equities/24/01/36606660/googles-mysterious-purge-claims-over-1-000-employees-whats-happening-behind-closed-doors",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW In a major layoff round, Alphabet Inc.’s GOOG GOOGL Google has reportedly let go of over 1,000 staff members, marking the largest layoff since January 2023. The layoffs have expanded to non-hardware teams like Assistant as well as core engineering departments, among others. What Happened: A union representative for Alphabet’s employees informed that Wednesday’s layoffs at Google impacted more than 1,000 individuals, as reported by The Information. Regulatory filings, as reported by SFGate, in California reveal Google’s intention to cut 703 positions. Google representatives have not disclosed the exact number of layoffs but have noted that the layoffs include several units, such as hardware and Google Assistant. Google has also reportedly shut down a childcare center in Mountain View and is laying off employees working there. Separately, according to a report by The Verge, Google has confirmed eliminating several hundred roles in their core engineering and Google Assistant teams, contributing to the total layoffs reported on Wednesday. The company’s hardware team, which is responsible for products like Pixel, Nest, and Fitbit, has also been affected. As of September 2023, Google had a workforce of approximately 182,000 globally. Why It Matters:  Google’s decision to lay off hundreds of employees from its hardware and digital assistant teams is part of a broader cost-cutting initiative. This move comes amidst rising competition from rival AI offerings such as Microsoft and OpenAI’s ChatGPT. Google executives had previously hinted at possible cuts during investor calls, aiming to allocate resources towards priority investments. Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Apple Suffers Third Downgrade In January Amidst Anticipated iPhone Sales Rise Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo: Courtesy Pawel Czerwinski on Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}