{
    "title": "Alphabet (GOOGL) Adds Generative AI Capabilities to Chrome",
    "date": "1/26/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-adds-generative-ai-141500831.html",
    "text": "Alphabet’s GOOGL is leaving no stone unturned to bolster its product offerings on the back of its growing generative AI capabilities.In this regard, the company recently added generative AI features, namely “Tab Organizer” and a theme maker, to Chrome 121.Notably, the Tab Organizer feature automatically creates tab groups based on open tabs by tapping the downward-facing icon in the top-left corner on Windows or right in macOS.Further, the feature provides a Tab Group suggestion with a name and emoji, which users must manually accept and can be rated up or down.Additionally, Chrome now allows users to create custom themes for the New Tab Page using a generative AI text-to-image diffusion model, offering six suggested options and recent creations.These new generative AI feature additions are expected to boost traffic on the Chrome browser. This, in turn, is expected to bolster the Google Services segment, which has been the key growth catalyst for Alphabet. Apart from the latest generative AI additions to Chrome, Google's Art Selfie 2 uses generative AI to match users' faces with existing artworks, allowing them to find doppelgangers.Further, Art Selfie 2 uses generative AI to create a stylized image of users’ faces, blending your selfie into a chosen scenario, allowing hair, head coverings, jewelry and clothing to be replaced.Alphabet also introduced an AI support assistant, which allows users to expand and ask questions, with the option to leave a thumb-up or down, view answer sources and suggest follow-up questions, enhancing its generative AI capabilities for virtual assistance.The company is also set to introduce a generative AI-powered “Help me write” feature to Chrome for Desktop use. This new AI feature can adjust its writing style, including \"Shorten\" or \"Elaborate\" options, as well as \"Casual\" or \"Formal\" options, with fewer options than Docs or Messages.The company’s growing endeavors to infuse generative AI capabilities into its product offerings will result in an enhanced user experience, allowing Alphabet to capitalize on the growth opportunities in the generative AI market space.Per an Allied Market Research report, the global generative AI market is expected to reach $191.8 billion by 2032, witnessing a CAGR of 34.1% between 2023 and 2032.Solidifying prospects in the promising gen AI market is expected to benefit Alphabet’s overall financial performance in the near term. The latest move is likely to aid Alphabet in strengthening its competitive position against peers like Microsoft MSFT, Amazon AMZN and Meta Platforms META, which are also making continuous efforts to capitalize on the growth opportunities present in the booming generative AI market.Notably, Microsoft’s OpenAI introduced the GPT Store to create a marketplace for specialized chatbot agents based on their language models, particularly ChatGPT, allowing users to create unique agents for various purposes like salary negotiation and recipe development.Further, Microsoft plans to offer users the ability to customize Copilot, a generative AI assistant, with customized versions called Copilot GPTs. These GPTs will be tailored for specific purposes like fitness, travel, or business.Meanwhile, Amazon announced generative AI capabilities for its virtual assistant Alexa, optimizing voice interactions, real-time information, smart home control and entertainment.Amazon also unveiled Titan Image Generator, a generative AI model that can create new or customize existing images, currently available in preview on Bedrock's AI development platform. This image generator tool uses English natural language prompts to create realistic images for advertising, e-commerce and media.Meta, on the other hand, unveiled Meta AI, an advanced conversational assistant for WhatsApp, Messenger, Instagram, Ray-Ban Meta smart glasses and Quest 3, providing real-time information and photorealistic images.Meta AI uses Meta’s state-of-the-art foundational language model, Llama 2, for text-based chats, accessing real-time information through Bing's search partnership and offering image generation tools. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Meta Platforms, Inc. (META) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}