{
    "title": "Top Google (Alphabet) Shareholders",
    "date": "1/9/2024",
    "url": "https://www.investopedia.com/articles/markets/011516/top-5-google-shareholders-goog.asp",
    "text": " Alphabet Inc. (GOOG, and GOOGL) is a holding company and parent of Google. The company provides software and Internet-related services including web browsing and search, cloud computing, streaming entertainment, and mobile operating systems, among others. The parent also is involved on a broad array of businesses, including cloud computing, software and hardware, advertising services, and mobile and desktop applications. The company, originally called Google, was founded by Larry Page and Sergey Brin in 1998. Now, more than two decades later, it has grown into one of the most-visited websites globally. This growth has transformed Alphabet into one of the largest companies in the world, with a market capitalization of nearly $1.75 trillion. The company has trailing 12 month (TTM) net income of $59.97 billion and TTM revenue of $280.88 billion. All of these figures are as of Jan. 9, 2024. Alphabet has three classes of shares. The ticker GOOGL represents the company's class A shares and are traded as common stock, with a one-share-one-vote structure. GOOG represents Alphabet's class C shares, which have no voting rights. The company also has class B shares, which are held by the founders and other insiders and which have 10 votes per share. Alphabet's class B shares are not publicly traded. The top individual insider shareholders of Google are Larry Page, Sergey Brin, and Sundar Pichai, and the top institutional shareholders are Vanguard Group Inc. and BlackRock Inc. (BLK). \"Insider\" refers to people in senior management positions and members of the board of directors, as well as people or entities that own more than 10% of the company's stock. In this context, it has nothing to do with insider trading. The shares owned by individual insider shareholders are those that are held through direct ownership. Shares mentioned in this section do not include shares held indirectly nor shares accessible through stock options. Company insiders must file an SEC Form 4 every time they buy or sell an amount of the company's stock that is deemed to be material. For Larry Page and Sergey Brin below, the share numbers listed are actually class B shares, which are counted and valued based on if they were converted to class C shares. Because class B shares don't trade, they have no \"market value.\" Larry Page owns a total of 389.05 million Alphabet Class B shares, representing about 44% of the shares outstanding. Page is the co-founder of Google and a board member of Alphabet. He was Google's CEO from the company's founding until 2001 and again from 2011-2015. He was Alphabet's CEO from 2015 until late 2019, when he stepped down. Page is the eighth-wealthiest person in the U.S. with a net worth of approximately $116 billion. Sergey Brin owns a total of 368.71 million Alphabet B shares, representing nearly 42% of the shares outstanding. Brin is a co-founder of Google, a controlling shareholder of Alphabet, and a member of the Alphabet board. He served as president of Alphabet until December 2019. Brin is the ninth-wealthiest person in the U.S. with a net worth of roughly $112 billion. Sundar Pichai holds 227,560 Alphabet Class A shares, representing less than 0.01% of the shares outstanding. Pichai is CEO of Google and Alphabet and a member of Alphabet's board of directors. He joined Google in 2004 as vice president of product management and was instrumental in the development of Google Toolbar, and led the unit that oversees Google Chrome. He became leader in 2014 of the Android operating system, which dramatically increased Google's global market presence. Pichai became CEO of Google in 2015 and CEO of Alphabet in December 2019. Institutional investors hold about 35.08% of Alphabet's total class A shares outstanding and about 27.13% of the company's total class C shares outstanding. Institutional investors -- institutional investment managers with at least $100 million in assets under management (AUM) -- must file an SEC Form 13F every quarter to disclose their equity holdings. Individual investors may be considered institutional investors if they acquire 5% or more of a company's shares, thus requiring them to file either a Schedule 13D or Schedule 13G form. Vanguard Group is one of the world's largest investment management companies with about 421 low-cost traditional funds and exchange-traded funds (ETFs). Vanguard is primarily a mutual fund and ETF management company and has about $7.6 trillion in global assets under management (AUM). Vanguard holds 487.44 million class A shares representing about 3.69% of total class A shares outstanding, and 410.03 million class C shares representing about 3.10% of total class C shares outstanding, according to its 13F filing for the period ended September 30, 2023. In total, Vanguard holds more than 897 million Alphabet shares. The Vanguard Communication Services ETF (VOX), with $3.5 billion under management, is one of many Vanguard funds holding Alphabet shares. GOOGL shares make up 12.25% of the fund's portfolio and GOOG shares comprise 9.84%, the second- and third-largest holdings, respectively. BlackRock Inc. (BLK), one of the world's biggest asset managers, sells the popular line of iShares ETF products. The company is primarily a mutual fund and ETF management company with approximately $9.09 trillion in AUM as of March 2023. BlackRock holds 410.94 million class A shares representing about 3.11% of total class A shares outstanding, and 353.03 million class C shares representing about 2.7% of total class C shares outstanding, according to its 13F filing for the period ended September 30, 2023. In total, BlackRock holds 763 million Alphabet shares. The iShares Core S&P 500 ETF (IVV) is among one of BlackRock's largest ETFs with approximately $402.8 billion in AUM. GOOGL shares make up 2.05% of the fund's portfolio and GOOG shares represent 1.75%, both among the fund's top 10 holdings. T. Rowe Price Associates owns 14.0 million class C shares of Alphabet, representing 4.4% of total class C shares outstanding, according to the company's 13F filing for the period ending June 30, 2021. T. Rowe Price Associates is a subsidiary of T. Rowe Price Group Inc. (TROW), which is a global investment management firm with about $1.6 trillion in AUM. The firm offers a variety of mutual funds, ETFs and related products. One of the company's largest ETFs, the T. Rowe Price Blue Chip Growth ETF (TCHP), has $225.3 million in AUM. GOOG is the second-largest position in the fund's portfolio, representing about 9.0% of invested assets. FMR LLC owns 13.1 million class A shares of Alphabet, representing 4.4% of total class A shares outstanding, according to the company's 13F filing for the period ending June 30, 2021. FMR is one of the nation's largest financial services companies and offers investment management, retirement options, brokerage, financial planning, and wealth management services. The company owns Fidelity Investments, which has total discretionary AUM of approximately $4.2 trillion. The company manages a range of ETFs and mutual funds. The Fidelity Growth Company Fund (FDGRX), which has approximately $64.5 billion in net assets, is one of the company's mutual funds that holds shares of GOOGL. GOOGL shares are a both in the top 10 holding in the fund's portfolio. U.S. Securities and Exchange Commission. \"Alphabet Inc., Form 10-K, For the Fiscal Year Ended December 31, 2022.\" Pages 4-6. Alphabet Investor Relations. \"Founders' IPO Letter.\" SimilarWeb. \"Top Websites: Worldwide, Ranking.\" TradingView. \"Alphabet Inc (Google) Class A: Overview.\" U.S. Securities and Exchange Commission. \"Alphabet, Inc., Schedule 14A, April 21, 2023.\" Page 16. Alphabet Investor Relations. \"FAQs and General Information.\" Select \"What’s the difference between Class A and Class C shares?\" U.S. Securities and Exchange Commission. \"Alphabet, Inc., Schedule 14A, April 21, 2023.\" Page 39. U.S. Securities and Exchange Commission. \"Updated Investor Bulletin: Insider Transactions and Forms 3, 4, and 5.\" Alphabet Investor Relations. \"Alphabet Management Change.\" Forbes. \"Real-Time Billionaires: Larry Page.\" Forbes. \"Real-Time Billionaires: Sergey Brin.\" MarketBeat. \"Alphabet (GOOGL) Institutional Ownership.\" MarketBeat. \"Alphabet (GOOG) Institutional Ownership.\" U.S. Securities and Exchange Commission. \"Frequently Asked Questions About Form 13F.\" U.S. Securities and Exchange Commission. \"Schedules 13D and 13G.\" Vanguard. \"Investor Outcomes.\" Adv Ratings. \"World's Top Asset Management Firms.\" Vanguard. \"Fast Facts About Vanguard.\" Whale Wisdom. \"Alphabet Inc. Class A (GOOGL).\" Whale Wisdom. \"Alphabet Inc. Class C (GOOG).\" Vanguard. \"Vanguard Communication Services ETF, VOX.\" BlackRock. \"Investment Funds.\" BlackRock. \"About BlackRock.\" iShares by BlackRock. \"iShares Core S&P 500 ETF, IVV.\" T. Rowe Price. \"About.\" T. Rowe Price. \"T. Rowe Price ETFs.\" T. Rowe Price. \"Products.\" ETFdb.com. \"T. Rowe Price Blue Chip Growth ETF.\" Fidelity. \"FIDELITY BY THE NUMBERS: ASSET MANAGEMENT.\" Fidelity. \"Fidelity Growth Company Fund.\" "
}