{
    "title": "Alphabet Inc.’s Q4 Earnings & Google Ads Fall Short",
    "date": "1/31/2024",
    "url": "https://retailwire.com/alphabet-inc-s-q4-earnings-google-ads-fall-short/",
    "text": "Logout Photo by Greg Bulla on Unsplash January 31, 2024 Dennis Limmer Google’s parent company, Alphabet Inc., recently disclosed its fourth-quarter results, drawing particular attention to the unmet ad revenue target, the mainstay of the business. This disappointing news pushed the stock down by over 5% in early trading on Wednesday. Alphabet reported total revenue of $72 billion, excluding traffic acquisition costs for the third quarter, compared to an anticipated $71 billion. This figure surpassed last year’s results of $63.12 billion for the same period, but the shortfall in ad earnings seemed to overshadow this gain. Despite the drawback in ad revenue, Alphabet demonstrated robust growth in other areas, namely its cloud business. The Google Cloud division exceeded predictions by posting revenue figures of over $9 billion, marking a significant 26% surge compared to last year. This growth is critical, considering the emerging importance of cloud services in artificial intelligence (AI) development. Currently, Google is ranked third, behind Amazon and Microsoft, in the global market for cloud computing. Nonetheless, it has been aggressively implementing strategies to boost its market share. A comparative breakdown of Alphabet’s key metrics versus Wall Street expectations for the fourth quarter reveals: Alphabet’s CEO Sundar Pichai and CFO Ruth Porat emphasized the necessity of refining business operations to enhance cost-effectiveness and efficiency. They’ve discontinued non-priority projects and removed some organizational layers, which unfortunately led to a slower hiring rate. However, the duo maintained that Alphabet would continue hiring high-caliber talent. This earnings disclosure follows shortly after Google announced layoffs across multiple divisions as part of its cost-cutting measures. This strategy, aimed at focusing more on growth areas like AI, mimics several other corporations’ responses to the expansive growth experienced in the COVID-19 era. In addressing concerns that AI advancements might disrupt Google’s search products since AI chatbots alter web interactions, Pichai stressed AI’s role in broadening Google’s services. The tech giant is also vigorously working to integrate AI into its search tools and develop advanced large language models like Gemini in a bid to rival Microsoft’s early inroads in consumer AI chatbots. Recent News In a bid to beat rival platforms like Instagram and TikTok, YouTube has revealed that numerous creators are now monetizing their short videos on the platform and earning a sizable paycheck. Read More A Creator on YouTube Earns $20,000 a Month to Make 1-Minute VideosContinue As the battle to bring the most cost-effective electric vehicles to the market heats up, the Chinese smartphone company Xiaomi announced that its first electric car will go on sale for significantly less than Tesla’s Model 3. Read More Xiaomi Unveils EV $4K Cheaper Than Tesla’s Model 3Continue SpaceX CEO Elon Musk has proposed an ambitious plan to make travel to Mars affordable for the masses. Musk envisions a ticket price of $100,000, believing it could be achievable for most individuals through hard work and saving. Read More SpaceX’s ‘Affordable’ Journey to MarsContinue Kroger, the grocery chain, has announced the closure of three spoke facilities in its e-commerce operations in Texas and Florida. This decision marks a strategic shift for the company in its efforts to streamline operations and enhance efficiency. Read More Kroger Shuts Down E-Commerce Spoke Facilities in Texas and FloridaContinue Retail industry’s premier source for news, analysis, and discussion. © 2023 RetailWire · Privacy Policy · Community Guidelines · Sitemap Username or Email Address Password Remember Me  Lost your password? Don't have an account yet? Sign up "
}