{
    "title": "Alphabet's Gemini AI rollout reveals the battle lines of the coming chatbot \nwars",
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/news/alphabet-gemini-ai-rollout-reveals-221412589.html",
    "text": "Andrew “Boz” Bosworth, Meta’s chief technology officer, once said that “the best product doesn’t always win. The one everyone uses does.” It might seem strange to start a story about Alphabet with a quote from a Meta exec, but I couldn’t help thinking about Boz’s line while hearing Google execs preview their plans for today’s big public rollout of the company’s Gemini AI services. These allow people to interact with a chatbot powered by its Gemini models, as well as use generative AI features powered by the models in Google Docs, Gmail, and other Google Workspace products. Google likes to tout the most capable version of Gemini, which it calls Gemini Ultra 1.0, as the world’s most powerful AI model. It's true that Gemini is compatible with many different kinds of media: It can work with images, video, audio, and text better, and do so better than any other model. And according to self-reported results on more than two dozen benchmark tests, Gemini Ultra is marginally superior to OpenAI’s GPT-4 across a lot of language and reasoning tasks. Chirag Dekate, vice president and analyst at tech analytics firm Gartner, says that a lot of people mistakenly see Gemini as Google still trying to play catch-up with OpenAI and Microsoft, which had a head start with ChatGPT and GPT-4 powered Microsoft products such as Bing Chat and its Copilot tools in Word and PowerPoint. What people are missing, Dekate says, is that with Gemini’s multimodal capabilities, Google has leapfrogged the competition. And that Google has some advantages that its competitors will find hard to match. One is YouTube, whose vast video archive is a ready source of video training data that few other companies have and that Microsoft and OpenAI certainly can’t match. Another, according to Dekate, is Google is finally showing that its in-house AI “model generation” factory—powered by the merger of its two AI research labs DeepMind and Google Brain and the tying of the new combined Google DeepMind closer to product development teams—can churn out powerful new AI models fast, which may mean it will now be able to stay ahead, or at least not fall behind again. But what was clear from Google’s Gemini launch is that they are not counting on performance alone to win the AI chatbot wars. This is going to be a battle fought largely over three factors that have little to do with the AI models themselves: distribution, pricing, and business model. Google knows where it has a strategic advantage over its rivals at Microsoft and OpenAI, and leaned heavily on them in the Gemini rollout. Among its biggest advantages is Android. Google has entrée to 3.6 billion Android users globally. And it’s planning to make it super convenient for them to use Gemini as their preferred chatbot and AI assistant. Starting today, users in the U.S. will be able to make Gemini their go-to voice-based digital assistant on their phones, replacing the old Google Assistant. (They can also use it through an app if they prefer; iOS users must access it less conveniently through the Google app.) It will be rolling out this capability in select parts of Asia, supporting English, Korean, and Japanese soon. This is a distribution channel that Microsoft can’t match, so Google is wise to focus on it. The fact that iOS users cannot easily make Gemini their preferred voice assistant also shows how Apple’s “walled garden” approach to iOS continues to serve as a moat. In this case, it has bought Apple time to play catch-up and ditch the current version of Siri for an LLM-powered chatbot of Apple’s own making that can match GPT-4 and Gemini. Apple is, according to reporting from Bloomberg, working its own “Apple GPT” models that are designed to rival OpenAI’s and Google’s generative AI offerings. Google is also hoping that people who want to access Gemini Ultra will be willing to pay $20 a month for it as part of a Google One subscription that will also let users use Gemini-powered features in Google Workspace products, such as Google Docs and Sheets. This is pricey, but it is the same amount OpenAI charges for ChatGPT Plus subscribers, without the integration into office productivity tools, and $10 less than Microsoft charges users who want to access GPT-4 powered generative AI in Microsoft 365 products. Plus, Google One subscribers will get 2 TB of storage. Google is hoping this bundling of Gemini with other products will tip consumers toward subscribing to its AI services instead of OpenAI’s or Microsoft’s. A lot of enterprise customers of Workspace or Microsoft 365 will probably pay to access the generative AI features. But it’s unclear how many consumers are willing to pay this kind of money. They certainly won’t subscribe to more than one such AI chatbot. And there is also the question of whether they will want to use a different AI chatbot on their personal devices than the brand they use at work. A lot of people may want to use the same AI model they are accustomed to for both work and personal tasks. Fresh off quarterly earnings in which Alphabet showed its subscription businesses are finally starting to show some real growth, the company is eager to double down on the business model. This is in part to quiet investor concerns that generative AI ultimately kills Google’s largely ad-driven search business. Subscriptions make a lot of sense for AI services. People want to know when they ask their AI chatbot which new running shoes they should buy, the responses are based on what the bot knows about their personal preferences, weekly mileage, and weak knees—not what Nike paid to have its shoes mentioned first by the chatbot. The best way to align the interest of the companies building the bots and consumers is with a subscription model. But the irony here may be that Big Tech is falling in love with AI subscriptions, just as the streaming companies are falling out of love with their subscriptions because they’ve hit the limits of consumer wallets. This may foretell a brutal reckoning down the road for the premium chatbot services, too. Streaming was a business where product differentiation mattered. That’s why Netflix and Amazon and Apple and Disney spent billions on exclusive content. And that differentiation resulted in consumers feeling torn—they wanted to watch both The Queen’s Gambit and Ted Lasso. So, for a time, people were willing to pay for both Netflix and Apple TV. But here the tech companies are spending billions essentially to ensure there’s almost no product differentiation. Dekate’s comments about Gemini’s multimodal capabilities aside, the top AI chatbots all offer fairly similar capabilities. So the winner here is going to come down to distribution and price. And while Google’s opening moves in that regard look solid, they are a bit conservative. Google’s biggest weakness is its innovator’s dilemma. It has a huge ad business to defend, and most of the moves it makes with AI chatbots and personal assistants potentially cannibalize it. On the other hand, it has a huge ad business that could subsidize a cut-price AI offering. If I were Sundar Pichai, CEO of Google parent Alphabet, I’d be thinking hard about dropping Gemini’s $20 per month price tag and coming in even lower, at $15 per month or even less. As Dekate points out, another advantage Google has is that it runs all of its AI applications on its own bespoke hardware, TPUs. That means it can potentially control its computing costs better than Microsoft, which is primarily reliant on Nvidia’s expensive and energy-hungry chips to run its AI services, or OpenAI, which runs its services on Microsoft’s cloud too. That, in turn, should allow Alphabet to run its AI offerings with higher operating margins. One thing is clear: The AI chatbot wars are just getting started. This story was originally featured on Fortune.com Related Quotes "
}