{
    "title": "Alphabet CEO Sundar Pichai confirms subscription model for Google's \nNext-Gen AI, Bard Advance | Mint",
    "date": "2/1/2024",
    "url": "https://www.livemint.com/technology/alphabet-ceo-sundar-pichai-confirms-subscription-model-for-googles-next-gen-ai-bard-advance-11706772862782.html",
    "text": "In a significant move that could reshape the landscape of conversational AI, Alphabet, Google's parent company, has officially confirmed the introduction of subscription plans for its upcoming advanced chatbot, Bard Advance. The announcement was made during the fourth-quarter earnings call, where Alphabet CEO Sundar Pichai shed light on the company's strategy to capitalize on the growing demand for premium AI services, reported Android Authority. The decision to implement a subscription model for Bard Advance stems from Google's desire to leverage the immense capabilities of its latest AI model, Gemini Ultra. The enhanced AI tool is set to be powered by the groundbreaking Gemini Ultra architecture, a component of Google's multimodal AI system Gemini, which made its debut in December last year. According to the report from the publication, Bard Advance, currently available for free, is expected to offer users a more sophisticated and versatile experience. With Gemini Ultra at its core, the advanced AI tool is geared to perform complex tasks across various modalities, including text, images, audio, video, and code. Pichai highlighted the expanded capabilities of Bard, stating, \"It's (Bard) now powered by Gemini Pro, and it's much more capable at things like understanding, summarizing, reasoning, coding, and planning.\" While Google has not disclosed specific pricing details for the subscription to Bard Advance, industry observers speculate that it could follow a model similar to ChatGPT Plus. This suggests that users might be looking at a subscription fee ranging between $10 and $20 per month. The move to introduce a subscription plan for Bard Advance appears as Google's intent to monetize its advanced AI capabilities. As the company reportedly aims to generate additional revenue through premium subscriptions, users can anticipate a more sophisticated and feature-rich conversational AI experience, unlocking new possibilities in tasks ranging from understanding and summarizing to coding and planning. As per a report from Android Authority, this strategic shift aligns with Google's broader vision for the future of AI services. Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}