{
    "title": "Zacks Investment Ideas feature highlights: Apple, Deckers Outdoor and \nAlphabet",
    "date": "2/14/2024",
    "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-110000743.html",
    "text": "Chicago, IL – February 14, 2024 – Today, Zacks Investment Ideas feature highlights Apple AAPL, Deckers Outdoor DECK and Alphabet GOOGL. We continue to navigate through earnings season, seeing plenty of quarterly prints delivered daily. The period has been primarily positive so far, underpinned by a notably strong performance from several of the Mag 7 members and the technology sector overall. So far, we’ve gotten plenty of positive results, with several companies, including Apple, Deckers Outdoor and Alphabet posting quarterly records across different metrics. What was there to like in each respective release? Let’s take a closer look. Deckers Outdoor Deckers Outdoor, a current Zacks Rank #1 (Buy), is a leading designer, producer, and brand manager of innovative, niche footwear and accessories developed for outdoor sports and other lifestyle-related activities. Concerning headline figures, DECK posted a 32% beat relative to the Zacks Consensus EPS estimate and reported sales 8.5% ahead of expectations, reflecting growth rates of 44% and 16%, respectively. Impressively, EPS of $15.11 and revenue of $1.6 million reflected quarterly records, driven by strength across its brands. Notably, the company’s UGG and HOKA brands were standout performers, with sales of each growing 15% and 22% from the year-ago period, respectively. Deckers provided bright guidance following the release, now expecting net sales of $4.15 billion and a gross margin of 54.5%. Analysts took their earnings expectations higher following the release, with the $26.59 Zacks Consensus EPS estimate for its current fiscal year suggesting 37% year-over-year growth. Apple Apple posted quarterly revenue of $119.6 billion and record EPS of $2.18, reflecting growth rates of 2% and 16%, respectively. EPS wasn’t the only quarterly record, as Services revenue of $23.1 billion reached its highest mark yet and grew 11% year-over-year. While Services results were primarily positive, it’s worth noting that the reported figure modestly fell short of the Zacks Consensus estimate. iPhone revenue positively surprised, reported at $69.7 billion and improving 6% from the year-ago period. Apple shares faced adverse price action following the release, particularly stemming from demand worries in China. Revenues in China totaled $20.8 billion, moving 13% lower year-over-year. Apple shares have slightly underperformed relative to the S&P 500 over the last year, adding 22% in value vs. a 24.4% gain. While the performance hasn’t been as robust as that of other members of the Mag 7, shares have been a safe haven for investors seeking business stability in a somewhat cloudy economic environment, particularly thanks to Apple’s cash-generating abilities. Alphabet Alphabet posted a 2.5% beat relative to the Zacks Consensus EPS estimate, reflecting the fourth consecutive period of exceeding bottom line expectations. Quarterly revenue totaled a mighty $86.3 billion, reflecting a quarterly record and growing 13% year-over-year. There were several notable highlights from the release, including YouTube ad revenue growing 15% year-over-year and Google Cloud operating income of $864 million well above the loss of -$186 million in the year-ago period. GOOGL shares aren’t overly stretched regarding valuation, with the current 21.8X forward earnings multiple (F1) beneath the five-year median and comparing favorably to the Zacks Technology sector average of 27.4X. The company’s earnings are forecasted to climb 16% in its current year (FY24) on 12% higher sales. Earnings season continues chugging along, delivering us surprises daily. We’ve gotten through a fair amount of results so far, with over two-thirds of S&P 500 members already posting quarterly results. Concerning positivity, all three companies above broke quarterly records. Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Deckers Outdoor Corporation (DECK) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}