{
    "title": "Google releases 'open' AI models after Meta -February 21, 2024 at 08:00 am \nEST",
    "date": "2/21/2024",
    "url": "https://www.marketscreener.com/quote/stock/ALPHABET-INC-24203373/news/Google-releases-open-AI-models-after-Meta-45997166/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) SAN FRANCISCO, Feb 21 (Reuters) - Google on Wednesday\nreleased new artificial intelligence (AI) models that outside\ndevelopers potentially can fashion as their own, following a\nsimilar move by Meta Platforms and others. The Alphabet subsidiary said individuals and\nbusinesses can build AI software based on its new family of\n\"open models\" called Gemma, for free. The company is making key\ntechnical data such as what are called model weights publicly\navailable, it said. The move may attract software engineers to build on Google's\ntechnology and encourage usage of its newly profitable cloud\ndivision. The models are \"optimized\" for Google Cloud, where\nfirst-time cloud customers using them get $300 in credits, the\ncompany said. Google stopped short of making Gemma fully \"open source,\"\nmeaning the company still may have a hand in setting terms of\nuse and ownership. Some experts have said open-source AI was\nripe for abuse, while others have championed the approach for\nwidening the set of people who can contribute to and benefit\nfrom the technology. With the announcement, Google did not make its bigger,\npremier models known as Gemini open, unlike Gemma. It said the\nGemma models are sized at two billion or seven billion\nparameters - or the number of different values that an algorithm\ntakes into account to generate output. Meta's Llama 2 models range from seven to 70 billion\nparameters in size. Google has not disclosed the size of its\nlargest Gemini models. For comparison, OpenAI's GPT-3 model\nannounced in 2020 had 175 billion parameters. Chipmaker Nvidia on Wednesday said it has worked\nwith Google to ensure Gemma models run smoothly on its chips.\nNvidia also said it will soon make chatbot software, which it is\ndeveloping to run AI models on Windows PCs, work with Gemma.\n(Reporting By Jeffrey Dastin and Stephen Nellis; Additional\nreporting by Krystal Hu, Katie Paul and Max Cherney; Editing by\nChristopher Cushing)  0 selected Alphabet a 'Clear' Beneficiary of Generative AI, Wedbush Says March 22, 2024 at 11:54 am EDT Alphabet is in a league of its own Partnerships or mergers in disguise? Regulators examine the link between Microsoft and OpenAI  Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}