{
    "title": null,
    "date": "2/2/2024",
    "url": "https://seekingalpha.com/article/4667075-google-i-see-a-great-yet-unpopular-business",
    "text": "JHVEPhoto  JHVEPhoto Alphabet Inc. aka Google (NASDAQ:GOOG, NASDAQ:GOOGL) continues to be a highly profitable and growth-oriented enterprise, with the most recent Q4 earnings report rounding off a solid 2023 for the firm. While growth has slowed compared to pre-pandemic years, Alphabet's businesses remain relevant within its their various segments despite rising competitive pressures from the likes of Apple (AAPL), Microsoft (MSFT) and Amazon (AMZN). Current valuations appear to have not yet priced-in 2024 growth with shares undervalued by 30% in my base-case calculations. Therefore, I rate Alphabet a tentative Buy at present time. Alphabet Inc. is a technology conglomerate that owns Google and several other companies that operate in various domains, such as internet search, artificial intelligence, biotechnology, cloud computing, cybersecurity, and more. Alphabet’s businesses is Google, who run the world’s most popular search engine and also offers products and services such as Gmail, Android, Google Cloud and more. Alphabet also has a massive collection of other businesses under their umbrella. More recent additions include Fitbit, Mandiant cyber security, Waymo autonomous driving taxis and even Verily, a life sciences and healthcare company. Alphabet has a mega economic moat that is driven both by the diversity and by the interconnectedness of their different business units along with what I see as some irreplicable intangible assets. Alphabet’s core business, Google Services, benefit from a positive feedback loop of more users generating more data which attracts more advertisers thus generates more revenue. This powerful scale and network effect has allowed Google Search and YouTube to emerge as absolutely critical elements of the internet experience for most users. These network and scale effects creates a high barrier to entry for competitors and a loyal user base for Alphabet. While Microsoft’s Bing has taken the fight to Google Search over the last twelve months, Google has begun rapidly integrating their own AI and machine learning into the Search business which should even the playing field substantially. Google Search as a business also enjoys a market leading position within the industry which the term to \"google something\" having become known across the world. This strong brand identity and integration into daily lingo should not be overlooked and illustrates just how powerful of a position Google has built for their flagship search product. Google offers a variety of other online services that complement its core search and advertising businesses, such as Gmail, Google Maps, Google Photos, Drive and Chrome. These services enhance the user experience and loyalty, create cross-selling and bundling opportunities, and generate additional revenue streams for Alphabet. Moreover, these services collect valuable user data that feed into Google’s artificial intelligence and machine learning capabilities, which improve the quality and relevance of its products and services. I also view the Android operating system as generating real moatiness to Alphabet’s business as a whole. Android is the world’s most popular mobile operating system, with a market share of over 70%. The operating system gives Alphabet a strategic advantage in the mobile space, as it allows the company to distribute its apps and services to billions of users and devices, and to monetize them through advertising and in-app purchases. Android also enables Alphabet to foster an open and diverse ecosystem of developers, manufacturers, and partners, who create and offer a wide range of applications, content, and hardware for Android users. Furthermore, Android helps Alphabet to counter the data superiority threat from Apple, which has its own proprietary operating system, iOS. The Google Cloud business segment also generates significant moatiness thanks to its scale, innovation, and integration with other Google Services. Google Cloud is a platform that offers cloud computing services, such as infrastructure (IaaS), platform (PaaS), data analytics, artificial intelligence, and software (SaaS) solutions. The platform competes with other major cloud providers, such as Amazon Web Services and Microsoft Azure, in what has rapidly become a massively profitable and competitive market. I once again see Google Cloud benefitting from the large and loyal user base of Google Services, which provides it with data, feedback, and cross-selling opportunities. Google Cloud also leverages its expertise and leadership in artificial intelligence and machine learning. The integration of AI and machine learning into Google Cloud will be a critical step for the firm to compete directly with Microsoft Azure and drive cloud adoption and differentiation within the business. If the firm lags behind in the capabilities of their IaaS, PaaS and SaaS solutions, there is a real risk of the entire Google Cloud business segment struggling to grow further in the future. Finally, Other Bets are a collection of Alphabet’s moonshot projects and ventures that operate in various domains, such as self-driving technology, life sciences, internet access, and cybersecurity. Some of the most prominent Other Bets are Waymo, Verily and Calico. Other Bets’ economic moat comes from their innovation, vision, and potential. All of the Other Bets businesses benefit directly from Alphabet’s financial and technical resources, which enable them to experiment and scale. Other Bets also have the potential to generate significant value and returns for Alphabet, if they succeed in their missions and monetize their products and services. However, the key word here is if they succeed. Considering the inherent risk associated start-up businesses, I can award no real moatiness to Alphabet from Other Bets as a segment. Overall, Google has a massive and robust economic moat that is incredibly difficult to replicate. The unique network effects generated by Google Services, Cloud and Other Bets working together creates for a powerful set of intangible assets and data which generates real competitive advantages for the firm. Alphabet has 5Y (FY23-FY19) average ROA, ROE and ROIC of 16.75%, 23.31% and 20.53% respectively. These returns are relatively positive in my opinion with the firm outpacing inflation handily with their returns on both assets, equity and invested capital. When compared to chief industry rivals however, the Alphabet falls behind. Both Apple’s and Microsoft’s ROAs, ROEs and ROICs for the same period of 22.69%, 109.15% and 40.91%, and 18.30%, 43.09% and 28.09% respectively beat Alphabet’s metrics by between 3-9pp. Quite simply, Alphabet is less effective at generating returns on their invested capital relative to these two competing enterprises. This primarily stems from Alphabet’s greater investment into R&D as a percentage of revenues relative to its competitors mainly due to their Other Bets segment. Nevertheless, the firm’s WACC is currently around 10.81% which illustrates that Alphabet easily generates higher returns on their investment than it costs the company to raise the capital needed for said investment. Alphabet also has 5Y average (as measured from FY23-FY19) gross, operating and net margins of 55.58%, 25.34% and 23.41% respectively. These solid margins are mostly in line with those of Apple and Microsoft and illustrate just how profitable Alphabet’s core operations. GOOG FY23 Q4 Press Release GOOG FY23 Q4 Press Release Alphabet delivered a strong 2023 performance, with revenue and profit growth across its segments, especially in Google Cloud and Other Bets. However, the company also faced some headwinds in its ad business, as well as restructuring and real estate costs. Total revenue for 2023 was $307 billion, up 9% year-over-year, driven by strong growth in Google Search, YouTube, Google Cloud, and Other Bets. GOOG FY23 Q4 10K GOOG FY23 Q4 10K Google Services had the largest YoY revenue growth posting an increase of 13% to over $272.6B. Search and YouTube ads also grew at a solid pace achieving just over 10.1 % growth YoY. Within the services segment Google ad revenue for 2023 was $237.9 billion, up 11% year over year, reflecting the recovery of the online advertising market and the resilience of the business even amidst a tricky macro environment. Google Cloud revenue for 2023 was $33.1 billion, up 46% year over year, reflecting the increased demand for cloud services and solutions amid the digital transformation trend. While the Search growth rate has slowed compared to previous years, most likely as a result of Bing becoming enhanced with AI, Google is still undoubtedly the search leader. GOOG FY23 Q4 10K GOOG FY23 Q4 10K Alphabet’s operating income for 2023 was $95.9 billion, up 30% year-over-year, and its operating margin improved from 22% to 25%. This was primarily thanks to an improvement in the revenue mix thanks to Google Cloud generating positive operating incomes of $1.7B compared to negative $1.9B at the end of FY22. Alphabet’s net income for 2023 was $73.8 billion, or $5.80 per diluted share up 23% YoY thanks to solid topline revenue growth and significant cost controls by eliminating a large portion of unnecessary workforce. This left Alphabet facing around $2B in one-off charges related to contract terminations along with another $1.8B due for early lease exists on some of their office buildings. While these costs are regrettable, I view Alphabet’s decision to right size the business headcount and office space in the name of efficiency to be a very good strategy and one which could widen margins in years to come. Seeking Alpha | GOOG | Profitability Seeking Alpha | GOOG | Profitability Seeking Alpha’s Quant calculates an “A+” profitability rating for Alphabet which I believe to be an accurate relative evaluation of the firm’s current fiscal situation given their solid FY23 performance. By analyzing Alphabet’s balance sheet, we can see the firm has $171B in total current assets while total current liabilities amount to just $81.8B. This massive short-term liquidity leaves Alphabet with an excellent quick ratio of 1.94x and a superb current ratio of 2.10x. Total assets for Alphabet amount to $402B with total liabilities being $119B. Alphabet also has $284B in total common equity. This leaves the firm with an excellent debt equity ratio of 0.10x. GOOG FY23 Q4 10K GOOG FY23 Q4 10K Alphabet’s long-term debt profile is excellent with the fixed-rate senior unsecured obligations having been negotiated at decent effective interest rates which allow the firm’s finances to remain well isolated from the higher interest rate environment. GOOG FY23 Q4 10K GOOG FY23 Q4 10K Alphabet’s debt maturity profile is also very attractive with a majority of debentures maturing after 2028. While some maturities between 2024-2028 are quite large, the firm’s truly gigantic unlevered FCF in FY23 of $58.9B means the firm should face no troubles financing these obligations as they arise. Moody’s ratings agency affirmed an Aa2 credit rating for Alphabet’s senior unsecured domestic notes while assigning a P-1 rating for the firm’s short-term domestic commercial paper. The outlook remains stable. Moody’s classifies “Aa2” credit ratings as being of “high investment grade” while “P-1” is defined as being of the highest “Prime” quality. Seeking Alpha | GOOG | Valuation Seeking Alpha | GOOG | Valuation Seeking Alpha’s Quant assigns Alphabet with a “D” Valuation grade. I believe this letter grade may be an excessively pessimistic representation of the value present within the stock given their solid growth prospects. The firm currently trades at a P/E GAAP FWD ratio of 21.00x. This represents a massive 20% decrease in the firm’s GAAP P/E ratio compared to their running 5Y average and is significantly lower than that of Apple or Microsoft. Alphabet’s P/CF TTM of 17.12x is reasonable while their Price/Sales FWD of 5.09x is more in line with what I would expect given the slightly softer outlook for their growth prospects as Google has fallen slightly behind Microsoft in the AI race. Seeking Alpha | GOOG | 5Y Advanced Chart Seeking Alpha | GOOG | 5Y Advanced Chart From an absolute perspective, Alphabet shares are trading near all-time highs with current share prices of around $143 only just falling shy of the peak achieved a few days prior to the writing of this article. Nevertheless, Alphabet shares have essentially matched the 5Y performance of the Nasdaq 100-Index (NDX)-tracking Invesco QQQ Trust ETF (QQQ), which illustrates just how well the firm has rewarded shareholders with its stock price appreciation. Seeking Alpha | GOOG | 3M Advanced Chart Seeking Alpha | GOOG | 3M Advanced Chart Over the last 3 months, Alphabet stock has performed very well rallying up over 22% until the overnight correction after the firm reported earnings. I believe the sudden drop in share prices came as a result of markets correcting an over-bought condition and due to the more hawkish than expected tone coming from Jerome Powell at the recent FED meeting. The Value Corner The Value Corner By utilizing our specially formulated Intrinsic Valuation Calculation, we can understand what value exists in the company from a more objective perspective. Using the firm’s current share price of $143, an estimated 2024 EPS of $6.73, a realistic “r” value of 0.12 (12%) and the current Moody’s Seasoned AAA Corporate Bond Yield ratio of 4.74x, I derive a base-case IV of $203. This represents a significant 30% undervaluation in shares. Even when using a more pessimistic CAGR value for r of 0.07 (7%) to reflect a scenario where a globally spanning recession causes Alphabet to massively miss revenue growth estimates, shares are valued at around $140.60 suggesting a fair valuation in shares. Considering the valuation metrics, absolute valuation and intrinsic value calculation, I believe that Alphabet is currently trading somewhere between a fair valuation and a 30% undervaluation in shares. In the short term (3-12 months), almost anything could happen to share prices as markets tend to act more like voting machines rather than weighing scales over short-time periods. Nevertheless, I do see the hawkish tone coming from the FED along with the over-bought nature of many tech stocks potentially placing downward pressure on Alphabet stock for at least 2-4 months. In the long-term (2-10 years), I believe Alphabet will continue to see their Google businesses develop at rapid pace to catch-up to the AI head start Microsoft has achieved with ChatGPT, Bing and Copilot. Despite the fierce competition currently taking place across the Cloud and AI businesses, I do believe Google has all the right resources to compete and win against their rivals. Alphabet faces some acute threats arising particularly from high levels of competition across their business segments along with some acute ESG concerns. Alphabet’s Google products all face significant competition from the likes of Apple and Microsoft. Both rivals have their own service and product ecosystems that are pitted directly against Google’s own offerings. Recent successes by Microsoft’s Azure and Bing, Amazon’s AWS and even Apple’s dominance in the smartphone market illustrates just how much competition Google is facing with their core Cloud and Services products. Furthermore, while the Search business seemed bulletproof for a long time, Microsoft’s jump forwards with Bing seemed to have caught Google napping. While I do believe the firm can rejuvenate and strengthen this key business, Alphabet must ensure its businesses remain at the forefront of the innovation race. Reports Apple may be working on their own Search engine places more pressure on Google’s key revenue stream as the loss of native promotion of Apple devices would significantly hurt Alphabet’s bottom line. From an ESG perspective, Alphabet also faces real threats from governance issues surrounding their business ventures. Firstly, Alphabet possesses a truly incomprehensible amount of sensitive user data on their customers which must remain absolutely confidential. Any data breach could have massive reputational and fiscal consequences for the firm. Alphabet’s massive size has also placed the firm in hot waters with various antitrust cases and litigation being brought against the firm for alleged unfair business practices. The firm also faces a real governance risk from any future mergers or acquisitions as any further sideways expansion into new businesses may be viewed as excessively monopolistic. While these ESG concerns are real, I still believe Alphabet’s proactive approach to environment conservation and pledge for workplace equality is enough to make the firm a great ESG conscious pick. Of course, opinions may vary with regards to ESG material and I implore you to conduct your own ESG and sustainability research before investing in the company if these matters are of concern to you. Alphabet has had a tough couple of years leading up to 2023. Luckily for the firm, multiple executional wins and a perceived improvement in the firm’s own AI potential has manifested itself with a solid earnings performance in 2023. Nevertheless, the firm is still facing some of the largest competitive challenges and a tough macroeconomic environment heading into 2024 with a potential souring in investor sentiments occurring after the full year 2023 results. Valuations have not yet appeared to price in 2024 growth with shares seemingly undervalued by 30% assuming aced execution throughout the year. Of course, my bear-case scenario sees shares fairly valued should Alphabet growth fall around 30% short of expectations. Therefore, I rate Alphabet, Inc. stock a Buy at present time and believe the post-earnings slump has generated just enough margin of safety for a GARP oriented investors to begin building a position. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I do not provide or publish investment advice on Seeking Alpha. My articles are opinion pieces only and do not solicit any content or security. Opinions expressed in my articles are purely my own. My opinions may change at any time and without notice. Please conduct your own research and analysis before purchasing a security or making investment decisions. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}