{
    "title": null,
    "date": "2/16/2024",
    "url": "https://www.cabotwealth.com/daily/growth-stocks/amzn-stock-goog-stock-better-buy",
    "text": "Amazon (AMZN) and Alphabet (GOOG) are two of the world’s most recognizable brands and Wall Street’s most coveted stocks, and the long-term trajectory of each blue-chip stock is still decidedly up. Plus, it’s estimated that roughly 40% of all web traffic is hosted by those two companies combined. But which looks like the better buy today, AMZN stock or GOOG stock? Both stocks were beaten down by the growth stock sell-off of 2022. GOOG has suffered a little damage from all the selling, down 2% since the start of 2022 vs. AMZN’s 2% gain. Going back a bit further, to just after the March 2020 Covid crash, the performance of both stocks has been far more palatable, with GOOG up 132% in since March 13, 2020, vs. a 90% gain for AMZN. Over the last five years, GOOG is up 155% vs. a 108% gain in AMZN. Those are particularly strong returns for GOOG, especially when compared to the 80% return in the S&P 500 in the last five years. Now the question is: Can AMZN and GOOG repeat or beat that performance over the next five years? [text_ad] It would be foolish to doubt either company at this point. That said, no stock continues to grow at a breakneck pace forever. Just ask anyone who bought General Electric (GE) 10 or 15 years ago, when it ranked among the 10 largest companies in the world by market cap. So chances are, one or both of these blue-chip tech stocks will start to slow in the years ahead. Given that backdrop, I thought it might be a fun exercise to examine which tech giant stock is better positioned for future growth. Here’s a closer look at AMZN stock and GOOG stock, broken into a few key numbers: Trailing P/Es: AMZN 58, GOOG 24 Forward P/Es: AMZN 43, GOOG 22 Estimated 2024 revenue growth: AMZN 11.6%, GOOG 11.3% Estimated 2024 EPS growth: AMZN 42.4%, GOOG 16.7% Cash per share: AMZN $8.35, GOOG $8.92 Institutional ownership: AMZN 63%, GOOG 62% That comparison tells us that AMZN is still the more overvalued stock. However, until recently it had been the faster-growing company on both the top and bottom lines; and it had been since 2016. That was also the year Amazon first turned consistently profitable. That said, Google has way more cash than Amazon - nearly 50% more in terms of total cash, with roughly a fifth as much debt. Considering that Amazon brings in nearly twice as much revenue as Google annually (though that gap is closing), that means that Amazon has been way more willing to spend its cash on things that will grow the company - the Amazon Prime Video streaming service that is rivaling Netflix these days; a new foray into live sports with NFL broadcasts; the Amazon Echo, Amazon Web Services, etc. Google looks more like a cash hoarder. The result is that Amazon stock has grown much faster than GOOG stock in the last decade, though that has certainly changed in the last two years. The guess here is that Google will start loosening its purse strings in the coming years, devoting it to new, exciting products like the long-anticipated and recently released Google Pixel Watch intended to rival the Apple Watch, a new Pixel smartphone, or perhaps Google will join Amazon, Netflix, Apple and Disney in the big-money streaming video wars (YouTube did make a splash buying the NFL broadcast rights). Regardless of what it comes up with, bet on Google spending more of its $110 billion cash stockpile soon. If it does, that could capture investors’ attention the way Amazon did up until the last few years. You can’t go wrong with either of these growth stocks. If you bought both of them five, 10 or even 15 years ago, you’ve made a LOT of money. But AMZN has been the better performer, at least up until recently. I think that might change in the years to come. Between its cash stockpile, untapped potential revenue streams, and cheaper valuation, I like GOOG stock to outperform AMZN in the next five years. In fact, that shift already seems to be taking place, as the last few years have shown. It could be the start of a longer-term role reversal between two of the biggest, baddest tech stocks on the block. Furthermore, after such extreme selling last year, both these stocks are still trading near their 2021 levels despite a furious run-up in the last year. You could buy both (or either, although I prefer GOOG); either way, an investment in GOOG stock will likely turn out quite well five years from now. For a list of the stocks that have the strongest momentum to start the year, consider taking a trial subscription to Cabot Top Ten Trader. In it, you’ll find the list of 10 stocks that are set to jump next week. For more details, click here. Do you own shares of Amazon, Google, or both in your portfolio? Which do you prefer? [author_ad] *This article is periodically updated to reflect market conditions  Get My Free Report As Seen On    Choose Your Free Reports You have access to our expertly curated collection of free investing reports, including 5 Best Stocks to Buy this Month, How to Find Undervalued Stocks, How Options Work, and more.  Get My Reports Copyright © 2024 Cabot Heritage Corporation, All Rights Reserved | Privacy Policy | Terms of Use & Conditions of Sale "
}