{
    "title": null,
    "date": "2/18/2024",
    "url": "https://finance.yahoo.com/news/beaten-down-growth-stock-could-110000857.html",
    "text": "Image-browsing platform Pinterest (NYSE: PINS) is a beaten-down growth stock. It peaked at close to $90 per share back in early 2021 and is 60% below that high about three years later. But some may quibble about calling Pinterest a growth stock. The company's revenue was up only 9% in 2023. That doesn't sound like a lot of growth for a growth stock. It's true: Pinterest's top-line has taken a breather. However, it might be ready for a new wave of growth in 2024, thanks to strategic partnerships with two members of the \"Magnificent Seven.\" The Magnificent Seven is a term that refers to seven of the biggest and top-performing tech stocks of the past decade. This list includes both e-commerce giant Amazon (NASDAQ: AMZN) and digital-advertising giant Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL), which happen to be two of Pinterest's newest partners. Pinterest announced its partnership with Amazon way back in April 2023, hinting that it was only the first partnership of many. And this month, the company announced its partnership with Alphabet's Google. Pinterest has nearly 500 million monthly active users who browse images on the platform looking for inspiration. Clicking on an image exposes users to other similar images, allowing them to hone in on what they're looking for with a visual version of internet search. For advertisers, this is a gold mine. The company's users are predisposed to buy something -- most are looking to take on a project or spruce up a space. Advertisers can therefore create ads that look like normal posts on Pinterest, making ads feel less intrusive than they do on other platforms. Pinterest also has interesting user-search data that can predict consumer behavior. The company just released its predictions for what consumers will be looking for in 2024 (apparently, jellyfish decor is about to be in style). And from 2019 through 2022, 80% of its predictions came true. Advertisers can lean into this data from Pinterest to create effective marketing. If Pinterest has struggled at all as a public company, it's been with monetization. The platform is different from larger platforms that advertisers are more familiar with. A fair bit of effort is spent convincing brands to give Pinterest a try. Now, it has monetization help from big tech partners. Amazon is the largest e-commerce company in the world, which means it has a lot of consumer data. Moreover, it has a community of third-party merchants who spend to advertise on Amazon. With the new partnership, Amazon merchants will have ads displayed on Pinterest automatically when the situation is appropriate. Pinterest's partnership with Google is a little different. Most of Pinterest's active users are outside of the U.S., and it operates in certain international markets that surprisingly haven't been monetized at all. Google will allow Pinterest to quickly turn on monetization in these regions. I don't believe I can overstate how revolutionary these partnerships can be for Pinterest. For starters, Amazon's ad network is huge. Opening up its platform to these third-party ads brings a flood of supply online. This makes ad slots more competitive, in theory, which could increase the amount of revenue Pinterest makes per ad. Moreover, the company averaged $6.44 in revenue per active user in 2023, which is lower than other platforms. And the highest monetization rates, by far, are in the U.S., Canada, and Europe. However, more than half of the company's 500 million users live outside of these core markets and are monetized at an average annual rate of just $0.50 per user. Even if the Google partnership could help Pinterest only double this monetization rate, it would be massive, given the size of the user base in these international markets. The Amazon partnership only started in the second half of 2023 and was a slow rollout. Even so, Pinterest's revenue growth in the second half of 2023 accelerated from the first half. And now, just as the Google partnership gets going, the company is guiding for even stronger revenue growth of 15% to 17% in the first quarter of 2024. For perspective, that would be Pinterest's best result in two years. And considering the partnerships are only in the early phases, growth might only get better from there. I believe Pinterest stock is a buy. The company has admirably grown its user base in recent years. Now, Amazon and Google can help the company finally live up to its monetization potential. Should you invest $1,000 in Pinterest right now? Before you buy stock in Pinterest, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Pinterest wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Jon Quast has positions in Pinterest. The Motley Fool has positions in and recommends Alphabet, Amazon, and Pinterest. The Motley Fool has a disclosure policy. This Beaten-Down Growth Stock Could Soar in 2024, Thanks to Partnerships With 2 Members of the \"Magnificent Seven\" was originally published by The Motley Fool Related Quotes "
}