{
    "title": null,
    "date": "2/6/2024",
    "url": "https://finance.yahoo.com/news/alphabet-verily-hires-health-veteran-170000528.html",
    "text": "(Bloomberg) -- Verily, Alphabet Inc.’s life sciences unit, hired veteran health technology executive Myoung Cha as chief product officer to help lead strategy as the company ramps up efforts to expand its business. Most Read from Bloomberg Pentagon Chief Austin in Critical Care Unit at Walter Reed Trump’s NATO Remark Sparks Political Storm in World Capitals Germany’s Days as an Industrial Superpower Are Coming to an End Top Nigerian Banker Killed in California Helicopter Crash Cha previously served as president and chief strategy officer at startup Carbon Health Technologies Inc. and also worked on health efforts at Apple Inc., Verily said Tuesday in a statement. “Myoung is a distinguished product leader whose proven ability to leverage integrated hardware, software, and clinical care supports our vision for driving precision health,” Verily Chief Executive Officer Stephen Gillett said in a statement. “His experience working and collaborating with some of the most esteemed companies in the health care sector will be a tremendous asset to Verily in our next phase of growth.” Verily, which captured the public imagination with efforts to develop glucose-detecting contact lenses, has in recent years focused more on its bottom line. In 2022, Verily raised $1 billion in new investments led by its parent company, Alphabet, and appointed Gillett as CEO, who succeeded founder Andy Conrad. Over a long career in health tech, Cha led development of applications for the Apple Watch and worked with Google on efforts to notify people of exposure to Covid-19. “What excites me about Verily is the unique opportunity we have to advance precision health with the company’s diverse combination of talent, technology, and capabilities,” Cha said in the statement. Previously known as Google Life Sciences, Verily was a division of secretive technology lab X until it broke away as an independent subsidiary of Alphabet in 2015. Most Read from Bloomberg Businessweek OpenAI’s Secret Weapon Is Sam Altman’s 33-Year-Old Lieutenant It’s Time to Talk About Those Taylor Swift Super Bowl Bets How Jack Dorsey’s Plan to Get Elon Musk to Save Twitter Went South Inside a Private Jet Club Where Everything Went Wrong Social Media Platforms Are Done With News, But Gen Z Still Treats Them as a Go-To Source ©2024 Bloomberg L.P. Related Quotes "
}