{
    "title": "Wall Street forecasts 15% upside for Google stock in a year",
    "date": "2/3/2024",
    "url": "https://finbold.com/wall-street-forecasts-15-upside-for-google-stock-in-a-year/",
    "text": "Alphabet Inc’s (NASDAQ: GOOGL) stock price remains in the green zone in 2024, aligning with the overall bullish sentiment exhibited by technology and communication services equities. However, it is worth noting that the stock experienced a brief dip on January 30 after Alphabet reported its 2023 fourth-quarter earnings, which fell short of analysts’ expectations on ad revenue, the core of the tech giant’s business. This comes against the backdrop of the stock surging in 2023, posting a remarkable over 50% increase as its businesses rewarded shareholders with substantial gains. As of press time, GOOGL has rallied almost 3% on a year-to-date basis, trading at $142.38. Following the recent financial reporting, the stock witnessed a sell-off, leading GOOGL to lose the crucial $150 support level. In the meantime, Alphabet’s stock can be considered low risk in the market, given the current status of the business. Moreover, it boasts strong profit margins likely to support the equity in meeting targets, especially with the $200 mark remaining a key focus area. When examining Alphabet’s key fundamentals, the prevailing focus is on the company’s advertising segments. The stock suffered following the Q4 2023 results, which revealed a shortfall in predicted advertising revenue at $65.52 billion compared to the expected $65.8 billion. However, Alphabet exceeded predictions for overall revenue, reaching $86.31 billion compared to $85.36 billion – reflecting a 13% year-over-year increase. Despite an overall advertising downturn, Alphabet reported robust YouTube ads revenue of $9.2 billion, surpassing analyst predictions of $9.16 billion. CEO Sundar Pichai expressed satisfaction with the growing contribution from YouTube and highlighted the commendable achievement of the company’s digital subscription services, including YouTube and Google One, which totaled $15 billion for the fiscal year. At the same time, the company is banking on the continued growth of its cloud business as it competes with rivals such as Amazon (NASDAQ: AMZN) and Microsoft (NASDAQ: MSFT). This segment remains a vital metric for investors, especially considering its role in advancing artificial intelligence (AI). Exceeding projections, Google Cloud revenue surpassed $9 billion, marking a significant 26% surge from the previous year. Despite the optimistic outlook for beating 2024 projections, Alphabet faces scrutiny after laying off 1,000 employees in January. Pichai subsequently indicated that additional layoffs could be anticipated in 2024 as part of the company’s strategic refocusing on “investing in our key priorities,” particularly integrating AI elements into Google’s flagship products. Indeed, these fundamentals play a crucial role in shaping the projection of Alphabet’s stock. In the latest analysis provided by 37 Wall Street analysts at TipRanks, Alphabet has an optimistic outlook. The average 12-month price target is $164, indicating a 15.18% increase from the recent closing price. The high-end forecast is particularly bullish, projecting a target of $180, while the more conservative estimate suggests a low of $140. This range of predictions reflects a consensus among analysts that Google’s stock has the potential for substantial growth in the coming months. The stock price projection is based on the equity’s last three-month performance, with 29 of the analysts rating GOOGL a ‘strong buy.’ Although Alphabet’s stock can be considered reasonably valued, lingering concerns about its ability to compete with giants like Microsoft in the AI race, expand its cloud infrastructure platform, and navigate regulatory challenges may restrict its short-term gains. Additionally, the prospect of heightened interest rates could potentially lead investors away from premier tech stocks. Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}