{
    "title": "Stock Market: Meta, Alphabet, and Amazon Could Rewrite Dividend History",
    "date": "2/15/2024",
    "url": "https://www.cointribune.com/en/bourse-en-ebullition-goldman-sachs-predit-une-annee-record-pour-les-societes-du-sp-500-2/",
    "text": "Home » News » Finance News The stock market has been stirred by Meta’s revelation of its first quarterly dividend. This move, unusual in the technology sector, could set a precedent for other tech giants like Alphabet and Amazon. That’s the view put forward by a team of analysts at Goldman Sachs, who see this trend as good news for investors seeking income. Alphabet $GOOGL and Amazon $AMZN likely to follow Meta's lead by announcing their first ever dividend payments this year according to Goldman Sachs pic.twitter.com/rRcUCeTelJ S&P 500 companies are expected to pay out more dividends in 2024, according to Goldman Sachs. Alphabet and Amazon could indeed follow Meta’s lead and announce their first dividends ever. Dividends serve as a support factor for stock prices. They lower the cost of capital and increase stock yields. In the stock market, Meta, Alphabet, and Amazon are among the seven technology companies that drove S&P 500 growth in 2023. Meta announced a dividend of 50 cents per share, payable on March 26th. According to stock market data, it reported a net profit of $14.02 billion in the fourth quarter of 2023, representing a 201% increase year-over-year. The stock surged by 20% the day after this announcement. Alphabet and Amazon could follow the same path, according to Goldman Sachs. The latter believes these companies have enough liquidity to pay dividends while continuing to invest in innovation. Alphabet posted a net profit of $22.3 billion in the fourth quarter of 2023, up 51% year-over-year. Amazon, on the other hand, reported a net profit of $8.9 billion, up 118% year-over-year. In any case, the current trend in the stock market could be favorable to investors. Stay tuned… Maximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits. Je m'appelle Ariela et j'ai 31 ans. J'oeuvre dans le domaine de la rédaction web depuis maintenant 7 ans. Je n'ai découvert le trading et la cryptomonnaie que depuis quelques années. Mais c'est un univers qui m'intéresse beaucoup. Et les sujets traités au sein de la plateforme me permettent d'en apprendre davantage. Chanteuse à mes heures perdues, je cultive aussi une grande passion pour la musique et la lecture (et les animaux !) The views, thoughts, and opinions expressed in this article belong solely to the author, and should not be taken as investment advice. Do your own research before taking any investment decisions. Receive the latest and best crypto news directly to your inbox in daily, weekly, or special format, to stay updated at your own pace Receive the latest and best crypto news directly to your inbox in daily, weekly, or special format, to stay updated at your own pace "
}