{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOG/pressreleases/24030841/",
    "text": "Meta Platforms(NASDAQ: META), the world's largest social media company, recently surprised its investors by initiating its first-ever dividend. Its quarterly dividend of $0.50 only constitutes a forward yield of 0.4%, but it was still a confident move that indicated its core advertising business could continue growing for the foreseeable future. So could Meta's biggest advertising competitor, Google's parent company Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL), also start paying dividends in the near future? Let's take a look at Alphabet's free cash flow (FCF) growth to find out. Image source: Getty Images. Alphabet, which went public as Google in 2004, has never paid a dividend. Like many other growing tech companies, Google allocated most of its cash to R&D investments and acquisitions instead of shareholder-friendly buybacks or dividends. Some of those big acquisitions paid off. YouTube, which it acquired for $1.65 billion in 2006, became the world's largest streaming video platform and a core growth engine of its advertising business. Other acquisitions, like its $12.5 billion purchase of Motorola Mobility, backfired and resulted in ugly write-downs. Meanwhile, some of Alphabet's \"moonshot\" investments -- including its driverless unit Waymo and healthcare unit Verily -- weren't aimed at generating near-term profits. Instead, it seeded those investments for the future growth of its ecosystem beyond digital ads. So for many years, Alphabet prioritized the expansion of its business above buybacks or dividends -- and that focus paid off. From 2004 to 2023, its annual revenue grew at a compound annual growth rate (CAGR) of 27% as its net income rose at a CAGR of 32%. Its stock has soared 6,750% since its IPO. However, Alphabet's growth gradually cooled off over the past few years. From 2019 to 2023, its revenue rose at a CAGR of 17% as its net income grew at a CAGR of 15%. From 2023 to 2026, analysts expect its revenue and net income to increase at a CAGR of 11% and 14%, respectively. Those growth rates are still impressive, but Google could be running out of room to expand its core advertising and cloud businesses. Google's advertising business faces fierce competition from Meta's Facebook and Instagram, ByteDance's TikTok, and Amazon's (NASDAQ: AMZN) integrated ads. Google's cloud platform remains a distant third in the public cloud race behind Amazon Web Services (AWS) and Microsoft(NASDAQ: MSFT) Azure, which have both been aggressively upgrading their integrated AI features to attract more customers. To reduce its dependence on ads, Google has been expanding its subscription-based options for YouTube, YouTube Music, and Google One. To keep pace with Microsoft and Amazon in the AI race, Google has been investing heavily in the development of its own Bard AI chatbot, Gemini large language models, and other AI features. Therefore, it makes sense for Alphabet to allocate more cash toward those initiatives instead of paying recurring dividends -- even through its annual FCF more than doubled from $31 billion in 2019 to $69 billion in 2023 and lifted its FCF margin from 19% to 23%. Analysts expect its annual FCF to reach $109 billion in 2026. Alphabet hasn't paid any dividends, but it repurchased 11% of its shares over the past five years. In 2023, it spent $62 billion -- or nearly 90% of its annual FCF -- on buybacks. Those big buybacks, along with its $111 billion in cash and marketable securities at the end of the year, counter the notion that it doesn't have enough cash for dividends. Instead, they indicate that Alphabet considers buybacks to be a better way to boost shareholder value (and reduce its own dilution from stock-based compensation) than recurring dividends. Alphabet's 165% rally over the past five years supports that idea. When buybacks are well-timed, they can be more beneficial to a company and its investors by boosting its earnings per share (EPS). Dividends, on the other hand, will reward investors with regular cash payments but won't reduce a company's outstanding shares or boost its EPS. Buybacks are also generally more resistant to inflation than dividends, which can lose value with the underlying currency unless they're reinvested, and usually more efficient for tax purposes since investors are only taxed on dividends (and not buybacks). Alphabet also might believe that paying a paltry dividend yield of less than 1% won't meaningfully boost its stock price or attract any serious income investors. Meanwhile, boosting its annual payout to 3%-4% would require it to set aside a lot more cash every quarter while sending out a troubling signal that its high-growth days are over. Alphabet might eventually follow Meta's lead and pay a dividend. But it also won't be a top priority, and its payout should be pretty low. For now, Alphabet will likely keep plowing its cash into big buybacks and the expansion of its subscription and AI services instead of becoming a blue-chip dividend stock. I believe that's the right path, since keeping pace with its industry peers over the long run matters a lot more than paying quarterly dividends. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 12, 2024  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, and Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Alphabet Cl C stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}