{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.breitbart.com/tech/2024/03/06/google-co-founder-sergey-brin-says-company-hasnt-fully-understood-why-gemini-ai-is-ultra-woke/",
    "text": "Google co-founder Sergey Brin acknowledged the company’s flawed rollout of its Gemini AI image generation tool in a rare public appearance over the weekend. In a revealing comment about the state of Google’s management, Brin claimed, “We haven’t fully understood why it leans left in many cases,” claiming “that’s not our intention.” Bring is apparently choosing to ignore the extreme leftist culture of the company he founded, which insiders report is now ruled by a “culture of fear” driven by DEI and an all-powerful HR bureaucracy. CNBC reports that in a surprising move, Sergey Brin, the 50-year-old former president of Alphabet and co-founder of Google, stepped out of retirement to address a group of AI enthusiasts and entrepreneurs. The event, held at the “AGI House” in Hillsborough, California, provided a platform for Brin to discuss the company’s recent missteps and the future trajectory of artificial intelligence. Google’s black George Washington (Gemini AI) Google CEO Sundar Pichai is happy (Boris Streubel /Getty) One of the most significant revelations came when Brin openly admitted that Google “definitely messed up” the launch of its Gemini image generation tool in February. The tool, designed to generate images based on user prompts, faced widespread criticism for producing inaccurate and questionable results, including historical inaccuracies and a perceived left-wing bias. “We definitely messed up on the image generation,” Brin said. I think it was mostly due to just not thorough testing. It definitely, for good reasons, upset a lot of people.” Discussing the AI’s obvious leftist bias, Brin added, “We haven’t fully understood why it leans left in many cases,” but “that’s not our intention.” Despite the setback, Google has stated its intention to relaunch the image generation feature soon, after addressing the issues that marred the initial rollout. While acknowledging the company’s struggles, Brin also pointed out that other AI tools, such as OpenAI’s ChatGPT and Elon Musk’s Grok services, have also produced “some pretty weird things that definitely feel far left.” Addressing concerns about the potential impact of AI on Google’s core business model, which heavily relies on online advertising revenue, Brin remained optimistic. “I personally feel as long as there’s huge value being generated, we’ll figure out the business models,” he said, suggesting that advertising could potentially work better with AI’s ability to tailor content more effectively. Breitbart News recently reported on the “culture of fear” at Google that likely contributed to its AI tools going ultra-woke: According to insiders, a profound lack of leadership and direction lies at the heart of Google’s problems. Despite being a $1.7 trillion company with over 150,000 employees and nearly 30,000 engineers, the company appears to be rudderless. Employees express uncertainty about who is truly in charge, with a strange dynamic between the founders, Larry Page and Sergey Brin, the board, and CEO Sundar Pichai leaving most employees confused about the company’s direction. This leadership vacuum has given rise to a “culture of fear” that permeates the entire organization. Employees at every level are afraid to challenge the processes and practices that have crippled the company’s ability to innovate. “I think it’s impossible to ship good products at Google,” said one senior engineer. Another major issue plaguing Google is the outsized influence of its sprawling HR bureaucracy, which is deeply obsessed with left-wing political dogma. From policing language to imposing bizarre pronoun expectations and forcing affinity groups to change their names, the HR department’s excessive focus on diversity, equity, and inclusion (DEI) initiatives has become a source of frustration for many employees. Read more at CNBC here. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Please let us know if you're having issues with commenting.     Copyright © 2024 Breitbart "
}