{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/alphabet-inc-nasdaqgoogl-shares-purchased-by-lantz-financial-llc.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Lantz Financial LLC lifted its holdings in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 9.5% in the fourth quarter, HoldingsChannel reports. The firm owned 3,787 shares of the information services provider’s stock after buying an additional 330 shares during the quarter. Lantz Financial LLC’s holdings in Alphabet were worth $529,000 as of its most recent SEC filing. A number of other institutional investors have also recently made changes to their positions in GOOGL. Spreng Capital Management Inc. lifted its holdings in  Alphabet by 4.0% in the 1st quarter. Spreng Capital Management Inc. now owns 131 shares of the information services provider’s stock valued at $364,000 after purchasing an additional 5 shares in the last quarter.  West Family Investments Inc. lifted its holdings in  Alphabet by 0.3% in the 1st quarter. West Family Investments Inc. now owns 1,754 shares of the information services provider’s stock valued at $4,878,000 after purchasing an additional 6 shares in the last quarter.  Maple Capital Management Inc. lifted its holdings in  Alphabet by 2.1% in the 1st quarter. Maple Capital Management Inc. now owns 296 shares of the information services provider’s stock valued at $823,000 after purchasing an additional 6 shares in the last quarter.  Private Advisory Group LLC lifted its holdings in  Alphabet by 1.8% in the 1st quarter. Private Advisory Group LLC now owns 401 shares of the information services provider’s stock valued at $1,115,000 after purchasing an additional 7 shares in the last quarter.  Finally, Weik Capital Management lifted its holdings in  Alphabet by 0.5% in the 1st quarter. Weik Capital Management now owns 1,533 shares of the information services provider’s stock valued at $4,264,000 after purchasing an additional 8 shares in the last quarter. Institutional investors and hedge funds own  35.08% of the company’s stock. Alphabet stock opened at $150.77 on Friday. The company has a market cap of $1.87 trillion, a PE ratio of 25.99, a P/E/G ratio of 1.39 and a beta of 1.04. The company has a fifty day moving average price of $143.02 and a two-hundred day moving average price of $137.79. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a 12 month low of $99.74 and a 12 month high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last announced its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating the consensus estimate of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The company had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. During the same quarter in the previous year, the company posted $1.05 earnings per share.  Research analysts expect that  Alphabet Inc. will post 6.77 earnings per share for the current year. In related news, insider John Kent Walker sold 28,281 shares of the company’s stock in a transaction dated Thursday, December 28th. The shares were sold at an average price of $141.40, for a total value of $3,998,933.40. Following the completion of the sale, the insider now owns 25,002 shares of the company’s stock, valued at $3,535,282.80. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. In related news, insider John Kent Walker sold 28,281 shares of the company’s stock in a transaction dated Thursday, December 28th. The shares were sold at an average price of $141.40, for a total value of $3,998,933.40. Following the completion of the sale, the insider now owns 25,002 shares of the company’s stock, valued at $3,535,282.80. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, CAO Amie Thuener O’toole sold 425 shares of the business’s stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares in the company, valued at $3,805,628.99. The disclosure for this sale can be found here. Over the last quarter, insiders sold 279,659 shares of company stock valued at $39,460,310. 0.88% of the stock is currently owned by company insiders. GOOGL has been the topic of a number of recent research reports. BMO Capital Markets upped their target price on shares of Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Susquehanna upped their target price on shares of Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a report on Wednesday, January 31st. Needham & Company LLC  reiterated a “buy” rating and set a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Citigroup increased their price objective on shares of Alphabet from $153.00 to $168.00 and gave the stock a “buy” rating in a report on Wednesday, January 31st. Finally, Wells Fargo & Company increased their price objective on shares of Alphabet from $141.00 to $144.00 and gave the stock an “equal weight” rating in a report on Monday, March 18th. Five investment analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have issued  a strong buy rating to the company. According to data from MarketBeat.com, Alphabet presently has a consensus rating of “Moderate Buy” and an average price target of $155.48. Check Out Our Latest Stock Analysis on Alphabet (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Willis Johnson & Associates Inc. Makes New $232,000 Investment in JPMorgan Chase & Co. (NYSE:JPM) Abbott Laboratories (NYSE:ABT) Shares Bought by Lantz Financial LLC "
}