{
    "title": "Google Stock: Mag 7 Stock Teases Breakout — While Nvidia Gets A Haircut",
    "date": "3/28/2024",
    "url": "https://www.investors.com/research/ibd-stock-analysis/google-stock-aapl-nvda-msft-meta/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     After tapping record highs, Magnificent Seven stocks like Nvidia (NVDA), Meta Platforms (META), and Microsoft (MSFT) have taken a little haircut this short holiday week. Meanwhile, Alphabet (GOOGL) looks to sprinkle a bit of that artificial intelligence pixie dust to lift shares of Google stock decisively past a new buy point. Among the Mag 7 stocks, Amazon.com (AMZN) has shown the most resilience in recent days. Laggards Tesla (TSLA) and Apple (AAPL) both remain trapped below their downward-sloping 50-day moving averages. As Tesla remains in its long slump, bulls turn bearish as the EV giant's \"nightmare\" first quarter comes to an end. Meanwhile, shares of Nvidia have held above 900 despite a flurry of pullbacks earlier this month. Although the AI powerhouse remains not too far off its all-time high, this week's action reminds investors to apply the eight \"secrets\" for when to sell stocks. In addition to a boost from a possible licensing deal with fellow Mag 7 stock Apple (AAPL), strong demand from large investors is boosting shares of Alphabet. Fueled by the continued AI boom, Nvidia, Microsoft and Meta Platforms made this month's list of new buys by the best mutual funds. While Alphabet did not join them in March, it did make the list in February. Plus, an impressive 401 funds with an A+ rating from IBD own shares of Google stock. A possible licensing deal between Alphabet and Apple has also piqued Wall Street's interest. On March 18, shares of Google stock popped on a report that the company is in talks with Apple about licensing Alphabet's Gemini AI system for the iPhone. That jump builds on Alphabet's recovery after an initial drop following its Jan. 30 earnings report. Special Report: See The Best Mutual Funds In Every Category While certainly in better shape than Tesla (TSLA) and Apple, Alphabet has been playing catch-up with the other Magnificent Seven stocks so far this year in terms of stock performance. Shares of Google stock have not soared like Nvidia or Meta have this year, but the search, cloud and AI giant now stands poised to pop into buy range. While Nvidia fell over 4% in below-average volume in this holiday-shortened week, Alphabet managed to notch a small gain. Counting bases in a stock chart helps gauge the progress and potential of a stock. Earlier stage bases, particularly first- and second-stage patterns, are most likely to spur significant and sustained climbs. Last April, Alphabet broke out from a first-stage cup with handle. From there, Google stock went on to form three more bases — without rising at least 20% from the subsequent buy points. As a result, each of those three new patterns are considered part of an evolving second-stage base. MarketSurge, IBD's pattern recognition platform, labels them as 2a, 2b and 2c. The current formation is a consolidation pattern showing a 153.78 buy point. A handle has also formed, which offers a slightly earlier entry at 152.15. In either case, look for Google stock to jump past the buy point in heavy volume, at least 40% above average. Follow Matthew Galgani on X (formerly Twitter) at @IBD_MGalgani. YOU MAY ALSO LIKE: How To Refine Your Stock Picks Yes, Top Funds Adore Nvidia. But They Love This Non-AI Sector. Nvidia Reveals 8 'Secrets' For When To Sell Stocks. No. 2 Is Key. MarketSmith Is Now MarketSurge. Explore What Else Is New. IBD Meetup Groups: How To Invest In Stocks — Socially 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}