{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) Receives Average Recommendation of “Moderate \nBuy” from Brokerages",
    "date": "3/11/2024",
    "url": "https://www.defenseworld.net/2024/03/11/alphabet-inc-nasdaqgoogl-receives-average-recommendation-of-moderate-buy-from-brokerages.html",
    "text": "Posted by Defense World Staff on Mar 11th, 2024 Shares of Alphabet Inc. (NASDAQ:GOOGL – Get Free Report) have earned a consensus rating of “Moderate Buy” from the thirty-three analysts that are  covering the firm, MarketBeat reports. Five investment analysts have rated the stock with a hold rating, twenty-seven have issued  a buy rating and one  has assigned  a strong buy rating to  the company. The average 12-month price objective among brokerages that have issued a report on the stock in the last year is $153.65. Several equities research analysts have recently commented on the stock. BMO Capital Markets lifted their price objective on shares of Alphabet from $170.00 to $178.00 and gave the stock an “outperform” rating in a research note on Wednesday, January 31st. Truist Financial reduced their target price on shares of Alphabet from $160.00 to $158.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. Needham & Company LLC  reaffirmed a “buy” rating and issued a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Rosenblatt Securities cut their price objective on shares of Alphabet from $174.00 to $172.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. Finally, Wedbush  reaffirmed an “outperform” rating and issued a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Check Out Our Latest Report on Alphabet In other Alphabet news, SVP Prabhakar Raghavan sold 16,088 shares of the company’s stock in a transaction dated Tuesday, January 2nd. The shares were sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the completion of the sale, the senior vice president now directly owns 52,440 shares of the company’s stock, valued at $7,294,404. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this link. In other news, SVP Prabhakar Raghavan sold 16,088 shares of Alphabet stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.10, for a total value of $2,237,840.80. Following the transaction, the senior vice president now owns 52,440 shares of the company’s stock, valued at $7,294,404. The transaction was disclosed in a legal filing with the SEC, which is available at the SEC website. Also, Director John L. Hennessy sold 200 shares of Alphabet stock in a transaction that occurred on Wednesday, January 10th. The shares were sold at an average price of $143.49, for a total transaction of $28,698.00. Following the completion of the transaction, the director now directly owns 6,784 shares in the company, valued at approximately $973,436.16. The disclosure for this sale can be found here. In the last quarter, insiders sold 278,859 shares of company stock worth $39,178,332. Corporate insiders own  0.88% of the company’s stock. Hedge funds have recently modified their holdings of the company. Bornite Capital Management LP bought a new position in shares of  Alphabet in the first quarter valued at $16,688,000.  Markel Corp boosted its position in  Alphabet by 17.0% during the first quarter. Markel Corp now owns 15,500 shares of the information services provider’s stock worth $43,110,000 after purchasing an additional 2,250 shares during the period.  United Bank boosted its position in  Alphabet by 5.9% during the first quarter. United Bank now owns 2,033 shares of the information services provider’s stock worth $5,654,000 after purchasing an additional 113 shares during the period.  Mirae Asset Global Investments Co. Ltd. boosted its position in  Alphabet by 23.4% during the first quarter. Mirae Asset Global Investments Co. Ltd. now owns 323,918 shares of the information services provider’s stock worth $900,929,000 after purchasing an additional 61,427 shares during the period.  Finally, Dakota Wealth Management boosted its position in  Alphabet by 20.4% during the first quarter. Dakota Wealth Management now owns 9,279 shares of the information services provider’s stock worth $25,806,000 after purchasing an additional 1,570 shares during the period. 35.08% of the stock is currently owned by institutional investors and hedge funds. NASDAQ GOOGL opened at $135.41 on Monday. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. The firm’s 50 day moving average price is $142.09 and its 200-day moving average price is $137.10. Alphabet has a 52-week low of $89.42 and a 52-week high of $153.78. The company has a market cap of $1.68 trillion, a PE ratio of 23.35, a P/E/G ratio of 1.25 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last released its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. The firm had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same period last year, the firm earned $1.05 earnings per share.  Sell-side analysts forecast that  Alphabet will post 6.77 EPS for the current fiscal year. (Get Free Report Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Cue Health (HLTH) Scheduled to Post Earnings on Wednesday NovoCure Limited (NASDAQ:NVCR) Receives Consensus Rating of “Moderate Buy” from Analysts "
}