{
    "title": "Alphabet (GOOGL) Stock Drops Despite Market Gains: Important Facts to Note",
    "date": "3/19/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-stock-drops-despite-214517234.html",
    "text": "The latest trading session saw Alphabet (GOOGL) ending at $147.03, denoting a -0.44% adjustment from its last day's close. The stock trailed the S&P 500, which registered a daily gain of 0.57%. Meanwhile, the Dow gained 0.83%, and the Nasdaq, a tech-heavy index, added 0.39%. Coming into today, shares of the internet search leader had gained 5.1% in the past month. In that same time, the Computer and Technology sector gained 3.42%, while the S&P 500 gained 2.97%. The investment community will be closely monitoring the performance of Alphabet in its forthcoming earnings report. The company's upcoming EPS is projected at $1.49, signifying a 27.35% increase compared to the same quarter of the previous year. Meanwhile, our latest consensus estimate is calling for revenue of $65.95 billion, up 13.58% from the prior-year quarter. For the full year, the Zacks Consensus Estimates project earnings of $6.77 per share and a revenue of $286.48 billion, demonstrating changes of +16.72% and +11.68%, respectively, from the preceding year. It's also important for investors to be aware of any recent modifications to analyst estimates for Alphabet. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits. Empirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system. The Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.16% higher within the past month. Alphabet is currently sporting a Zacks Rank of #3 (Hold). With respect to valuation, Alphabet is currently being traded at a Forward P/E ratio of 21.8. For comparison, its industry has an average Forward P/E of 25.52, which means Alphabet is trading at a discount to the group. We can also see that GOOGL currently has a PEG ratio of 1.36. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. GOOGL's industry had an average PEG ratio of 2.24 as of yesterday's close. The Internet - Services industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 90, which puts it in the top 36% of all 250+ industries. The Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Don't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}