{
    "title": "Is Google in danger of being replaced?",
    "date": "3/2/2024",
    "url": "https://seekingalpha.com/news/4074691-is-google-in-danger-of-being-replaced",
    "text": "JHVEPhoto/iStock Editorial via Getty Images In less time than it takes Saturn to orbit the Sun, Google (NASDAQ:GOOG) (NASDAQ:GOOGL) has gone from a scrappy Stanford University research project into a technology behemoth valued at more than $1.7 trillion. But as generative artificial intelligence looks to re-shape nearly every sector of the global economy, some have questioned whether the world's search engine is in danger of losing its place at the top of the mountain. \"Ever since OpenAI launched ChatGPT in late 2022, Google’s response looks more like a body builder who’s been told his muscles are all show, picking fights and getting beat up,\" Bernstein analyst Mark Shmulik wrote in a recent investor note. Shmulik has a Market-Perform rating and $160 price target on Google. Since ChatGPT and OpenAI — which is backed by billions from Microsoft (MSFT) — took the world by storm in late 2022, Google has been accused of being too slow to ship products (it has recently upped its cadence, albeit to harrowed results) and playing defense instead of offense, Shmulik said. The company has not done itself any favors, giving investors \"nothing beyond the bare minimum,\" Shmulik added. Led by Chief Executive Sundar Pichai, Google does not provide guidance; commentary around its various markets are often seen as \"cryptic;\" and the question and answer portion of earnings calls are a \"waste of time,\" Shmulik said. While that mindset worked for most of the past 20 years (the company went public in 2004), with the stock up nearly 5,000% since its IPO, the landscape has shifted dramatically the past couple of years. Perhaps the biggest risk to Google (aside from being broken up or antitrust issues) is losing dominance in the lucrative search engine market. The company generated roughly $237B in ad revenue in 2023, most of which came from search. With roughly 91% of the market, it's clear Google is the 800 pound gorilla and others are champing at the bit to go after it. Microsoft is integrating generative AI and OpenAI's technology into all of its products, including Bing. ChatGPT itself is consistently one of the top 10 free apps on the iOS App Store while other gen AI companies garner significant attention from investors. Companies like Meta (META), Amazon (AMZN), Pinterest (PINS) and others are also nipping at Google's heels, as vertical (or specialized) and social search are as big of a threat to Google as generative AI is, Shmulik said. Google has tried to counter the generative AI threat with its own offerings, notably, Gemini. However, Gemini (formerly known as Bard) has had issues in recent days, including last month when it provided responses that offended some users, prompting the company to pause AI-generated images. Pichai called the results \"completely unacceptable\" and said the company would relaunch the AI model in the next few weeks. While Google's stock has been penalized for poor generative AI product launches or competitor's announcements, its share of the search market hasn't been dinged — at least not yet. Its search market share has been relatively stable over the past 12 months at roughly 91%, according to StatCounter. That provides some comfort despite the self-inflicted wounds stemming from inside Google, Shmulik said. \"We continue to believe that at the point in time when Gen AI answers have gained consumer trust, Google should be best positioned to integrate these results alongside web query results thereby offering consumers the best of both worlds,\" Shmulik said. "
}