{
    "title": null,
    "date": "3/8/2024",
    "url": "https://www.exchange4media.com/digital-news/helping-publishers-grow-revenue-remains-a-huge-focus-for-ussundar-pichaiceogoogle-69864.html",
    "text": "Alphabet announced the Q2 results for the year 2017 earlier this week. On an earnings call held by Alphabet, Sundar Pichai spoke about the future of Google products and how they have fared over the quarter and YoY. While Pichai confirmed that YouTube, Cloud and hardware businesses are the most promising ‘bets’, he also added that there has been incredible momentum in some of the core products and machine learning. “We had a phenomenal quarter and Google continues to lead the shift to AI-driven computing. We are working towards making this incredible technology available to everyone around the world. It’s our focus on infusing our products and platforms with product learning and the AI that’s driving our success,” he said.\n\nGoogle Lens Alphabet announced the Q2 results for the year 2017 earlier this week. On an earnings call held by Alphabet, Sundar Pichai spoke about the future of Google products and how they have fared over the quarter and YoY. While Pichai confirmed that YouTube, Cloud and hardware businesses are the most promising ‘bets’, he also added that there has been incredible momentum in some of the core products and machine learning. “We had a phenomenal quarter and Google continues to lead the shift to AI-driven computing. We are working towards making this incredible technology available to everyone around the world. It’s our focus on infusing our products and platforms with product learning and the AI that’s driving our success,” he said. Google Lens At Google IO, it was announced that Google Lens will be available later this year. Lenses is a vision-based computing capability that can understand what are you looking at and help you take action based on that information. YouTube YouTube now has 1.5 billion monthly viewers. People are watching an average of 60 minutes of content a day on their phones and tablets. “That’s incredible and it helps thousands of passionate video creators make money,” said Pichai. Television is now the fastest growing screen for YouTube as the watch-time on TV screens has nearly doubled YoY. This quarter, Google has unveiled six new ad supported originals from celebrities including Ellen Degeneres and Kevin Hart. Advertiser feedback on these new shows has been extremely positive, according to Pichai. Google Cloud Platform It is said that Google Cloud platform (GCP) has continued to grow impressively across products sectors and geographies and is increasingly being used by large enterprise customers in regulated sectors. “To be more specific about our momentum with big customers in Q2, the number of new deals to be closed are worth more than half a million dollars and it’s three times what it was last year,” said Pichai. Google continues to invest in new data centres around the world to provide the fastest and the most reliable services for its new customers and the existing ones. Computing and Advertising platforms Speaking about the two platforms, Pichai said, “Our computing and advertising platforms are driving great results for our partners. There are now more than two billion monthly active Android devices around the world. It’s really humbling to know that so many people use Android.” At Google IO this year, Google gave developers an early access to Android O which plans to focus on vitals like battery life and performance. Google Play, on the other hand, continues to be a vital distribution platform for developers. Eighty-two billion apps were downloaded from Google Play in the last year alone which is 11 apps for every person on the earth. “We continue to work on next generation computing platforms, virtual and augmented reality. By the end of this year, there will be 11 day dream ready devices on the market from manufacturers like Samsung, LG, Motorola and Asus,” he added. Advertising Platforms Elaborating on machine learning and its involvement at Google, Pichai said, “Machine learning is critical to helping advertisers and app developer analyse data in real time to reach consumers with more useful ads and measure campaign effectiveness.” At Google marketing, this quarter, Google launched the ‘Google attribution’which is a comprehensive measurement tool that allows marketers to measure the impact of their campaigns across devices and channels, all in one place with no additional cost. Google has also launched new ad formats and bidding features in Universal ad campaigns to help developers grow their user base on Google Play, Search, YouTube, Gmail and the display network. At Google IO, in 2016, it was announced that there were two billion app installations but today the number is more than five billion. Speaking on online transactions, Pichai stated that around 90 per cent of transactions still happen offline. Google aims to help consumers find what they are looking for in brick-and-mortar stores. He added, “Our store visit technology is instrumental in understanding customer behaviour that starts online and ends in store. This quarter, we also brought local ads and store visits measurement to video.” Google continues to witness success with their bumper ads which is the six second ad format. Pichai said that both brand and viewers love the format as it is the ideal length to capture attention. L’Oreal, Xbox, Clinique and Nutrogena have all seen great success with bumpers.\r\n  It’s said that ‘Google preferred’ continues to grow as hundreds of brands are now buying it. In the US, the numbers have nearly tripled since it launched three years ago.\r\n  Pichai said that Google is not just helping large brands but also millions of small businesses get online and grow. Every month, Google helps drive 100 million visitors to business websites and creates more than three billion direct connections between businesses and their customers. “These interactions drive huge economic opportunities in growth for small businesses.  Small businesses can now build a website on their mobile phones in under 10 minutes using the listings on Google,” he added. Speaking on publisher’s growth, he said that helping publishers grow their revenues remains a huge focus at Google. He said, “We are using the power of automation and machine learning to improve our auction algorithm for publishers. The 50 improvements we made since 2016 are generating 15 per cent more revenues for publishers using double click ad exchange.” “Many of these products that make people’s life easier are being powered by machine learning. One focus area for us this quarter has been enabling our machine learning algorithm to learn and make our products faster. Our ability to rapidly deploy the best machine learning in all of this quarter enabled us to launch all sorts of smart features to help moderate comments, suggest smart replies in Gmail and improve translations. We rolled out new machine learning features in Google maps, YouTube, Gmail and Google photos which now has more than 500 million monthly users who back up 1.2 billion photos and videos every day,” he said. Read more news about Digital Media, Internet Advertising,\r\nMarketing News, Television Media, Radio Media The Crumbling Cookie: A catalyst for growth in the cookieless era\n \n                                                                                                                            2 days ago Why marketers are going the CTV way to explore open internet\n \n                                                                                                                            3 days ago Google Ads Safety Report: 5.5 billion ads blocked or removed in 2023\n \n                                                                                                                            3 days ago Lenskart unveils campaign to launch French eyewear brand Le Petit Lunetier in India\n                                        7 hours ago ABP News bags 50 metals at enba 2023\n                                        17 hours ago NDTV wins 41 metals at 16th edition of enba\n                                        17 hours ago India Today & Aaj Tak shine at enba 2023 with 108 metals\n                                        17 hours ago ABP Network’s Avinash Pandey honoured with ‘CEO of the Year’ title at enba 2023\n                                        17 hours ago SEE MORE NewsNext Summit today: Industry stalwarts to discuss news broadcasting in digital era\n                                        1 day ago Tavleen Bhatia is the new CMRO of Cleartrip\n                                        2 days ago Zee prunes its Tech & Innovation Centre by 50%\n                                        1 day ago BW Businessworld & GMR Aerocity announce Aerocity Entertainment Fest 2024\n                                        1 day ago SEE MORE 1 second ago 1 second ago 1 second ago 1 second ago 1 second ago SEE MORE The announcement comes at a time when India is poised to become a global leader in AI innovation At the BW Businessworld’s Gen AI Summit 2024, Dubai-based artificial intelligence firm QX Lab AI and conversation media platform Bobble AI unveiled an exciting partnership poised to reshape the landscape of artificial intelligence.Specializing in generative AI solutions, QX Lab AI brings cutting-edge technology to the table, particularly through their Ask QX platform, which targets applications like chat functions. With a focus on accessibility and multilingual features tailored for the Indian market, QX Lab AI aims to revolutionize how AI interacts with users.On the other hand, Bobble AI is renowned for its suite of keyboard applications, offering features like stickers and AI recommendations to enhance conversations. Their flagship product, the Bobble Indic Keyboard, boasts a user base of over 50 million, underscoring their influence in the AI conversation space.Led by Indian-origin founders Tilakraj Parmar and Arjun Prasad, QX Lab AI, and Bobble AI, helmed by Ankit Prasad, have joined forces in a strategic partnership that holds immense potential. While the specifics of the collaboration are yet to be disclosed, both companies are expected to leverage their respective strengths to develop innovative products and services for their customers.The announcement comes at a time when India is poised to become a global leader in AI innovation. With the promise of fostering a thriving AI ecosystem, this partnership signifies a significant step forward in harnessing the power of artificial intelligence for societal and economic advancement.As the AI landscape continues to evolve, collaborations like this one are poised to drive innovation, accelerate technological advancements, and unlock new opportunities for consumers and businesses alike. Read more news about Digital Media, Internet Advertising,\r\nMarketing News, Television Media, Radio Media As per Google's transparency report, 9,012,232 videos and 20,592,341 channels were removed between October 2023 and December 2023 for violation of its guidelines YouTube has removed 2,254,902 videos in India for violation of its community guidelines, according to Google's transparency report. In all, the platform has removed 9,012,232 videos and 20,592,341 channels in the October 2023-December 2023 period. India leads in the number of videos removed on YouTube. According to the transparency report, a YouTube channel is terminated if it has violated three Community Guidelines in 90 days, has a single case of severe abuse (such as predatory behavior), or is determined to be wholly dedicated to violating the platform's guidelines. Last week, YouTube announced that it has launched a new tool that will require content creators to disclose to viewers when realistic content is made with generative AI and other altered or synthetic media. Read more news about Digital Media, Internet Advertising,\r\nMarketing News, Television Media, Radio Media Rakuten's Sunil Gopinath will also be speaking today at BW Businessworld Gen AI Summit 2024, to be held at The Imperial, New Delhi BW Businessworld is thrilled to announce the headline speakers for the upcoming BW Businessworld Gen AI Summit 2024. The summit, themed \"Building Generative AI for Bharat: Can India Become the Gen AI Capital of the World?\", is poised to delve into India's potential to lead the global conversation on generative artificial intelligence (AI). The esteemed headline speakers for the summit include:1.Sandip Patel, Managing Director, IBM India & South Asia2.Vishnu Vardhan, CEO & Founder, VIZZHY INC3.Sunil Gopinath, CEO Rakuten India These distinguished personalities bring a wealth of experience and insights to the summit, promising to enrich discussions and shape the future of AI in India and beyond. The summit, scheduled for Wednesday, March 27, 2024, at The Imperial, New Delhi, anticipates a diverse delegate profile. Professionals from various fields including generative AI, Machine Learning (ML), information technology, computer sciences, ethics, regulatory affairs, compliance, risk management, marketing, creatives, philanthropy through technology, entrepreneurs, intrapreneurs, governing bodies, academicians, and users of Gen AI in creatives & arts are welcomed to participate in this transformative dialogue. In addition to the headline speakers, the summit will feature esteemed speakers such as:1.Tilakraj Parmar, Co-Founder & CEO, QX Lab AI2.Tathagat Prakash, Co-Founder & Chief Scientist, QX Lab AI3.Arjun Prasad, Co-Founder & Chief Strategy Officer (CSO), QX Lab AI4.Santanu Bhattacharya, Scientist, MIT Media Lab5.Madhav Bissa, Program Director, NASSCOM AI6.Deepak Thomas, Founder & CEO, SVAYO7.Ayush Singhal, Founder & CEO, CodeMate.ai The BW Businessworld Gen AI Summit 2024 promises to be a pivotal event in shaping the trajectory of AI development in India and fostering collaboration among industry leaders, innovators, and stakeholders. Read more news about Digital Media, Internet Advertising,\r\nMarketing News, Television Media, Radio Media Prativa Mohapatra, VP & MD, Adobe India, spoke to e4m on the sidelines of the Adobe Annual Summit in Las Vegas that saw Adobe CEO Shantanu Narayen launching a Gen AI app for marketers The past few years have been a period of 'hyper-growth' for Adobe's digital media and digital experience business, said Prativa Mohapatra, Vice President & Managing Director of Adobe India, during an interaction with e4m on the sidelines of the annual Adobe Summit being held in Las Vegas, on March 26 and 27. Although specific figures were not disclosed, Mohapatra mentioned that Adobe witnessed double-digit growth in India in 2023. \"We are observing fantastic adoption of our creative suite of products. We have seen notable usage among top banks such as HDFC, ICICI and Axis Bank, as well as airlines like Air India, Indigo and Vistara,\" she added. Mohapatra also noted some sectors are yet to fully leverage Adobe products, namely heavy industries, the healthcare sector and B2B businesses, which are still hesitant to experiment with MarTech. \"While B2C companies have largely been early adopters, B2B adoption remains in progress. Although hospitals and healthcare in a few mature markets have embraced our products, there is room for growth in India,\" she remarked. The automotive sector, according to Mohapatra, is now showing increased interest in MarTech. \"After banking and airlines, we anticipate our third wave of collaboration with auto companies. We are currently in the process of finalizing several deals, which we will announce soon. With FMCG, our operations are predominantly global,\" she stated. “World over, businesses are prioritizing their digital investments to improve marketing agility and customer engagement, while driving growth and profitability. Adobe products are playing an essential role in driving the digital economy. We’re excited to be joined by our customers and partners from India, as we showcase our next in line innovations that will pave the way for customer experiences of the future,” Mohapatra added. The Adobe Summit commenced on Tuesday morning with a keynote session by Adobe Global CEO Shantanu Narayen, who made several key announcements and spoke of Adobe's collaboration with other companies, particularly those working with generative artificial intelligence and about establishing broad industry standards. \"Responsible innovation cannot be an afterthought. We are actively combatting misinformation by advocating for content credentials as an industry standard to establish trust in digital content,\" Narayen, also Chairman and President of the company, affirmed. He further explained how GenStudio, which builds upon Adobe’s generative artificial intelligence model released the previous year, is enabling planning, creation, management, and measurement of campaigns. Anil Chakravarthy, President of Digital Experience Business at Adobe, highlighted the transformative potential of generative AI in reshaping brand-customer relationships and driving profitable growth while delivering new digital experiences. Last year, Adobe launched Firefly, its image generation model, with plans to expand it to video, audio, and 3D model generation. Speaking of the reception of Firefly in India, Mohapatra noted that there was significant initial interest followed by gradual adoption. \"India is an experimental market. While Firefly initially received maximum attention in India, purchasing decisions take time here. Many digital marketing organisations have licensed Firefly in the past year, positioning themselves as early adopters. Additionally, some tech companies have also embraced it. As we move towards Firefly Image Model 2, we anticipate even higher quality images and pictures for our clients,\" Mohapatra concluded. Read more news about Digital Media, Internet Advertising,\r\nMarketing News, Television Media, Radio Media The account was won following a multi-agency pitch Admatazz, a Mumbai-based digital agency, has bagged the integrated social media and SEO marketing mandate of Boss Appliances. As part of the mandate, Admatazz will handle the creative communications of the brand across social media platforms like Facebook, Instagram, and LinkedIn to elevate social presence along with boosting organic traffic. Speaking on the account win, Yash Chandiramani, Founder and Chief Strategist at Admatazz, said, “We are glad to add Boss Appliances to our roster. As we grow as a company, we look to partner with brands who believe in our methods and approach, and we are glad Boss Appliances entrusted their digital presence duties to us. Our key aim is to strengthen the brand's digital presence by curating interesting content that can be made in this category and increasing the brand's reach and audience engagement.” Vidhi Gala, Director of Marketing at Boss Appliances added, \"As a brand that has been present for over four decades, we have always moved forward with the times, and as we see the digital and social media space grow rapidly and consumers become more active, we realise the need to strengthen our online presence. With Admatazz, we are glad to find like-minded agency partners who are enthusiastic and excited to build our brand as we do. We look forward to our association with them.” Read more news about Digital Media, Internet Advertising,\r\nMarketing News, Television Media, Radio Media The company has announced major updates in Adobe Experience Cloud and Adobe Creative Cloud that help brands activate generative AI to deliver customer value The Adobe Summit unveiled a suite of innovations for the enterprise that will empower brands to activate generative AI in how they create, deliver and measure customer experiences. The products expand the Customer Experience Management (CXM) solutions that enterprises have relied on to bring data, content, and customer journeys together to delight customers and build loyalty over time. “Generative AI enables a fundamental shift in the relationship between brands and their customers, creating a transformative moment for business leaders to drive profitable growth while delivering new digital experiences,” said Anil Chakravarthy, president, Digital Experience Business at Adobe. “The ability to personalize every interaction has become the key growth driver in Customer Experience Management for enterprises around the world, and Adobe is leading the way in making this a reality with powerful generative AI deeply integrated into existing workflows.” GenStudio With Adobe GenStudio, Adobe is unveiling a new generative AI-first application that empowers brands (and users of various skill levels) to create content, access brand-approved assets, measure performance of campaigns, and more. With connections across Adobe Experience Cloud and Adobe Creative Cloud applications, it provides everything a team needs to address their organization’s Content Supply Chain, which is an end-to-end business process that every company needs to deliver the content required for marketing campaigns and personalized customer experiences. For most organizations, however, their content supply chain is a web of disconnected workflows, teams and systems that often break down. At the same time, the demand for content that is personalized and engaging is exploding. GenStudio capabilities span: ⦁ Workflow & Planning: Allows users to track and view campaigns, manage campaign briefs, see tasks assigned to them, and more. GenStudio also connects directly to applications such as Adobe Workfront, Adobe’s project management software. ⦁ Creation & Production: Brands can find images and generate variations through Adobe Firefly, along with Custom Models that fine tune Adobe Firefly with a brand’s own assets, to ensure that content is on-brand. This unlocks personalization at scale for content creation and production, eliminating manual tasks. ⦁ Asset Management: A content hub allows users to easily find assets across their organization. It connects GenStudio with Adobe Experience Manager Assets—a leading digital asset management system used by brands to manage their library of images, videos and other content—where any user can search for an asset and also create personalized variations with Firefly in Adobe Express, the all-in-one content creation application. ⦁ Delivery and Activation: Brands can create different variations of marketing assets for different distribution channels, with copy that is both audience-centric and on-brand. Users will be alerted if content is not on-brand, with suggestions on how to remedy it. ⦁ Insights & Reporting: GenStudio provides a feedback loop for brands to understand which generated assets and campaigns are performing best, down to the attribute level. These attributes can then be used to inform generative AI prompts. GenStudio is also connected to Adobe Customer Journey Analytics, to drive a holistic measurement of customer experiences across channels such as web and mobile. In addition to GenStudio, Adobe is also unveiling generative AI capabilities in specific applications such as Adobe Experience Manager (AEM) Sites, a content management system that enables brands to create high-performance pages across any digital property (from web to mobile to apps). With the new AEM Sites variant generation, brands can take a single marketing asset and create numerous variations of copy that speak to different audiences. Teams can take a web page for instance and generate variants where the copy is personalized for target personas across different industries, job roles, age groups, and more. And with the new Adobe Content Analytics, brands can understand the performance of AI-generated content, down to the attribute level. The system can analyze and pinpoint elements (colors, objects, styles) that resonate with target audiences, providing a necessary feedback loop to ensure that AI-generated content also aligns with business goals. Adobe unveils Adobe Experience Platform AI Assistant The Adobe Experience Platform AI Assistant enables brands to boost the productivity of teams involved with delivering a great customer experience. It democratizes access to a broader set of users, while also helping individuals spur new ideas. This is made possible through a simple conversational interface that can answer technical questions and will automate tasks, simulate outcomes and generate new audiences and journeys within Adobe Experience Cloud applications. Users can ask questions to uncover high-performing customer segments for instance—or ask the AI Assistant to create a segment that is more likely to embrace a certain promotional offer. This can then be leveraged to drive widescale personalization campaigns. The AI Assistant can also help users leverage Adobe’s enterprise applications more effectively, through querying support materials in Adobe Experience League. Adobe Experience Platform AI Assistant brings all this to life with generative AI and a powerful conversational interface, as well as Adobe’s Generative Experience Models that bring together Large Language Models and Adobe’s product knowledge with unique insights based on customer data, campaigns, audiences and business goals—all in a brand-safe way and with a privacy-first mindset. New capabilities in customer journey orchestration Adobe also announced Adobe Experience Cloud innovations that empower brands to enhance customer engagement by orchestrating impactful cross-channel journeys. A new unified experimentation capability enables brands to increase the volume of tests to pinpoint customer paths that maximize conversion and drive reuse of offers across channels. Brands can support experimentation across content, channels and audiences, with machine learning models, and centralized administration to push winners and resolve conflicts. New capabilities in Adobe Journey Optimizer bring together brand-initiated and customer-initiated interactions within a journey. This ensures that as brands interact with consumers on channels such as the web, social media and mobile, any real-time changes in user behavior or preferences are captured, triggering new experiences. Adobe also unveiled Adobe Journey Optimizer B2B Edition, a new enterprise application built on Adobe Experience Platform. This enables sales and marketing teams to target specific buying groups within customer accounts, a departure from broad based marketing. It leverages unified data in Adobe Experience Platform and generative AI to personalize the journey, through a web chat bot for instance. Read more news about Digital Media, Internet Advertising,\r\nMarketing News, Television Media, Radio Media Mirum India will amplify ibis Hotels' digital presence Mirum India has won the digital mandate for ibis Hotels. Under this mandate, Mirum India will be the digital and social media agency of record (AOR) for ibis Hotels. Commenting on the partnership, Animesh Kumar, Commercial head - ibis & ibis Styles India, shared, “The partnership with Mirum India, marks a strategic move for ibis Hotels in our journey to reinforce our digital presence and connect more deeply with our audience. As we embark on this journey, we're committed to leveraging innovative digital strategies not only to amplify our presence but also to cultivate a vibrant digital community. Together with Mirum India, we aim to create immersive experiences that resonate with our guests, fostering lasting connections, and enhancing the essence of ibis Hotels.” Mirum India will play an important role in amplifying ibis Hotels' digital presence through strategic planning, media, production, and execution of comprehensive digital marketing campaigns. Mihir Karkare, Managing Director, Mirum India, expressed his excitement about the new partnership, \"If we look at the recent stats, domestic tourism is expected to bounce back to the pre-pandemic levels by 2024–25, with foreign tourist arrivals increasing by 435% over the next three years. With the opportunity that it presents for the Indian tourism sector, I believe this partnership couldn't have happened at a better time. The team is fueled with determination to elevate ibis Hotels' digital presence to even greater heights. Together, we're set to create a captivating digital landscape that will enable ibis Hotels to foster deeper connections with its audience and build brand loyalty.\" Read more news about Digital Media, Internet Advertising,\r\nMarketing News, Television Media, Radio Media exchange4media was set up in year 2000 with the aim of publishing niche,\n                            relevant and quality publications for the marketing, advertising and media professionals. ADSERT WEB SOLUTIONS PVT. LTD. 3'rd Floor, D-40, Sector-2, Noida (Uttar Pradesh), Pincode - 201301 (0120) 4007700 Connect With Us ! 25000+ Industry Leaders already read it everyday By clicking Sign Up, I agree to the Terms of Use and Privacy\n                                            Policy. "
}