{
    "title": "4 Reasons to Buy Baidu Stock Like There's No Tomorrow",
    "date": "3/27/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOGL/pressreleases/25090651/4-reasons-to-buy-baidu-stock-like-theres-no-tomorrow/",
    "text": "There's not a lot of love for Baidu(NASDAQ: BIDU) these days. Shares of the Chinese search engine leader have plummeted more than 70% since peaking three years ago. It's clearly out of favor, but that doesn't mean there isn't still a lot to like here. Baidu deserves better than this time capsule of greatness during the dot-com revolution in China. The stock could be a big winner from here. Let's go over four reasons why now could be a great time to pick up this former growth stock darling. I'll start with the value investor argument because that is the box that Baidu is checking best these days. With valuations of online leaders skyrocketing for U.S. stocks, you may be surprised at how cheap China's search pioneer is for the most popular valuation metrics. Baidu is currently trading for 13 times trailing reported earnings. If we shift gears to adjusted earnings, Baidu's multiple drops all the way down to 9. There aren't too many titans of tech trading at a trailing adjusted earnings multiple in the single digits. Google parent Alphabet(NASDAQ: GOOG)(NASDAQ: GOOGL) -- a fierce competitor to Baidu two decades ago before pulling out of China -- is currently fetching 26 times trailing earnings. The disparity grows wider if we head to the top line. Baidu is trading at an enterprise value that's 1.3 times last year's revenue. Alphabet's multiple clocks in at 5.8. This isn't a knock on Alphabet. Google is the global leader outside of China, and it's worthy of a market premium. I just want to illustrate how cheap Baidu is when you can buy it for 9 times trailing adjusted earnings and an enterprise value that is just 1.3 times last year's generated revenue. Image source: Getty Images. Baidu isn't cheap just by top- and bottom-line multiples. Even last year, when the stock essentially marched in place, Baidu consistently landed well ahead of Wall Street's adjusted earnings targets. Source: Yahoo! Finance. Baidu has provided positive quarterly earnings surprises of at least 23% over the past year. The fifth surprise -- a negative but opportunistic one -- is that the stock is trading slightly lower than where it was at the beginning of 2023. Analysts see Baidu posting an adjusted profit per share of $11.06 in 2024 and $12.20 come next year. What if Baidu keeps that streak of 23%-or-better bottom-line beats going? Either the stock finally wakes up and starts to move higher, or you're getting Baidu at less than 7 times next year's adjusted earnings. Baidu has always been more than just a search engine with a cash-rich balance sheet. It puts money to work in various emerging tech industries. Baidu has been working on machine learning, computer vision, and robotics for years. It was an early pioneer in autonomous driving technology. It even mentioned \"AI\" a whopping 62 times in last month's earnings call. Have you seen the rich multiples that investors are giving stateside leaders in artificial intelligence? Baidu's lack of growth is a problem. You have to go back to 2017 to find the last time it topped 20% revenue growth. Last year's 9% top-line climb isn't going to get growth investors excited. However, if just some of its next-gen technologies start to pay off, it's easy to see global investors bidding Baidu up again. Investing in international stocks has its risks, and those potholes widen as we get to China. There are challenges in the country, where censorship and anticapitalist sentiment can eat away at a platform's upside. There is also the growing tension between China and the U.S. and other global trade partners. It's not popular for stateside investors to buy Chinese stocks these days, but geopolitical conditions come and go. Growth also finds a way to rise. Along the way, you have a proven tech leader trading at a historically low valuation. Baidu is so flush with cash that its $36 billion market cap gets whittled down to an enterprise value below $24 billion as a result of its strong net-cash position. Betting on Baidu may be the most contrarian move you can make right now, but it could also be one of the best decisions you make in 2024. Should you invest $1,000 in Baidu right now? Before you buy stock in Baidu, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Baidu wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 25, 2024  Rick Munarriz has positions in Baidu. The Motley Fool has positions in and recommends Baidu. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Alphabet Cl A stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}