{
    "title": "Alphabet vs. Tesla: Which is the Best Magnificent 7 Stock to Buy Now?",
    "date": "3/15/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/indices/TXBE/pressreleases/24819536/alphabet-vs-tesla-which-is-the-best-magnificent-7-stock-to-buy-now/",
    "text": "The “Magnificent 7” group of stocks rallied impressively last year. and led the market from the front. However, in 2024 we haven’t seen those kind of one-dimensional moves in these mega-cap stocks. While Nvidia (NVDA) has continued its rally to become a $2 trillion company, Tesla (TSLA) and Apple (AAPL)are in the red this year. Tesla, in fact, is the worst-performing S&P 500 Index($SPX) stock of 2024 so far, and has lost roughly a third of its market cap. Alphabet (GOOG) stock is up just 2.4% in 2024, and is underperforming the 9.2% return of Nasdaq Composite ($NASX). Incidentally, GOOG is the worst-performing Magnificent 7 stock over the last decade. Clearly, the recent performance has been underwhelming, as well, and the stock has fallen hard after the last two earnings reports. Could Alphabet be the best “Magnificent 7” stock to buy now, amid concerns over soaring valuations for some of the other names in the market-leading group? Here’s what Ray Dalio and Ashwath Damodaran have to say on the Google parent. Dalio, who is the founder of hedge fund Bridgewater Associates, believes that both Meta Platforms (META) and Alphabet are “somewhat cheap.” Although at least a section of the market believes that stocks are getting overheated, Dalio is not too perturbed. “When I look at the U.S. stock market… it — and even some of the parts that have rallied the most and gotten media attention — doesn't look very bubbly,” said Dalio. Value investor Warren Buffett’s view on markets might be at odds with Dalio, though, considering the fact that the “Oracle of Omaha” has been a net seller of stocks for five consecutive quarters, and is sitting on a record cash pile. However, Dalio believes that among the Magnificent 7, only Tesla is “somewhat expensive” – an assertion that valuation guru Ashwath Damodaran couldn’t disagree with more. NYU professor Damodaran believes that Tesla is currently the cheapest Magnificent 7 stock. He did, however, single out Nvidia and Microsoft (MSFT) - in that order - for trading above their fair values. As for Apple, Alphabet, and Amazon (AMZN), the “dean of valuation” believes that all three are \"within striking distance of value.\" So, while Damodaran and Dalio might have starkly differing views on Tesla - which tends to be among the most polarizing stocks, anyway - they have somewhat similar views on Alphabet, as neither one of them believes the stock is overvalued. Wall Street analysts have given Alphabet stock a “Strong Buy” rating, and its mean target price of $160.69 is 11.3% above yesterday’s closing prices. Overall, 86% of analysts covering GOOG rate it as either a “Strong Buy” or “Moderate Buy.” Among the Magnificent 7, Meta Platforms, Microsoft, Nvidia, and Amazon are rated higher than GOOG among analysts, while Apple and Tesla are rated lower. In terms of the upside from the mean target price, Tesla scores above the rest - but that’s largely because of its recent underperformance, which has widened the gap between analysts’ target price and the current stock price. Alphabet stock looks attractive in terms of valuation, trading at a next 12-month (NTM) price-to-earnings (PE) multiple of 21x, which is the lowest among its Magnificent 7 peers.  GOOG’s valuation multiples have compressed over the last couple of years, both on an absolute as well as a relative basis. To be sure, markets have reasons to be apprehensive about Alphabet. The company’s dominance in digital advertisement is under threat from not only TikTok, but also U.S. tech peers like Amazon. To make things worse, Alphabet seems to be coming up short in the generative AI race. While the company rebranded its Bard chatbot as Gemini, the new avatar has been marred by controversy, and some responses have been flagged as racist, sexist, or even factually inaccurate. To be fair, contrary to popular belief, Bing’s market share in the global search market hasn’t exactly exploded since Microsoft added Copilot to the product. However, given its current dominance, the market share is Alphabet's to defend at a time when Microsoft continues to aggressively focus on the online search market. I believe that after the recent underperformance, Alphabet stock looks like a good buy. Analysts expect the company’s top line to rise 11.4% and 10.6%, respectively, in 2024 and 2025, while profits are expected to grow at an even sharper pace. While Alphabet continues to face headwinds - including on the regulatory front, as it battles accusations of monopoly in its Play Store policies - I find the risk-reward attractive at current prices, as the negatives seem more than baked into current stock prices. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Futures and Forex: at least 10 minutes delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}