{
    "title": "Why Alphabet Stock Rallied Monday Morning",
    "date": "3/18/2024",
    "url": "https://finance.yahoo.com/news/why-alphabet-stock-rallied-monday-154817094.html?prefer_reader_view=1&prefer_safari=1",
    "text": "Shares of Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) charged higher Monday, gaining as much as 7.8%. As of 10:49 a.m. ET, the stock was still up 7.1%. The catalyst that sent the tech giant higher was reporting that the company may have found its first big licensee for its artificial intelligence (AI) services. Alphabet is reportedly \"in active negotiations\" with Apple to license Google's Gemini to underpin certain AI-powered features in the iPhone, according to a story first reported by Bloomberg. The company may go so far as to integrate Alphabet's suite of AI tools into the device itself, according to the report, which cited \"people familiar with the situation.\" If the deal comes to pass, it would be the first clear indication that Alphabet has a market for its AI services beyond its cloud infrastructure offering, Google Cloud. Any such deal would extend an existing partnership between the pair, as Apple offers Google as the default search engine within its Safari web browser. It's still early days for generative AI, and it hasn't always been smooth sailing. Just last month, Alphabet temporarily suspended Gemini's image generation capabilities when it produced inaccurate representations of historical figures. Google took the features offline and apologized, saying: \"Gemini image generation got it wrong. We'll do better.\" This helps to illustrate that even the most advanced generative AI models are still a work in progress. Investors have questioned Alphabet's ability to capitalize on the AI opportunity and this is the first sure sign it's headed in the right direction. And the opportunity ahead is vast, though estimates span a wide range. Generative AI could be worth between $2.6 trillion and $4.4 trillion annually, according to global management consulting firm McKinsey & Company. That said, Alphabet is still a relative bargain, selling for 26 times earnings, a discount compared to the price-to-earnings (P/E) ratio of 28 for the S&P 500. A rebound in the digital advertising market -- Alphabet's bread and butter -- is ongoing, and the potential to profit from AI is significant. Now is the time to buy Alphabet stock before this fire sale is over. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 18, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet and Apple. The Motley Fool has positions in and recommends Alphabet and Apple. The Motley Fool has a disclosure policy. Why Alphabet Stock Rallied Monday Morning was originally published by The Motley Fool Related Quotes "
}