{
    "title": "GOOG Stock Warning: The One Thing That Could Threaten Alphabet's Dominance",
    "date": "1/29/2024",
    "url": "https://investorplace.com/2024/01/goog-stock-warning-the-one-thing-that-could-threaten-alphabets-dominance/",
    "text": " The king of search may have met its match Advertisement Source: achinthamb / Shutterstock.com Google parent Alphabet (NASDAQ:GOOGL,NASDAQ:GOOG) stock has been a phenomenal investment over the past decade returning double the S&P 500 on the back of search. Although cloud services are gaining more attention, advertising runs Alphabet. It accounts for 57% of total revenue and produces virtually all of the company’s operating income. While that has been driving GOOG stock higher, it is now very much at risk. Despite ad spending forecast for a comeback, the very foundations of Alphabet’s growth machine are being undermined. It poses a formidable challenge to Google’s dominance in the future. For that reason, I’m no longer convinced of Alphabet makes for a good long-term investment. Digital advertising cuts in 2022 and the early half of 2023 rocked ad-dependent stocks. Forbes recounts how spending growth went from almost 20% in 2021 to low-single-digit rates last year. Industry leaders including Google, Meta Platforms (NASDAQ:META) and The Trade Desk (NYSE:TTD) were all affected by ad dollars suddenly drying up. Now the money is flowing again, climbing each month in the back half of the year. Ad spending will exceed $1 trillion for the first time in 2024. That’s nearly double the growth rates from the prior year. The industry watchers at WARC say Alphabet, Alibaba (NYSE:BABA), Amazon (NASDAQ:AMZN), TikTok parent ByteDance, and Meta will attract over half the total. Their revenues will grow 11% this year with the rest of the industry being stagnant. Because search is where the lion’s share of digital ad spending goes, it means Alphabet’s dominance is most at risk if anything upends the status quo. And that something has arrived: artificial intelligence. The launch of OpenAI‘s ChatGPT was a breakthrough moment and heralded the sort of tumult that could upend Alphabet’s apple cart. In particular, it ushered in an additional threat from different search engines that now pose a serious threat to Google. Microsoft‘s (NASDAQ:MSFT) Bing has always been an afterthought for most users but after integrating ChatGPT throughout virtually all its tools and services, it now poses a credible challenge. Although Google is still the dominant player in search, Semrush notes Bing saw a massive increase in usage following the AI integration. The New York Times reported Samsung briefly considered dumping Google for Bing threatening a $3 billion hit to revenue. Although there was additional worry Apple (NASDAQ:AAPL) might follow suit when their contract expired, financial advisor Bernstein noted Google pays Apple between $18 billion and $20 billion annually to be its default search engine. That is enough incentive to lock the two together. Still, AI opened a wedge. Plugging a query into Google often gets you pages of hits having little to do with your search. A conversational query into Bing, which uses ChatGPT’s most up-to-date iteration, can get you nearer the mark. It allows you to drill down further with greater ease without parsing what Google’s algorithm needs. Alphabet isn’t standing around wringing its hands over the development. It created Bard, which is similar in format to ChatGPT, and a reportedly much more powerful generative AI platform, Gemini. It says the Ultra version outperforms ChatGPT-4 on critical massive multitask language understanding tests as well as other core tasks. While those are solutions to the current threat, the real problem is that AI can democratize search. ChatGPT is the most well-known chatbot but it also spawned a proliferation of alternatives. It is going to become a situation where users can turn to any platform for good results. Advertisers may not be willing to pay up for Google’s search, which could topple Alphabet’s revenue stream. It won’t happen today or even next year. But Alphabet’s search dominance now faces a real threat and that could challenge its standing as a long-term investment. On the date of publication, Rich Duprey did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Rich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets. Artificial Intelligence, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/goog-stock-warning-the-one-thing-that-could-threaten-alphabets-dominance/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}