{
    "title": "PREVIEW: Alphabet shares dip; seen reporting Q4 EPS, rev increases",
    "date": "1/30/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L1N3EK28X:0-preview-alphabet-shares-dip-seen-reporting-q4-eps-rev-increases/",
    "text": "** Shares in Google's parent Alphabet Inc GOOG down 0.8% on Tuesday ahead of Q4 financial report due out after market close, with analysts expecting strongest rev growth in over a year ** Wall Street sees GOOGL reporting adj EPS of $1.59 vs $1.05 EPS in year-ago quarter on rev of $85.3 bln, which would be up 12.2% y/y according to the latest data from LSEG. That would be highest pct qtrly rev increase since June qtr in 2022 ** In the last 8 quarters GOOGL beat EPS and rev consensus 4 times as it missed expectations every quarter in 2022 ** The bulk of the search giant's rev comes from advertising with $66.1 bln ad rev expected for Q4, which would be almost 12% higher than year-ago, per LSEG ** Also in focus is the company's cloud computing business, which in the third quarter quarter grew 22.5%, its slowest pace since Q1 2021, sending its shares down after its report ** Earlier this month Google said it was laying off hundreds of employees in ad sales, marking the latest cuts at the co ** YTD GOOGL shares up 9% after soaring ~58% in 2023 vs S&P 500 communications services index S5TELS, which is up 9.6% so far in 2024 after rising 54% in 2023 ** GOOGL last traded at $152.27 vs median PT of $155.50 according to LSEG, which shows 51 analyst ratings: 13 'strong buy,' 29 'buy' ratings and 9 'hold' recommendations Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}