{
    "title": "Alphabet (GOOGL) Q4 Earnings to Benefit From Google Cloud",
    "date": "1/26/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-q4-earnings-benefit-113600800.html",
    "text": "Alphabet’s GOOGL fourth-quarter 2023 results, scheduled to be released on Jan 30, are likely to reflect gains from its strengthening cloud service offerings.The company’s cloud services arm — Google Cloud — has become the key catalyst behind its business growth.Alphabet’s cloud offerings include Google Cloud Platform and Google Workspace, which have been continuously gaining momentum in the booming cloud computing market. Google’s growing investments in infrastructure, security, data management, analytics and AI have been the major positives.The Google Cloud segment, which derives revenues from fees collected for Google Cloud Platform services and Google Workspace collaboration tools, has constantly been driving substantial revenue growth for Alphabet.Revenues from the segment totaled $8.41 billion in third-quarter 2023. The figure accounted for 10.9% of total revenues and exhibited year-over-year growth of 22.5%.For fourth-quarter 2023, the Zacks Consensus Estimate for Google Cloud’s revenues is pegged at $9.04 billion, indicating growth of 23.6% from the prior-year quarter’s reported figure.Click here to know how the company’s overall fourth-quarter results are likely to be. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote GOOGL’s efforts in integrating data lakes, data warehouses, data governance and advanced machine learning into a single platform are expected to have bolstered its prospects in the cloud market during the to-be-reported quarter. Its strengthening efforts toward expanding its cloud services portfolio, data centers, availability zones and regions are likely to have helped it gain share in the highly competitive cloud market.This apart, its robust real-time data, analytics and AI, along with its open and scalable cloud infrastructure, is expected to have helped win customers during the to-be-reported quarter.The company’s deepening focus on generative AI might have been a major positive.In the fourth quarter, Google introduced its new, advanced, powerful, large language model, namely Gemini, which comes in three different sizes, Gemini Ultra, Gemini Pro and Gemini Nano.GOOGL announced the general availability of its suite of AI-powered assistance tools for code completion and generation, called Duet AI for Developers. It provides developers with real-time code suggestions, chat assistance and enterprise-focused customization. It focuses on code/boilerplate generation, inline code completion, code explanation and code security guardrails.Also, the growing momentum with the Vertex AI platform is likely to have contributed well.This apart, the solid adoption of generative AI-powered Workspace tools might have been another positive.The growing efforts of Google Cloud to identify cyber threats and automate security workflows and responses on the back of generative AI are likely to be reflected in the upcoming results. Currently, Alphabet has a Zacks Rank #3 (Hold).Some better-ranked stocks in the broader technology sector are Arista Networks ANET, Logitech International LOGI and Itron ITRI, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Arista Networks' shares have returned 116.5% over the past year. The long-term earnings growth rate for ANET is 19.77%.Shares of Logitech International have returned 23.2% over the past year. The long-term earnings growth rate for LOGI is 15.75%.Shares of Itron have risen 22.3% over the past year. The long-term earnings growth rate for ITRI is 23%.Stay on top of upcoming earnings announcements with the Zacks Earnings Calendar. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Logitech International S.A. (LOGI) : Free Stock Analysis Report Itron, Inc. (ITRI) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Arista Networks, Inc. (ANET) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}