{
    "title": "Google parent Alphabet to cut more jobs, this unit to be impacted: Report",
    "date": "1/24/2024",
    "url": "https://www.hindustantimes.com/business/google-parent-alphabet-to-cut-more-jobs-this-unit-to-be-impacted-report-101706061515287.html",
    "text": "Subscribe Now! Get features like X (not to be confused with Elon Musk's X, formerly Twitter), a moonshot factory for artificial intelligence (AI) owned by Google parent Alphabet Inc., is laying off ‘dozens of employees’ in an effort to turn to external investors to help fund its ventures, according to Bloomberg News. The job cuts will reportedly impact the X support staff. Also, while there is no official word yet on whether the Alphabet unit will indeed see the layoffs, Astro Teller, its CEO, in an email to employees, recently said that the company will continue to emphasise on 'lean teams.' “We are expanding our approach to focus on spinning out more projects as independent companies funded through market-based capital. We will do this by opening our scope to collaborate with a broader base of industry and financial partners, and by continuing to emphasize lean teams and capital efficiency,” Teller wrote. It is this ‘restructuring' under which the Alphabet-owned firm will carry out these layoffs, the Bloomberg report said quoting a source, adding that the division has, in recent months, ramped up discussions on funding with venture capitalists and other investors. X staffers had explored raising outside capital for their ventures in the past, but ran into ‘concerns’ from Alphabet leadership, the report further stated. This year, Google has already laid off ‘hundreds of employees’; those terminated include Fitbit co-founders James Park and Eric Friedman. CEO Sundar Pichai, however, has warned about ‘more job cuts’ in the coming months. Last year, the tech giant eliminated around 12,000 roles, the largest such number in its history.    Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}