{
    "title": "Google CEO Sundar Pichai warns of more layoffs. How does he plan to compete \nwith Microsoft in creating AI",
    "date": "1/22/2024",
    "url": "https://m.economictimes.com/news/international/us/google-ceo-sundar-pichai-warns-of-more-layoffs-how-does-he-plan-to-compete-with-microsoft-in-creating-ai-systems/articleshow/107060835.cms",
    "text": "(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. (Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates.  IPO report card: 2024 can be one of the best years by listing gains. But investors must be cautious. JSW’s EV juggernaut: Odisha gets an INR40k crore project, and MG an Indian touch From Leh to Varanasi, via Vikhroli: Sister takes Pepperfry’s Ambareesh Murty on his final journey No free gifts to doctors, but latest government diktat is still not effective Indians shell out as much as Americans on transportation. And it’s a worrying sign. Here’s why. Retail investors ride momentum in the hunt for multibaggers. How long will the party last? Ghazipur SP warns Mukhtar Ansari's supporters Hemant Soren's wife meets Sunita Kejriwal in Delhi Trump challenges Fani Willis' stay in Georgia case Gaza War: Fresh updates from Shifa Hospital raids Chaudhary Charan Singh conferred with Bharat Ratna MS Swaminathan posthumously conferred with Bharat Ratna Know Saudi Arabia's 1st ever Miss Universe participant '27-28 parties to join INDIA bloc rally in Delhi' Key updates on Baltimore bridge collapse P V Narasimha Rao conferred with Bharat Ratna Trending Now Hot on Web In Case you missed it Top Calculators Top Definitions Top Slideshow Top Videos Top Searched Companies Top Prime Articles Private Companies Top Commodities Top Story Listing Follow us on: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin. Log In/Connect with: Will be displayed Will not be displayed Will be displayed Stories you might be interested in "
}