{
    "title": "GOOGL Stock Falls As Google Earnings Beat Amid 2024 Spike In Capital \nSpending",
    "date": "1/31/2024",
    "url": "https://www.investors.com/news/technology/googl-stock-google-earnings-q42023/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Google parent Alphabet (GOOGL) reported fourth quarter earnings and revenue that topped consensus estimates. But GOOGL stock fell as the core advertising business slightly missed views amid worries over how the rise of generative artificial intelligence will impact internet search. Wall Street analysts on Wednesday hiked 2024 capital spending estimates in the wake of Google management commentary on rising AI investments. Reported after the market close on Tuesday, Google earnings for the quarter ending Dec. 31 jumped 56% to $1.64 a share. The tech giant reports Google earnings under generally accepted accounting principles, also known as GAAP. In Q4, Google's gross revenue rose 13% to $86.31 billion. Cloud computing revenue growth re-accelerated and beat estimates. Analysts polled by FactSet had projected EPS of $1.60 on revenue of $85.25 billion. Also, Google's Q4 advertising revenue rose 11% to $65.52 billion, just below estimates of $65.82 billion. One view is that the rise of generative artificial intelligence and Microsoft's (MSFT) alliance with startup Open AI will change how big brands buy digital advertising. \"Gen AI impacting search remains bear case No. 1 on Google stock and this quarter won't alleviate that concern, in our view,\" said RBC Capital analyst Brad Erickson in a report. He added that guidance for Google's capital spending in 2024 came in much higher than expected. \"Capex guide like whoa,\" Erickson added. \"Management guided for 'notably higher capex' in 2024 versus 2023's commentary of 'modestly higher'.\" \"To us, (this) gives off the impression that gen AI's capital intensity is catching management a bit off-guard. Given the company is still in the rollout phase of gen AI tools for search in particular, the capex intensity bear case is arguably playing out at this point.\" Erickson holds an out-perform rating on GOOGL stock. Wall Street analysts polled by Factset now estimate Google's 2024 capital spending at $40 billion, up 25% from last year. Some estimates are higher. Deutsche Bank raised its capital spending estimate to $46 billion. TD Cowen estimates $45 billion for 2024. Deutsche Bank analyst Benjamin Black said in a report: \"While concerns around the capex investment cycle dominate headline, we think these interments are clearly geared towards supporting (commercial) search query growth from here, and also driving deeper penetration into the small- and medium business advertiser base.\" Google said cloud-computing revenue rose 25% to $9.19 billion, topping estimates of $8.94 billion. Google's cloud-computing business posted 22% growth in the September quarter. Meanwhile, YouTube ad revenue rose 15% to $9.2 billion, in-line with estimates. On the stock market today, GOOGL stock fell 7.5% to close at 140.10. \"We would like to point out that this is a fundamentally stronger quarter — gross revenue, search, YouTube, and cloud and Google other revenues all accelerated quarter-over-quarter,\" said Evercore ISI analyst Mark Mahaney in a report. He added: \"That said, we believe the price actions following the print reflect the higher expectations that weren't exceeded.\" In Q4, Google repurchased $16.2 billion of its own stock. In the September quarter, it repurchased $15.78 billion. Also, Google's Q4 traffic acquisition costs rose 8% to $13.98 billion. Google's internet search-related payments to Apple (AAPL) are a key issue in the Department of Justice's antitrust lawsuit vs. Alphabet. Google rebounded from a sell-off after it reported September quarter 2023 results. GOOGL stock sold off 13% on Oct. 25, the first day of trading after the Q3 report. Shares hit a low of 121.46 on Oct. 27. But Google stock went on to rally 26% over the next three months before today's Q4 Google earnings report. Heading into the Google earnings report, Alphabet shares had gained 9% in 2024. In 2023, Google stock climbed 58% in 2023, though other big cap tech stocks — Meta Platforms (META), Amazon.com (AMZN) and Netflix (NFLX) did even better. Also, GOOGL stock holds a Relative Strength Rating of 89 out of a best-possible 99, according to IBD Stock Checkup. Meanwhile, Google stock is extended and trades above a buy zone. Follow Reinhardt Krause on X, formerly called Twitter, @reinhardtk_tech for updates on artificial intelligence, cybersecurity and cloud computing. YOU MIGHT ALSO LIKE: Fed Rate Cuts And The S&P 500: Are We About To Party Like It's 1999 Again? IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Learn How To Time The Market With IBD's ETF Market Strategy Get Free IBD Newsletters: Market Prep | Tech Report | How To Invest These Seven Stocks Lead Huge Earnings Wave; What To Do 3/29/2024\nBuying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the... 3/29/2024\nBuying a stock is easy, but purchasing the right stock... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}