{
    "title": "Google CEO Warns Of More Job Cuts In What's A Horror Year – channelnews",
    "date": "1/19/2024",
    "url": "https://www.channelnews.com.au/google-ceo-warns-of-more-job-cuts-in-whats-a-horror-year/",
    "text": "After announcing more than 1000 job cuts in 2024 already, Google is foreshadowing even more cuts and is additionally slashing jobs at YouTube. The trail blazing tech giant once had bottomless pockets to employ the worlds best up-and-coming staff. It is now pinned against the economic wall, facing the same industrial problems as other companies on the planet. In the wake of two rounds of job cuts announced in the past week, Alphabet and Google CEO Sundar Pichai has warned of more job cuts on the way, as the company hones its attention on the AI race. There’s a growing perception that Google is falling behind in that race, after leading it for many years, developing machine learning devices and releasing Google Tensor. The sudden rise of OpenAI, its release of ChatGPT and generative AI, and its partnership with Microsoft has put Google on the back foot. Microsoft, meanwhile, has taken all before it, challenging Apple as the US’s most valuable company. This week Microsoft launched a commercial AI product, Copilot Pro, that will see it snare billions of dollars in new revenue from the generative AI market. Google instead seems to be flatfooted in the market dealing with job cuts, and spooked by the success of Microsoft. Google, which reduced its staff numbers by more than 12,000 in 2023, announced another 1000 cuts to its Pixel, Fitbit and Nest teams little more than a week ago. A few days ago it announced several hundred more job cuts in its advertising and sales teams. Two days ago, The New York Times reported that Google would cut 100 jobs at YouTube. Now Mr Pichai is warning of more cuts in a memo to staff obtained by the media, entitled “2024 priorities and the year ahead”. It suggests Google is consolidating its efforts behind AI developing and downscaling other activities. “We have ambitious goals and will be investing in our big priorities this year,” Mr Pichai says. “The reality is that to create the capacity for this investment, we have to make tough choices. “I know it’s very difficult to see colleagues and teams impacted.” News of the job cuts hasn’t negatively impacted the share price of Google’s parent Alphabet which is up 58 percent in a year and remains close to its November 2021 all-time high.  02 9002 5900 [email protected] Level 1, 275 Alfred Street\nNorth Sydney\nNSW 2060\nAustralia  "
}