{
    "title": "Alphabet (GOOGL) to Post Q4 Earnings: What's in the Offing?",
    "date": "1/25/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-post-q4-earnings-155100440.html",
    "text": "Alphabet GOOGL is scheduled to report fourth-quarter 2023 results on Jan 30.For the quarter under review, the Zacks Consensus Estimate for revenues is pegged at $70.71 billion, indicating an improvement of 12% from the year-ago reported number.The consensus mark for earnings is pegged at $1.60, indicating 52.4% growth from the previous year’s reported figure. The figure has been stable over the past 30 days.The company surpassed the Zacks Consensus Estimate in three of the trailing four quarters while missing in the remaining one, delivering an earnings surprise of 4.62%, on average. Alphabet Inc. price-eps-surprise | Alphabet Inc. Quote The company’s continued efforts toward innovation in artificial intelligence (AI) techniques for the advancement of its search segment, which accounts for a major portion of its total revenues, are expected to have driven traffic on its platform in the to-be-reported quarter.The integration of generative AI technology into the search engine might have continued to benefit Google Search. With the large language models (LLM)-powered enhanced search results, GOOGL is likely to have driven its search momentum in the fourth quarter.Bard’s integration might have been a major positive for the company's search platform. Assistant with Bard, which aids in generating better AI-backed search results, is likely to have boosted the search traffic further.The Search Generative Experience (SGE), which leverages generative AI technology to make search results more natural and intuitive, is likely to have contributed well.This, along with strength across Google Lens and Google Maps, is expected to have contributed well to the fourth quarter’s Search performance.The Zacks Consensus Estimate for Google Search & Other revenues is pegged at $47.84 billion, indicating an increase of 12.3% from the year-ago quarter’s reported figure.Coming to the advertisement business, Alphabet’s growing efforts to deliver better performance and profitability to advertisers on the back of foundational research models and LLMs are expected to have contributed well.SGE is expected to have aided the advertisement business as it can create relevant, customized and high-quality ads.Stabilization in advertisers’ spending is expected to have benefited the advertising business. The strength in conversational experience of Google Ads and Performance Max is likely to have driven the company’s momentum among advertisers during the fourth quarter. The improving performance of YouTube ads might have been another positive.However, softness in Network advertising might have been a major concern.The consensus mark for Google advertising is pegged at $65.45 billion, suggesting growth of 10.8% from the reported figure in the prior-year quarter.Coming to the non-advertisement revenues of YouTube, strengthening user momentum in YouTube Shorts might have been a tailwind. Google’s growing efforts to bolster relationships with content creators are likely to have acted as a positive.The introduction of major updates and various user-friendly features of YouTube Premium is likely to have bolstered the Premium subscriber base in the quarter under review. Also, solid momentum in Connected TV might have been a plus.These factors might have driven growth in Google’s Other revenues, for which the consensus mark is pinned at $9.65 billion, indicating growth of 9.7% from the year-ago reported figure.The growing momentum across Android 14 is likely to have benefited Alphabet’s performance in the to-be-reported quarter.All the abovementioned factors are expected to have benefited Google’s Services segment’s performance in the fourth quarter.The Zacks Consensus Estimate for Google Services revenues is pegged at $74.95 billion, suggesting growth of 10.5% from the year-ago reported figure. Alphabet’s go-to-market strategy, expanding cloud service portfolio and strengthening cloud infrastructure, including data centers and cloud regions, is expected to have benefited Google Cloud’s fourth-quarter performance.The solid adoption of the Google Cloud Platform and Google Workspace is likely to have contributed well to the performance of the Google Cloud segment in the quarter under review.The Zacks Consensus Estimate for Google Cloud revenues is pinned at $9.04 billion, indicating growth of 23.6% from the reported figure in the prior-year quarter.Alphabet’s strengthening efforts toward bolstering its healthcare technology portfolio are expected to have driven growth in its Other Bets segment during the fourth quarter.The Zacks Consensus Estimate for Other Bets revenues is pegged at $251 million, indicating growth of 31.9% from the year-ago quarter’s reported figure. Our proven model predicts an earnings beat for Alphabet this time around. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the odds of an earnings beat. That is the case here, as you will see below.Alphabet has an Earnings ESP of +2.26%. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.GOOGL carries a Zacks Rank #3 at present. Here are some other companies that, too, per our model, have the right combination of elements to post an earnings beat in the soon-to-be-reported quarterly results.Apple AAPL has an Earnings ESP of +2.13% and a Zacks Rank #2 at present. You can see the complete list of today's Zacks #1 Rank stocks here.Apple is scheduled to release first-quarter fiscal 2024 results on Feb 1. The Zacks Consensus Estimate for AAPL’s earnings is pegged at $2.08 per share, suggesting a jump of 10.6% from the prior-year quarter.A. O. Smith AOS has an Earnings ESP of +3.80% and a Zacks Rank #2 at present.A. O. Smith is set to report fourth-quarter 2023 results on Jan 30. The Zacks Consensus Estimate for AOS’s earnings is pinned at 95 cents per share, suggesting growth of 10.5% from the prior-year period’s reported figure.Fortive FTV has an Earnings ESP of +0.64% and a Zacks Rank #2 at present.Fortive is scheduled to release fourth-quarter 2023 results on Jan 31. The Zacks Consensus Estimate for FTV’s earnings is pinned at 93 cents per share, indicating growth of 5.7% from the year-ago quarter.Stay on top of upcoming earnings announcements with the Zacks Earnings Calendar. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report A. O. Smith Corporation (AOS) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Fortive Corporation (FTV) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}