{
    "title": null,
    "date": "2/2/2024",
    "url": "https://finance.yahoo.com/news/analysts-made-financial-statement-alphabet-124603633.html",
    "text": "Shareholders might have noticed that Alphabet Inc. (NASDAQ:GOOGL) filed its full-year result this time last week. The early response was not positive, with shares down 7.2% to US$141 in the past week. It was a credible result overall, with revenues of US$307b and statutory earnings per share of US$5.80 both in line with analyst estimates, showing that Alphabet is executing in line with expectations. Earnings are an important time for investors, as they can track a company's performance, look at what the analysts are forecasting for next year, and see if there's been a change in sentiment towards the company. We've gathered the most recent statutory forecasts to see whether the analysts have changed their earnings models, following these results. View our latest analysis for Alphabet Taking into account the latest results, the consensus forecast from Alphabet's 47 analysts is for revenues of US$342.2b in 2024. This reflects a notable 11% improvement in revenue compared to the last 12 months. Statutory earnings per share are predicted to grow 14% to US$6.76. Before this earnings report, the analysts had been forecasting revenues of US$340.3b and earnings per share (EPS) of US$6.68 in 2024. The consensus analysts don't seem to have seen anything in these results that would have changed their view on the business, given there's been no major change to their estimates. There were no changes to revenue or earnings estimates or the price target of US$163, suggesting that the company has met expectations in its recent result. Fixating on a single price target can be unwise though, since the consensus target is effectively the average of analyst price targets. As a result, some investors like to look at the range of estimates to see if there are any diverging opinions on the company's valuation. Currently, the most bullish analyst values Alphabet at US$180 per share, while the most bearish prices it at US$140. This is a very narrow spread of estimates, implying either that Alphabet is an easy company to value, or - more likely - the analysts are relying heavily on some key assumptions. Of course, another way to look at these forecasts is to place them into context against the industry itself. We would highlight that Alphabet's revenue growth is expected to slow, with the forecast 11% annualised growth rate until the end of 2024 being well below the historical 17% p.a. growth over the last five years. Juxtapose this against the other companies in the industry with analyst coverage, which are forecast to grow their revenues (in aggregate) 9.7% annually. Factoring in the forecast slowdown in growth, it looks like Alphabet is forecast to grow at about the same rate as the wider industry. The most obvious conclusion is that there's been no major change in the business' prospects in recent times, with the analysts holding their earnings forecasts steady, in line with previous estimates. They also reconfirmed their revenue estimates, with the company predicted to grow at about the same rate as the wider industry. The consensus price target held steady at US$163, with the latest estimates not enough to have an impact on their price targets. With that said, the long-term trajectory of the company's earnings is a lot more important than next year. We have forecasts for Alphabet going out to 2026, and you can see them free on our platform here. You can also see our  analysis of Alphabet's Board and CEO remuneration and experience, and whether company insiders have been buying stock. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}