{
    "title": "Why Alphabet Stock Stumbled Thursday Morning",
    "date": "2/15/2024",
    "url": "https://www.fool.com/investing/2024/02/15/why-alphabet-stock-stumbled-thursday-morning/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Shares of Alphabet (GOOGL 0.04%) (GOOG 0.21%) slipped on Thursday morning, falling as much as 3.8%. As of 12:32 p.m. ET, the stock was still down 2.7%. The catalyst that sent the tech giant lower was troubling reports involving collisions within the company's Waymo self-driving car unit. Reports emerged late yesterday that Waymo was forced to recall the software that controls its self-driving cars. The company noted that all the cars in its current fleet had been updated, but the cause of the recall was equal parts humorous and troubling. Waymo filed a voluntary recall report with the National Highway Traffic Safety Administration for software that had previously powered its fleet. The company cited two separate \"incidents\" that occurred in Phoenix, Arizona, on Dec. 11. It seems that a Waymo self-driving car \"made contact\" (read \"crashed\") with a pickup truck that was being hauled by a tow truck. The company notes that the truck was being \"improperly towed,\" which caused it to consistently veer between lanes of traffic. Following the collision, the tow truck driver failed to stop, and another Waymo vehicle crashed into the pickup just moments later. The company was quick to note that neither Waymo vehicle had passengers at the time, resulting in no injuries and only \"minor vehicle damage.\" Self-driving cars have been making headlines in recent months -- and not in a good way. Earlier this month, a Waymo vehicle had a collision with a cyclist in San Francisco, who suffered only minor injuries. A week later, a crowd surrounded and set fire to a Waymo vehicle in the same city -- presumably in response to the earlier incident, though the matter is still under investigation. This all comes just months after General Motors recalled all 950 of its Cruise robotaxis. A pedestrian, who was the victim of a hit-and-run accident, had been catapulted into an adjacent lane where they were struck by a Cruise self-driving car and dragged after the vehicle wasn't able to stop. Self-driving cars don't move the needle for Alphabet, but some investors believe the technology has the potential to be a significant growth driver in the future. There are plenty of reasons to buy Alphabet stock, but it's clear self-driving isn't yet ready for prime time. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}