{
    "title": "Sundar Pichai Net Worth 2024: Salary, $1.3 Billion Assets",
    "date": "2/7/2024",
    "url": "https://caknowledge.com/sundar-pichai-net-worth/",
    "text": "Home » Net Worth » Business » CEOs » Sundar Pichai Net Worth 2024: Salary, $1.3 Billion Assets It is estimated that Google has a brand value of around $1940 billion as of 2024. The CEO of such a brand value, Mr. Sundar Pichai has a net worth of $1310 million ($1.31 Billion), which in Indian currency is approximately 10,810 crores Indian rupees. Mr. Pichai gets an annual income of around 242 million USD i.e. 1880 crores INR. Apart from such a massive earning, comes a huge responsibility towards society. Under Mr. Pichai, Google raises donations for several educational institutes, and funds for various small technical companies, and supports the transition towards taking the world towards a digital era. Mr. Sundar Pichai owns over 3,000 units of Alphabet Inc stock worth over $177,596,126 and over the last 6 years, he sold GOOG stock worth over $978,292,670. In addition, he makes $280,622,016 as Chief Executive Officer and Director at Alphabet Inc. Other compensation includes personal security costs, travel expenses, and other miscellaneous items and Total compensation is the sum of annual base salary, stock awards, and other compensation. Please note that Pichai’s base salary has remained steady at $2 million since 2018. Sundar Pichai (47) received a package of $242 million (Rs 1880 crore) after becoming the CEO of Alphabet. This includes basic salaries of $2 million (Rs 15 crore) and $240 million (Rs 1865 crore) in annual share. Pichai’s new salary package will be applicable from 1 January 2020. Advertisement However, out of $240 million, the $120 million stock award will be received in quarterly installments. The rest of the annual performance will be based, ie if all the targets are met by Pichai, shares will be available in three years. Alphabet gave this information on Friday. On December 4, Pichai was announced to be CEO of Google’s parent company Alphabet. These are daily averages based on annual figures. Pichai’s actual daily earnings will vary depending on stock performance and vesting schedules. 1880 crore package to Alphabet CEO Sundar Pichai; Basic salary will be 15 crores, 1865 crores shares In order to know about his net worth, we need to analyze his major assets. Promotion to CEO: On December 3, 2019, Google announced that company co-founders Larry Page and Sergey Brin had stepped fully aside and Sundar had been promoted to CEO of the full Alphabet conglomerate. Let us now have a look at the assets he possesses: SUNDAR PICHAI bought a luxurious home in the year 2013, the value of his luxurious home is estimated to be around 2.9 million USD. Mr. Pichai also owns several real estate properties in India. Mr. Pichai has a good collection of luxury cars in the world. His car brands include Porsche, BMW, Range Rover, and Mercedes Benz. Average Income: Mr. Pichai takes home a massive 242 million USD annually. Investments: Mr. Pichai has also invested a huge amount of money at various sources across the globe. His personal investment is estimated to be around 572.5 million USD. Let us have a look at the facts about Mr. Sundar Pichai whose Approx Annual Earnings for the last few years are a part of his net worth: *Mr.  Pichai was the head of many different projects until 2015. In October 2015, he stepped in as a CEO, Soon after becoming the CEO of Google Inc. Mr. Pichai’s net growth had a rapid rise. His rise from a project head to the CEO of the company is the most significant way that tells us the rise of Pichai is consistent. Considering his current performance and annual growth of the company as well as an individual, we can be very positive about his net worth which will be growing through the years to come. Sundar Pichai is an American citizen of Indian origin. Who is the CEO of the “Google Search” section of Alphabet Company, the largest company in the tech sector On 10 August 2015, he was elected as the new executive of Google Search, and on 2 October 2015, Sundar Pichai took his position. Google is currently being managed by Sundar Pichai. Not only this, but he is also the CEO of Alphabet along with Google. Sundar Pichai has shared the breakfast routine. They believe that breakfast only gives them the energy to start the day. The man who has been an integral part of such an amazing creation is Mr. Sundar Pichai, he is the chief executive officer (CEO) of Google Inc. The Estimated Net Worth of Sundar Pichai is $1310 million (1.31 Billion) (nearly Rs 10,810 crore) in 2024. Here, we will discuss this Indian – American business executive Mr. Sundar Pichai, who manages to administer such a huge company, which has over 53,000 employees across the globe. Mr. Pichai has made every Individual proud, when he was made the head of such a great institution and has earned tremendous respect from every Indian across the nation. To be a part of such a massive institute comes the great responsibility, and with every successful effort comes great prize. Sundar Pichai net worth is $1310 Million (Rs. 10,810 Crores) Sundar Pichai monthly income is $20 Million. Sundar Pichai earns an estimated salary of $242 Million Per Year. Sundar Pichai is Born 10 June 1972 (age 51 years). Currently, Sundar Pichai is 51 years old (10 June 1972). The height of Sundar Pichai is 5 ft 11 in (1.80 m). Recommended Articles: Comment  Devin Singletary Net Worth 2024: Salary, Age, Income & Wife Ethan Horvath Net Worth 2024: Age, Wife, Salary and Assets Ryne Sandberg Net Worth 2024: Earnings, Assets, & Wife Marlon Humphrey Net Worth 2024: Age, Wife, Salary and Assets Terry Rozier Net Worth 2024: Earnings, Contract, & Family CA knowledge offers Net Worth, taxation, Banking & financial solutions to individuals, businesses, and organizations all over the world. \"Here you can enhance your knowledge on various topics related to finance & accountancy related topics like taxation, management, accounting, business law, corporate law banking, stock market, investment, and many more. GST taxation Money Cryptocurrency Insurance Judiciary Stock market Files Banking Online Test Tally Accounting HR Formats Interviews About Us Contact Us Privacy Policy Advertise Key Difference Judiciary Technology Tucker Carlson Net Worth | Hunter Biden Net Worth | Ron DeSantis Net Worth | Blippi Net Worth | Logan Paul Net Worth | Kanye West Net Worth | Andrew Tate Net Worth © 2024 CAknowledge.com • ❤️ From Your HeartThe materials and information provided on this website are for reference purposes only. "
}