{
    "title": "7 Stocks That Google's Updated AI Wants You to Buy",
    "date": "2/26/2024",
    "url": "https://finance.yahoo.com/news/7-stocks-google-updated-ai-224500976.html",
    "text": "Alphabet’s (NASDAQ:GOOG, NASDAQ:GOOGL) Google has been on an AI roll lately. It released its conversational AI model Gemini back in early December of last year. Since then, it has rapidly iterated and integrated Gemini across many Google products. Just two weeks ago, Google unveiled Gemini 1.5, which it claims is superior to competitors like OpenAI’s GPT-4. We can’t objectively say one AI is “better” than another in a general sense. Each has strengths and weaknesses for different applications. However, one area where Google’s AI excels is picking stocks to buy. Months ago, Google’s Bard AI beat human experts and other AI models at choosing profitable stocks picks. Could the new Gemini 1.5 update improve its stock-picking skills further? That remains to be seen since even an advanced AI has no special knowledge of future market moves. Nonetheless, tapping its suggestions could give individual investors an edge. After all, Google’s AI has access to far more data and analytics than any one person could compile. Let’s have a look at some stocks to buy! InvestorPlace - Stock Market News, Stock Advice & Trading Tips Source: Karol Ciesluk / Shutterstock.com Datadog (NASDAQ:DDOG) is a cloud monitoring and analytics platform that has become a Wall Street darling. The stock has nearly doubled since last April, so it’s no surprise that Google’s Gemini AI likes this name. After turning profitable in 2023 with $2.1 billion in revenue and $48.6 million in net income, Datadog clearly has solid financials and growth metrics. Of course, profits still seem small for now, but I see a newly-profitable company with much more potential ahead. Analysts forecast Datadog’s earnings per share to increase 9-fold from 2024 to 2033. You’re paying around 90 times forward 2024 earnings for that growth at current prices. Is it worth the premium valuation? That’s for each investor to decide. I’m not convinced this is the best choice of stocks to buy today. At over 16 times forward sales, Datadog already trades richly versus other software stocks. While I see 20-30 % more upside in 2024, anything beyond that would make the stock significantly overvalued. As a general rule, cloud stocks trading above 20 times sales look overheated to me. DDOG isn’t quite there yet, but it’s getting close. I’d wait for a better entry point before jumping in. Source: Sundry Photography / Shutterstock.com Fortinet (NASDAQ:FTNT) provides cybersecurity solutions for networks, applications and access. As another software pick, this selection aligns with Google’s AI preference for tech names riding Wall Street’s favor. Compared to Datadog, Fortinet’s valuation looks more reasonable, though its growth is admittedly lower, too. At around 40 times 2024 earnings, you’re paying for an expected 4-5x EPS expansion over the next decade. Meanwhile, annual revenue growth is seen steady around 15% this decade. Fortinet trades at a forward price-to-sales ratio of 9x and a similar value proposition to Datadog. If you believe software stocks will continue getting rewarded by Mr. Market, I’d say Fortinet is a fine choice among stocks to buy — though it’s not a screaming bargain. In my view, there are some more attractively priced software plays out there. Still, I wouldn’t be surprised to see Fortinet gain 30% or more from current levels, assuming the tech bull market persists. It’s a quality name at a fair price right now. Source: IgorGolovniov / Shutterstock.com Now, here’s an interesting option in stocks to buy. Lithia Motors (NYSE:LAD) is a leading automotive retailer with 290 stores and 70,000 vehicles nationwide. The company offers new vehicles across 47 brands and used vehicles of all types, both in-store and online. Lithia also provides vehicle servicing and certified pre-owned options. The fact that Gemini chose an auto dealer over the usual tech fare caught my attention. There may be untapped potential that the average investor overlooks here. Despite missing Q4 top-line estimates, Lithia still grew revenue double-digits last quarter. Profitability has suffered recently, which is no shock given supply chain woes and rate hikes devastating the auto sector. However, I’ve argued extensively over the past year that the automotive industry is gearing up for a major rebound. Those focused on used vehicle sales and service look especially promising to me. Undeniably, lower-income Americans are struggling in this economy despite keeping silent about it. The bottom 50% own just 2.6% of national wealth. Many can’t afford car payments now, pushing the average vehicle age to record highs. It reached 13.5 years in 2023 and likely topped 14 years in 2024. This all spells big business for Lithia in used cars and repairs. I believe that informed Gemini’s bullish call here. Lithia looks like a steal, with an expected 20% annual EPS growth over the decade with a current forward P/E ratio of just 8x. Revenue growth should also stay double-digit annually, yet the stock trades at just 0.2 times sales. High debt has hurt profitability amid rising rates, but I see that picture improving as the Fed pivots dovish. Source: II.studio / Shutterstock.com ZoomInfo (NASDAQ:ZI) helps companies find and sell to more potential customers using data and technology. It provides key information like names, companies, locations and industries to boost its software-based marketing clients. In 2023, ZoomInfo generated revenue of $1.2 billion. As a data/AI-focused software play, ZoomInfo aligns with the kind of companies Google’s Gemini tends to favor. However, ZI’s performance has been disappointing. The stock has declined almost 80% from its peak of $79 in February 2021 to trade around $17 currently. But the bleeding seems to have stopped, and a turnaround could be brewing. Despite its issues, ZoomInfo still trades at premium SaaS multiples, at 17x forward earnings of $1 per share on 2024 projected revenue of $1.27 billion. Analysts expect low double-digit revenue growth, so the bull case revolves around expanding margins. Analysts expand that to also grow at low double digits going forward. In 2023, ZoomInfo’s net income was $107.3 million, an 8.7% net profit margin. If ZoomInfo improves profitability from current levels, its forward P/E gives it huge upside potential once Wall Street takes notice. With 86% gross margins already, I see room for cost-cutting, especially as AI drives SaaS efficiency. Source: JHVEPhoto / Shutterstock.com Autodesk (NASDAQ:ADSK) produces software that architects, engineers, designers and artists use to design buildings, vehicles, games and more. It helps people visualize ideas and improve designs. In 2023, Autodesk generated revenue of $5 billion. As another software play, Autodesk fits Gemini’s preferences. At around $257 per share and 10x FY2025 projected sales of $5.5 billion, Autodesk’s valuation gives me pause normally. Both the revenue and EPS growth is expected to hover around 10% annually. I usually would say that paying this much for these financials would be out of the question and give it a “hold” rating at most. However, I agree with Gemini. That’s because Autodesk has beaten every EPS and revenue estimate since 2009 and the booming infrastructure expenditure could boost its beats even more. I think Autodesk can still deliver 30-40% upside from here with those beats. But again, this can only happen if Wall Street continues to pour money into SaaS/Cloud/AI companies. Source: rafapress / Shutterstock.com MercadoLibre (NASDAQ:MELI) operates e-commerce and fintech platforms primarily across Latin America. In 2023, it generated revenue of $14.5 billion. I’m highly bullish on its prospects. Despite huge gains lately, much more upside remains as MELI cements itself as the Latin American Amazon (NASDAQ:AMZN). Its fintech growth has been tremendously impressive, too. With almost 10x EPS growth expected over eight years, rising from $33 per share in 2024 to $309 per share in 2033, and 20%+ annual revenue expansion, MercadoLibre might even be a better buy than Amazon today, in my view. MELI is still a very underappreciated company, trading at 5x forward 2032 earnings. I certainly agree with Gemini that investors should consider jumping aboard this impressive Latin American growth story. Source: Boyloso / Shutterstock Last on our list of stocks to buy is Marcus Corp (NYSE:MCS). Marcus Corp operates in the lodging and entertainment industries with substantial real estate assets. Its two main divisions are Marcus Theatres and Marcus Hotels and Resorts. Marcus Theatres is the 4th largest circuit in the U.S., and its hotels are unique brands in their markets. In 2022, Marcus Corp generated revenue of $644 million. This is an interesting off-the-beaten-path pick by Gemini compared to its tech choices. I expected Gemini to choose a travel name, but more conventional picks, not a beaten-down name like MCS, trading 65% off its 2019 peak. I believe Gemini sees a value/recovery play here. Sales have held up relatively well, though a small 1% decline is expected in 2024 before rebounding in 2024. The main issue is plunging profitability. With the travel boom cooling and moviegoing still depressed, MCS’ EPS is projected to nosedive in 2024 before recovering in 2025. In my view, theaters have limited comeback potential as streaming grows. Only major releases keep them alive now. While these businesses won’t disappear, Marcus Theatres’ best days seem behind. I expect the hotel side to power growth instead. But with heavy debt of $384 million and high rates, more pain likely looms before a recovery plays out. Rate cuts will definitely lead to much higher profits in the long run. On the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Omor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn. The #1 AI Investment Might Be This Company You’ve Never Heard Of “America’s Top Trader” Issues A.I. Code Red: Act Now or Miss Out It doesn’t matter if you have $500 or $5 million. Do this now. The post 7 Stocks That Google’s Updated AI Wants You to Buy appeared first on InvestorPlace. Related Quotes "
}