{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.marketwatch.com/story/the-dow-is-due-for-a-change-these-sectors-may-be-affected-2e32f173",
    "text": "The keepers of the Dow Jones Industrial Average will have to make at least one change to the venerable index next week, and there’s a very good chance they’ll make a couple of others, as well. S&P Dow Jones Indices will have to tweak the Dow \n        DJIA\n       on Feb. 26, the day Walmart Inc.’s \n        WMT,\n        -0.91%\n       three-for-one stock split takes effect. Before Walmart’s stock split, the company, which reported fourth-quarter earnings on Tuesday, was the 17th largest component of the Dow. The split will lower Walmart’s stock price by two-thirds. Since the Dow is a price-weighted index — meaning stocks with higher prices have more influence on the index’s price than those with lower prices — both Walmart and the consumer-staples sector of which Walmart is a part will have a lot less influence on the Dow’s price. In contrast, the S&P 500 index \n        SPX\n       is market-capitalization weighted, meaning a company’s market value determines the stock’s impact on the index’s price. When Walmart’s stock split takes effect after the Feb. 26 open, the “divisor,” or the number by which a stock’s price change is divided to determine the impact on the Dow’s price, will also have to change. The current divisor is 0.15172752595384. Read: Why you can count on the Dow making changes in February The last time the Dow’s divisor changed was on Aug. 31, 2020, when Apple Inc.’s \n        AAPL,\n        -1.06%\nfour-for-one split took effect. One week before Apple’s split took effect, the Dow’s keepers announced three other changes to the index’s members, to offset the reduction in Apple’s influence and to “diversify” the index in order to “better reflect the American economy.” As of Jan. 31, the consumer-staples sector had a 7% weighting in the Dow and a 6.1% weighting in the S&P 500, so a diminished representation of that sector with a lower Walmart stock price wouldn’t put the weightings out of whack. Also read: Here’s where Walmart’s stock would rank in the Dow after 3-for-1 stock split The Dow’s keepers are famously tight-lipped about if, when and what kind of changes might be made. But these are the sectors with the biggest differences in weightings between the Dow and the S&P 500 as of Jan. 31 (the Dow doesn’t include transportation or utility companies and currently doesn’t include any real-estate investment trusts): Information technology \n        XLK\n       had a 19.7% weighting in the Dow and a 29.5% weighting in the S&P 500. Some of the largest IT-sector components by market capitalization that aren’t in the Dow are Nvidia Corp. \n        NVDA,\n        +0.12%,\n       Broadcom Inc. \n        AVGO,\n        +0.51%\n       and Oracle Corp. \n        ORCL,\n        +0.27%. The financial sector \n        XLF\n       had a 21.5% weighting in the Dow and a 13.1% weighting in the S&P 500. The Dow’s current financial components are Goldman Sachs Group Inc. \n        GS,\n        +0.59%,\n       Visa Inc. \n        V,\n        +0.02%,\n       Travelers Cos. \n        TRV,\n        +0.57%,\n       JPMorgan Chase & Co. \n        JPM,\n        +0.39%\n       and American Express Co. \n        AXP,\n        -0.03%.\n       Warren Buffett’s Berkshire Hathaway Inc. \n        BRK.B,\n        +0.86%\n       is the financial stock with the biggest market cap, at $885.2 billion, that is not in the Dow. And the communications services sector \n        XLC\n       had a 2.4% weighting in the Dow but an 8.9% weighting in the S&P 500. Some of the largest companies by market cap that aren’t in the Dow are Alphabet Inc. \n        GOOGL,\n        +0.04%\nGOOG,\n        +0.21%,\nMeta Platforms Inc. \n        META,\n        -1.68%\n       and Netflix Inc. \n        NFLX,\n        -1.01%. Something unusual happened in the stock market this quarter: Both the S&P 500 and Cboe Volatility Index, better known as the Vix, rose. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Tomi Kilgore is MarketWatch's deputy investing and corporate news editor and is based in New York. You can follow him on Twitter @TomiKilgore. Visit a quote page and your recently viewed tickers will be displayed here. "
}