{
    "title": "Google Reports Stagnant Revenue and Tumbling Stocks for 2023",
    "date": "2/1/2024",
    "url": "https://propakistani.pk/2024/02/01/google-reports-stagnant-revenue-and-tumbling-stocks-for-2023/",
    "text": "Alphabet, the parent company of Google, has released its financial report for the fourth quarter and the entire year of 2023. Although not a catastrophic outcome, the figures fell short of expectations, causing the company’s stock to plummet by 6% at the time of this report. For the fourth quarter, Alphabet reported revenues of $86 billion, reflecting a 13% increase compared to the same period in 2022. Furthermore, the company’s unaudited total revenue for 2023 amounted to $307 billion, constituting a 9% rise from the previous year’s figures.  Alphabet’s CEO Sundar Pichai expressed his contentment with the sustained robust performance in Search and the expanding impact of YouTube and Cloud services. He underscored the role of the company’s investments in AI and innovation in bolstering these segments and hinted at a promising future, particularly within the Gemini era. Delving into the specifics of Alphabet’s $86 billion in revenue, Search emerges as the dominant revenue generator, maintaining a considerable lead over various subscription services.  In terms of the company’s overall financial performance, Alphabet reported a net profit of $23.7 billion for the fiscal year 2023, marking a notable increase from the $18.2 billion recorded in 2022. The search engine giant has been laying off thousands of employees lately, most of it happening in the last month alone. During the latest layoff, several hundred employees were laid off from multiple company divisions including the Assistant team as well as some of the Hardware team such as Pixel phones, Nest home devices, and Fitbit wearables. But that’s not the end of it either as Google’s CEO Sundar Pichai has recently announced that employees should expect more layoffs soon, putting into perspective the alarming situation at Google’s offices. 📢 For the latest Tech & Telecom news, videos and analysis join ProPakistani's WhatsApp Group now! Follow ProPakistani on Google News & scroll through your favourite content faster!  Shares ProPakistani is the premier and most trustworthy resource for all happenings in technology, telecom, business, sports, auto, education, real estate and entertainment news in Pakistan. \nWhether it's the top trending news, inside scoops or features, interviews, market trends and analysis, product reviews, How to's or tutorials – we cover it all. © 2024 ProPakistani.PK - All rights reserved  Follow ProPakistani to get latest news and updates.  Join the groups below to get latest news and updates. "
}