{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.fiercetelecom.com/broadband/google-fiber-eyes-outside-investors-fuel-expansion",
    "text": "Google Fiber is eyeing fresh capital to fuel its broadband expansion. According to a new Reuters report, parent company Alphabet is seeking outside investors for the fiber operator. An anonymous source said Google Fiber has already hired an investment bank to start the process of selling equity in the company, adding Google Fiber’s future goal is to be independent from Alphabet.  Google Fiber confirmed the report to Fierce Telecom but did not disclose how much funding it’s seeking or its plans for the money. “GFiber's strong execution shows the industry's potential for faster, more affordable broadband access,” said Alphabet CFO Ruth Porat in a statement provided to Fierce. “This next step of raising external capital will enable them to scale their technical leadership, expand their reach, and provide better internet access to more communities.” Indeed, Google Fiber’s expansion is marching on. The company on Tuesday announced it scored approval for a franchise agreement with Nevada’s Clark County, allowing Google Fiber to build its network in the Las Vegas metro area.  Aside from Nevada, Google Fiber in the past two years unveiled build plans in four other new states: Arizona, Colorado, Nebraska and Idaho. The operator is also growing its existing markets in Kansas, Missouri, North Carolina, Tennessee, Utah, among others. Google Fiber doesn’t share subscriber or passings figures. A spokesperson told Fierce in December its 2023 build increased by more than 10% from 2022 – both in terms of fiber miles deployed and the number of homes passed. The company told Reuters it tripled its customer base in the past six years. In 2023, Google Fiber signed deals to expand its service to more than 25 additional cities. “We began this journey to fundamentally redefine the internet experience,” said Google Fiber CEO Dinni Jain in a statement. “Over the last six years, we’ve proven that, in terms of speed, price, and truly differentiated customer service. We are now ready to scale this much faster.” Not only has Google Fiber been expanding its coverage, it’s also beefed up its leadership team. The company last year appointed Melani Griffith as its first chief growth officer and named John Keib as its inaugural chief technology and product officer. Additionally, Google Fiber tapped Rocco Laurenzano as chief operating officer. "
}