{
    "title": "The Next Chapter of Our Gemini Era | by Sundar Pichai - Tech | Business | \nEconomy",
    "date": "2/8/2024",
    "url": "https://techeconomy.ng/the-next-chapter-of-our-gemini-era-by-sundar-pichai/",
    "text": "Home » The Next Chapter of Our Gemini Era | by Sundar Pichai Sundar Pichai, the CEO of Google and Alphabet speaking about Gemini For years, we’ve been investing deeply in AI as the single best way to improve Search and all of our products. We’re excited by the progress, for example with our Search Generative Experience, or SGE, which you can try in Google Labs. AI is also now central to two businesses that have grown rapidly in recent years: our Cloud and Workspace services and our popular subscription service Google One, which is just about to cross 100 million subscribers. In December, we took a significant step on our journey to make AI more helpful for everyone with the start of the Gemini era, setting a new state of the art across a wide range of text, image, audio, and video benchmarks. However, Gemini is evolving to be more than just the models. It supports an entire ecosystem — from the products that billions of people use every day, to the APIs and platforms helping developers and businesses innovate. The largest model Ultra 1.0 is the first to outperform human experts on MMLU (massive multitask language understanding), which uses a combination of 57 subjects — including math, physics, history, law, medicine and ethics — to test knowledge and problem-solving abilities. Today we’re taking our next step and bringing Ultra to our products and the world. Bard has been the best way for people to directly experience our most capable models. To reflect the advanced tech at its core, Bard will now simply be called Gemini. It’s available in 40 languages on the web, and is coming to a new Gemini app on Android and on the Google app on iOS. The version with Ultra will be called Gemini Advanced, a new experience far more capable at reasoning, following instructions, coding, and creative collaboration. For example, it can be a personal tutor, tailored to your learning style. Or it can be a creative partner, helping you plan a content strategy or build a business plan. You can read more in this post. Anyone can start using Gemini Advanced by subscribing to the new Google One AI Premium plan, which offers the best of Google’s AI features in a single place. This premium plan builds off the popular Google One service offering expanded storage and exclusive product features. Gemini models are also coming to products that people and businesses use every day, including Workspace and Google Cloud:  Developers have been fundamental to every major technology shift and will play an equally important role in the Gemini ecosystem. Hundreds of thousands of developers and businesses have already been building with Gemini models. While today is about Gemini Advanced and its new capabilities, next week we’ll share more details on what’s coming for developers and Cloud customers. These latest updates reflect how we’re approaching innovation boldly, and advancing and deploying this technology responsibly. And we’re already well underway training the next iteration of our Gemini models — so stay tuned for more! A new name for Bard Google’s mission with Bard has always been to give users direct access to its AI models, and Gemini represents the most capable family of models. To reflect this, Bard will now simply be known as Gemini. Gemini — Advanced You can already chat with Gemini with its Pro 1.0 model in over 40 languages and more than 230 countries and territories. And now, Google is launching Gemini Advanced to help people easily collaborate with the best of Google AI. Gemini Advanced will give users in more than 150 countries and territories access to Ultra 1.0, Google’s largest and most capable state-of-the-art AI model, better at highly complex tasks like coding, logical reasoning, following nuanced instructions and collaborating on creative projects. It’s currently available in English, and we’ll expand to more languages over time. Introducing a new subscription for the Gemini era Gemini Advanced is available as part of the brand new Google One AI Premium Plan for N20,500/month, starting with a two-month trial at no cost. This plan gives the best of Google AI and the latest advancements, along with all the benefits of the existing Google One Premium plan, such as 2TB of storage. In addition, AI Premium subscribers will soon be able to use Gemini in Gmail, Docs, Slides, Sheets and more. Easily use Gemini on your phone\nGoogle is starting to roll out a new mobile experience for Gemini and Gemini Advanced with a Gemini app on Android and in the Google app on iOS, starting Thursday in English in the US only, coming to Nigeria in English next week. With Gemini on your phone, you can type, talk or add an image for all kinds of help while you’re on the go: take a picture of your flat tyre and ask for instructions, generate a custom image for your dinner party invitation or ask for help writing a difficult text message. It’s an important first step in building a true AI assistant — one that is conversational, multimodal and helpful. Building next-gen AI boldly and responsibly Google continues to take a bold and responsible approach to bringing this technology to the world. And, to mitigate issues like unsafe content or bias, Google has built safety into its products in accordance with the AI Principles. [Featured Image Credit]  The Microsoft Garage - Africa Development Center (ADC - West Africa), Wednesday, hosted a highly informative workshop, with a specific... Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Privacy Policy Agreement *\n I agree to the Terms & Conditions and Privacy Policy.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Follow Us © 2023 Techeconomy - Designed by Opimedia. © 2023 Techeconomy - Designed by Opimedia. "
}