{
    "title": "20 Richest Countries During the Great Depression",
    "date": "2/10/2024",
    "url": "https://finance.yahoo.com/news/20-richest-countries-during-great-134811721.html",
    "text": "In this article, we will look into the 20 richest countries during the great depression. If you want to skip our detailed analysis, you can go directly to the 5 Richest Countries During the Great Depression. The 1920s, believed as the era of economic and cultural upsurge, underwent an abrupt change in 1929. This economic downturn, known as the Great Depression, initiated by the US stock market crash in October 1929, was a multifaceted interplay of various factors affecting aggregate demand and spending globally. In the late 1920s, the monetary policies set by the state to impede speculation around the stock market backfired, leading to reduced investments. This crash resulted in inflated prices, reduced business spending, and plunging stock values. The US stock market witnessed a dramatic boost in the early 1920s, with the Dow Jones Industrial Average resulting in a 6-fold increase from 1921 to 1929, reaching a peak of 381. However, the high that was supposedly believed as a permanent victory, was abrupted by the decline of October 1929, as reported by the Federal Reserve History. The relentless slide that started with two consecutive declines of 13% and 12% in October, later wiped out the index value to nearly half by mid-November. The Dow Jones Industrial Average continued to decline and reached its lowest level of 41.22 in 1932, witnessing an 89% descent from its peak. It took over 20 years for the index to surpass its high before the crash and reach 381 again in 1954. The economic downturn was further incited by the widespread banking panics, which began in the third quarter of 1930. The beginning of the great depression culminated in fear among people, resulting in mass withdrawals and liquidation of assets. Marking the start of the biggest crisis, the bank failures contributed significantly to the depth and duration of the depression. The economy of the United States shrank 29% from 1929 to 1933, as reported by the Federal Bank Reserves of St. Louis. Unemployment in the country peaked at 25% in 1933, whereas consumer prices declined to 25%. Over 30% of the banking system, around 7,000 banks, failed between 1930 and 1933. The impact of the Great Depression was not uniform. According to the Hall of Mirrors, by Barry Eichengreen, the global gross domestic product declined 15% from 1929 to 1932. A research study, \"The Global Impact of the Great Depression\" by the London School of Economics, provides an analysis of the impact of the great depression on 30 countries, by taking into account their monthly variations of severity. The study highlights that although Central Eastern European countries, except Yugoslavia and Bulgaria, witnessed the longest economic recessions, narratives about certain countries needed revision. For instance, Spain was believed to have avoided the depression due to its non-gold-standard monetary policy, which links a country's currency directly to its gold reserves. Many historians believe that the Gold Standard highly contributed to the length and severity of the great depression. However, Spain still experienced a long-lasting recession, with 45% of the months between January 1929 and July 1935 in recession. On the contrary, Japan witnessed a strong recovery after 1932. However, the study found that the impact of the great depression was higher on Japan than the evidence of annual industrial production suggests. The depression in America and Canada was the longest, while Scandinavian countries escaped the depression relatively early. The study suggests that geography played a significant role in the depression's severity. Central and Eastern European countries and North American economies endured the longest and strongest recessions. Economies including Canada, Poland, Austria, and Germany faced the highest cumulative damages. The research also highlighted a pattern emerging in concentric circles depicting decreased severity moving outwards from the central point. Countries such as France, Belgium, and several Eastern European nations were closest to the epicenter and hence endured the deepest losses. This was followed by Scandinavia, Britain, and Switzerland, and the outermost circle experienced milder downturns, including nations such as Spain, Italy, and Japan. The only exceptions were New Zealand and Denmark, which endured a long-lasting and severe recession. After nearly a century, the global economy remains resilient, while still facing a multitude of challenges fueled by the aftermath of the pandemic's outbreak in 2020 and the current geopolitical tensions in the Middle East and Europe. According to the IMF, global growth is projected to remain steady at 3.1% in 2024, an uptick of 0.2% from October 2023. It is forecasted to reach 3.2% in 2025. The US and China are expected to experience slower growth in 2024, due to tight monetary policies in the US and weaker consumption and investment in China. The Eurozone is expected to witness a rebound from the 2023 growth level. However, the region still faces high energy prices and monetary challenges. On the contrary, Southeastern Economies, India, and Brazil are expected to grow with headline inflation declining to 4.9% globally.  The advanced economies are anticipated to remain resilient, with headline and core inflation expected to drop to 2.6% in 2024. Overall. the global economy presents varied paths of recovery for different nations. While the global outlook presented varied aspects of growth, a glimpse into the richest economies in the world can provide insights into the relative stability and business opportunities in these nations. Luxembourg, Singapore, Switzerland, and the United States are among the top 10 richest countries in the world by GDP per capita in 2024.  Spotify Technology S.A. (NYSE:SPOT), Alphabet Inc. (NASDAQ:GOOG), and Chubb Limited (NYSE:CB) are some of the leading companies in the richest economies in the world. Headquartered in Luxembourg, Spotify Technology S.A. (NYSE:SPOT) is an audio streaming and media services company. On January 31, Steven Cahall, an analyst at Wells Fargo, raised his price target on Spotify Technology S.A. (NYSE:SPOT) to $280 from $250 and maintained an overweight rating. Over the past 3 months, 14 out of 20 analysts have given a buy rating on Spotify Technology S.A. (NYSE:SPOT). The stock has an average price forecast of $240.06 and a high price target of $330.00. As of February 7, the stock has surged more than 63% over the past 6 months. On January 30, Alphabet Inc. (NASDAQ:GOOG) reported its earnings for the fiscal fourth quarter of 2023. The company reported an EPS of $1.64 and surpassed estimates by $0.04. The company reported a revenue of $86.31 billion for the quarter and outperformed estimates by $1.03 billion. Alphabet Inc.'s (NASDAQ:GOOG) revenue for the quarter grew by 13.49% on a year-over-year basis. Chubb Limited (NYSE:CB) is a top financial services company in Switzerland. On January 31, Elyse Greenspan, an analyst at Wells Fargo, maintained an equal-weight rating and raised her price target on Chubb Limited (NYSE:CB) to $255 from $234. Over the past 3 months, 6 analysts have given a buy rating on Chubb Limited (NYSE:CB). The stock has an average price forecast of $255.47 and a high price target of $280.00. Now, let's look at the 20 richest countries during the great depression. Richest Cities in Every State in the US Methodology To compile our list of the 20 richest countries during the great depression, we utilized the Maddison Project Database 2020. The database is a useful tool that provides historical economic data of countries. It reports the GDP per capita (PPP 2011) and population data for countries. At the time of the great depression, there were approximately 75 countries based on the strict definition of fully independent states. The database provides the historical GDP per capita data for the years 1929 and 1937 for nearly 67 countries. We have utilized the GDP per capita and population data from the database to calculate the GDPs of the countries for the years, 1929 and 1937. Please note that we have selected 1937 as our end year due to the unavailability of data for certain countries for the year 1939. We then calculated the percentage change in GDP from 1929 to 1937 to provide an in-depth insight into the recovery rate and economic resilience of the countries. Finally, we ranked the 20 richest countries during the great depression, based on their calculated GDP in 1937. We have also mentioned the current GDP (PPP) of the countries, as of 2024, to provide insight into their economic growth since the great depression. The 2024 GDP (PPP) of countries is sourced from the IMF Database. By the way, Insider Monkey is an investing website that tracks the movements of corporate insiders and hedge funds. By using a consensus approach, we identify the best stock picks of more than 900 hedge funds investing in US stocks. The top 10 consensus stock picks of hedge funds outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Whether you are a beginner investor or a professional one looking for the best stocks to buy, you can benefit from the wisdom of hedge funds and corporate insiders. GDP (1929): $40.90 billion GDP (1937): $48.07 billion Percentage Change in GDP (1929-1937): 17.53% GDP (2024): $3.42 trillion Mexico is ranked among the richest countries during the great depression. In 1929, the country had an estimated GDP of $40.90 billion. Mexico experienced a 17.53% increase in its GDP from 1929 to 1937 and reached $48.07 billion in 1937. As of 2024, Mexico has a GDP of $3.42 trillion. GDP (1929): $48.18 billion GDP (1937): $62.28 billion Percentage Change in GDP (1929-1937): 29.25% GDP (2024): $4.62 trillion Brazil ranks 19th on our list. The country reported a GDP of $48.18 billion in 1929 and $62.28 billion in 1937. Its GDP grew by 29.25% from 1929 to 1937. As of 2024, it has a GDP of $4.62 trillion. GDP (1929): $53.65 billion GDP (1937): $62.65 billion Percentage Change in GDP (1929-1937): 16.77% GDP (2024): $1.78 trillion Ranked 18th on our list, Australia reported a GDP of $53.65 billion in 1929 and $62.65 billion in 1937. Its GDP increased by 16.77% from 1929 to 1937. As of 2024, the GDP of the country is $1.78 trillion. GDP (1929): $64.70 billion GDP (1937): $66.00 billion Percentage Change in GDP (1929-1937): 2.00% GDP (2024): $793.83 billion Belgium ranks among the richest countries during the great depression. In 1929, the country had an estimated GDP of $64.70 billion. Belgium witnessed a 2% increase in its GDP from 1929 to 1937 and reached $66 billion in 1937. As of 2024, the country has a GDP of $793.83 billion. GDP (1929): $67.32 billion GDP (1937): $66.28 billion Percentage Change in GDP (1929-1937): -1.54% GDP of Czechia (2024): $564.19 billion GDP of Slovakia (2024): $240.65 billion Ranked 16th on our list, Czechoslovakia reported a GDP of $67.32 billion in 1929. Its GDP shrank by 1.54% from 1929 to 1937. In 1993, Czechoslovakia split into two independent countries, Czechia and Slovakia. As of 2024, Czechia has a GDP of $564.19 billion and Slovakia has a GDP of $240.65 billion. GDP (1929): $96.85 billion GDP (1937): $66.46 billion Percentage Change in GDP (1929-1937): -31.37% GDP (2024): $2.51 trillion Spain is ranked 15th on our list. In 1929, the country reported a GDP of $96.85 billion. Its GDP shrank by 31.37% from 1929 to 1937 and reached $66.46 billion in 1937. As of 2024, the country has a GDP of $2.51 trillion. GDP (1929): $70.56 billion GDP (1937): $74.46 billion  Percentage Change in GDP (1929-1937): 5.53% GDP (2024): $1.34 trillion The Netherlands ranks 14th on our list. The country reported a GDP of $70.56 billion in 1929 and $74.46 billion in 1937. Its GDP grew by 5.53% from 1929 to 1937. As of 2024, it has a GDP of $1.34 trillion. GDP (1929): $83.20 billion GDP (1937): $80.86 Percentage Change in GDP (1929-1937): -2.21% GDP (2024): $2.47 trillion Canada is ranked among the richest countries during the great depression. In 1929, the country had an estimated GDP of $83.20 billion. Canada's GDP declined 2.21% from 1929 to 1937 and reached $80.86 billion in 1937. As of 2024, Canada has a GDP of $2.47 trillion. GDP (1929): $80.69 billion GDP (1937): $88.69 billion Percentage Change in GDP (1929-1937): 9.92% GDP (2024): $1.30 trillion Argentina ranks 12th on our list. The country reported a GDP of $80.69 billion in 1929 and $88.69 billion in 1937. Its GDP grew by 9.92% from 1929 to 1937. As of 2024, it has a GDP of $1.30 trillion. GDP (1929): $93.98 billion GDP (1937): $93.97 billion Percentage Change in GDP (1929-1937): -0.01% GDP (2024): $1.79 trillion Ranked 11th on our list, Poland reported a GDP of $93.98 billion in 1929 and $93.97 billion in 1937. Its GDP declined by 0.01% from 1929 to 1937.  As of 2024, it reports a GDP of $1.79 trillion. GDP (1929): $103.85 billion GDP (1937): $118.78 billion Percentage Change in GDP (1929-1937): 14.76% GDP (2024): $4.72 trillion Indonesia ranks 10th on our list. The country reported a GDP of $103.85 billion in 1929 and $118.78 billion in 1937. Its GDP grew by 14.76% from 1929 to 1937. As of 2024, it has a GDP of $4.72 trillion. GDP (1929): $197.85 billion GDP (1937): $210.13 billion Percentage Change in GDP (1929-1937): 6.20% GDP (2024): $3.29 trillion Italy is ranked among the richest countries during the great depression. In 1929, the country had an estimated GDP of $197.85 billion. Italy experienced a 6.20% increase in its GDP from 1929 to 1937 and reached $210.13 billion in 1937. As of 2024, Italy has a GDP of $3.29 trillion. GDP (1929): $231.79 billion GDP (1937): $290.45 billion Percentage Change in GDP (1929-1937): 25.31% GDP (2024): $6.71 trillion Japan ranks 8th on our list. The country reported a GDP of $231.79 billion in 1929 and $290.45 billion in 1937. Its GDP grew by 5.53% from 1929 to 1937. As of 2024, it has a GDP of $1.34 trillion. GDP (1929): $309.55 billion GDP (1937): $299.88 billion Percentage Change in GDP (1929-1937): -3.12% GDP (2024): $4.01 trillion France is ranked 7th on our list. In 1929 the country reported a GDP of $309.55 billion. Its GDP shrank by 3.12% from 1929 to 1937. As of 2024, the country has a GDP of $4.01 trillion. GDP (1929): $386.39 billion GDP (1937): $399.83 billion Percentage Change in GDP (1929-1937): 3.46% GDP (2024): $14.26 trillion India is ranked 6th on our list of the richest countries during the great depression. In 1929, the country had an estimated GDP of $386.39 billion. India's GDP grew 3.46% from 1929 to 1937 and reached $399.83 billion in 1937. As of 2024, India has a GDP of $14.26 trillion. Click to continue reading and see the 5 Richest Countries During the Great Depression. Suggested articles: Top 20 Most Innovative Economies in Asia 10 Most Innovative Economies in Central and South America 15 Most Powerful Asian Countries in 2024 Disclosure: None. 20 Richest Countries During the Great Depression is originally published on Insider Monkey. Related Quotes "
}