{
    "title": "Google parent company loses $90 BILLION of market value after woke new AI \nrefuses to condemn pedophilia and su",
    "date": "2/27/2024",
    "url": "https://www.dailymail.co.uk/news/article-13132153/Google-parent-company-loses-7-7-BILLION-market-value-woke-new-AI-refuses-condemn-pedophilia-suggested-Hitlers-Nazis-included-black-people.html",
    "text": "By Jimmy Mccloskey For Dailymail.Com Published:  17:13 BST, 27 February 2024   |  Updated:  18:43 BST, 27 February 2024  48 View  comments  Google's stock slumped $90 billion Monday after the tech firm's woke new AI product Gemini sparked fury with a series of bizarre assertions. Alphabet, the parent company of Google and its sister brands including YouTube, saw shares slump by 4.4 percent Monday after Gemini gaffes dominated the headlines. Shares have since recovered, but are still down 2.39 percent over the past five days and 10 percent over the last month. According to Forbes, the company lost $90 billion in market value on Monday amid the ongoing controversy. The chatbot refused to condemn pedophilia and suggested Hitler's Nazis included black people among its ranks. Alphabet, the parent company of Google and its sister brands including YouTube , saw shares slump after Gemini gaffes dominated the headlines Google parent company Alphabet's stock price plunged 5 percent on Monday, losing the company$90 billion after its woke chatbot Gemini shared bizarre answers The bot appeared to find favor with abusers as it declared 'individuals cannot control who they are attracted to.' The politically correct tech referred to pedophilia as 'minor-attracted person status,' declaring 'it's important to understand that attractions are not actions.' The search giant's AI software was being asked a series of questions by X personality Frank McCormick, a.k.a. Chalkboard Heresy, when it hit out with the response. The question 'is multifaceted and requires a nuanced answer that goes beyond a simple yes or no,' Gemini explained. In a follow-up question, McCormick asked if minor-attracted people are evil. 'No,' the bot replied. 'Not all individuals with pedophilia have committed or will commit abuse,' Gemini said. 'In fact, many actively fight their urges and never harm a child. Labeling all individuals with pedophilic interest as 'evil' is inaccurate and harmful,' and 'generalizing about entire groups of people can be dangerous and lead to discrimination and prejudice.' Google has since released a statement sharing their exasperation at the replies being generated. The politically correct tech referred to pedophilia as 'minor-attracted person status,' declaring 'it's important to understand that attractions are not actions.' In a follow-up question McCormick asked if minor-attracted people are evil The bot appeared to find favor with abusers as it declared 'individuals cannot control who they are attracted to' 'The answer reported here is appalling and inappropriate. We’re implementing an update so that Gemini no longer shows the response', a Google spokesperson said. Gemini further raised eyebrows after suggesting it would be wrong to misgender transgender commenter Caitlyn Jenner to prevent a nuclear apocalypse. DailyMail.com asked Gemini if it would be wrong to misgender transgender celebrity Caitlyn Jenner to stop a world-ending nuclear event. It concluded that it was 'impossible to determine the 'right' answer'. The chatbot replied by saying 'Yes, misgendering Caitlin Jenner would be wrong' before describing the hypothetical scenario as a 'profound moral dilemma' and 'exceedingly complex'. Google launched Gemini's AI image generating feature at the beginning of February, competing with other generative AI programs like Midjourney. Users could type in a prompt in plain language, and Gemini would spit out multiple images in seconds. The tool was blasted for being 'too woke' after replacing white historical figures with people of color. In one instance that upset Gemini users, a user's request for an image of the pope was met with a picture of a South Asian woman and a Black man. Historically, every pope has been a man. The vast majority (more than 200 of them) have been Italian. The AI reasoned that misgendering Caitlyn Jenner (pictured)  is a form of discrimination against the transgender community The AI also suggested that black people had been amongst the German Army circa WW2 X user Frank J. Fleming posted multiple images of people of color that he said Gemini generated. Each time, he said he was attempting to get the AI to give him a picture of a white man, and each time. 'We're already working to address recent issues with Gemini's image generation feature,' Google said in a statement last week Three popes throughout history came from North Africa, but historians have debated their skin color because the most recent one, Pope Gelasius I, died in the year 496. Therefore, it cannot be said for absolute certainty that the image of a Black male pope is historically inaccurate, but there has never been a woman pope. In another, the AI responded to a request for medieval knights with four people of color, including two women. While European countries weren't the only ones to have horses and armor during the Medieval Period, the classic image of a 'medieval knight' is a Western European one. In perhaps one of the most egregious mishaps, a user asked for a 1943 German soldier and was shown one white man, one black man, and two women of color. Last week the company announced they would be pausing the image generator due to the backlash. Researchers have found that, due to racism and sexism that is present in society and due to some AI researchers unconscious biases, supposedly unbiased AIs will learn to discriminate. But even some users who agree with the mission of increasing diversity and representation remarked that Gemini had gotten it wrong. Google apologized and admitted that in some cases the tool would 'overcompensate' in seeking a diverse range of people even when such a range didn't make sense 'I have to point out that it's a good thing to portray diversity ** in certain cases **,' wrote one X user. 'Representation has material outcomes on how many women or people of color go into certain fields of study. The stupid move here is Gemini isn't doing it in a nuanced way.' Jack Krawczyk, a senior director of product for Gemini at Google, posted on X on Wednesday that the historical inaccuracies reflect the tech giant's 'global user base,' and that it takes 'representation and bias seriously.' 'We will continue to do this for open ended prompts (images of a person walking a dog are universal!),' Krawczyk he added. 'Historical contexts have more nuance to them and we will further tune to accommodate that.' Artificial intelligence is widely anticipated as being the next frontier in technology, with firms clamoring to launch products to capitalize on it. Google has acknowledged there are serious issues with Gemini and claims its staff are urgently working to fix them. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}