{
    "title": null,
    "date": "2/19/2024",
    "url": "https://www.insidermonkey.com/blog/5-best-big-name-stocks-to-buy-right-now-1260834/2",
    "text": "Number of Hedge Fund Investors: 214 Alphabet Inc Class A (NASDAQ:GOOGL) ranks fourth in our list of the best big name stocks to buy according to hedge funds. Last month, Citi reiterated its Buy rating on Alphabet Inc Class A (NASDAQ:GOOGL) and set a $168 price target on the stock. A total of 214 hedge funds in Insider Monkey’s database had stakes in Alphabet Inc Class A (NASDAQ:GOOGL) as of the end of 2023. The biggest stakeholder of Alphabet Inc Class A (NASDAQ:GOOGL) was Ken Fisher’s Fisher Asset Management which owns a $6.3 billion stake in Alphabet Inc Class A (NASDAQ:GOOGL). The FPA Crescent Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: “Alphabet Inc. (NASDAQ:GOOG) continued going from strength to strength during 2023 despite concerns that competition may infringe on the company’s dominant position in Search. Thus far, Alphabet has continued to hold its own, and we look forward to seeing how the company incorporates further AI developments across the Alphabet ecosystem. Lastly, we are hopeful that the impending arrival of a new CFO will bring a renewed focus on efficiency – an area where we believe Alphabet has ample room for improvement.” NYSE:VNASDAQ:AMZNNASDAQ:METANASDAQ:MSFTNASDAQ:NVDANASDAQ:GOOGLVisa Inc (NYSE:V)Nvidia Corp (NASDAQ:NVDA)Microsoft Corp (NASDAQ:MSFT)Amazon.com Inc. (NASDAQ:AMZN)Meta Platforms Inc. (NASDAQ:META)Alphabet Inc. Class A (NASDAQ:GOOGL)5 Best Big Name Stocks to Buy Right NowShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}