{
    "title": "Not All of Big Tech Posted Magnificent Results for the 4th Quarter",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/news/not-big-tech-posted-magnificent-212034350.html",
    "text": "Big tech earnings kicked off earnings season last week and not all of the results were so magnificent. Alphabet (NASDAQ:GOOGL) and Microsoft (NASDAQ:MSFT) got things started on Tuesday, and while both surpassed top and bottom-line expectations, it wasn't enough for investors. Weak advertising revenues for Alphabet resulted in a nearly 6% stock price decline in the wake of the report,[1] and light guidance from Microsoft also didn't go over well with investors.[2] Given the momentum tech had into these reports and rich price-earnings levels, investors were less willing to forgive minor stumbles. The same went for Apple (NASDAQ:AAPL), which reported disappointing revenue from China on Thursday, the stock fell over 5% in the hours after the report before climbing back on Friday.[3] Warning! GuruFocus has detected 6 Warning Signs with DIS. The two standouts for last week were undoubtedly Meta (NASDAQ:META) and Amazon (AMZN?), both handily beating expectations on the top and bottom-line.[4] Even sweeter for Meta investors was the announcement of the company's first ever dividend of 50 cents as well as a $50 billion buyback plan.[5] CEO Mark Zuckerberg also vowed to \"keep things lean,\" a strategy that has worked well for the social media company who successfully pulled off the \"year of efficiency\" in 2023.[6] As a result of better-than-expected reports last week, the FactSet blended S&P 500 EPS consensus now stands at 1.6%, an uptick from -1.4% the week prior.[7] But that's not all that moved the markets last week, the first Federal Reserve meeting of 2024 ended up being a bust when Chairman Powell indicated they are not ready to begin cutting rates yet.[8] The CME Group FedWatch tool is now predicting a 60% probability of a rate cut at the May 1st meeting, with the likelihood of a March 20th cut falling to 21%.[9] While markets initially fell after that news on Wednesday, they perked back up after Thursday's tech results and Friday's blockbuster jobs number. Nonfarm Payrolls came in at 353,000 for January, and unemployment stayed at 3.7%, marking 24 consecutive months of sub-4% unemployment and the longest stretch since the 1960s.[10] We get results from a smattering of sectors this week, including the restaurant space (MCD, CMG), Industrials (CAT, UBER), pharma (GILD, LLY) and always highly anticipated Disney (NYSE:DIS). Source: Wall Street Horizon Academic research shows that when a company confirms a quarterly earnings date that is later than when they have historically reported, it's typically a sign that the company will share bad news on their upcoming call, while moving a release date earlier suggests the opposite.[11] This week we get results from a number of large companies on major indexes that have pushed their fourth-quarter 2023 earnings dates outside of their historical norms. Nine companies within the S&P 500 confirmed outlier earnings dates for this week, all of which are later than usual and therefore have negative DateBreaks Factors*. Those names are McDonald's Corporation (NYSE:MCD), IDEX Corporation (NYSE:IEX), Edwards Lifesciences Corp (NYSE:EW), Mid-America Apartment Communities (NYSE:MAA), McKesson Corporation (NYSE:MCK), The Hershey Company (NYSE:HSY), ConocoPhillips (NYSE:COP), T. Rowe Price (NASDAQ:TROW) and Catalent Inc. (NYSE:CTLT). * Wall Street Horizon DateBreaks Factor: statistical measurement of how an earnings date (confirmed or revised) compares to the reporting company's 5-year trend for the same quarter. Negative means the earnings date is confirmed to be later than historical average while Positive is earlier. This season peak weeks will fall between Jan. 29 - March 1, with each week expected to see over 1,000 reports. Currently Feb. 22 is predicted to be the most active day with 561 companies anticipated to report. Thus far, 64% of companies have confirmed their earnings date and 18% have reported (out of our universe of 10,000+ global names). Roughly 46% of the S&P 500 has reported. Source: Wall Street Horizon 1 Alphabet Announces Fourth Quarter and Fiscal Year 2023 Results, January 30, 2024, https://abc.xyz2 Earnings Release FY24 Q2, Microsoft, January 30, 2024, https://www.microsoft.com3 Apple reports first quarter results, February 1, 2024, https://www.apple.com4 Amazon.com Announces Fourth Quarter Results, February 1, 2024, https://ir.aboutamazon.com5 Meta Reports Fourth Quarter and Full Year 2023 Results; Initiates Quarterly Dividend, February 1, 2024, https://s21.q4cdn.com6 Fourth Quarter 2023 Results Conference, Meta, February 1, 2024 Call, https://s21.q4cdn.com7 Earnings Insight, FactSet, John Butters, February 2, 2024, https://advantage.factset.com8 Federal Reserve issues FOMC statement, January 31, 2024, https://www.federalreserve.gov9 CME FedWatch Tool, CME Group, February 2, 2024, https://www.cmegroup.com10 Employment Situation Summary, U.S. Bureau of Labor Statistics, February 2, 2024, https://www.bls.gov11 Time Will Tell: Information in the Timing of Scheduled Earnings News, Journal of Financial and Quantitative Analysis, Eric C. So, Travis L. Johnson, Dec, 2018, https://papers.ssrn.com? Copyright 2024 Wall Street Horizon, Inc. All rights reserved. Do not copy, distribute, sell or modify this document without Wall Street Horizon's prior written consent. This information is provided for information purposes only. Neither TMX Group Limited nor any of its affiliated companies guarantees the completeness of the information contained in this publication, and we are not responsible for any errors or omissions in or your use of, or reliance on, the information. This publication is not intended to provide legal, accounting, tax, investment, financial or other advice and should not be relied upon for such advice. The information provided is not an invitation to purchase securities, including any listed on Toronto Stock Exchange and/or TSX Venture Exchange. TMX Group and its affiliated companies do not endorse or recommend any securities referenced in this publication. TMX, the TMX design, TMX Group, Toronto Stock Exchange, TSX, and TSX Venture Exchange are the trademarks of TSX Inc. and are used under license. Wall Street Horizon is the trademark of Wall Street Horizon, Inc. All other trademarks used in this publication are the property of their respective owners. This article first appeared on GuruFocus. Related Quotes "
}