{
    "title": null,
    "date": "2/18/2024",
    "url": "https://www.whichcar.com.au/explore/explore-sa/googs-track",
    "text": "With an idea like that it would be easy to assume Goog was a bit crazy, though I don’t actually think that was the case. He was probably just an ambitious guy who loved a good challenge, and from all accounts he faced that challenge with a huge smile and plenty of laughs. The record states that Goog took on this task in search of better grazing land for his cattle, though I think it’s more likely he was just looking to have some fun and adventure. Years of blazing hot sun probably cooked his brain a little, but it’s probably best to overlook that as the normal kind of Aussie crazy. Now, almost 50 years later, the original unmaintained single track remains as a primitive route through the scrubby bush. Famously, as it heads directly north, the track climbs up and over 363 bright red sand dunes, and we will have to climb up and over every single one of them as we push towards the red centre. After exploring the Victorian High Country and Tasmania in my Jeep Gladiator, I’m feeling more confident with the setup every day, and Googs Track feels like the perfect opportunity for remote exploration, where I can put all systems to the test in preparation for much more remote desert travel to come. Looking west, a huge road sign announces I would still need to drive 2000km to reach Perth, while facing east an equally large sign shows there are also 2000km to Sydney. While Perth is in the plan on this tour, it will be many months before I venture further west than I am now. In Ceduna I fill both the main and auxiliary petrol tanks to the brim, and get some friendly ribbing at the service station from a LandCruiser owner who thinks my Jeep won’t be able to handle the soft sand on Googs Track. After many months in Australia, I’m getting used to this kind of thing and as usual I will let the Jeep do the talking. At these pressures the tyres will have a much larger contact patch giving much more grip in the soft sand. If needed, I can go much lower, though I’ll start at this pressure and see just how soft the sand gets. I also attach a sand flag to the roof rack to make the Jeep more visible to oncoming vehicles, and I will drive with my headlights on at all times. Over the years there have been horrific crashes when two vehicles meet on top of dunes, both aggressively climbing at speed and unable to see each other until the last second. At first the track is dusty and corrugated as it meanders past cattle stations and eucalyptus trees that are huddled together looking as if they’re trying to conserve water. With the stations fading in the rear view mirror we pass through the dog fence that runs east to west for many thousands of kilometres. Packing a punch of 6000 volts and buried into the ground, this fence is an attempt to stop the enormous plagues of rabbits, dingoes and wild cats from roaming freely. In the first hours the track passes over only a handful of smaller bright red dunes that are easy to climb. Nothing presents a problem, and we make slow and steady progress until reaching camp at sunset. Googs Lake is an enormous salt pan that rarely contains water. While cooking a huge feast of burgers and salad for dinner, we are treated to an impressive display of heat lightning far to the south as rainstorms that have ravaged much of the continent continue their endless assault. All day I’ve been shocked by how green the desert is, a clear indication of the heavy rainfall that is seemingly endless. These massive dunes that run east to west across the track are the only feature in the otherwise flat landscape, and they stretch into the distance like an endless procession of ocean swell rolling towards shore. Because the dunes run east to west to the horizon, and we’re driving north, we must climb directly up and over every single one. The dunes come thick and fast, usually with only a couple of hundred yards rest between each. Roughly speaking there appear to be about 10 or 15 smaller dunes that slowly build in height until we reach a much taller dune, from the top of which we are treated to stunning views over the harsh landscape that stretches to the horizon. These larger dunes are much softer, and because we’re the first vehicle to tackle them for the day, the top of each is a mound of soft untouched sand that has blown in overnight. The climb up the face of these dunes is often rutted and lumpy, thanks to other vehicles having struggled and dug holes through excessive wheel spin. Towing a trailer is not recommended on Googs Track, though plenty of people still do. Moving north we catch the occasional glimpse of emus darting away, which move extremely quickly through the scrub and small trees. We also spot plenty of wild camel tracks in the soft sand, leaving no doubt they use the track to move around, though we never actually see any. As the day wears on we spot hundreds and hundreds of golden orb spiders building enormous webs that are often more than three metres across. Apparently they’re doing great in the wetter-than-usual conditions, and many are nearly as big as my hand across. Though they are not considered toxic to humans, I fall firmly in the ‘leave them alone’ camp when it comes to snakes and spiders. For hour after hour we continue north in the same fashion before stopping under a scrawny gum tree in an attempt to find some shade for lunch.  Late in the afternoon we roll into camp at Mount Finke, the only feature on the landscape for hundreds of miles in any direction. We haven’t seen a vehicle or heard anything on the radio for the entire day, and we’re a little shocked to see other people at camp. After a day without hearing a single crackle, it’s reassuring to know our radio works just fine. In the morning we rise early and hike to the top of the rocky mountain to catch a stunning red sunrise that stretches far across the landscape. With the sun low on the horizon the waves of sand are clear to see, and it’s humbling to realise we’ve only crossed a few hundred of the many, many thousands that stretch as far as the eye can see. According to his wife Jenny, the nickname ‘Goog’ was given to him early in life as a result of him selling eggs for his mum, and as they tend to do, the nickname stuck. Soon after tying the knot, Goog and Jenny moved to a property north of Ceduna, which they named Lone Oak. The property was originally 5800 acres (2300ha) of scrub just north of the dog fence with thick bush and sandhills extending north to the east-west railway line, 200km away. Together they built a family home on the property and over the next five years their three children were born. Often friends and other local farmers pitched in to help, and it was all hands on deck. A grader was eventually purchased and at times a bulldozer was used to get through the most difficult areas. Goog and his family faced numerous challenges as they slogged away building the track. From drought to bushfires, worn-out machinery to the relentless heat, they had an impossibly hard time of it. Without a breath of wind temperatures can push towards 50°C, and for that reason it is strongly advised not to drive the track in during the summer. The Australian outback is not a friendly or forgiving place, and completing this track took an unimaginable amount of hard work and perseverance. In stark contrast we completed the track in just a couple of days, and I’m ashamed to say we had the air conditioner running most of the time.While his track and legacy live on, Goog was sadly killed in an accident near the track in 1996. After visiting the memorial constructed near his namesake lake, I spent many hours thinking about Goog and his herculean effort against all odds. I like to think he still gets a laugh about all the people driving his track 50 years after his incredible achievement. Goog’s wife Jenny has written an excellent account of their lives and adventures building the Googs Track called Memories of Pushing Goog's Track. It is available for purchase at available at googstrack.com You can join Dan Grec’s ongoing adventures on YouTube and Instagram @TheRoadChoseMe [↗️] Explore SA Will Googs Track be as challenging in the wet as it is in the dry? Let's find out "
}