{
    "title": "Alphabet, Amazon likely to follow Meta by introducing dividends in 2024",
    "date": "2/12/2024",
    "url": "https://www.marketwatch.com/story/alphabet-amazon-likely-to-follow-meta-by-introducing-first-ever-dividends-in-2024-839167f4",
    "text": "There is good news for income-oriented investors — or anybody who owns any of the so-called Magnificent Seven tech stocks that have powered much of the S&P 500’s gains over the past year. Meta Platforms Inc. \n        META,\n        -1.68%\n       likely won’t be the only megacap company to introduce a first-ever dividend in 2024, according to a team of analysts at Goldman Sachs Group \n        GS,\n        +0.59%. Fellow Magnificent Seven members Alphabet Inc. \n        GOOGL,\n        +0.04%\n       and Amazon.com Inc. \n        AMZN,\n        +0.31%\n       are well positioned to introduce dividends of their own this year, according to an analysis from a team of Goldman Sachs equity analysts led by David Kostin. Investors’ interest in dividend-paying stocks has increased since Meta announced its first-ever quarterly dividend earlier this month, according to the Goldman team. The increased interest has prompted the team to raise its forecast for the S&P 500’s \n        SPX\n       dividend-per-share payout to 6%, up from 4% previously. Opinion: Meta stuns Wall Street with its first dividend. Amazon and Alphabet could be next. Another factor driving the Goldman team’s dividend optimism is the fact that the largest U.S. companies have generally surpassed Wall Street’s expectations when reporting their earnings from the final three months of 2023. Earnings-per-share growth for the quarter is on track to hit 7% year over year for S&P 500 companies, compared with analysts’ estimates of 3% growth at the start of the season, according to Goldman. Meta shares soared 20% the day after the company announced a quarterly dividend of 50 cents a share, payable March 26. The company also reported blowout earnings growth, reporting a net income of $14.02 billion, or $5.33 a share, compared with $4.65 billion, or $1.76 a share, during the same period a year earlier. Companies most likely to introduce or increase dividends typically have similar characteristics: wide profit margins, stable earnings, an existing program of share buybacks and relatively low valuations, according to the Goldman team. While most of the companies included in the list above will likely continue to favor share buybacks as a way to return capital to shareholders, “for companies with stable cash flows, and especially those with large existing buyback programs, a dividend could signal confidence about future earnings and attract a new group of income-oriented investors,” Kostin and his team said in the report, dated Friday. Since the start of 2024, 56 companies in the S&P 500 have raised their dividends by a median of 6%, according to Goldman. This group includes 10 financial and nine industrial firms, which have driven the largest share of the increase. Meanwhile, Walgreens Boots Alliance Inc. \n        WBA,\n        +3.19%\n       is the only S&P 500 company to cut its dividend year to date, slashing it by half in order to dedicate more money to growing its business. Now read: Is Meta now a value stock? And: This grouping of stocks has actually kept up with the Magnificent Seven, and with a lot less risk The company says the leaked data set seems to be from 2019 or earlier. Joseph Adinolfi is a markets reporter at MarketWatch. Joseph Adinolfi is a markets reporter at MarketWatch. Visit a quote page and your recently viewed tickers will be displayed here. "
}