{
    "title": "Alphabet Inc. (GOOG) Stock Drops Despite Market Gains: Important Facts to \nNote",
    "date": "3/19/2024",
    "url": "https://finance.yahoo.com/news/alphabet-inc-goog-stock-drops-214517589.html",
    "text": "In the latest market close, Alphabet Inc. (GOOG) reached $147.92, with a -0.38% movement compared to the previous day. The stock fell short of the S&P 500, which registered a gain of 0.57% for the day. Meanwhile, the Dow gained 0.83%, and the Nasdaq, a tech-heavy index, added 0.39%. Coming into today, shares of the company had gained 4.74% in the past month. In that same time, the Computer and Technology sector gained 3.42%, while the S&P 500 gained 2.97%. Investors will be eagerly watching for the performance of Alphabet Inc. in its upcoming earnings disclosure. It is anticipated that the company will report an EPS of $1.49, marking a 27.35% rise compared to the same quarter of the previous year. Meanwhile, our latest consensus estimate is calling for revenue of $65.95 billion, up 13.58% from the prior-year quarter. Regarding the entire year, the Zacks Consensus Estimates forecast earnings of $6.77 per share and revenue of $286.48 billion, indicating changes of +16.72% and +11.68%, respectively, compared to the previous year. Investors should also take note of any recent adjustments to analyst estimates for Alphabet Inc. These revisions help to show the ever-changing nature of near-term business trends. Therefore, positive revisions in estimates convey analysts' confidence in the company's business performance and profit potential. Our research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system. Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 0.16% upward. Alphabet Inc. is currently a Zacks Rank #3 (Hold). In terms of valuation, Alphabet Inc. is presently being traded at a Forward P/E ratio of 21.92. This signifies a discount in comparison to the average Forward P/E of 25.52 for its industry. We can additionally observe that GOOG currently boasts a PEG ratio of 1.37. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. As the market closed yesterday, the Internet - Services industry was having an average PEG ratio of 2.24. The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 90, putting it in the top 36% of all 250+ industries. The Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Remember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}