{
    "title": "ZRC Wealth Management LLC Raises Position in Alphabet Inc. (NASDAQ:GOOGL)",
    "date": "3/27/2024",
    "url": "https://www.defenseworld.net/2024/03/27/zrc-wealth-management-llc-raises-position-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 27th, 2024 ZRC Wealth Management LLC grew its holdings in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 109.7% during the 4th quarter, Holdings Channel reports. The fund owned 28,939 shares of the information services provider’s stock after buying an additional 15,138 shares during the period. Alphabet comprises  2.1% of ZRC Wealth Management LLC’s portfolio, making the stock its 9th biggest holding. ZRC Wealth Management LLC’s holdings in Alphabet were worth $3,787,000 at the end of the most recent reporting period. Several other institutional investors have also added to or reduced their stakes in GOOGL. Live Oak Investment Partners bought a new stake in shares of  Alphabet during the 4th quarter valued at $26,000.  VitalStone Financial LLC raised its position in shares of  Alphabet by 1,900.0% during the 2nd quarter. VitalStone Financial LLC now owns 280 shares of the information services provider’s stock valued at $34,000 after purchasing an additional 266 shares during the period.  Sanctuary Wealth Management L.L.C. bought a new stake in shares of  Alphabet during the 4th quarter valued at $34,000.  Turim 21 Investimentos Ltda. bought a new stake in shares of  Alphabet during the 3rd quarter valued at $38,000.  Finally, Meritage Group LP raised its position in shares of  Alphabet by 1,061.5% during the 3rd quarter. Meritage Group LP now owns 302 shares of the information services provider’s stock valued at $40,000 after purchasing an additional 276 shares during the period. 40.03% of the stock is currently owned by institutional investors. Several research firms recently weighed in on GOOGL. Wedbush raised their target price on shares of Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a research note on Friday, March 22nd. Barclays cut their target price on shares of Alphabet from $180.00 to $173.00 and set an “overweight” rating for the company in a research note on Wednesday, January 31st. Citigroup raised their target price on shares of Alphabet from $153.00 to $168.00 and gave the company a “buy” rating in a research note on Wednesday, January 31st. JMP Securities lifted their price objective on shares of Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a research note on Wednesday, January 31st. Finally, Truist Financial dropped their price objective on shares of Alphabet from $160.00 to $158.00 and set a “buy” rating for the company in a research note on Wednesday, January 31st. Five research analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have given a strong buy rating to the company. According to data from MarketBeat.com, the stock presently has an average rating of “Moderate Buy” and an average target price of $155.48. Get Our Latest Report on GOOGL Shares of Alphabet stock opened at $150.67 on Wednesday. The firm’s 50 day moving average price is $143.17 and its 200-day moving average price is $137.93. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a 52-week low of $99.74 and a 52-week high of $153.78. The company has a market cap of $1.87 trillion, a P/E ratio of 25.98, a PEG ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The firm had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. During the same quarter in the previous year, the firm earned $1.05 EPS.  On average, sell-side analysts predict that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. In other news, CAO Amie Thuener O’toole sold 425 shares of Alphabet stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the transaction, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the business’s stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total transaction of $59,334.25. Following the sale, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The transaction was disclosed in a legal filing with the SEC, which can be accessed through the SEC website. Also, CEO Sundar Pichai sold 22,500 shares of the business’s stock in a transaction that occurred on Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total transaction of $3,152,475.00. Following the sale, the chief executive officer now directly owns 2,422,691 shares in the company, valued at approximately $339,443,236.01. The disclosure for this sale can be found here. Insiders have sold a total of 279,659 shares of company stock valued at $39,460,310 in the last 90 days. Insiders own  0.88% of the company’s stock. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. JPMorgan Chase & Co. (NYSE:JPM) Shares Sold by B & T Capital Management DBA Alpha Capital Management Cambridge Advisors Inc. Has $1.39 Million Position in Alphabet Inc. (NASDAQ:GOOGL) "
}