{
    "title": "Google: Great Apple News Amid Fears Of Inferiority (NASDAQ:GOOG)",
    "date": "3/20/2024",
    "url": "https://seekingalpha.com/article/4679473-google-great-apple-news-amid-fears-of-inferiority",
    "text": "pressureUA  pressureUA Finally, Alphabet Inc. aka Google (NASDAQ:GOOG, NASDAQ:GOOGL) investors received some good news this past week. According to a Bloomberg report, Apple (AAPL) is in talks with the search giant to license its Gemini LLM (large language model) to power iPhone AI features. In response, Google's stock saw one of its highest single-day increases in several months. The news is perceived as a clear testament to Google's superiority in the LLM landscape, during a time when Google seems to disappoint investors on every chance they get. While this obviously a positive development, it remains to be seen whether or not the partnership materializes, and in what form. Let's dive into the search giant's prospects and try to understand why it remains the most undervalued among big tech. I've been covering Alphabet on Seeking Alpha since March of 2023. Despite maintaining a Buy rating throughout the period, most of my articles focused on criticizing the company. Specifically, its unwillingness to turn things around, its lack of efficiency, and its consistent execution failures. I think this pretty much reflects the conflict many Google investors face. On the one hand, the company trades at a market-average multiple, it's the cheapest among big tech, and it still owns several of the strongest businesses in the world. On the other hand, Alphabet is cheap for a reason. Investors perceive its management as inferior compared to the rest of big tech, after continuous underperformance. Even on the AI front, where Google was supposed to be a leader, it seems like the company doesn't have a well-defined strategy. Additionally, so far, Alphabet refrained from going through an aggressive efficiency shakeup. Data by YCharts Unsurprisingly, for the last year, Alphabet's stock is trailing behind other big tech names, coming only in line with the Nasdaq 100 (QQQ). Still, investors are torn between a high-quality business with a wide moat and a relatively low valuation, and the fact that this business is currently underperforming. Which is why the recent Apple news led to such enthusiasm. It's been three days since Bloomberg broke the news about talks between Apple and Google for the iPhone maker to license the Gemini LLM. If this deal were to close, it would be a powerful testament to Google's superiority in AI, compared to OpenAI and other LLMs that are open-sourced like Llama. In terms of financial implications, however, it's hard to say, as the deal terms remain unknown. As we all know, Google and Apple already have a longstanding relationship in search, where Google pays Apple a significant amount of money to be the default search engine in Safari. Interestingly, in this case, most pundits suggest Apple will be the one who pays Google to use its model, which isn't as obvious as one might think. With all that said, it's important to emphasize that no deal has been formally announced and no talks have been confirmed. Furthermore, the same news piece said Apple is also talking with OpenAI. In my view, Google's stock was up not necessarily because of investors pricing the potential benefit from a deal, but rather, because investors understand Google is cheap, and they want to cash in on the optionality the current valuation provides, ahead of a potential turnaround or an actual development. Google is the number one search engine in the world, and its market share has been hovering conveniently in the low nineties for almost a decade. Similarly, Gmail remains the most popular E-mail platform, and YouTube is the most-watched streaming platform and one of the most popular social media apps worldwide. That's all great, but investors should care about how Google translates this popularity into revenues. And of course, Google does that primarily through advertising and cloud services. Created by the author using data from Alphabet's financial reports. Created by the author using data from Alphabet's financial reports. According to Alphabet's 10-K, more than 75% of the company's revenues in 2023 were generated from online advertising. That comes down to approximately $240 billion, which uncoincidentally equals the combined revenues of Google Search & other, YouTube ads, and Google Network. Those three categories combined grew by a lackluster 6% in 2023. For comparison, Meta Platform's (META) advertising revenues grew by 16% during this period, and Amazon's (AMZN) grew even faster, at 24%. Created and calculated by the author using data from the companies' financial reports. Created and calculated by the author using data from the companies' financial reports. As we can see, Alphabet has been losing significant share in online advertising, and while Meta is showing clear signs of recovery from its 2022 trough, Alphabet's decline is only getting sharper. And, Alphabet's second most important line of business, Google Cloud, doesn't compare much better to its competitors. Created and calculated by the author using data from the companies' financial reports. Created and calculated by the author using data from the companies' financial reports. As of Q4 2023, Google Cloud was far behind AWS and Microsoft Intelligent Cloud (MSFT) in terms of share, with 15.5%. Despite being much smaller and the least profitable, Google's growth lags behind Microsoft. Created and calculated by the author using data from the companies' financial reports. Created and calculated by the author using data from the companies' financial reports. Overall, we can see why investors are worried about Google's inferiority, with almost 90% of the company's revenues coming from businesses that are underperforming peers. During a terrible 2022 for technology stocks, many companies went through a major transformation to become much leaner and profitable, cutting unnecessary headcount and divesting non-core businesses. One such company was Meta, which delivered one of the most impressive turnarounds in history with Zuckerberg's 'Year of Efficiency'. Google investors were hoping to see something similar from Sundar Pichai, as Google's operating profit plunged 400 bps in 2022. That is yet to happen, though. While Meta arguably had a deeper hole to climb out from, its 10 percentage points operating margin improvement was justifiably received with enthusiasm. For Google, a lackluster 96-bps improvement is quite disappointing. Data by YCharts Looking ahead to 2024, consensus estimates expect Google's profit margins to improve slightly from 24.0% to 24.9%, whereas Meta is expected to improve from 29.0% to 32.3%. Again, I think it's reasonable to say investors are rightfully criticizing Google's lack of ambition to cut costs further. Personally, when I see a company that's underperforming rivals and lacks efficiency, I normally cross it off my list. To that, add one of the biggest innovator's dilemmas in history, and I'm sure many investors would be deterred too. However, Alphabet's valuation is too attractive to give up on so easily. Data by YCharts As I'm writing this article, Alphabet trades at a 21.6x P/E, significantly below any other big-tech company. Take it one step further, Alphabet is currently trading right in line with the S&P 500's multiple at 21.4x. Moreover, many investors, myself included, believe that Google's businesses still have the potential to take back the crown or at the very least, narrow the gap with peers. As such, I still think that as long as Alphabet trades at a market-average multiple and significantly below its peers, investors won't be wrong to want to capitalize on the opportunity, with the company's turnaround potential viewed as a free \"option.\" Alphabet has been disappointing investors for several quarters in a row, as it underperforms its rivals both in terms of growth and profitability. In a vacuum, the stock performed well, but a closer look shows Alphabet underperformed every one of its peers while providing returns that are in line with the QQQ. Amid fears of continued inferiority, recent news about Apple considering licensing Google's LLM provides some optimism as to the company's technological superiority. While this is far from being a done deal, the news reminded investors that they can buy Google at an objectively low valuation, and get its turnaround optionality for free. Therefore, I reiterate Alphabet stock as a Buy. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of MSFT. AMZN, META either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}