{
    "title": null,
    "date": "3/21/2024",
    "url": "https://www.fool.com/investing/2024/03/21/3-artificial-intelligence-ai-stocks-to-buy-march/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More There's no doubt about it: Some artificial intelligence (AI) stocks are just too expensive to buy right now. However, plenty are still fairly priced and look like prime candidates to load up on in March. On my list of best AI stocks to buy in March are Alphabet (GOOG 0.21%) (GOOGL 0.04%), UiPath (PATH -0.48%), and Adobe (ADBE 0.04%). All three can be bought for a fair price and still have plenty of upside. Alphabet's AI progress has been completely overshadowed by its blunders. Alphabet has made one mistake after another during its rollouts, but with the company's vast engineering resources and knowledge, it will only stay down for so long. Additionally, its primary business, advertising, is beginning to thrive again after a rough few quarters driven by fears of a recession. In Q4, ad revenue was up 11% across all divisions. Other segments, like its Google Cloud division, increased much faster, helping bring overall revenue growth to 13%. Despite this, Alphabet's stock trades at a discount to the market and from a historical perspective.  GOOGL PE Ratio data by YCharts With the S&P 500 trading at 21.4 times forward earnings, Alphabet stock trades on par with the broader market. But with Alphabet growing at an above-average pace combined with an AI catalyst that has yet to take hold of the stock and company, Alphabet is primed for greater upside when it finally starts executing at a high level, which should be only a matter of time. AI is becoming a hot topic for many management teams. They need to develop AI applications to show investors and clients that they are keeping up with the times. One way to do this is to deploy UiPath's robotic process automation (RPA) software. RPA allows users to automate repetitive tasks, making them more efficient and freeing them to do work that requires original thinking. When RPA software is supplemented with AI, the range of tasks it can automate dramatically increases. UiPath offers products that integrate both technologies, making it a great pick in the AI space. UiPath recently closed its FY 2024 (ending January 31) with a strong Q4, with annual recurring revenue (ARR) increasing 22% to $1.46 billion. Additionally, the company guided ARR to come in around $1.73 billion for FY 2025, indicating about 19% growth.  PATH Revenue (Quarterly) data by YCharts However, the market wanted more and sold the stock off following the release of this report. As a result, it can be picked up for an attractive 10 times sales. UiPath is a great company to take advantage of while the market is giving you a discounted price, as the RPA market opportunity is expected to grow at a 40% compounded annual growth rate from 2023 to 2030. Adobe is another company that's working to integrate AI into its products. Its Firefly AI model harnesses the power of large language models (LLMs) to generate high-quality images. This model has been a hit and was a major focus of Adobe's Q1 FY 2024 (ending March 1). Firefly has attracted new customers and produced great results for existing ones. For example, IBM created 200 marketing campaign images and 1,000 variations in an instant rather than in months, and that material helped drive 26 times greater engagement than its benchmark. Those kinds of results will keep Adobe at the top of the digital creation space, making it a top investment. Adobe also had a strong Q1, with revenue rising 11% year over year to $5.18 billion. Its earnings per share (EPS) would have risen from $2.72 to $3.58 (a 32% increase), but Adobe had to pay a $1 billion breakup fee for the terminated Figma acquisition. However, because Adobe guided for $5.25 billion to $5.3 billion in Q2 revenue while analysts expected $5.31 billion, the stock fell around 13% the day after earnings. This is a prime opportunity to scoop up Adobe shares cheaply, as the stock now trades for about 29 times FY 2024 estimates. Considering Adobe usually trades for around 50 times trailing earnings, the stock could have massive upside if it hits those estimates. Adobe is a long-term winner in its segment, and investors should feel confident in the business moving forward, even if Wall Street isn't happy with a slight miss on revenue guidance. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Adobe, Alphabet, and UiPath. The Motley Fool has positions in and recommends Adobe, Alphabet, and UiPath. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}