{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/alphabet-inc-nasdaqgoogl-shares-purchased-by-west-wealth-group-llc.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 West Wealth Group LLC boosted its holdings in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 12.7% in the fourth quarter, HoldingsChannel.com reports. The firm owned 1,915 shares of the information services provider’s stock after acquiring an additional 216 shares during the period. West Wealth Group LLC’s holdings in Alphabet were worth $268,000 as of its most recent filing with the Securities and Exchange Commission (SEC). A number of other hedge funds have also recently added to or reduced their stakes in the business. Procyon Advisors LLC boosted its holdings in  Alphabet by 10.0% in the fourth quarter. Procyon Advisors LLC now owns 114,417 shares of the information services provider’s stock worth $15,983,000 after purchasing an additional 10,378 shares during the period.  Parisi Gray Wealth Management boosted its holdings in shares of  Alphabet by 1.1% during the fourth quarter. Parisi Gray Wealth Management now owns 35,579 shares of the information services provider’s stock valued at $4,970,000 after acquiring an additional 403 shares during the period.  Next Level Private LLC boosted its holdings in shares of  Alphabet by 1.7% during the fourth quarter. Next Level Private LLC now owns 4,505 shares of the information services provider’s stock valued at $629,000 after acquiring an additional 76 shares during the period.  First National Corp MA ADV boosted its holdings in shares of  Alphabet by 5.1% during the fourth quarter. First National Corp MA ADV now owns 22,635 shares of the information services provider’s stock valued at $3,162,000 after acquiring an additional 1,100 shares during the period.  Finally, Planned Solutions Inc. acquired a new position in shares of  Alphabet during the fourth quarter valued at $137,000. Institutional investors and hedge funds own  40.03% of the company’s stock. Several brokerages have recently issued reports on GOOGL. Redburn Atlantic boosted their price target on shares of Alphabet from $150.00 to $165.00 and gave the company a “buy” rating in a report on Wednesday, January 31st. BMO Capital Markets boosted their price target on shares of Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Susquehanna boosted their price target on shares of Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a report on Wednesday, January 31st. Wolfe Research lifted their price objective on shares of Alphabet from $170.00 to $180.00 and gave the company an “outperform” rating in a research note on Wednesday, January 31st. Finally, KeyCorp lifted their price objective on shares of Alphabet from $153.00 to $165.00 and gave the company an “overweight” rating in a research note on Monday, January 29th. Five investment analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have given a strong buy rating to the stock. According to MarketBeat.com, Alphabet currently has a consensus rating of “Moderate Buy” and an average price target of $155.48. Check Out Our Latest Stock Report on Alphabet In other Alphabet news, SVP Prabhakar Raghavan sold 16,088 shares of Alphabet stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the transaction, the senior vice president now owns 52,440 shares of the company’s stock, valued at approximately $7,294,404. The transaction was disclosed in a document filed with the SEC, which is available at this hyperlink. In other Alphabet news, insider John Kent Walker sold 48,076 shares of Alphabet stock in a transaction dated Tuesday, February 20th. The stock was sold at an average price of $142.20, for a total transaction of $6,836,407.20. Following the transaction, the insider now owns 12,725 shares of the company’s stock, valued at approximately $1,809,495. The transaction was disclosed in a document filed with the SEC, which is available at this hyperlink. Also, SVP Prabhakar Raghavan sold 16,088 shares of the business’s stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.10, for a total value of $2,237,840.80. Following the completion of the sale, the senior vice president now directly owns 52,440 shares of the company’s stock, valued at approximately $7,294,404. The disclosure for this sale can be found here. In the last quarter, insiders have sold 263,312 shares of company stock valued at $37,268,315. 0.88% of the stock is owned by corporate insiders. Shares of GOOGL opened at $150.93 on Friday. The business’s 50-day moving average price is $143.67 and its 200 day moving average price is $138.21. The stock has a market capitalization of $1.88 trillion, a P/E ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. Alphabet Inc. has a 1-year low of $99.78 and a 1-year high of $153.78. The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. The firm had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same quarter last year, the business posted $1.05 EPS.  Analysts expect that  Alphabet Inc. will post 6.77 earnings per share for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 1,264 Shares in Kenvue Inc. (NYSE:KVUE) Bought by Planned Solutions Inc. Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by Parisi Gray Wealth Management "
}