{
    "title": null,
    "date": "3/6/2024",
    "url": "https://timesofindia.indiatimes.com/life-style/relationships/web-stories/sundar-pichai-all-about-his-education-salary-family-and-more/photostory/108254797.cms",
    "text": "Mar 6, 2024 Indian-origin CEO of Alphabet Inc and Google, Sundar Pichai is currently in the news. Let's take a look at his education, salary, family, and more here. PTI The Indian-American executive was born on June 10, 1972 in Madurai, Tamil Nadu, India. Lakshmi, his mother, was a stenographer, while his father, Regunatha Pichai, worked at GEC as an electrical engineer. PTI While he is better known as Sundar Pichai, the Google CEO's full name is Pichai Sundararajan. Reuters Sundar Pichai completed his schooling from Jawahar Vidyalaya Senior Secondary School in Chennai, and Class XII from Vana Vani school. He then studied earned metallurgical engineering from IIT Kharagpur. Canva It was followed by an M.S. in materials science and engineering from Stanford University, and an MBA from Wharton School, University of Pennsylvania. Canva Pichai worked at Applied Materials and at McKinsey & Company for a few months. In 2004, he joined Google where he worked and headed various projects. In October 2015, he was appointed as Google's CEO after the completion of Alphabet Inc, which includes Google. In 2017, he was made one of Alphabet's Board of Directors. Canva As per reports in 2022, Pichai received a total compensation of $226 million! Pichai's net worth is said to be approximately $1.66 billion. Reuters Sundar Pichai has been named in TIME's annual list of the 100 most influential people in the world twice-- in 2016 and 2020. Canva Sundar Pichai is married to Anjali Pichai, a chemical engineer whom he met at IIT Kharagpur. Together they have two children: Kavya Pichai and Kiran Pichai. etimes.in Recently, Google's AI chatbox called Gemini is being accused by many for being racist. This has sparked a controversy, with many people wanting Sundar Pichai to resign as the CEO of Google. Canva Thanks For Reading! Read Next "
}