{
    "title": "Paramount most shorted S&P 500 communications stock in February; Alphabet \nleast shorted (NYSEARCA:XLC)",
    "date": "3/14/2024",
    "url": "https://seekingalpha.com/news/4079579-paramount",
    "text": "primeimages Bets against communication services stocks are marginally higher from the end of January. Media company Paramount Global (PARA) was the most shorted stock in the sector, while Google parent Alphabet (GOOG) was the least shorted one. Average short interest across S&P500 communication services stocks was 1.32% of shares float in end-February, up from 1.29% at the end of January. The S&P500’s communications services sector (NYSEARCA:XLC) is up nearly 10% from the start of the year, outperforming the 8% rise in the broader S&P500 Index. Ranked by short interest as a percentage of shares float  Meta Platforms Class A (META), Alphabet Class A (GOOG), Netflix (NFLX), the three largest contributors to the index, had short interest of 1.27%, 0.25% and 1.84%, respectively. Paramount Global (PARA) had 84.80M shares sold short as of February 29, or 14.69% of the shares float. Charter Communications (CHTR) was the second most shorted stock at 11% of shares float, followed by Live Nation Entertainment (LYV) and Fox (FOXA) with short interest of 8.77% and 6.91% respectively. Alphabet (GOOG) was preceded by media giant Disney (DIS) with short interest of 0.97% and Comcast (CMCSA) with 1.22% short interest. Average short interest as a percentage of floating shares  Wireless Telecommunication Services, which only includes T Mobile US (TMUS), remains the most shorted industry within the sector, with 5.65% short interest as of end-February, down from 6.76% during end-January. Media industry and entertainment stocks took the second spot with 2.88% short interest as of February 29, compared to 2.74% and 2.70% respectively at Jan-end. Interactive Media and Services, which has stocks like Alphabet (GOOG) and Meta Platforms (META), was the least shorted industry in the sector with 0.49% short interest as of February 29. "
}