{
    "title": "Canvas Wealth Advisors LLC Sells 5007 Shares of Alphabet Inc. (NASDAQ:GOOGL)",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/canvas-wealth-advisors-llc-sells-5007-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 Canvas Wealth Advisors LLC lessened its stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 5.2% during the 4th quarter, according to the company in its most recent 13F filing with the SEC. The firm owned 91,316 shares of the information services provider’s stock after selling 5,007 shares during the quarter. Alphabet accounts for about  4.7% of Canvas Wealth Advisors LLC’s holdings, making the stock its 5th biggest position. Canvas Wealth Advisors LLC’s holdings in Alphabet were worth $13,026,000 as of its most recent filing with the SEC. Other large investors have also recently added to or reduced their stakes in the company. DE Burlo Group Inc. increased its stake in shares of  Alphabet by 520.0% during the 2nd quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider’s stock worth $11,551,000 after purchasing an additional 80,934 shares during the last quarter.  West Tower Group LLC acquired a new position in shares of  Alphabet during the 2nd quarter worth $88,000.  Ballast Advisors LLC increased its stake in shares of  Alphabet by 9.6% during the 3rd quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider’s stock worth $2,061,000 after purchasing an additional 1,385 shares during the last quarter.  Quantum Financial Advisors LLC increased its stake in shares of  Alphabet by 8.0% during the 3rd quarter. Quantum Financial Advisors LLC now owns 7,623 shares of the information services provider’s stock worth $998,000 after purchasing an additional 564 shares during the last quarter.  Finally, Acadian Asset Management LLC increased its stake in shares of  Alphabet by 2.4% during the 3rd quarter. Acadian Asset Management LLC now owns 4,416,533 shares of the information services provider’s stock worth $577,908,000 after purchasing an additional 104,366 shares during the last quarter. Institutional investors and hedge funds own  40.03% of the company’s stock. Shares of Alphabet stock opened at $150.93 on Friday. The stock has a market capitalization of $1.88 trillion, a P/E ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The company has a 50-day simple moving average of $143.52 and a 200 day simple moving average of $138.12. Alphabet Inc. has a 12-month low of $99.78 and a 12-month high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last announced its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. The business had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter last year, the company posted $1.05 EPS.  Research analysts expect that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. GOOGL has been the topic of several analyst reports. JMP Securities increased their price target on shares of Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a research note on Wednesday, January 31st. Truist Financial decreased their price objective on shares of Alphabet from $160.00 to $158.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. Needham & Company LLC  reaffirmed a “buy” rating and set a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Wells Fargo & Company upped their price objective on shares of Alphabet from $141.00 to $144.00 and gave the stock an “equal weight” rating in a report on Monday, March 18th. Finally, Roth Mkm decreased their price objective on shares of Alphabet from $166.00 to $164.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. Five analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have given a strong buy rating to the company’s stock. According to MarketBeat, the company presently has a consensus rating of “Moderate Buy” and a consensus price target of $155.48. View Our Latest Stock Analysis on GOOGL In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the firm’s stock in a transaction dated Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares in the company, valued at approximately $3,805,628.99. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available at this hyperlink. In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction dated Wednesday, January 3rd. The shares were sold at an average price of $140.11, for a total value of $3,152,475.00. Following the completion of the sale, the chief executive officer now owns 2,422,691 shares in the company, valued at approximately $339,443,236.01. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available at this hyperlink. Also, CAO Amie Thuener O’toole sold 425 shares of the firm’s stock in a transaction dated Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total transaction of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. Insiders sold 251,138 shares of company stock worth $35,427,655 in the last quarter. 0.88% of the stock is owned by corporate insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.    Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Highland Capital Management LLC Trims Stake in JPMorgan Chase & Co. (NYSE:JPM) The J. M. Smucker Company (NYSE:SJM) Shares Sold by Kingswood Wealth Advisors LLC "
}