{
    "title": null,
    "date": "3/8/2024",
    "url": "https://finance.yahoo.com/news/1-magnificent-seven-stock-warren-114500042.html?prefer_reader_view=1&prefer_safari=1",
    "text": "The \"Magnificent Seven\" is a group of stocks that have led the market since early 2023. However, they've also gotten quite expensive, so it doesn't make sense for a value investor like Warren Buffett and his team at Berkshire Hathaway to buy them. Still, there's one that Buffett and Berkshire might be eyeing: Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL). On the surface, this may seem like a stock Berkshire wouldn't own, but after some digging, it's clear that Alphabet is a stock they would consider buying. Alphabet is probably better known for the companies under its umbrella: Google, YouTube, Android, and others. While news headlines may tell you that Alphabet is losing the AI race (which may be true), at its core, Alphabet is just an advertising business. In the fourth quarter, 76% of revenue came from the ad segment. This sets up the first part of a Buffett investment: Alphabet is a top dog in a timeless field. Advertising has existed for thousands of years and isn't going away. The Google platform has become a must-advertise location if you want to succeed as a business, giving Alphabet strength even in weak times. Alphabet is also a cash flow machine. Over the past 12 months, Alphabet has produced nearly $70 billion in cash and elected to use about $62 billion of it to repurchase shares. This helped reduce the share count by more than 2% in the past year. Buffett's interest might increase with Alphabet's focus on returning capital to shareholders, especially if he thinks the company is doing it well. However, the biggest factor with Alphabet is its valuation. Compared to the S&P 500, Alphabet trades at a lower price. The S&P 500 currently trades at 21 times forward earnings, which is more expensive than Alphabet's stock, which trades at 19.7 times forward earnings. That means Alphabet trades at a lower valuation than the average business in the S&P 500. That assessment doesn't make much sense with how vital Alphabet is in the advertising chain and in other areas like artificial intelligence (AI). Plus, according to Wall Street analysts, Alphabet is expected to grow its earnings per share (EPS) to $6.25 in 2024 and $7.19 in 2025, indicating 17% and 15% growth, respectively. Typically, if a stock is growing its earnings faster than a 10% pace (the long-term average growth rate of the market), it demands a premium due to its above-average growth. However, Alphabet does not, making the stock look fairly cheap. So, does this mean Warren Buffett is a shoo-in for buying Alphabet stock? Probably not. There's no telling what he and his team at Berkshire will do next, and they may believe the broader market is overvalued, disqualifying the assessment above. But just because Buffett may not buy the stock doesn't mean you should ignore it. The facts are clear: Alphabet is still growing at a healthy pace while trading at a below-market premium. That's normally a good opportunity to buy, making Alphabet a great stock pick right now. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy. 1 \"Magnificent Seven\" Stock Warren Buffett Might Buy Soon was originally published by The Motley Fool Related Quotes "
}