{
    "title": "How to Install Google Play / Aptoide TV on FireStick (2024)",
    "date": "3/2/2024",
    "url": "https://www.firesticktricks.com/google-play-fire-stick.html",
    "text": "Fire Stick Tricks Everything About Amazon Fire TV Stick Last updated March 2, 2024 By Patrick In this tutorial, I’ll show you how to install Google Play (Aptoide TV) on FireStick. The steps apply to any Fire TV device, including the FireStick Lite, FireStick 3rd generation, Fire TV Cube, FireStick 4K Max, and FireStick 4K.  Aptoide TV is an alternative app store that allows you to download and install apps on various Android-based devices, including the FireStick. It aims to provide diverse applications, including some unavailable on official app stores such as the Amazon Appstore. Aptoide TV gives you more choice and flexibility when it comes to selecting and accessing apps for FireStick. It has a wide range of apps, including streaming services, gaming, utility apps, and more. The UI is designed specifically for TV screens, making exploring and browsing across various app categories easier. Attention, FireStick Users! Governments and ISPs constantly monitor your online activity, and accessing copyrighted content on your Fire TV Stick could lead to serious trouble. Currently, your IP  is visible to everyone. I strongly recommend getting the best FireStick VPN to mask your IP address and securely stream your favorites. I personally use ExpressVPN, the fastest and most secure VPN available. Not only is it easy to install on any device, it comes with a risk-free 30-day money-back guarantee. Plus, if you're not 100% satisfied, you can always get a refund. ExpressVPN is currently also offering a whopping 3 extra months free on their annual plan! Here are reasons why using a VPN at all times is essential. Read: How to Install and Use Best VPN for FireStick Aptoide TV is a third-party app and game repository. While this raises a safety concern, I scanned its APK file on VirusTotal, and no vendor flagged it as malicious. However, I will recommend that you exercise caution while using third-party applications.  Regarding legality, Aptoide TV is a third-party app store, which is a red flag. The platform insists it’s a legal alternative to Google Play. However, FireStickTricks can’t verify its legitimacy. Legality depends on several factors, including copyright agreements, licenses, and regional laws. I strongly discourage piracy. At the same time, I recommend using a VPN for FireStick, like ExpressVPN, when using unofficial apps and app stores. The process to sideload the Google Play Store on FireStick is tedious, long-winding, prone to glitches, and often does not work. On the other hand, Aptoide TV works error-free on FireStick for the most part. It also has a decent collection of apps for the FireStick that you will ever need. Instead of struggling with the Google Play Store on FireStick, let’s install its alternative, Aptoide TV. There are two ways to sideload Aptoide TV on the FireStick: using Downloader and ES File Explorer. Legal Disclaimer: This tutorial is purely educational. FireStickTricks.com doesn’t own, host, operate, resell, or distribute any streaming apps, addons, websites, IPTV or services. The page contains some unverified services, and we are not certain whether they hold legal licenses to distribute the content. FireStickTricks.com does not verify the legality of each app/service in all regions. Do your due diligence if you use any of the unverified apps/services, and stream only content that is available in the public domain. The end-user shall be solely responsible for the media accessed. This method entails two parts: preparing FireStick to sideload the app and the installation steps. Let’s discuss the two parts below. Aptoide TV is a third-party app store not hosted on Amazon Store. Since we will get the app from outside the official store, we must first install the sideloading tool called Downloader. Downloader lets you download APK files onto your FireStick from the web. If you don’t have Downloader on your Fire TV device, follow our guide to install and use Downloader on FireStick. Here are the quick steps to do it: 1. On the FireStick home screen, select Find>Search. Type Downloader and follow the onscreen instructions to install it on your device.  2. After installing the Downloader, return to the FireStick home screen. Select Settings > My Fire TV > Developer Options > Install Unknown Apps to enable the Downloader. Note: Please remember that some Fire TV devices may display Apps From Unknown Sources. If this is the case with your gadget, simply turn it ON. Note: If you do not see Developer Options, go to Settings > My Fire TV > About.Now, select Fire TV Stick and click it 7 times to enable Developer Options. If you’re still not sure how to do it, here’s a step-by-step guide to enable developer options.  Once you have prepared your FireStick for sideloading, follow the steps below to install the Aptoide TV app on your device: 1. Click the All Apps icon on the Fire TV home screen.  2. Select Downloader.  3. Once the app is running, select the URL/Search term field.  4. Enter the following link: firesticktricks.com/store, and click Go. Note: This APK file is not hosted on FireStickTricks.com. Instead, the link leads to the external site that hosts the file.  5. The Aptoide TV APK file starts downloading. Give it a few moments to download.  6. Once the file is downloaded, select Install.  7. Select Done once the app installation is finished.  8. Select Delete to remove the Aptoide TV APK file because you no longer need it.  9. Select Delete again.  You’ve successfully installed Aptoide TV( Google Play alternative) on FireStick. Your FireStick / Fire TV is now all ready to stream your favorite content. However, before you start, I would like to warn you that everything you stream online is visible to your ISP and Government. This means, streaming free movies, TV shows, Sports might get you into legal trouble. Thankfully, there is a foolproof way to keep all your streaming activities hidden from your ISP and the Government. All you need is a good VPN for Fire Stick. A VPN will mask your original IP which is  and will help you bypass Online Surveillance, ISP throttling, and content geo-restrictions. I personally use and recommend ExpressVPN, which is the fastest and most secure VPN. It is compatible with all kinds of streaming apps and is very easy to install on Fire TV / Stick. We do not encourage the violation of copyright laws. But, what if you end up streaming content from an illegitimate source unintentionally? It is not always easy to tell the difference between a legit and illegal source. So, before you start streaming on your Fire Stick / Fire TV, let’s see how to use ExpressVPN to keep your streaming activities hidden from prying eyes. Step 1: Subscribe to ExpressVPN HERE. It comes with a 30-day money-back guarantee. Meaning, you can use it free for the first 30-days and if you are not satisfied with the performance (which is highly unlikely), you can ask for a full refund. Step 2: Power ON your Fire TV Stick and go to Find followed by Search option.  Step 3: Now type “Expressvpn” (without quotes) in the search bar and select ExpressVPN when it shows up in the search results.  Step 4: Click Download to install the ExpressVPN app on Fire TV / Stick.  Step 5: Open the app and enter the login credentials that you created while buying the ExpressVPN subscription. Click Sign in.  Step 6: Click the Power icon to connect to a VPN server. That’s all. Your connection is now secure with the fastest and best VPN for FireStick.  You can also read more detailed info on using ExpressVPN with Fire TV / Stick. The official ES File Explorer now costs $9.99 monthly to unlock sideloading. However, you may install the unofficial version of ES File Explorer for free sideloading. If, for some reason, you can’t use Downloader, you can sideload the app using the ES File Explorer. There are two ways to install the Aptoide TV app using the ES File Explorer: one with the computer and the other without. The method without the computer is easier and quicker (but requires a subscription of $9.99 per month). We will talk about this method first. If you have downloaded the Aptoide TV APK on your computer, you may want to look at the second method later. First, you must install and set up ES File Explorer on FireStick. Here are the steps to install the Aptoide TV app on Fire TV using ES Explorer without a computer: 1. Open ES File Explorer, navigate to Tools on the left sidebar and expand it. From the Tools submenu, select Downloader.  2. Then, at the bottom, click the +New option.  3. You should now see the Download dialogue box. In the Path field, enter the URL: https://firesticktricks.com/store. Enter any name you want in the Name section, but make it relevant to the app we are installing. I gave it the name Aptoide TV, as that is the name of the app I am installing. Now click the Download Now button and wait for the APK to download. Note: This APK file is not hosted on FireStickTricks.com. Instead, the link leads to the external site that hosts the file.  4. Once downloaded, click the Open File button to run the APK file. This will start the installation process.  5. Now, when you see the following prompt, click Install.  6. Click the Install button.  7. If you want to launch the app immediately, click the Open button. Otherwise, click the Done button. You can run the app later from the Apps & Games section.  You will need a computer. Windows, Mac, or Linux. Ensure that your computer and FireStick are connected to the same Wi-Fi network. Follow the steps below: On Your Computer: First, download the Aptoide APK file on your computer from www.firesticktricks.com/store. On FireStick: Get the ES File Explorer app from the Amazon Store on your FireStick device. Just select the Search option at the top left of the Fire Stick home screen, look up ES File Explorer, and follow the simple onscreen instructions to install it. 1. Run ES File Explorer from the Your Apps and Games section. Please scroll down to the Network menu on the left sidebar, then expand it. Select Remote Manager from the available network options (see image below).  2. Now, click the Turn on button. You should now see an FTP address. Note down the FTP address. You will need to enter it on your PC. It will allow you to manage all your FireStick files and folders from your computer.  3. Return to your computer and open any folder. Type the FTP address of your Fire TV Stick that you see on the ES Explorer screen in the address bar of the folder window on your computer and press Enter. It will open the ES File Explorer contents on your PC.  4. Copy the Aptoide APK for FireStick that you downloaded earlier onto your computer. And paste it into any ES File Explorer folder you opened with the FTP address in the previous step.  I always choose the ‘Download’ folder to copy the Aptoide TV APK file from my computer. Somehow, it makes more sense to me. 5. Go back to FireStick and open ES File Explorer if it has not already. Please navigate to the Local menu on the left, then expand it. Select the second Home option (not the one with the home image). See the image below for more clarity.  6. Use the remote to navigate to the Download folder on the right of the screen.  7. Open the folder, and you will see the Aptoide APK file here (Remember? I saved this file in the Download folder. If you copied it to any other folder, choose accordingly).  8. Press the Select on your FireStick remote to run this APK file. Click Install when you see the prompt titled Properties (image below).  9. Navigate to the bottom of the next screen and click Install on the bottom right to confirm your action and install the app.  10. When the app is installed, this is what you see. If you want to launch Aptoide TV right away, click Open or Done to open it later.  Once you have successfully installed Aptoide TV, launch it. However, I recommend creating an app shortcut on the Fire TV home screen if you intend to use it regularly. Aptoide TV’s user interface is visually appealing, decluttered, and straightforward. On the home screen, you can see the following sections (as shown in the image below)  The Discover tab, as the name suggests, lets you explore and find apps and games. You can explore the apps in the section marked Top Apps, New Arrivals, Streaming Apps, Free Games, Applications, etc. You can also use the magnifying glass icon at the top left to search for a game or app.  The Categories tab consists of various classes of apps and games. This section helps you find the apps you are looking for by category. The categories include All, Health, House & Home, Entertainment, Social, Shopping, Tools, Music & Audio, Video Players & Editors, and Sports.  My Apps tab shows the already downloaded apps on your device. The other categories, Community and Settings, are self-explanatory.  This guide discussed how to install Google Play (Aptoide TV) on FireStick. The platform offers various apps in categories such as streaming services, games, utilities, and more. Its user interface is designed primarily for television displays, allowing for easy discovery and navigation through various app categories. Let me know if you have any comments or concerns in the comment section. Related: Stay Ahead: Weekly Insights on the Latest in Free Streaming! No spam, ever. Unsubscribe anytime. Hi! I'm Patrick, a seasoned IT and cybersecurity professional. As an avid streamer myself, I started FireStickTricks.com to help others access and stream good content on any platform. On this blog, I review services, write how-to articles, and cover the latest Fire Stick news and streaming trends. Stay Ahead: Weekly Insights on the Latest in Free Streaming! No spam, ever. Unsubscribe anytime. Filed Under: Apps, Fire Stick, How to Davey says February 5, 2022 at 23:25 None of your stuff works anymore? Max says February 8, 2022 at 20:45 Hi Davey, I just checked and Aptoide TV is working for me. You may have run into temporary issues, please try again. Klaas says September 23, 2020 at 20:00 Simple comme “bonjour”\nWorks perfectly Poppie says July 20, 2020 at 22:11 No matter how many time I download, delete , redownload, clear cache turn on and off the none whatsit apps thing I cannot get this app to download anything on to my firestick. Not anything, it just keeps telling me you’re having problems Max says July 23, 2020 at 06:00 Hi, it is likely your FireStick is low on storage. Clear the cache of all the installed apps and try again. Also, uninstall any apps you do not use. Alvin says June 17, 2020 at 07:45 I can’t successfully downloaded it.. it says app isn’t compatible with your device. Max says June 21, 2020 at 14:56 Hi Alvin, are you saying you couldn’t download Aptoide on FireStick? Your email address will not be published. Required fields are marked * Comment * Name * Email *  © Copyright 2024 Fire Stick Tricks · All Rights Reserved Disclaimer – Streaming or downloading copyright content is unlawful. FireStickTricks.com do not in any way condone, promote or encourage any illegal use of Kodi, Fire Stick or our guides. Users are responsible for their actions. Read our full disclaimer.  🔥 Try ExpressVPN Risk-Free (3 Months Free) "
}