{
    "title": "Alphabet Inc. (GOOG) Stock Moves -0.31%: What You Should Know",
    "date": "3/5/2024",
    "url": "https://finance.yahoo.com/news/alphabet-inc-goog-stock-moves-224519495.html",
    "text": "Alphabet Inc. (GOOG) closed the most recent trading day at $133.78, moving -0.31% from the previous trading session. This change was narrower than the S&P 500's daily loss of 1.02%. On the other hand, the Dow registered a loss of 1.04%, and the technology-centric Nasdaq decreased by 1.65%. The company's stock has dropped by 7.4% in the past month, falling short of the Computer and Technology sector's gain of 3.72% and the S&P 500's gain of 3.64%. The investment community will be paying close attention to the earnings performance of Alphabet Inc. in its upcoming release. On that day, Alphabet Inc. is projected to report earnings of $1.49 per share, which would represent year-over-year growth of 27.35%. Meanwhile, the latest consensus estimate predicts the revenue to be $65.95 billion, indicating a 13.58% increase compared to the same quarter of the previous year. For the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $6.77 per share and a revenue of $286.48 billion, representing changes of +16.72% and +11.68%, respectively, from the prior year. Any recent changes to analyst estimates for Alphabet Inc. should also be noted by investors. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook. Our research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system. The Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.12% increase. Alphabet Inc. presently features a Zacks Rank of #3 (Hold). Valuation is also important, so investors should note that Alphabet Inc. has a Forward P/E ratio of 19.81 right now. This indicates a discount in contrast to its industry's Forward P/E of 26.57. It is also worth noting that GOOG currently has a PEG ratio of 1.24. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Internet - Services stocks are, on average, holding a PEG ratio of 2.24 based on yesterday's closing prices. The Internet - Services industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 141, this industry ranks in the bottom 45% of all industries, numbering over 250. The Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Be sure to follow all of these stock-moving metrics, and many more, on Zacks.com. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}