{
    "title": "Alphabet's AI play, tech sector lags: Market takeaways",
    "date": "3/18/2024",
    "url": "https://finance.yahoo.com/video/fed-decision-alphabets-ai-play-204849156.html",
    "text": "As the trading day draws to a close, Yahoo Finance's Josh Schafer joins the Live Show to discuss the top three market takeaways for Monday. With the highly anticipated Federal Reserve decision looming on Wednesday, markets are navigating a state of uncertainty. While the broader market is not significantly underperforming— small-cap stocks, the homebuilder sector, and regional banks are all lagging behind, despite yields continuing their upward trajectory. Shares of Alphabet (GOOG, GOOGL) are gaining momentum after the company announced the potential integration of its Gemini AI into Apple's (AAPL) iPhones. This news has fueled investor enthusiasm, propelling Alphabet's stock nearly 5% higher. The communication services sector continues to lead market gains, outpacing the broader S&P 500 index (^GSPC). In contrast, the tech sector is underperforming relative to the benchmark. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith JOSH LIPTON: Stocks looking to rebound after two straight weeks of declines as investors eye this week's Fed decision. Josh Schafer is here with us with his takeaways of the day, Josh. JOSH SCHAFER: Yeah, Josh, I mean, I was perusing the different headlines from Austin various financial news networks today this morning. And I would have thought stocks would fall. It felt like we were-- the conversation this morning was about we're going to learn that the Fed is going to cut maybe less than we hoped. And we might see overall less cuts, maybe later cuts. It seems like we're starting to already get worried about what is going to happen at this Wednesday meeting. And then I take a look at the market action today. And that is not what happened. We rallied about almost 1% in the S&P 500. And we had a 1% rally in the NASDAQ. But what I want to highlight here guys is sort of the divergence that we did see between what did underperform. So when we take a look at what underperformed today, you could look at small caps underperformed. We have homebuilders underperforming. We have regional banks underperforming. And the reason I highlight this is sort of the chart that we have up here now. This is a chart from Mike Wilson over at Morgan Stanley. And he was pointing out the different moves we've seen in small caps versus large caps in relation to interest rate movements. We've seen large caps be a lot more resilient to the moves. We've seen in rates over the last month compared to small caps. I'm highlighting this because I'm curious what we see on Wednesday. If we can continue to see yields go higher and the overall anticipation and the pricing in of less cuts, is it another day where small caps could significantly sink compared to the S&P 500? I like to use small caps because to me, that's sort of become part of the proxy of this soft landing trade of this. We're going to get a lot of cuts trade, small caps ripped on that. And now, we're seeing them still react more. But that resilience we're seeing in large caps that we did see again today could be what maybe holds us up depending on what comes on Wednesday. MADISON MILLS: Yeah. JOSH LIPTON: Go ahead, Madi. MADISON MILLS: Well, I just think it's interesting. I remember on Friday, we were talking about how typically historically it had been the day in March where the market hits its lowest lows for the last 20 years. So there was a little bit of seasonality coming into play that made me think we might be in the green this morning. But then it's always fascinating when you look at bifurcation that we're seeing in treasuries. And you see the two-year yield climbing to its highest highs for the year. What is going on with that? These are supposed to move in different directions. I just don't-- JOSH SCHAFER: At what point do investors care about the 10-year yield moving higher. We've had the 10-year kind of chugging higher for basically it feels like a month or two now, at least relatively consistently on a trend basis. MADISON MILLS: When does it bite. JOSH SCHAFER: And when does that actually matter to equities again? Wilson highlighted in his note 4.35%. I think we're right there right now. Maybe it was 4.3 4%. But sort of saying we're getting to that level now where we're going to start talking about bond yields being higher. And even if you're just a stock investor, that just owns something like the index, it might be time to start paying attention to it again. MADISON MILLS: Yeah. JOSH LIPTON: Especially as yields move higher, too, Josh. Interesting to see the repercussions. Like you would think tech wouldn't work against that. Those interest rates names. JOSH SCHAFER: But take away, too, for today, Josh. What if you have an AI play? Then it always works even if yields are going up. I wanted to highlight the announcement from Alphabet today because I found it particularly or I shouldn't say announcement. Sorry. The report that Alphabet may be included Gemini AI may be included on iPhones. We saw big move in shares of Google on this, nearly 5% move in the stock from that. And it just stuck out to me because I couldn't name a tech company that needed more of an AI win. They needed to have an AI. And a rumor I guess, we'll call it news come out. And then see the stock go up for once, rather than having some of these AI announcements and rumors that have come out about them. And it really hasn't done well on some of those trades. So to me, it stuck out just to see shares go up in that reaction. And then also for Apple shares to not necessarily fall on this news. There's a read of this report where you could say so Apple's not building their own AI. That's not good. Where's Apple's involvement here? MADISON MILLS: Still not in the AI race. JOSH SCHAFER: Maybe it's actually just a smart play from Apple. JOSH LIPTON: Yeah, that's what we were talking off camera, Josh, about how Evercore kind of saw it AI features without AI CapEx as they put it. Yeah. MADISON MILLS: You were looking at comm services as well, Josh. What's your takeaways? JOSH SCHAFER: Yes our final takeaway is just I love to look at the sectors and just click on the year-to-date sometimes on the Wi-Fi interactive. It's pretty fun. It's pretty fun activity for me during the day. And when we take a look at that, when you look at communication services here, up 11% on the year. It was up 2% today. But what stands out to me here too, Madi, that really I found interesting. Look at what is underperforming, the S&P 500. Minimally, I should add, but tech. And it just sort of reminds us of when we talk about tech broadly, what's actually in the tech sector versus what's actually in the communication services sector? And so you see technically underperforming the S&P 500 here for the year. But communication services outperforming. And that's because today we saw a jump in communication services from that jump we were just talking about and Alphabet. Meta's had a great year. Netflix has had a great year. And so it's just interesting to me. I feel like we talk a lot about tech is still leading the market. Tech is still leading the market. Just to note. We're not always talking about XLK. We might be talking about the NASDAQ. But we're not always talking about XLK. It's some other sectors, too, that are participating here. And that one stuck out to me because it was up 2%. MADISON MILLS: It's a great point for any retail investors who are looking to tech specific ETFs. Just remember to look under the hood a little bit when you're on the Robinhood app. Josh, thank you so much. Really appreciate it. Related Quotes "
}