{
    "title": null,
    "date": "3/13/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-aids-healthcare-offerings-153600581.html",
    "text": "Alphabet’s GOOGL Google is leaving no stone unturned to bolster its healthcare offerings on the back of growing generative AI capabilities, which are presently acting as key growth catalysts for the company. Its shares have surged 47.4% in the past year compared with the Zacks Computer & Technology sector’s growth of 47.2%.Recently, Google launched Vertex AI Search for Healthcare, a generative AI powered tool intended for the healthcare industry.The tool utilizes generative AI to assist clinicians in searching for information from patient notes, scanned documents and other clinical data. The tool's understanding of medical terminology and specific data points provides transparency and reduces hallucinations.Google's Vertex AI Search for Healthcare integrates with its other generative AI-powered healthcare tools like Health Data Engine and MedLM, enhancing data interoperability and providing a range of algorithms for healthcare use cases.Alphabet is expected to gain solid traction across clinicians, researchers and health and life science organizations on the back of its latest move. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from Vertex AI Search for Healthcare, Alphabet launched MedLM, a family of generative AI models intended for the healthcare industry. These models offer medical documentation testing, drug development research and chatbot provider identification.The company also announced that the Healthcare Data Engine is now globally accessible, providing interoperable patient data and clinical insights in FHIR format, enhancing AI's effectiveness in the healthcare industry.Additionally, Google announced that it will be expanding its MedLM capabilities with MedLM for Chest X-rays to help with their classification for operational, screening and diagnostics use cases, and a Condition Summary feature to enhance task-specific API capabilities.All the above-mentioned endeavors will aid the company in capitalizing on growth opportunities present in the global generative AI in the healthcare market space. Per a Grand View Research report, global generative AI in the healthcare market is expected to witness a CAGR of 36.7% between 2023 and 2030.Moreover, expanding healthcare offerings will boost the company's portfolio strength, potentially enhancing its overall financial performance in the upcoming period.The Zacks Consensus Estimate for 2024 total revenues stands at $286.52 billion, indicating year-over-year growth of 11.7%. The latest efforts in the healthcare space will likely allow this Zacks Rank #3 (Hold) company to strengthen its competitive edge against rivals like Amazon AMZN, Microsoft MSFT and Oracle ORCL, which are also making substantial efforts to strengthen their footing in the healthcare sector by leveraging generative AI capabilities.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Recently, Amazon’s cloud computing arm, Amazon Web Services, expanded its collaboration with Philips to improve digital workflow integration and AI/ML capabilities in pathology labs and healthcare organizations.Amazon’s latest partnership will enhance digital pathology solutions, enabling labs to efficiently manage and analyze growing data, optimize workflows and integrate with existing healthcare systems for holistic patient care.Meanwhile, Microsoft partnered with Epic to deploy various technologies, such as clinical note summarization, medical coding suggestions and data exploration tools, leveraging its generative AI capabilities in the healthcare space.Further, Microsoft’s cloud business Azure introduced new capabilities to free up clinicians' information, including patient timelines and clinical report simplification using generative AI, enabling healthcare professionals to extract and organize unstructured data for better understanding.Oracle, on the other hand, recently enhanced its Health Data Intelligence suite, introducing a new generative AI service to boost care management efficiency. The suite enables healthcare stakeholders to use data for patient health improvement, care delivery and operational efficiency.Earlier, Oracle also introduced patient-facing tools, including generative AI answers, voice commands for appointment scheduling and chats with clinicians to remind patients about lab results. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Oracle Corporation (ORCL) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}