{
    "title": "Google: I Welcome The Post-Q4 Selloff As An Attractive Buy Opportunity \n(NASDAQ:GOOG)",
    "date": "1/31/2024",
    "url": "https://seekingalpha.com/article/4666330-google-i-welcome-the-post-q4-selloff-as-an-attractive-buy-opportunity",
    "text": "400tmax 400tmax Alphabet Inc. aka Google (NASDAQ:GOOG, NASDAQ:GOOGL) shares intermittently slumped as much as 7% after the company reported Q4 2023 results. The drop in shares came although the Search giant delivered robust YoY growth of 13% and 32% in sales and operating income, respectively. This price action reminds me of investors' arguably misguided reaction to Q3: I remember that shares plunged following a solid September quarter, only to recover aggressively in the following few weeks. Accordingly, at that time, my \"Buy\" thesis in response to the selloff was well advised. Today, reflecting on the post-Q4 Google stock selloff, despite strong commercial momentum in the December quarter, I again expect that the rebound in shares should be quick and aggressive. In the fourth quarter of 2023, Google, as part of its broader conglomerate activities, reported a strong set of financials, beating consensus estimates on both revenue and earnings: During the period from September to the end of December, the Search behemoth recorded $76.3 billion in sales, marking a solid 13% YoY growth compared to the same period one year earlier, and exceeding analyst forecasts by nearly $1,050 million, according to data compiled by Refinitiv. On profitability, Google's operating income increased by about 32% YoY, to $23.5 billion. Notably, Google's operating profit was about $350 million higher than what consensus has projected. After deducting non-operating expenses and income taxes, Google's net profit attributable to shareholder came in at $20.7 billion, or $1.64 per share (up 51% YoY). Google Q4 2023 Google Q4 2023 Diving into the numbers, there are quite a few interesting takeaways for investors that I argue warrant more detailed discussion: Firstly, I point out that Google's momentum with YouTube remains very strong. In fact, YouTube's advertising revenue exceeded analyst forecasts, reaching $9.2 billion, up 16% YoY, and outpacing the broader advertising growth for Google. On that note, during the investor call, Alphabet's CEO, Sundar Pichai, highlighted that Shorts as seen its daily views surge to 70 billion, compared to 50 billion daily views reported at the start of the year. Secondly, I highlight that Google continues to steam ahead with the cloud business, with management citing a \"strong demand [...] for our vertically integrated AI portfolio [which] is creating new opportunities for Google Cloud across every product area.\" Notably, the segment scored a 26% YoY growth, bringing sales to $9.2 billion for Q4, while operating profits jumped to $864 million (vs. a $186 million loss in the same period of 2022). Thirdly, I am delighted to see that Google management is serious about operating discipline, as evidenced by the company's notable reduction in headcount: Despite higher sales, the number of employees dropped to 182.5K, compared to 190.2K in Q4 2022. Lastly, I note that Google has disclosed Traffic Acquisition Costs (\"TAC\"), which amounted to almost $14 billion in Q4 alone! The investor takeaway that I am implying here is that Google may approximately safe as much as $56 billion of annual costs, up from $25-30 billion estimated previously, depending on the outcome of the ongoing antitrust trial relating to TAC. In that context, I have previously argued: Optimally, Google would emerge victorious in all aspects of the trial, essentially preserving the status quo--suggesting no concern for investors. That said, I would like to point out that even if Google loses the trial, this wouldn't necessarily spell doom for the tech giant. In fact, investors should consider that the downside scenario here relates to a situation where Google would need to stop paying as much a $25-30 billion a year for certain search distribution agreements. Paradoxically, this could be value accretive for the search giant, if the overall impact on search volume and market share remains relatively limited. And this is in fact my personal opinion: I believe that even if Google were to lose the position of being the default search engine installed at devices like Apple, OEMs may either continue to give preferential treatment to Google, or users themselves will actively seek out the Search giant's applications--simply as a function of Google's leading technology and user experience. Google Q4 2023 Google Q4 2023 Expanding my commentary on Google's commercial momentum, I point out that the Search giant's strong fundamentals translate quite directly into shareholder returns. In fact, investors should note that for every dollar of incremental sales, Google currently generates about 24 cents of free cash flow, 85-90% of which the company uses to repurchase its own shares. During the Q4 2023 period, Google bought back a notable $16.2 billion worth of stock, suggesting an acceleration compared to the $15.4 billion repurchased in the same period 2022. On a full year view, repurchases jump to about $61.5 billion, or about 3.2% of market capitalization. On that note, with a net financial cash position of approximately $92 billion as of December 31, 2023, I expect the share buyback bonanza to continue through 2024. Google Q4 2023 Google Q4 2023 Reflecting on Google's commercial strength, paired with a 15% consensus CAGR of EPS growth through 2030, I argue that Google shares trade cheap at a <22 EV/EBIT, and 27x P/E. In fact, a simple exercise underscores the point: If we apply a structural 18x P/E to Google's estimated 2029 earnings (14.5*18=261), which is about in line with the S&P 500 (SP500), and discount the result at a 4% time value of money, which is in line with the 10-year yield (US10Y), then Google shares should be fairly valued at about $215. I understand that investors demand a risk premium for investing in Google shares, especially given concerns surrounding Google's dominance in search following the success of ChatGPT; However, investors should note that downside risks associated with Google's fundamentals should be approximately offset by upside opportunities relating to the company's leadership in cloud and AI. Seeking Alpha Seeking Alpha Google shares slumped 6% after Q4 2023 results, but a quick rebound should be expected, in my opinion, as Google's commercial momentum in the December quarter was actually quite robust: YouTube's advertising revenue exceeded expectations (up 16% YoY), and Google's cloud business showed strong growth too (up 26% YoY). Meanwhile, Google's reduction in headcount and potential cost savings from the ongoing antitrust trial are potentially positive factors driving more operating income upside through 2024. On growth, investors should note that for every dollar of incremental sales, Google currently generates about 24 cents of free cash flow, 85-90% of which the company uses to repurchase its own shares. All this said, I argue that Google shares trade cheap at a <22 EV/EBIT and the latest selloff is a fantastic buying opportunity. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Not financial advice. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}