{
    "title": "Alphabet Financial Report Outlook: Can Gemini Help Google Overtake in the \nAI Field?",
    "date": "1/25/2024",
    "url": "https://www.cmcmarkets.com/en-sg/analysis/alphabet-earnings",
    "text": " Trade on the go Download our apps CFD's app X Select the account you'd like to open CFD account Trade CFDs on over 10,000+ shares, FX pairs, commodities, indices and treasuries  Written by Zhujun Li Market Analyst 25 Jan 2024, 10:00 Share this In the last quarter, the growth of Google's parent company, Alphabet, in the cloud business was significantly below market expectations, trailing behind Microsoft and Amazon. This briefly caused their stock price to dip to $120 after the financial report announcement. However, with a general improvement in risk sentiment in the fourth quarter, the company's stock price rose by 58.3% in 2023. As competition intensifies in the field of AI, Google launched the large-scale language model Gemini in early December, divided into three versions—Ultra, Pro, and Nano. On December 14, Gemini Pro's API was made freely available to the public, offering users a chance to experience the visual AI model for free, unlike the paid version of OpenAI's GPT-4. However, initial third-party test data suggests that Gemini Pro is currently on par with OpenAI's ChatGPT-3.5 but still lags behind GPT-4. Therefore, Google may have some way to go to establish a leading position in the AI field. Gemini Ultra is currently only available for internal employee use, with expectations for public release by March this year. However, Google's competitor OpenAI has announced plans to significantly upgrade its model, surpassing all existing AI products in the market. Even with the introduction of Gemini Ultra, Google may struggle to overcome its current lag. While Google's search system, YouTube, and Android ecosystem have brought in a robust user base, its competitors, Microsoft and Amazon, are actively collaborating with other companies in the cloud services sector. For example, Microsoft has invested in OpenAI, and Amazon has invested in Anthropic. Google's progress in self-developed projects has consistently lagged behind the other two. The good news is that even though Google might be lagging in the field of AI, it still maintains a leadership position in the search business, holding over 90% of the market share, while Microsoft's Bing Chat contributes only 1% to its search business growth. Cost reduction and efficiency improvement are likely to remain Google's primary strategies for this year. In January 2024, Google has already laid off another 1000 employees across various departments, intending to enhance company productivity and achieve cost control. As we properly enter 2024, the external environment faces downward economic trends and geopolitical instability, while internally, challenges include cancelling multiple product lines, employee layoffs, and negative feedback from users due to the cessation of product releases. As AI continues to evolve, considerations for the security of AI models may be something overlooked by the current capital markets. With the continuous improvement of large model functionalities, the high information collection capabilities demonstrated by AI models sharply contrast with the current global situation of anti-globalization, potentially impacting regional restrictions on user access. Release Date: After-market on January 30th Possible Revenue: $707.1 billion, YoY growth of 12.03% Earnings Per Share: $1.6, YoY growth of 52.38% Data Source: Zacks Research Disclaimer: CMC Markets Singapore may provide or make available research analysis or reports prepared or issued by entities within the CMC Markets group of companies, located and regulated under the laws in a foreign jurisdictions, in accordance with regulation 32C of the Financial Advisers Regulations. Where such information is issued or promulgated to a person who is not an accredited investor, expert investor or institutional investor, CMC Markets Singapore accepts legal responsibility for the contents of the analysis or report, to the extent required by law. Recipients of such information who are resident in Singapore may contact CMC Markets Singapore on 1800 559 6000 for any matters arising from or in connection with the information. Latest from CMC Apple Quarterly Earnings Apple's recent run of earnings calls have been mixed. Ahead of their next earning call on 1st February 2024, what could we expect from the $3tn market cap giant? 24 Jan 2024 Microsoft Q4 Earnings Preview Meta Q4 Earnings Preview Upcoming indices dividend drop points Related articles Apple Quarterly Earnings Apple's recent run of earnings calls have been mixed. Ahead of their next earning call on 1st February 2024, what could we expect from the $3tn market cap giant? 24 Jan 2024 Microsoft Q4 Earnings Preview Microsoft Earnings Preview: Can the growth of its cloud business help Microsoft maintain its position as the world's most valuable company? 23 Jan 2024 Meta Q4 Earnings Preview Meta Earnings Preview: Stable growth expected in advertising business but could the Metaverse continue to incur losses? 23 Jan 2024 Upcoming indices dividend drop points View the estimated indices dividend drop points for the week commencing Monday, 22 January 2024. 19 Jan 2024 SG 1800 559 6000 Lines are open 24/5 Contact Download our app Get greater control and flexibility for peak performance trading when you're on the go. CMC Markets Singapore Pte. Ltd. (Reg. No./UEN 200605050E.) is regulated by the Monetary Authority of Singapore and holds a capital markets services licence for dealing in capital market products that are over-the-counter derivatives and leveraged foreign exchange, and is an exempt financial adviser. Contracts for difference (CFD) are leveraged products and carry a high level of risk to your capital as prices may move rapidly against you. It is possible to lose more than your initial investment and you may be required to make further payments. Countdowns carry a level of risk to your capital as you could lose all of your investment. Invest only what you can afford to lose. CFDs and Countdowns involve the risk of substantial loss and trading  such products may not be suitable for all clients therefore ensure you understand the risks and seek independent advice. Please read our disclaimers, risk warning/disclosures, terms of business and associated documentation here This website uses cookies to obtain information about your general internet usage. Removal of cookies may affect the operation of certain parts of this website. For more information about cookies and how to remove them, please read our  cookie policy.  Tax treatment depends on the individual circumstances of each client. Tax law can change or may differ depending on the jurisdiction in which you are resident.  Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. © 2012 Samsung Telecommunications America, LLC. Samsung and Galaxy S are both registered trademarks of Samsung Electronics Co., Ltd. Android is a trademark of Google Inc. Android is a trademark of Google Inc. Portions of this page are reproduced from work created and shared by Google and used according to terms described in the Creative Commons 3.0 Attribution License. This advertisement has not been reviewed by the Monetary Authority of Singapore. © 2024 CMC Markets "
}