{
    "title": "Here's Why Investors Sold Off Alphabet (GOOG)",
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/why-investors-sold-off-alphabet-053339169.html",
    "text": "Ensemble Capital Management, an investment management company, released its fourth quarter 2023 investor letter. A copy of the same can be downloaded here. The fund saw exceptionally excellent absolute and relative performance in the fourth quarter. The fund was up 16.00% in the quarter while the S&P 500 appreciated 11.69%. The fund was up 21.75% for the full year vs the S&P 500 up 26.29%. The fund’s underperformance was due to its investment in First Republic, which the fund exited in March. In addition, please check the fund’s top five holdings to know its best picks in 2023. Ensemble Capital Management featured stocks such as Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On January 18, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $144.99 per share. One-month return of Alphabet Inc. (NASDAQ:GOOG) was 2.25%, and its shares gained 54.39% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.804 trillion. Ensemble Capital Management stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: \"Alphabet Inc. (NASDAQ:GOOG) (8.52% weight in the Fund): Google’s earnings report in October showed its core advertising business accelerating to double digit growth as the digital advertising recession of 2022 and early 2023 fades away. However, the company’s Cloud division, which is expected to generate growth from selling access to artificial intelligence services, saw its growth rate slow modestly. Juxtaposed with Microsoft’s Cloud business seeing growth pick up slightly, investors sold off Google’s stock on the report. While the stock recovered to new highs by the end of the year, the earnings report set back caused the stock to trail behind the S&P 500 with a gain of 6.8% for the quarter.\" Photo by Kai Wenzel on Unsplash Alphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 163 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of third quarter which was 152 in the previous quarter. We discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared Wedgewood Partners' views on the company. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 10 Small-Cap Energy Stocks with Strong Returns 30 Smallest Countries In The World By Population and Land Area 30 Cheapest Places Across America Where You Will Want to Retire Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}