{
    "title": "Alphabet's Wing shows off a larger delivery drone with a bigger payload \ncapacity",
    "date": "1/17/2024",
    "url": "https://www.engadget.com/alphabets-wing-shows-off-a-larger-delivery-drone-with-a-bigger-payload-capacity-163148392.html",
    "text": "Alphabet-owned Wing has been trying to make drone delivery an actual thing, but the relatively minuscule payload capacity of modern delivery aircraft has been a serious obstacle. The company just unveiled a new drone that’s a step in the right direction. The new model can handle payloads of up to five pounds, which is twice as much as Wing’s previous flagship drone. It can also travel up to 65 MPH, which is pretty darned fast. The onboard battery allows for a 12 mile round trip, which is in line with previous metrics, so that translates to an under six-minute delivery time. That certainly beats pizza delivery. Speaking of, most pizzas are well under five pounds. Just saying. The increased weight limit will also allow Wing to complete more deliveries at once and limit the number of orders that require more than a single drone. The company says that 30 percent of current deliveries demand two drones, but that’s with the 2.5 pound payload capacity. Adam Woodworth, Wing CEO, says the new aircraft will “streamline our deliveries of larger orders” and gave an example of a customer ordering last minute ingredients for a pasta dinner. The new drone will be unleashed on the masses sometime in the next year. Also, there are more redesigns coming. It’s announced something called an Aircraft Library, in which teams are working on a wide configuration of builds to suit different use case scenarios. Woodworth likens it to how a standard delivery company operates a fleet of different-sized trucks. Even with this initiative, however, we are likely a long ways off from a drone delivering something heavy and bulky, like an Xbox. Wing currently operates in the Dallas-Fort Worth area, in addition to Australia, Finland and Ireland. It’s teamed up with retailers like Walgreens and Walmart to offer deliveries. "
}