{
    "title": "Wall Street sets Google stock price for the next 12 months",
    "date": "1/16/2024",
    "url": "https://finbold.com/wall-street-sets-google-stock-price-for-the-next-12-months-4/",
    "text": "Since the start of 2024, Alphabet’s (NASDAQ: GOOGL) stock has distinguished itself among the select few to defy the general market short-term sell-off, recording minimal gains. Although 2024 is still in its infancy stage, Alphabet remains a focal point among technology stocks as the company endeavors to align its operations with the evolving technology landscape. The emphasis is on emerging and growing segments, including artificial intelligence (AI) and cloud computing. Notably, the stock has garnered positive endorsements from entities like banking giant JPMorgan Chase (NYSE: JPM), singling out products like Search and YouTube to lead the company’s revenue and growth in 2024. Against this backdrop, the valuation of GOOGL in the coming months remains a crucial point of consideration. Looking ahead to the next 12 months, Wall Street analysts at TipRanks project a bullish outlook for Alphabet’s stock. The 35 analysts, providing projections based on the last three months’ performance, indicate that the equity will likely trade at an average price of $155.91, reflecting gains of at least 9% from the current price. The analysts offer a high projection of $180 and a low target of $140. Indeed, the bullish outlook aligns with key fundamentals likely to propel GOOGL to new heights in 2024. The optimism is rooted in the company’s ongoing high-profile partnerships, such as Isomorphic Labs and Alphabet’s biotech arm, securing collaborations with Eli Lilly (NYSE: LLY) and Novartis. These partnerships leverage Isomorphic’s AI platform for drug discovery, resulting in substantial upfront and potential milestone payments and showcasing significant revenue potential. Beyond biotech, Alphabet’s diversified business segments contribute to investor confidence. The company’s extensive user base, driven by popular brands like Android and YouTube, coupled with a robust digital advertising business, offers optimism for the future. Notably, Q3 2023 witnessed a 9% YoY increase in advertising revenue, constituting 78% of total revenue, signaling market recovery. Additionally, Google Cloud achieved an impressive 22% YoY revenue growth in Q3 2023. Alphabet has also asserted its position in the AI race with notable software advancements in 2023, including Bard, expanded Google Cloud AI tools, and the introduction of Gemini. This comes amid competition from Microsoft (NASDAQ: MSFT) and OpenAI’s ChatGPT. A review of GOOGL stock price reveals recovery from the short-term sell-off experienced at the start of 2024 amid rising bond yields. The stock is currently valued at $142.65, with year-to-date gains exceeding 3%. Over the past month, the trading range of GOOGL has fluctuated broadly, spanning from $129.69 to $145.22. Currently positioned near the upper end of this spectrum, the stock exhibits a support zone between $135.37 and $141.67, while a resistance zone lies in the range of $142.66. This particular zone is established by converging several trend lines across various time frames. While positive sentiments dominate GOOGL, the stock’s susceptibility to overall market fluctuations is worth noting. The company’s ability to sustain growth in key business segments, especially AI, is also crucial given the intensifying competition. At the same time, a possible downside will likely emerge from the ongoing Department of Justice (DoJ) antitrust case. Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}