{
    "title": "Alphabet (GOOGL) Boosts YouTube Capabilities for Podcasters",
    "date": "1/11/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-boosts-youtube-capabilities-150700940.html",
    "text": "Alphabet’s GOOGL Google is leaving no stone unturned to boost YouTube’s user base on the back of feature updates.In this regard, Google announced that it is allowing audio-first podcasters to upload episodes via RSS feed, instead of requiring them to manually create a video.YouTube creates a static-image video using podcast show art, which is available only on its app and YouTube Music.The users enter a verification code and choose between existing, published or future episodes.The latest move will allow podcasters to modify titles, descriptions, video visibility, default video order and RSS settings. The users will also be able to disconnect feeds and re-upload episodes.Alphabet is expected to gain solid traction across content creators, particularly podcasters, on the back of its latest move. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the latest update, Google introduced AI-powered features to YouTube, including Dream Screen for seamless video backgrounds, production tools for quick editing and YouTube Create, which is a mobile app for AI-enabled video production.Google, via YouTube TV, recently partnered with Peloton Interactive’s PTON streaming service platform, Peloton Entertainment.Per the terms of the partnership, Peloton All-Access members can stream their favorite television content from their Peloton Bike, Peloton Row or Peloton Tread. Further, Google launched YouTube Create, a mobile app designed to streamline video production for creators, offering AI-enabled editing, captioning, voiceover, filters and royalty-free music features.Alphabet introduced a Pause option for YouTube Creators, preventing new video-level comments while preserving existing ones. This feature is available in video-level comment settings on the YouTube app’s watch page and YouTube Studio.The company is also testing a new feature that allows views and like counts to update in real-time while a viewer watches a video. This feature updates the figures every minute, though it becomes harder to see as counts increase. All the above-mentioned endeavors will strengthen YouTube’s subscriber base, which, in turn, will solidify Alphabet’s footing in the global video streaming space, presenting a significant growth opportunity for the company.Per a Fortune Business Insights report, the video streaming market is expected to reach $1.9 trillion by 2030, witnessing a CAGR of 19.3% between 2023 and 2030.Moreover, a strong YouTube subscriber base will, in turn, aid Alphabet in strengthening its Google Services segment, which has been the key growth driver of the company. Shares of GOOGL have gained 56.1% in the past year compared with the Zacks Computer & Technology sector’s growth of 45.5%.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues is pegged at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, indicating year-over-year growth of 15.6%. The estimate has been revised upward by 0.7% in the past 30 days. Currently, Alphabet carries a Zacks Rank #3 (Hold).Some better-ranked stocks in the broader technology sector are Camtek CAMT and DigitalOcean DOCN, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Shares of Camtek have returned 98% in the past year. The long-term earnings growth rate for CAMT is pegged at 12.26%.Shares of DigitalOcean have lost 10.7% in the past year. The long-term earnings growth rate for DOCN is currently projected at 31.26%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Camtek Ltd. (CAMT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Peloton Interactive, Inc. (PTON) : Free Stock Analysis Report DigitalOcean Holdings, Inc. (DOCN) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}