{
    "title": "YouTube Q4 Ad Sales Rise 15% As Parent Alphabet Sees AI Investment, \nSeverance Payouts",
    "date": "1/30/2024",
    "url": "https://deadline.com/2024/01/youtube-ad-sales-google-alphabet-quarterly-earnings-layoffs-1235808884/",
    "text": "By Jill Goldsmith Co-Business Editor Google parent Alphabet on Tuesday reported decent numbers for the fourth quarter of 2023, including a 15.5% hike in YouTube advertising to $9.2 billion (from $7.8 billion), solid but disappointing the market a bit with shares down 4%. Most numbers met but didn’t exceed forecasts at a time of very high expectations for tech stocks. Google Search & other advertising saw revenue of $48 billion, from $42.6 billion. Google Network saw ad revenue of $8.3 billion versus $8.5 billion. So total Google advertising including YouTube of $65.5 billion was up from $59 billion. Google services sales rose to $76 billion from $68 billion. Cloud Services was strong, with revenue of $9.2 billion, up from $7.3 billion. Alphabet consolidated revenue was up 18% at $86 billion. EPS of $1.64 was up from $1.05. RELATED: Riding NFL Sunday Ticket Momentum, Google Is “Closely Looking At” Expanding YouTube TV Beyond U.S., Senior Exec Says “We are pleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud. Each of these is already benefiting from our AI investments and innovation. As we enter the Gemini era, the best is yet to come,” said CEO Sundar Pichai, referring to the company’s new Gemini generative AI platform. CFO Ruth Porat said, “We ended 2023 with very strong fourth-quarter financial results. … We remain committed to our work to durably re-engineer our cost base as we invest to support our growth opportunities.” Investing in AI costs and the company as a result has had rounds of layoffs. A wave in January 2023 resulted in employee severance and related charges of $2.1 billion for the year. Execs will go over the numbers on a call today at 4:30 p.m. ET. Subscribe to Deadline Breaking News Alerts and keep your inbox happy. Signup for Breaking News Alerts & Newsletters By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Get our latest storiesin the feed of your favorite networks We want to hear from you! Send us a tip using our annonymous form. Sign up for our breaking news alerts By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Deadline is a part of Penske Media Corporation. © 2024 Deadline Hollywood, LLC. All Rights Reserved. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. "
}