{
    "title": "Tech giants' $10 trillion market showdown",
    "date": "1/29/2024",
    "url": "https://www.biznews.com/global-investing/2024/01/29/tech-giants-market-showdown",
    "text": "  Investors are closely watching the fate of the stock market this week, as five major tech giants—Microsoft, Alphabet, Meta Platforms, Amazon, and Apple—worth over $10 trillion in combined market value, are set to report earnings. This comes amid a broader market surge, with the S&P 500 hitting record highs, fuelled by expectations of central banks easing monetary policies. The results from these tech companies, especially Microsoft and Alphabet heavily invested in artificial intelligence, are deemed crucial for market direction. Concerns linger about overexposure to a handful of stocks, as the Magnificent Seven, including Tesla, dominate the S&P 500. Despite this, traders appear less inclined to hedge against potential declines, reflecting confidence in the ongoing rally, even as valuations and crowded trades raise cautionary flags. Sign up for your early morning brew of the BizNews Insider to keep you up to speed with the content that matters. The newsletter will land in your inbox at 5:30am weekdays. Register here. By Jeran Wittenstein and Elena Popina Investors wondering where the S&P 500 is headed, at least for the next month or so, will want to pay attention to three key days this week. Between Tuesday and Thursday, five Big Tech companies with a combined market value of more than $10 trillion will report earnings: Microsoft Corp., Alphabet Inc., Meta Platforms Inc., Amazon.com Inc. and Apple Inc. Meanwhile, the Federal Reserve will issue its decision on interest rates, followed by Chair Jerome Powell’s press conference where he’s expected to discuss the outlook ahead. Read more: 🔒 Marc Champion: Don’t confuse Netanyahu’s interests with Israel’s The stakes couldn’t be much higher, with the S&P 500 Index pushing deeper into record territory on bets that central bankers are poised to began easing monetary policies and tech behemoths like Microsoft getting more valuable by the day. “Tech disproportionately moved the market last year and big tech continues to have the biggest earnings power, so the results will be crucial for the markets,” said Chris Zaccarelli, chief investment officer at Independent Advisor Alliance. After a shaky start to the year, the S&P 500 is rising again and on pace for a third monthly advance that’s added more than 18% since late October, when the index hit a near-term low before Fed officials started signaling that rate hikes were over. The rally is again being led by megacaps including Microsoft, Alphabet, Amazon.com, Nvidia and Meta Platforms, which were responsible for a majority of the index’s 24% gain last year as investors became captivated by the possibilities of artificial intelligence services. The so-called Magnificent Seven, which also includes Tesla Inc., just hit a record 29% of the S&P 500 despite a slump in shares of the electric-vehicle maker that’s erased more than $200 billion in market value just this month. Microsoft and Alphabet will kick off earnings on Tuesday after markets close. The two companies are among the best positioned to benefit from the AI boom after investing heavily in the field for years. Microsoft has been adding the features to its suite of software products, and investors are betting that AI will soon start boosting profit and sales growth. On Wednesday, the focus shifts to the end of the Fed’s January meeting, where it’s expected to hold interest rates steady for a fourth-consecutive meeting. Traders will be primarily focused on what Powell and other policymakers have to say about the timing of easing. Recent data showing inflation continuing to recede and resilient US economic growth suggest central bankers won’t be in a hurry to cut interest rates. Read more: 🔒 Tesla’s stock surf stalls as Musk bids adieu to growth targets: Liam Denning Apple is the biggest draw on Thursday, when Amazon and Facebook-owner Meta Platforms also report in the afternoon. The iPhone maker has been dogged by concerns about revenue growth and is expected to report its first sales expansion in four quarters. With most of the megacaps in record territory, there are concerns that investors are over exposed to just a handful of stocks, which could open the door for some pain if quarterly results underwhelm. The Magnificent Seven stocks were again named the most crowded trade in a Bank of America survey of fund managers, according to a research note published by the bank last week. Still, traders aren’t rushing to scoop up hedges against declines, according to options market data. A gauge of projected price swings in Apple in the next three months is hovering near the lowest level in six years. Traders expect a 3.3% move in the stock in either direction a day after the results, which would be among the narrowest post-earnings swings in two years. Projected three-month volatility in Meta Platforms, which more than quadrupled since its November 2022 nadir, is at the lowest in two years. The cost of protection against a 10% decline in Microsoft in the next month is hovering near the lowest level since August relative to the cost of options that profit from a similar rally. Tesla demonstrated the risks last week after missing fourth-quarter earnings estimates and warning that its sales growth would be “notably lower” in 2024. The stock tumbled 12% the following day, its biggest drop in a year. Microsoft recently overtook Apple as the world’s most valuable company with a market value above $3 trillion. The rally has made the stock even more expensive, at 33 times profits projected over the next 12 months compared with an average of 24 times over the past decade. To Jason Benowitz, senior portfolio manager at CI Roosevelt, there’s no doubt the megacap trade is crowded. But that doesn’t mean the stocks can’t continue to rally with economic growth slowing and easing financial conditions. “There’s a good reason for the crowded trade,” he said. “The environment is good for them.” Read also: © 2024 Bloomberg L.P. Listen to the story of Cyril Ramaphosa's rise to presidential power, narrated by our very own Alec Hogg. Narration by Alec Hogg BizNews © 2024 BizNews, Inc. | The Rational PerspectiveTerms & ConditionsComments Policy "
}