{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.techtimes.com/articles/300741/20240118/google-ceo-sundar-pichai-tells-employees-brace-more-cuts.htm",
    "text": " After the recent wave of layoffs, which saw over 1,000 employees cut across various divisions and an additional 100 jobs trimmed at YouTube, Google CEO Sundar Pichai has issued a memo cautioning that more layoffs are on the horizon for the tech giant. (Photo : Alex Wong/Getty Images)WASHINGTON, DC - DECEMBER 11: Google CEO Sundar Pichai testifies before the House Judiciary Committee at the Rayburn House Office Building on December 11, 2018 in Washington, DC. The committee held a hearing on 'Transparency & Accountability: Examining Google and its Data Collection, Use and Filtering Practices.” According to the internal memo reported by The Verge, Sundar Pichai admitted the need for \"tough choices\" to align with the company's ambitious objectives, emphasizing that the forthcoming job reductions won't reach the scale of the previous year's downsizing, which amounted to 12,000 job cuts that comprised 6% of Google's workforce. While clarifying that the impending role eliminations won't impact every team, Pichai acknowledged the difficulty of witnessing colleagues and teams being affected, saying, \"Many of these changes are already announced, though to be upfront, some teams will continue to make specific resource allocation decisions throughout the year where needed, and some roles may be impacted.\" The latest round of layoffs is particularly felt in the YouTube division, with approximately 100 employees on the business side of YouTube facing job cuts. Mary Ellen Coe, Chief Business Officer of YouTube, delivered the internal announcement, specifying that the reductions would affect business operations, partnerships, and advertising within YouTube. Responding to inquiries about these organizational shifts, a Google spokesperson highlighted strategic investments in key focus areas and the alignment of resources for future opportunities. Teams at Google have undergone adjustments since the latter part of 2023 to enhance efficiency, collaboration, and alignment with primary product goals. The continuous restructuring initiative extends its influence beyond the business aspect of YouTube, incorporating comprehensive organizational adjustments and global-scale role eliminations. This overhaul is not confined solely to YouTube's business operations, as it also permeates into the structural framework of YouTube's music and support teams. Read Also: Google Announces Further Workforce Reductions, Targeting Advertising Sales Team In response to the layoffs affecting employees, a designated 60-day timeframe has been provided, offering an opportunity for those impacted to actively explore and pursue new roles within the company before the scheduled dismissals take effect. This reduction in the workforce at Google is not exclusive to the YouTube division. Instead, it reflects a more extensive trend of downsizing across the company. A significant workforce reduction recently occurred, resulting in the layoff of over 1,000 employees spanning diverse divisions, engineering, services, and even the voice-activated product, Google Assistant. These layoffs were also felt in Google's advertising division, which underwent considerable downsizing. Similar to previous instances, YouTube staff affected by these changes are confronted with a limited timeframe to secure alternative roles within the company. However, since there is no placement assurance, affected individuals should consider severance packages as part of the potential transition. Related Article: Google CEO Sundar Pichai Cautions the Dangers of Open Web; AI, Quantum Computing to be Highlight for the Next Few Years  Sign up for our free newsletter for the Latest coverage!   "
}