{
    "title": "Google, Microsoft, IBM and 13 other technology companies headed by \nIndian-origin executives",
    "date": "1/26/2024",
    "url": "https://timesofindia.indiatimes.com/gadgets-news/google-microsoft-ibm-and-13-other-technology-companies-headed-by-indian-origin-executives/photostory/107163048.cms",
    "text": "You must login to keep earning daily check-in points  Lifetime Expired Redeemed Total redeemable TimesPoints * TimesPoints expire in 1 year from the day of credit   Refrain from posting comments that are obscene, defamatory or inflammatory, and do not indulge in personal attacks, name calling or inciting hatred against any community. Help us delete comments that do not follow these guidelines by marking them offensive. Let's work together to keep the conversation civil. Now Reading: Distinguished CEOs of Indian origin are at the helm of some of the globe's most impactful companies. Sundar Pichai, at the forefront of Google, steers advancements in search, artificial intelligence, and beyond. Satya Nadella's leadership at Microsoft has rejuvenated the company's trajectory, with a strong emphasis on cloud computing and services. Arvind Krishna guides IBM, concentrating on pioneering developments in hybrid cloud and artificial intelligence. Here, we spotlight 15 Indian-origin CEOs who are at the forefront of major tech corporations. After serving as Google CEO for five years, India-born Sundar Pichai was appointed CEO of Google's parent company, Alphabet Inc., in 2019. Pichai had been leading Google since his appointment as its head in August 2014. Throughout his over two decades at Google, Pichai has held key leadership roles in several of the company's core businesses, including Android, Chrome, and Maps.Academically, Pichai holds a BTech degree from IIT Kharagpur, an MS degree from Stanford University, and an MBA from the Wharton School. Born in Hyderabad, Satya Nadella took the reins as the Chief Executive Officer of Microsoft in February 2014. Before Nadella, Steve Ballmer held the position, being one of the earliest employees of Microsoft and a successor to the company's founder, Bill Gates. Nadella's educational background includes engineering studies at Manipal Institute of Technology, a Master of Science degree from the University of Wisconsin-Milwaukee, and an MBA from the University of Chicago Booth School of Business. His career at Microsoft commenced in 1992, where he played a key role as a developer for the Windows NT operating system. Steve Sanghi was named the executive chair of US-based chip company Microchip in March 2021. He was earlier CEO Microchip, a position he held since October 1991, and the chairman of the Board of directors since October 1993. Sanghi served as president from August 1990 to February 2016. Before joining the company, Sanghi was vice president of operations at Waferscale Integration Inc, a semiconductor company, from 1988 to 1990. Sanghi was with Intel Corporation from 1978 to 1988, where he held various positions in management and engineering, the last one as general manager of Programmable Memory Operations. He holds a Masters of Science degree in Electrical and Computer Engineering from the University of Massachusetts and a Bachelor of Science degree in Electronics and Communication from Punjab University, IndiaIn March 2021, Steve Sanghi was appointed Executive Chair of US semiconductor company Microchip. He held various leadership positions at Microchip since 1990, including CEO and Chairman of the Board of Directors. Prior to Microchip, Sanghi had a successful career in the semiconductor industry. He was Vice President of Operations at Waferscale Integration Inc. from 1988 to 1990. Before that, he worked at Intel Corporation from 1978 to 1988 in management and engineering roles, rising to General Manager of Programmable Memory Operations.Sanghi holds a Master's in Electrical and Computer Engineering from the University of Massachusetts and a Bachelor's in Electronics and Communication from Punjab University, India. In 2018, Nikesh Arora assumed the role of Chief Executive Officer at Palo Alto Networks. Before this appointment, he held various prominent positions at notable companies such as Google and SoftBank. Arora's educational background includes a bachelor's degree obtained from the Institute of Technology at Banaras Hindu University, an MBA from Northeastern University, and a Master of Science degree from Boston College. Shantanu Narayen, another long-term Indian origin CEO of a prominent global tech company, joined Adobe in 1998 as the Senior Vice President of Worldwide Product Research. He rose through the ranks, becoming the COO in 2005 and eventually assuming the role of CEO in 2007.Prior to his tenure at Adobe, Narayen held various positions at Apple and Silicon Graphics. He possesses an impressive educational background, holding a Bachelor of Science from Osmania University, an MBA from the prestigious University of California, Berkeley, and an MS from Bowling Green State University. In April 2020, Arvind Krishna, an IBM veteran of over 30 years, assumed the role of Chief Executive Officer (CEO) at IBM. Throughout his tenure at the company, he has held various senior-level positions. Krishna earned his bachelor's degree from the Indian Institute of Technology Kanpur, followed by a Ph.D. from the University of Illinois at Urbana-Champaign. Anjali Sud serves as the Chief Executive Officer of Vimeo, an open video platform, a position she has held since 2017. Before her role at Vimeo, Sud gained experience working with Amazon and Time Warner. She holds an MBA from Harvard Business School. Sanjay Mehrotra is the President and CEO of Micron Technology, a semiconductor solutions company. Previously associated with Sandisk, he also held positions at Integrated Device Technology, SEEQ Technology, and Intel before co-founding SanDisk. Mehrotra holds over 70 patents and earned his bachelor's and master's degrees from the University of California, Berkeley. Revathi Advaithi is the CEO of Flex, a multinational electronics contract manufacturer domiciled in the United States and Singapore. Assuming the role in 2019, Advaithi previously served as the President and COO of Eaton's electrical sector business. She completed her bachelor's degree at the Birla Institute of Technology and Science, Pilani, and earned her MBA from the Thunderbird School of Global Management. Jayashree Ullal has been the President and CEO of Arista Networks, a cloud networking company, since 2008. Under her leadership, Arista Networks went public on the New York Stock Exchange in 2014. With prior experience at Cisco and AMD, Ullal has also served on the Boards of Zscaler, Arista Networks, and Snowflake. She holds a BS in electrical engineering from San Francisco State University and a master’s in engineering management from Santa Clara University. Anirudh Devgan serves as the President and CEO of Cadence. Prior to becoming CEO in 2021, he was the President of Cadence since 2017. Before joining Cadence in 2012, Devgan held positions at Magma Design Automation and IBM. He holds a Bachelor of Technology degree in electrical engineering from the Indian Institute of Technology, Delhi, and MS and PhD degrees in electrical and computer engineering from Carnegie Mellon University. Siva Sivaram assumed the role of Executive Vice President of Memory Technology at Western Digital in 2016 when SanDisk was acquired. With over 30 years of experience in semiconductors, Sivaram has held executive positions at Intel, Matrix Semiconductor, and was the founder and CEO of Twin Creeks Technologies. He earned his bachelor’s degree in mechanical engineering from the National Institute of Technology, Tiruchi, India. Raghu Raghuram became the CEO of VMware in May 2021, having joined the company as Director of Product Management in 2003. Prior to VMware, Raghuram worked at AOL, Bang Networks, and Netscape. He holds an MBA from the Wharton School of Business and a Master's degree in Electrical Engineering from the Indian Institute of Technology, Mumbai. George Kurian serves as the CEO and President of NetApp, a storage and data management company. Appointed as CEO in 2015, Kurian previously worked with Cisco Systems, Akamai Technologies, and McKinsey & Company. He completed his bachelor’s in electrical engineering from Princeton University and earned an MBA from Stanford University. Smartwatch not syncing with your phone? Here are 9 things you can do How to improve charging speed on your iPhone: 9 tips to follow Managing your Google Drive storage: 8 essential tips to follow 9 reasons why AppleCare is important for Apple devices 10 common issues you may encounter when using Microsoft Teams Sent money to a wrong UPI ID? 9 key things to do immediately Xiaomi's HyperOS rolled out globally: Eligible devices, features and more Cybersecurity in sports: Protecting data and fans Lost an item or mobile in an Uber? Here’s what to do next 10 tips for recording better video with your smartphone Some big fat truths about obesity In Paris, school hijab row prompts national uproar and death threats No more roza dates: Party’s now over for political iftars Is Sunita AAP’s No.1 in husband Arvind Kejriwal’s absence? Copyright © 2024 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service "
}