{
    "title": "Alphabet (GOOGL) Stock Declines While Market Improves: Some Information for \nInvestors",
    "date": "1/22/2024",
    "url": "https://www.zacks.com/stock/news/2213775/alphabet-googl-stock-declines-while-market-improves-some-information-for-investors",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    January 22, 2024 GOOGL Quick QuoteGOOGL Better trading starts here. You follow Tale of the Tape - edit You follow Zacks Equity Research - edit Zacks Equity Research Tale of the Tape In the latest trading session, Alphabet (GOOGL Quick QuoteGOOGL  -  Free Report)     closed at $145.96, marking a -0.29% move from the previous day. The stock trailed the S&P 500, which registered a daily gain of 0.22%. At the same time, the Dow added 0.36%, and the tech-heavy Nasdaq gained 0.32%. The internet search leader's shares have seen an increase of 3.46% over the last month, not keeping up with the Computer and Technology sector's gain of 3.64% and outstripping the S&P 500's gain of 1.61%. The investment community will be closely monitoring the performance of Alphabet in its forthcoming earnings report. The company is scheduled to release its earnings on January 30, 2024. The company is expected to report EPS of $1.60, up 52.38% from the prior-year quarter. Alongside, our most recent consensus estimate is anticipating revenue of $70.71 billion, indicating a 12.03% upward movement from the same quarter last year. Investors should also note any recent changes to analyst estimates for Alphabet. Such recent modifications usually signify the changing landscape of near-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability. Research indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system. The Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.26% higher within the past month. Alphabet currently has a Zacks Rank of #3 (Hold). In terms of valuation, Alphabet is presently being traded at a Forward P/E ratio of 21.97. This represents a discount compared to its industry's average Forward P/E of 25.98. We can additionally observe that GOOGL currently boasts a PEG ratio of 1.3. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. Internet - Services stocks are, on average, holding a PEG ratio of 1.93 based on yesterday's closing prices. The Internet - Services industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 75, this industry ranks in the top 30% of all industries, numbering over 250. The strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Ensure to harness Zacks.com to stay updated with all these stock-shifting metrics, among others, in the next trading sessions. Alphabet Inc. (GOOGL) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}