{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.fool.com/investing/2024/02/06/is-alphabet-stock-a-buy-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Alphabet (GOOGL 0.04%) (GOOG 0.21%) reported better-than-expected fourth-quarter 2023 revenue and diluted earnings per share (EPS) of $86.3 billion and $1.64, respectively. However, the stock dipped following the news, as the market was disappointed with a component of Alphabet's revenue. Shares are taking a bit of a breather, which might be needed as they soared 54% in the last 12 months before the drop. Investors have a lot to think about. Is Alphabet stock a smart buy right now? To answer that question, let's take a closer look at the latest financial results from this dominant tech business. Then we can zoom out and view Alphabet with a long-term perspective. With revenue up 13% and diluted EPS surging 56% compared to Q4 2022, it makes you scratch your head and wonder why the stock is down. But it was Alphabet's advertising revenue that missed analyst expectations. Seeing as how digital ads made up 76% of the company's overall sales in 2023, it's clear that a disappointment here would lead to a negative reaction from the market. Ad revenue rose by 11% in the fourth quarter, so there was still a solid gain. This was driven by strength in the retail sector, as well as in the Asia-Pacific region. \"As we enter 2024 with advertising revenues of more than $100 billion higher than 2019, we remain focused on sustaining healthy growth on this larger base,\" CFO Ruth Porat said on the Q4 2023 earnings call. And YouTube produced $9.2 billion in sales, up 16% year over year. This missed Wall Street's expectations by a measly $10 million. Management also mentioned there are more than 2 billion monthly active users on the platform, and there are an average of 70 billion Shorts being viewed daily. Engagement doesn't seem to be a problem. It's easy to follow the herd and immediately lean toward selling your shares, but there's no need for investors to panic. Revenue for Alphabet actually increased at its fastest pace since the first quarter of 2022. Don't let the market's negative reaction to Alphabet's latest earnings distract you from the factors that truly matter. As a long-term investor, it's best not to get caught up with what happens during a three-month period. There are so many wonderful qualities that make Alphabet an elite company. With a 91% share of the global market, Search has a monopoly position. The fears about the rise of ChatGPT and its integration with Microsoft's Bing search engine have proven to be overblown. Alphabet has a pristine financial position. Its operating margin in Q4 came in at 27%, a notable expansion from 24% in the prior-year period. Ongoing cost cuts, like the latest layoffs of 6% of the company's workforce, are boosting profitability. Alphabet also ended 2023 with $111 billion of cash, cash equivalents, and marketable securities on the balance sheet, compared to long-term debt of $13 billion. This puts the business in a favorable position to continue investing heavily in growth initiatives. One such area is in the cloud. Google Cloud reported 26% revenue growth and a 9% operating margin last quarter. With the recent launch of generative AI tool Gemini, Google Cloud has a potentially meaningful revenue driver as it licenses this technology to clients. \"The Cloud team is intensely focused on bringing the benefits of Gemini, our industry-leading AI technology, to enterprises and governments globally, and we are gratified with the level of engagement,\" Porat highlighted. There's no shortage of reasons to be bullish about this business. Investors should take advantage of the recent dip to buy the stock. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Neil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}