{
    "title": "Here's Why I'm Buying the Dip on Alphabet's Stock",
    "date": "2/8/2024",
    "url": "https://www.fool.com/investing/2024/02/08/heres-why-im-buying-the-dip-on-alphabets-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Sometimes good just isn't good enough. That's exactly what Alphabet (GOOG 0.21%) (GOOGL 0.04%) investors can say after its latest results came out, as they were pretty good by most standards, yet the stock tumbled more than 7% following the report. However, I think this represents a great buying opportunity, as investors aren't seeing the full picture of how strong Alphabet's business is. Alphabet is better known by some brands underneath their umbrella -- Google, YouTube, and Android are all Alphabet products. But there's one key theme among its lineup: advertising. Advertising revenue makes up 76% of Alphabet's total, so as the ad market goes, so does Alphabet. In late 2022 and early 2023, this wasn't a great business to be in, and Alphabet struggled. However, it has begun to recover, which resulted in Alphabet's ad revenue increasing 11%. A key highlight in this division was YouTube, whose ad revenue increased by 16%. This shouldn't be a surprise, as YouTube is the most popular streaming platform in terms of minutes viewed per day. If ads do well, so does Alphabet. However, other stronger portions of the business are doing incredibly well but are just smaller, so they don't sway the results as much. One of those is Google Cloud, Alphabet's cloud computing product. Cloud computing is becoming a vital part of infrastructure, as many businesses are switching their workloads to the cloud. Additionally, cloud computing is a key part of artificial intelligence (AI), as it allows companies to gather and store data easily and then use Google's computing resources to create powerful AI models. Google Cloud is a popular choice for AI start-ups, and more than 70% of generative AI unicorns (private companies worth more than $1 billion) utilize Google Cloud. Google Cloud's revenue rose 26% in Q4 to $9.2 billion, with an operating margin of 9%. While this is below the companywide operating margin of 27%, Google Cloud is still building its infrastructure and is laser-focused on capturing market share instead of profits. This division should be able to achieve an operating profit margin of 30% when fully developed, so this segment will be a long-term boost to Alphabet. There wasn't anything wrong with Alphabet's quarter, and with earnings per share rising from $1.05 in last year's Q4 to $1.64 this year, everything appears to be healthy at Alphabet, which is why I think right now is a fantastic time to buy shares. Compared to its big tech peers, Alphabet's stock is cheap.  GOOGL PE Ratio data by YCharts Not only is Alphabet cheaply priced compared to historical trends, but it's also far cheaper than Microsoft (37 times trailing and 35 times forward earnings) and Apple (29 times trailing and 28 times forward earnings). If Alphabet had the same valuation as Microsoft, it would be valued at $2.68 trillion -- not far off of Microsoft's $3.06 trillion valuation. Alphabet is reasonably priced and slated to have another strong year. Unlike its peers, it doesn't have a premium valuation, so you're not at risk of overpaying. As a result, it's one of the best stocks to buy right now despite what the stock price has done lately. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Keithen Drury has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Apple, and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}