{
    "title": "3 Takeaways From Alphabet's Fourth Quarter That Bode Well for Its Stock",
    "date": "2/4/2024",
    "url": "https://finance.yahoo.com/news/3-takeaways-alphabets-fourth-quarter-072500763.html",
    "text": "Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) has suffered from a lack of respect recently. Despite being an innovator in artificial intelligence (AI) for more than 20 years, investors now question its future in that industry. Moreover, the negative perceptions in the market appeared to persist despite the company delivering respectable results for the fourth quarter. Following the release of that Q4 report Tuesday, the stock price dropped 6% in after-hours trading. Despite the negativity surrounding this communications stock, it would be premature to count out the company. Three factors make it likely that Alphabet will maintain a considerable competitive edge and continue to grow. Given Alphabet's recently intensified focus on AI, one might forget that it remains primarily an advertising company. That segment earned $66 billion in revenue in Q4, growing 11% year over year and accounting for 76% of the company's revenue. The advertising segment provided 78% of company revenue in Q4 2022. Most of the revenue came from Google Search, which brought in $48 billion in Q4, 13% higher than year-ago levels. Additionally, YouTube continues to grow in popularity, especially the YouTube TV service. That segment brought in $9.2 billion in Q4 revenue versus almost $8 billion a year earlier. Even with its share of the top line modestly declining, advertising remains the driving force in the company, and given that its growth is continuing, investors should not expect that to change anytime soon. Outside of advertising, the most notable growth segment of the company was Google Cloud. It reported $9.2 billion in quarterly revenue, an increase of 26% year over year. This continued the trend of Alphabet being more focused on the cloud and AI. On the Q4 earnings call, CEO Sundar Pichai highlighted the company's work in AI and emphasized Google DeepMind's work in generative AI with Gemini, its family of large language models. This is significant because investors seemed to turn away from Alphabet following the release of ChatGPT last year. OpenAI, the developer of ChatGPT, has a tight relationship with Microsoft, and for the first time in decades, the dominance of Google Search appeared threatened. Nonetheless, Gemini shows Alphabet is not going to surrender its position. Furthermore, even if that research falls short, investors often forget about the company's massive cash position. Alphabet reported $111 billion in liquidity as of the end of 2023. Admittedly, there has been some slippage. A year earlier, Alphabet reported $114 billion in liquidity. Additionally, its nearly $8 billion free cash flow in Q4 2023 was less than half of the $16 billion it generated in Q4 2022. An increase in the company's income tax expenses in 2023 was responsible for most of that decline. Alphabet's cash and short-term investments give it one of the corporate world's strongest balance sheets. If it needs to buy companies to gain advantages in the AI space or any other area, it has the resources necessary to bolster and expand its competitive advantage. Investors have not given up on Alphabet to the degree that one might assume. Over the last year, Alphabet stock is still up by more than 50%. Its P/E ratio of 29 is reasonable for a tech growth stock but probably not the bargain valuation some might assume. Ultimately, Alphabet's fourth-quarter results should serve as a reminder to investors to focus on the company's long-term future. Indeed, Alphabet's AI faces more competition, and declines in financial metrics such as liquidity and free cash flow may have disappointed some investors. Nonetheless, it continues to derive growth from a vibrant ad business. Moreover, growth in the cloud and its research bode well for AI, and since the company is tremendously well-resourced, it can invest to maintain or expand its competitive advantages. This should mean that Alphabet will remain a player in the AI space, and that should enrich its long-term shareholders. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Alphabet wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of January 29, 2024  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Will Healy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool has a disclosure policy. 3 Takeaways From Alphabet's Fourth Quarter That Bode Well for Its Stock was originally published by The Motley Fool Related Quotes "
}