{
    "title": "Dan Loeb's Third Point Exited Alphabet, Slashed Uber Stake in Fourth Quarter",
    "date": "2/15/2024",
    "url": "https://www.investopedia.com/dan-loeb-s-third-point-exited-alphabet-slashed-uber-stake-in-q4-8582093",
    "text": " Eva Marie Uzcategui / Bloomberg / Getty Images Billionaire Dan Loeb's Third Point Capital exited its position in Alphabet (GOOGL) and slashed its stake in Uber Technologies (UBER) in the fourth quarter of 2023, while also reducing its positions in Amazon (AMZN), Microsoft (MSFT) and Taiwan Semiconductor Manufacturing (TSM), according to the company's latest 13-F filling. Loeb sold out of several positions to wrap up 2023. His fund exited its $118 million position in Alphabet Class A shares. It also sold off stakes in special purpose acquisition companies including Disruptive Acquisition Corp., EG Acquisition, and Bluescape. Other notable exits from the quarter included about 1 million shares of T-Mobile US Inc. (TMUS) worth roughly $140 million and 5.5 million shares of Option Care Health (OPCH) valued at about $176 million. Third Point reduced its positions in several tech companies in the last quarter. It sold 480,000 shares of Amazon, 210,000 shares of Microsoft, 600,000 shares of Taiwan Semiconductor Manufacturing Co. (TSM) and 1.7 million shares of Intercontinental Exchange Inc. (ICE). Loeb slashed the fund's holdings in Uber by 3.2 million shares, ending the fourth quarter with 1 million. Third Point's additions to preexisting positions were fewer but included some significant boosts. Loeb added 1 million shares each to utilities firms Pacific Gas & Electric (PGE) and Vistra Corp. (VST). He also bought up about 750,000 shares of U.S. Steel (X). Meta Platforms (META) was the sole tech company to get a boost, as Third Point increased its stake by 60,000 shares. Three of Third Point's largest new positions of the quarter were business payments company Fleetcor Technologies (FLT), hydrocarbon exploration firm EQT Corp. (EQT) and diversified healthcare company McKesson (MCK). Loeb's fund bought 615,000 shares of Fleetcor worth about $174 million. The new positions in EQT and McKesson were relatively smaller, at $75 million and $76 million, respectively. Third Point also entered smaller positions in BioMarin Pharmaceutical (BMRN) and private airline FlyExclusive Inc. (FLYX). Third Point Capital. \"13-F Form for the Period Ended December 31, 2023.\" "
}