{
    "title": null,
    "date": "2/16/2024",
    "url": "https://www.storyboard18.com/how-it-works/this-news-about-chatgpt-maker-openai-reportedly-dropped-google-parent-alphabets-stock-23358.htm",
    "text": "Alphabet Inc, which owns search giant Google, reportedly experienced a decline in its stock value following a report in The Information that the Microsoft-backed ChatGPT-maker OpenAI is working on a web search product that would directly challenge Google. This comes one year after Microsoft CEO Satya Nadella went straight at Google by adding Copilot AI tools to its search engine Bing, saying on Decoder, “I want people to know that we made them dance.” Microsoft has pumped billions of dollars into the Sam Altman-led company last year and has been integrating its technology into its products and services, including Bing. OpenAI, which took the world by storm last year, has been developing a web search product, partly powered by Microsoft Bing, the report claimed, mentioning unnamed sources. Since ChatGPT's global launch and Microsoft's AI acceleration, Alphabet seems to have been playing catch up. On Thursday, Google showcased Gemini 1.5, an upgrade to its suite of AI models it announced two months ago. In a single prompt, a user can ask Google's AI to analyze vastly more content than before -- 30,000 lines of code, 11 hours of audio, a whole hour of video, Google said. In an interview with Reuters, Alphabet CEO Sundar Pichai heralded the advance as one of multiple \"breakthroughs\" that would fuel his company's myriad businesses. At root, he said, the search-industry mainstay was making a new manner of inquiry possible. \"You're dramatically giving a wider view for people to ask questions about the world.\" Reuters stated, \"Google's increasingly voracious AI, on the heels of releases by ChatGPT's creator OpenAI and others, reflects the rapid arms race underway in Silicon Valley to build the most capable - and marketable - technology yet.\" Alphabet's fourth-quarter ad revenue rose to $65.5 billion from $59.0 billion a year prior. Google’s ad revenue increased by $6.48 billion from the previous year, while YouTube ad revenue was $9.2 billion, up from $8 billion in 2022. Read More: OpenAI’s founding member Andrej Karpathy departs Storyboard18 is Network18 Group’s flagship platform focussed on the advertising and marketing community and a leading source of news and analyses. For over two decades as a TV show on CNBC-TV18, Storyboard18 has championed and chronicled the business of brands, the rise of Indian advertising and a flourishing brand marketing ecosystem. Now we’re building on that legacy and taking Storyboard18 to the next level as a destination for modern marketers building legendary brands. Have a query? Got feedback? Want to share tips or ideas? Our team would be happy to hear from you. Get in touch with us here:Storyboard18@nw18.com "
}