{
    "title": "Rating All \"Magnificent 7\" Stocks By Their Return Potential",
    "date": "2/23/2024",
    "url": "https://seekingalpha.com/article/4672972-rating-all-magnificent-7-stocks-by-their-return-potential",
    "text": " Silver Screen Collection/Moviepix via Getty Images The legendary gunslingers of the \"Magnificent Seven\" film may have ridden off into the sunset, but in the financial world, the term takes on a new meaning. Coined by analysts in 2023, it initially referred to seven mega-caps driving most of the EPS growth. Last year, their combined gains of 107% dwarfed the S&P 500's (SP500) return of 24%. However, just like in the movies, things change quickly. As 2024 unfolds, the fortunes of the \"Magnificent 7\" have diverged significantly. The group has shrunk to more closely resemble a \"Fantastic Four,\" with several members experiencing vastly different returns. The \"Fantastic Four\": The laggards so far this year: Yet, the Magnificent 7 has amassed wealth exceeding most major countries. This power surge raises critical questions: is it an opportunity for great returns or a ticking time bomb? Alarm bells are ringing as the US stock market exhibits its highest concentration in history, mirroring the dangerous levels of 2000 and 1929. Within the S&P 500, these giants account for a staggering 28.7%. In the tech-heavy NASDAQ, their presence rises to an even more dominant 39.8%, leaving investors heavily exposed to their fortunes. This lack of diversification creates a fragile ecosystem where one company's stumble can trigger a domino effect, impacting the entire market. As we saw yesterday with Nvidia's Q4 FY24 earnings, investors anxiously awaited results from a single company to gauge the direction of the wider market. While these companies carry premium valuations, they also boast impressive quality and growth potential. Their leadership positions within their respective sectors are well-established, and their projected EPS growth of 28% in 2024 paints a promising picture compared to the wider market. Furthermore, their average blended P/E ratio of 41.3x, although seemingly high, is balanced by a moderate forward PEG ratio of 1.47, suggesting attractive value despite the premium price tag. To put it into perspective, the S&P 500 blended P/E is currently 23.25x, and the EPS growth for 2024 is expected to reach 9%, implying a PEG ratio of 2.58. One could argue that compared to the market, the Magnificent 7 are trading at a discount with superior growth expectations. However, not all of these seven companies are created equal, and some offer more attractive potential returns today than others. Amazon has long been admired for its rapid growth, but profitability often took a backseat as the company prioritized expansion. Now, a new chapter unfolds as the focus shifts towards operational efficiency and leveraging AI across its businesses, particularly its powerhouse cloud computing arm, AWS. This shift was evident at the recent re:Invent conference, where Amazon unveiled a suite of AI-powered products for AWS. A new business chatbot, deeper collaboration with Nvidia, and an updated AI chip showcase Amazon's commitment to solidifying its dominance in the cloud services market. This focus on AI integration plays a crucial role in the company's growth strategy, aiming to improve operational efficiency and unlock new revenue streams. Despite its current lead with a 32% market share, Amazon faces stiff competition from Microsoft's Azure and Google Cloud. By harnessing the power of AI, Amazon aims to stay ahead of the curve, ensuring both continued growth and improved profitability in the years to come. When it comes to valuing companies like Amazon, relying solely on the P/E ratio often ignites fiery debates. Critics argue it misrepresents the true picture, especially for such rapidly growing and reinvesting businesses. I stand firmly with that camp, believing P/E fails to capture Amazon's true cash-generating power. Instead, I advocate for focusing on Operating Cash Flow (OCF). A glance at Amazon's historical performance reveals a compelling narrative. Since 2003, its annual OCF growth has averaged a staggering 28.6%, mirroring its valuation, which hovered around 26x its OCF. However, here's where things get interesting. Currently, the stock trades at a much lower multiple of 19.5x its OCF. Even more enticing, analysts project continued growth, anticipating a 25% annual growth in OCF over the next three years. Let's break it down: These projections paint a clear picture: despite decelerating growth, Amazon currently trades at a discount to its historical valuation based on OCF. Taking things a step further, if we consider the 25% annual OCF growth forecast, a fair valuation would be around 24x to 25x its OCF. This translates to a potential annual return of nearly 33% by the end of 2026. Based on this analysis, I confidently rate Amazon stock as a \"Strong Buy\". Amazon Valuation (Fast Graphs) Nvidia's recent Q4 FY24 earnings report sent the stock price skyrocketing, fueled by a 265% YoY revenue surge. This growth was driven by the company's H100 chip, a leader in the data center market. Capitalizing on heavy CapEx spending by major companies investing in AI-powered data centers, Nvidia saw its data center revenue alone quadruple YoY, reaching a staggering $18.4 billion. This performance signifies a significant shift, transforming Nvidia from a primarily gaming company into a major player in the AI/data center realm. Their chips now power the most powerful language models used by tech giants like Microsoft, Google, and Meta. With limited competition, Nvidia enjoys immense pricing power, evident in their gross margin expanding to 76%, rivaling software companies rather than hardware manufacturers. Their net income also witnessed a substantial 7.7x increase compared to the previous year. However, the future holds potential challenges. Competitors like AMD (AMD) and Intel (INTC) are launching their own AI chips in the coming quarters, putting pressure on Nvidia's pricing dominance. While the past 1.5 years have seen a remarkable growth story driven by AI tailwinds and accelerated computing, replicating such explosive growth might be difficult. Despite these concerns, the stock's 226% increase in the past year raises questions about its sustainability. Yet, the current valuation, with a blended P/E of 57.6x, seems justifiable considering the projected forward growth: While expectations remain high and Nvidia's stock is known for its volatility, the forward PEG ratio of only 0.77 suggests an attractive opportunity. Keep in mind that if the growth materializes, the stock isn't expensive at all: While the expected returns are enticing, the risk of growth not materializing makes me hesitant to call it a \"Strong Buy\". Taking all factors into account, I rate Nvidia as a \"Buy\" with potential returns of 20.6% over the next three years. Nvidia Valuation (NVDA IR) Meta's Q4 earnings report, released in early February, brought smiles to investors' faces, marking one of the best earnings reports of the season. The stock surged 21% after the company surpassed analyst expectations by nearly $1 billion, reporting revenue of $40.1 billion, a 25% YoY increase. Despite many claiming the company's demise, the family of apps is used today by almost 50% of the world's population on a monthly basis. The company has also become much more efficient, increasing its operating margin to 41% from only 20% a year ago, as Marketing & Sales and G&A expenses also saw significant reductions of 29% and 26%, respectively, mainly due to lower marketing spend and restructuring costs. Meta put its cash pile to good use by authorizing a new $50 billion stock buyback program, adding to the existing $30.9 billion program. This is expected to reduce outstanding shares by another 6.7% at current stock prices. Further enticing investors, Meta announced its first-ever quarterly dividend of $0.50 per share. Alongside Google, Meta is a dominant force in advertising and opinion-making, and with the 2024 US presidential election approaching, as well as a record-breaking 4 billion voters globally expected to vote in elections this year, such a massive audience presents a significant advertising opportunity not just for Meta, but also for Alphabet this year. Meta is also one of the top frontrunners for the \"top AI business\" title, as the company is spending more than $18 billion to build leading data centers to power its AI tools and deliver a superior user experience. The stock is not cheap, trading at a blended P/E ratio of 30x, compared to 16 months ago when the stock traded at only 10x its earnings. Yet, EPS growth is expected to continue at an average of 20% annually over the next three years: While the forward growth is lower than the 32% EPS growth since 2012, even if the valuation contracts to around 25x its earnings, which I consider fair for the stock, investors could see up to 14% annual returns. I rate Meta as a \"Buy\" with strong tailwinds in 2024 driven by a record-breaking election year around the world. Meta Valuation (Fast Graphs) In 2024, Alphabet, the parent company of Google, has emerged as the underperformer among the Magnificent 7 companies. Despite expectations for Google to lead in AI innovation given its extensive history in the field, the company has yet to demonstrate clear superiority. Concerns linger that emerging technologies like chatbots, such as ChatGPT, could potentially challenge Google's longstanding dominance, which commands a 93% market share in search engines. However, fears of significant market share erosion have not materialized. In its Q4 earnings report, Google posted a robust 13% increase in overall revenue, reaching $86.3 billion. This marks the company's swiftest growth over the past six quarters. The revenue exceeded Wall Street estimates of 12% growth, while operating income surged by 30% to $23.7 billion, boasting an operating margin of 27%. This reflects a notable 300 basis point increase YoY. In the broader context, Google's performance in Q4 has been robust, particularly evident in its consistent double-digit growth across all segments. After the earnings, however, the company's stock has dropped, as Google's total advertising revenue slightly impacted overall revenue growth, increasing by only 11% to $65.5 billion, falling short of expectations for $65.8 billion, or perhaps even an expectation to overdeliver. In my view, this drop still presents a good opportunity to add to Google's position, as the company is not going anywhere and should benefit from the same tailwinds as Meta in the record-breaking election year. The stock is trading at 24.8x its blended P/E, making it the cheapest among the Magnificent 7. Yet, the EPS growth is expected to average 15.3% over the next 3 years, which is not the lowest by any means: In terms of forward growth, I consider the valuation of 24.8x its earnings to be fair, and I would expect the valuation to remain at a relatively similar level going forward. Taking all aspects into consideration, I rate Alphabet, or Google, as a \"Strong Buy\" today, with the potential for 16% annual returns until 2026 and a very favorable valuation, which entails lesser risk compared to other discussed stocks. Alphabet Valuation (Fast Graphs) Microsoft kicked off 2024 with a powerhouse Q2 FY24, exceeding expectations with an 18% revenue surge to $62.0 billion. This stellar performance was driven by strong showings across all segments, but the real highlight was the Microsoft Cloud. Cloud revenue skyrocketed 24% to over $33 billion, fueled by Microsoft's successful integration of AI across its entire tech stack. This move is attracting both new customers and driving significant productivity gains for existing ones. The company's commitment to AI is further solidified by their explosive Azure AI user growth – 53,000 in total, with a third joining within the past year. The future looks even brighter for Microsoft. Larger, more strategic Azure deals like Vodafone's (VOD) recent $1.5 billion commitment over 10 years showcase the transformative power of their cloud and AI offerings. Additionally, the acquisition of Activision Blizzard is expected to significantly contribute to the More Personal Computing segment, unlocking further growth and efficiency potential. With its cloud ambitions heating up and the gap on market leader Amazon's AWS shrinking, Microsoft is poised for continued success in the coming years. Microsoft is widely regarded as a superior business with excellent leadership, high-quality, recurring earnings, and a longstanding presence among the Magnificent 7, consistently ranked in the top 5 US companies by market capitalization, except for only four months since 1997. However, we cannot overlook the current valuation, which poses a risk. The stock is trading at a stretched 36.7x blended P/E, a significant departure from its historical average of 21x its earnings. While it's true that growth is projected to accelerate over the next three years, departing from the historical EPS growth of 12.5% and accelerating to 17%, the valuation remains stretched: Despite the anticipated attractive growth, the stretched valuation will likely impact potential returns going forward. Investors should not expect more than 8% annual returns until 2026. While I personally hold a significant position in Microsoft, which has grown handsomely, I am not inclined to buy more shares at today's price point. Therefore, I rate the stock as a \"hold.\" Microsoft Valuation (Fast Graphs) Apple's fiscal Q1 earnings report was a welcome change, marking a return to sales growth after four consecutive quarters of decline. iPhone 15 sales and services fueled this 2% YoY revenue increase and 16% YoY EPS jump to $119.6 billion and $2.18, respectively. However, a dark cloud hangs over China, where sales plunged 12.9% YoY in December due to heightened competition. This raises concerns about the health of one of Apple's biggest markets. Adding another layer of intrigue, Apple launched the Vision Pro headset on February 2, its first major innovation in nine years. Starting at a hefty $3,499 and currently limited to the US, its impact remains to be seen. With the iPhone, Apple's core business, reaching maturity, investors seek the next big growth driver. Services and wearables have recently provided a lift, but sustaining top-line growth will be challenging. Apple's key strength lies in its interconnected ecosystem, boasting over 2.2 billion devices in use, including more than one billion iPhones. This \"stickiness\" helps retain users, but is it enough for future growth? Moving the top line might be difficult, but levers like stock buybacks could influence EPS growth. Despite these strengths, analyst forecasts paint a modest picture: With an average annual EPS growth of 8.6% over the next three years and a current P/E ratio of 28.9x, significant upside potential seems limited. In fact, the valuation could decline towards 20x earnings, to trade more in-line with the historical valuation during a period of similar growth, implying a potential 4% annual loss until 2026. Acknowledging Apple's superior quality and non-cyclical ecosystem, the limited growth prospects and stretched valuation suggest minimal upside. While some investors appreciate these strengths, at today's price, I cannot see any argument to be buying Apple's stock, hence \"hold\". Apple Valuation (Fast Graphs) While 2023 wasn't stellar for Tesla's EPS (down 23% YoY), a bright spot emerged: the Tesla Model Y became the global best-selling car, exceeding 1.2 million units sold. This achievement underscores the growing popularity of EVs, with sales of EVs in the US crossing one million and reaching a 7.5% market share. However, recent months have seen a slowdown in EV growth, with November 2023 showing only 35% YoY growth. Several factors are at play: This slowdown impacted Tesla's Q4 earnings. Revenue grew only 3% YoY to $25.16 billion, and the ongoing price war in the EV industry caused a 612 basis point drop in gross margin to 17.6%. While recent price cuts aim for price parity with traditional vehicles, they pose a $1.2 billion annual cost gamble for Tesla. The EPS hit was significant, falling 40% to $0.71 in Q4. While the stock's valuation is no longer as extreme as its 2020-2021 peak of 340x earnings, it still sits at a potentially inflated 62.4x blended P/E with growth slowing. Analyst forecasts paint a mixed picture in EPS growth over the next three years: Given the average annual forecasted EPS growth of 20%, the current P/E seems high. In my view, Tesla shouldn't trade at a higher valuation than 40x earnings with a similar growth profile, hence my \"hold\" rating. Yet, investors assign a higher valuation due to its other ventures, such as power storage, robotics, and autonomous driving, all of which could be great growth drivers in the future but have not yet made a significant mark on the bottom line. Considering this, if the valuation stays around 55x earnings and the growth materializes, 14% annual returns are possible. Tesla Valuation (Fast Graphs) In this article we looked at all the Magnificent 7 stocks, diving deep into their latest earnings, potential tailwinds, and current valuations compared to projected future growth. While their average blended P/E ratio of 41.3x seems high, it's counterbalanced by significant projected EPS growth. This suggests that despite the premium price tag, they may offer attractive value. However, remember that not all stocks are created equal. Within the group, some present better investment opportunities than others due to differences in valuation and projected growth. To summarize: For an in-depth look into each of the stocks, you can read my recently published research on SA: Microsoft: Not Worth Your Money At Today's Price Apple: Make No Mistake, Is The Smartwatch Sales Ban A Real Threat? Nvidia: Near All-Time Highs, Yet Reasonably Valued With Widening AI Tailwinds Alphabet: Cheapest Mag 7 Ripped To Reach $170 By The Year End Amazon: Path To $220 In 2024 Meta: Still A Buy After The 408% Parabolic Run? Tesla: Buy The Dip? Here's What You Need To Know (Rating Downgrade) This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG, NVDA, MSFT, AMZN either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}