{
    "title": "Analyst Upgrades: 3 Stocks That Just Got a Boost From Wall Street",
    "date": "2/26/2024",
    "url": "https://investorplace.com/2024/02/analyst-upgrades-3-stocks-that-just-got-a-boost-from-wall-street/",
    "text": " Analysts are increasingly bullish on these companies and their shares Advertisement As earnings season rolls on, analysts are busy updating their price targets and ratings on the stocks that they cover. While many stocks have gotten downgraded after issuing subpar financial results, others are seeing their ratings and price targets get a well-deserved boost from the analyst community. Better-than-expected earnings prints, strong forward guidance, and future catalysts can lead to big price target increases and top “Buy” ratings. These, in turn, can improve the sentiment around certain stocks and attract both retail and institutional investors. After strong prints, some previously unloved stocks are now seeing some welcome upgrades from analysts after years of being downgraded or neglected. Here is analyst upgrades: three stocks that just got a boost from Wall Street. Analysts at Redburn Atlantic just raised their price target on Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) stock to $170 per share from $165 previously, while maintaining a “Buy” rating on the security. In its upgrade, Redburn said that Google Search maintains a competitive advantage and is in a “…stronger position than is appreciated” and worth buying. The analyst upgrade comes after Alphabet reported strong fourth quarter 2023 financial results but noted that its online advertising revenue is slowing down. Alphabet reported Q4 earnings per share (EPS) of $1.64 versus $1.59 that had been expected among analysts. Revenue totaled $86.31 billion compared to $85.33 billion that was forecast on Wall Street. Total sales rose 13% from a year earlier. However, revenue from online advertising totaled $65.52 billion in the quarter, missing analysts’ estimates of $65.94 billion. The miss was blamed on a dip in ad sales at YouTube. The advertising disappointment sent GOOGL stock down more than 6% immediately after the earnings print. Year-to-date, GOOGL stock is up 4%, trailing the market. Redburn says it’s time to buy. Barclays (NYSE:BCS) just lifted its price target on Walmart (NYSE:WMT) to $180 a share from $167 while keeping a “Buy” equivalent rating. Barclays’ upgrade comes after a very strong print from the discount retailer and as it makes a bid to acquire connected TV maker Vizio (NYSE:VZIO) for $2.30 billion. Walmart just reported strong financial results for the fourth quarter of last year due largely to a surge in its e-commerce sales. Walmart reported EPS of $1.80 compared to $1.65 that was forecast on Wall Street. Revenue totaled $173.39 billion versus $170.71 billion that was expected. Walmart’s overall sales rose 6% from a year earlier as shoppers turned to the big-box retailer throughout the holiday season and the company’s global e-commerce sales grew 23%. In fact, the company’s e-commerce sales worldwide surpassed $100 billion for the first time. In the U.S., e-commerce sales rose 17% year-over-year. Same-store sales rose 4% in the U.S. At Sam’s Club, same-store sales increased 1.9%, including gasoline sales. Walmart also recently announced a 3-for-1 stock split and says it sees an opportunity to grow its online advertising business through the Vizio purchase. Bernstein has taken its price target on Walt Disney Co. (NYSE:DIS) to $120 from $115 and kept a “Buy” equivalent rating.  The analysts at Bernstein say that the ongoing crackdown on Disney+ password sharing and the Nelson Peltz proxy fight for board seats at the company are both positive developments for the Mouse House. After being in Pluto’s dog house for the last two years, DIS stock is finally gaining ground after the entertainment giant issued strong quarterly financial results and raised its dividend payment to shareholders by 50%. Starting in July of this year, Disney will pay a semi-annual dividend to stockholders of 45 cents, which is 50% higher than its current payout. Disney also announced a new $3 billion stock buyback plan. Disney reinstated its dividend late last year after suspending it in 2020 during the Covid-19 pandemic. Disney also reported strong results for the final quarter of 2023, announcing EPS of $1.22, which was well ahead of Wall Street forecasts that called for $1.01. Revenue of $23.50 billion was flat compared with a year ago. DIS stock is now up 18% on the year. On the date of publication, Joel Baglole held a long position in GOOGL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Joel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/analyst-upgrades-3-stocks-that-just-got-a-boost-from-wall-street/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}