{
    "title": null,
    "date": "2/18/2024",
    "url": "https://finance.yahoo.com/news/billionaire-investor-chase-coleman-46-124000295.html",
    "text": "Billionaire investor Chase Coleman is one of Wall Street's original whiz kids. When he was just 24 years old, he founded Tiger Global Management with starting capital from his former boss and mentor, the iconic hedge fund manager Julian Robertson, Jr. Coleman parlayed this seed money of $25 million into one of the world's most successful hedge fund empires, with roughly $58 billion in assets under management. He's currently ranked as the world's 500th richest person by Forbes with a net worth estimated at $5.7 billion. Coleman is best known for spotting big winners early on, making notable investments in (among others) Spotify; Facebook, now Meta Platforms (NASDAQ: META); and LinkedIn, now owned by Microsoft (NASDAQ: MSFT). He's no stranger to bold bets, so it isn't surprising that to close out 2023, Coleman had a whopping 45.8% of Tiger Global Management's equity portfolio invested in just five artificial intelligence (AI) stocks: Meta Platforms: 18.8% Microsoft: 14.3% Amazon (NASDAQ: AMZN): 5.3% Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG): 4% Nvidia (NASDAQ: NVDA): 3.4% Let's look at Coleman's top holdings to see why he's so heavily weighted in these AI stocks. Meta Platforms is Coleman's largest holding by far, which isn't surprising since he discovered the company when it was still Facebook. When it comes to AI, Meta has a long track record of using sophisticated algorithms to its advantage. The lion's share of its revenue is generated by digital advertising, and using AI helps surface more relevant ads and appropriate content for its social media users. With the ongoing recovery in ad spending, 2023 was a banner year for the world's second-largest digital advertiser. Meta helped fuel its growth by providing advertisers with a suite of AI-powered tools to help improve their results. The company also jumped feet first into generative AI by developing a top-shelf AI model -- the LLaMA (large language model Meta AI) -- which is available on all the major cloud platforms, giving Meta an entirely new revenue stream. The social media company also announced its first-ever dividend. Meta stock sells for about 23 times forward earnings, a discount compared to the broader market -- which likely factored into Coleman's investing decision. Microsoft stunned tech aficionados last year when it invested $13 billion in ChatGPT creator OpenAI, focusing the limelight on the potential applications for generative AI. Many big tech companies followed suit, and the AI arms race was on. Microsoft made the most of its investment, quickly integrating AI functionality across a broad cross-section of its most popular productivity tools. It further bolstered demand by offering the most sought-after AI models on its Azure Cloud. One of the biggest opportunities, however, rests in its suite of AI-fueled assistants: Microsoft Copilot. The ability of these tools to increase users' productivity has resulted in strong demand, which could generate incremental revenue of $100 billion by 2027, according to the I/O Fund's Beth Kindig. Azure's growth outpaced the competition in the fourth quarter, and Microsoft noted that 6 percentage points of that growth came from increased demand for AI services. Microsoft currently trades for 35 times forward earnings. That's a slight premium to the overall market, but the company's strong history of growth and the additional potential resulting from AI make it a must-own AI stock, which likely provided extra incentive for Coleman to buy. Amazon also has a long history of deploying AI algorithms to manage its e-commerce business, using AI to make product recommendations, manage inventory levels, schedule delivery routes, and more. The company has also jumped on the generative AI bandwagon, using the technology to improve product descriptions, summarize reviews, and polish merchant advertising. Amazon also plans to offer a customer-focused tool to answer specific product questions. Furthermore, as the leading cloud infrastructure provider, Amazon Web Services (AWS) offers a laundry list of popular generative AI models via its Bedrock AI. The company is also several generations along in the development of its AI processors -- namely Inferentia and Trainium -- to provide improved and lower-cost AI processing for its cloud customers. Despite its run-up over the past year, Amazon stock sells for just 2 times forward sales, the standard for an undervalued stock, which likely didn't escape Coleman's notice. Like its rival Meta Platforms, Alphabet makes the vast majority of its revenue from its ad tech business, driven by Google search. Alphabet has a long and distinguished history of using AI to improve its search and targeted advertising results, and the rebound in the digital advertising market will no doubt boost its fortunes. Alphabet has been hard at work developing generative AI solutions, incorporating this next-generation functionality into a broad cross-section of its namesake Google and Android products and services. Its position as a leading cloud infrastructure provider puts the company in the perfect position to market AI solutions to its cloud clients. The recent debut of Gemini AI was hailed by Google as its \"largest and most capable AI model.\" Furthermore, Alphabet's Vertex AI platform offers a growing suite of more than 130 foundational AI models for customers to choose from. One of the most intriguing things about Alphabet's stock is the price: just 25 times earnings, a discount to the broader market -- and a valuation that Coleman likely couldn't pass up. Nvidia is the poster child for the accelerating adoption of AI. Its processors revolutionized the gaming industry and were adapted to handle the rigors of AI and have since become the gold standard. Its graphics processing units (GPUs) dominate the market in machine learning and data centers, with an estimated 95% share in each market. This made Nvidia the no-brainer choice when demand for generative AI ramped up. While rivals are working furiously to develop competing chips, Nvidia's pace of innovation makes it difficult to gain ground. Further frustrating those efforts is the company's heavy spending on research and development, which amounted to $6.2 billion -- or 16% of total revenue -- for the nine months ended Oct. 29. Despite the stock's triple-digit gains, Nvidia is still incredibly cheap, with a price/earnings-to-growth (PEG) ratio of less than 1 -- the standard for an undervalued stock -- and Coleman was no doubt keenly aware of that. Should you invest $1,000 in Meta Platforms right now? Before you buy stock in Meta Platforms, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, and Spotify Technology. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Billionaire Investor Chase Coleman Has 46% of His Portfolio Invested in 5 Brilliant Artificial Intelligence (AI) Growth Stocks was originally published by The Motley Fool Related Quotes "
}