{
    "title": null,
    "date": "2/2/2024",
    "url": "https://www.dcourier.com/news/2024/feb/02/analysts-unveil-new-google-stock-price-targets-aft/",
    "text": "  On Sept. 4, 1998, computer scientists Larry Page and Sergey Brin took a research project that they had been working on for two years and turned it into a company. And they called it Google. Their project, which would later become a subsidiary of Alphabet  (GOOGL)  - Get Free Report, became the most popular search engine in the world, capturing roughly 92% of the market. So much has changed since those final years of the 20th Century. Now, we live in a world where artificial intelligence has moved from science fiction to reality, and companies are competing fiercely for a place in this new landscape. How this landscape will evolve remains to be seen, but optimism that Alphabet will be a major player helped its shares surge 31% in the past year. That's great, but it's been tougher sledding for investors recently. After Google reported fourth-quarter earnings, shares fell by 7%, causing many to wonder what could happen next. Alex Wong&solGetty Images Google, a member of the so-called \"Magnificent Seven,\" a basket of tech stocks that includes a who's who of big-time players such as Apple, Microsoft, and Nvidia, posted fourth-quarter earnings on Jan. 30. The company reported adjusted earnings of $1.64 per share, up from $1.05 a year earlier, and beating Wall Street's forecast of $1.59 per share. Revenue totaled $86.3 billion, up from $76.1 billion last year and ahead of the expected $85.33 billion. Ad revenue came to $65.52 billion, short of analysts’ estimates of $65.94 billion. While the numbers overall looked good, investors were disappointed with ad revenue and increased spending, including rising AI costs. \"Our results reflect strong momentum and product innovation continuing into 2024,\" CEO Sundar Pichai told analysts during the company's earnings call. \"Last year brought new excitement around gen AI, and I'm proud of how we responded responsibly with deep advances in foundation models and a number of great launches.\" Related: What Apple’s stock does after earnings may hinge on this key opportunity Alphabet's capital expenditure surged 45% to $11 billion, and Chief Financial Officer Ruth Porat said that capital expenditures would be notably larger this year than in 2023. She said the CapEx spending will be driven \"overwhelmingly by investment in our technical infrastructure with the largest component for servers followed by data centers.\" Porat also said that Alphabet would incur $700 million in severance-related costs in the first quarter. Last month, Google laid off a thousand workers in its hardware, voice-assistance, and engineering teams as part of cost-cutting measures. Early last year, the company cut about 6% of its workforce, or 12,000 positions, marking the largest layoff round in its history. At the time, Google said it was “responsibly investing in our company’s biggest priorities and the significant opportunities ahead.” Redburn Atlantic analyst James Cordwell,  who boosted his price target on Alphabet to $165 from $150 and kept a buy rating on the shares, said that the company's results were robust at an aggregate level. However, he said, investor focus is likely to be on the fact that Search growth was only in line with expectations, which, when combined with capex increasing materially, will likely support the bear case. Cordwell, however, said he viewed these concerns as overdone. Jefferies raised the firm's price target on Alphabet to $175 from $170 while keeping a buy rating on the shares. Its analysts said that strong ad demand drove accelerating, double-digit growth in Search and YouTube, though results in these segments were \"shy of some investor bogeys.\" More From Wall Street Analysts: Cloud growth re-accelerated but remains below that of Microsoft's Azure cloud computing program. Jefferies said it sees \"an upbeat 2024\" with a healthy and strengthening ad market plus Al driving Cloud and YouTube momentum. BMO Capital analyst Brian Pitz raised the firm's price target on Alphabet to $178 from $170 and kept an outperform rating on the shares. Pitz said in a research note that the next leg of GenAl growth is likely to come from infrastructure, foundational models, and apps. Given its full-stack offering, Alphabet is one of the best-positioned Al competitors. BMO also raised its 2024 earnings call to $6.62 per share, up from $6.21, and its 2025 target to $8.06 per share from $7.49. Wells Fargo, however, had a different view of Alphabet's results. The firm lowered its price target on the company to $141 from $148 and kept an equal weight rating on the shares. Analysts there said they viewed tepid fourth-quarter search growth as mostly an Alphabet-specific issue. Negative revisions to search revenues offset a more favorable cost outlook, Wells Fargo added. They noted that operating loss and free cash flow estimates were revised lower. Further, the firm sees the combo of decelerating search growth and elevated capital expenditure as difficult for the stock. Related: Veteran fund manager picks favorite stocks for 2024 Click Below to: Contents of this site are © Copyright 2024 Prescott Newspapers, Inc. and Western News&Info®, Inc. All rights reserved. |  Terms of Service | Privacy Policy "
}