{
    "title": "How To Use Google Circle To Search Feature - Alphabet (NASDAQ:GOOG), \nAlphabet (NASDAQ:GOOGL)",
    "date": "2/5/2024",
    "url": "https://www.benzinga.com/news/24/02/36933459/how-to-use-googles-new-circle-to-search-feature",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Alphabet Inc.'s GOOG GOOGL Google Circle to Search feature makes it easier to finding information about something on your screen. It was announced during the Samsung Electronics Co Ltd.'s SSNLF Galaxy S24 launch. What Is This About: As the name suggests, the new Google Circle to Search feature allows users to invoke the Google app on their Android phone and draw a circle to search for information. This feature uses Google's reverse image search technology and character recognition to identify and search for information the user highlights. One of the most obvious use cases of this is shopping for a certain item. For instance, if you see a product in an image sent by your friend or in a post on social media, you can invoke Google and search for it right away. But wait: this is not a completely new feature. It was available several years ago when Google Now on Tap was unveiled. However, in its current avatar, Circle to Search lets you be more precise in terms of what you want to search, which is a good bonus. See Also: Google Search ‘Cached’ Feature Has Been Killed: Here Are Free Alternatives You Can Try Instead It is worth noting that Circle to Search is currently available only on the Samsung Galaxy S24 and the Google Pixel 8 series. With that out of the way, here's how you can use Circle to Search: That's it, the Google app will now look up for information based on your instructions. Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Apple’s ‘Find My’ Feature Helps An iPhone Owner Recover Their Stolen Phone From Walmart’s ‘EcoATM’: Here’s How You Can Save Yours Photo courtesy: Google © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}