{
    "title": "Alphabet is the bargain stock among the 'Magnificent Seven'",
    "date": "3/11/2024",
    "url": "https://finance.yahoo.com/news/alphabet-bargain-stock-among-magnificent-170900695.html",
    "text": "You might be tired of seeing so much coverage of the group of tech stocks known as the Magnificent Seven, but their valuations and expected growth rates highlight Alphabet — Google’s holding company — as a compelling play at its current price. It even appears to be a bargain when compared with the entire S&P 500. Tesla’s stock chart sends warning to bears that momentum may have bottomed IBM begins layoffs amid push toward AI No more free lunches: How laid-off tech workers are surviving a tight job market I inherited $70,000 in savings bonds from my late mother. How do I avoid tax problems when cashing them in? Nvidia’s stock could hit $1,200, this bull says. Here’s the key to that rally. Sorted by market capitalization, the Magnificent Seven include Microsoft Corp. MSFT, Apple Inc. AAPL, Nvidia Corp. NVDA, Amazon.com Inc. AMZN, Alphabet Inc. GOOGL GOOG, Meta Platforms Inc. META and Tesla Inc. TSLA. Combined, these seven companies (eight stocks with Alphabet’s Class A and Class C shares) make up 28.7% of the SPDR S&P 500 ETF Trust SPY, the largest exchange-traded fund tracking the S&P 500 SPX. The most commonly cited stock valuation is the forward price-to-earnings ratio. This is the current price of a stock divided by the average earnings estimate for the next 12 months among analysts who work for brokerage firms. FactSet tracks forward P/E ratios historically, based on rolling consensus estimates among analysts polled by the data provider. With the Magnificent Seven sorted by market capitalization, here are current forward P/E ratios along with historical averages, with weighted ratios for the S&P 500 at the bottom: Company Ticker Market cap ($bil) Forward P/E 3-year average forward P/E 5-year average forward P/E 10-year average forward P/E Microsoft Corp. MSFT $3,018 31.3 28.8 28.6 24.1 Apple Inc. AAPL $2,636 25.4 25.9 24.6 19.0 Nvidia Corp. NVDA $2,188 34.1 41.4 39.9 35.0 Amazon.com Inc. AMZN $1,821 39.4 57.6 62.8 116.7 Alphabet Inc. Class A GOOGL $1,596 19.7 21.8 23.6 22.8 Meta Platforms Inc. Class A META $1,113 23.5 19.4 21.2 25.9 Tesla Inc. TSLA $558 55.3 75.6 96.3 128.6 S&P 500 SPX 20.6 19.2 19.4 18.0 Source: FactSet And this is how the current valuations compare with the averages: Company Ticker Current P/E to 3-year P/E Current P/E to 5-year P/E Current P/E to 10-year P/E Microsoft Corp. MSFT 109% 109% 130% Apple Inc. AAPL 98% 103% 133% Nvidia Corp. NVDA 82% 86% 98% Amazon.com Inc. AMZN 68% 63% 34% Alphabet Inc. Class A GOOGL 90% 84% 86% Meta Platforms Inc. Class A META 121% 111% 91% Tesla Inc. TSLA 73% 57% 43% S&P 500 SPX 107% 106% 114% Source: FactSet Microsoft, Apple and the S&P 500 trade well above their average 10-year forward P/E valuations. Alphabet is among five companies trading below their 10-year averages. But only Alphabet trades below all the averages while having a current forward P/E below that of the index. Now let’s take a look at expected compound annual growth rates for sales and earnings per share through 2025. The estimates driving the expected growth rates are based on calendar years, because Nvidia, Microsoft and Apple have fiscal years that don’t match the calendar. Company Ticker Expected 2-year sales CAGR through 2025 2-year estimated EPS CAGR through 2025 Microsoft Corp. MSFT 14.8% 14.8% Apple Inc. AAPL 4.1% 6.6% Nvidia Corp. NVDA 52.3% 66.8% Amazon.com Inc. AMZN 11.7% 36.3% Alphabet Inc. Class A GOOGL 11.2% 16.3% Meta Platforms Inc. Class A META 14.6% 24.9% Tesla Inc. TSLA 17.6% -1.4% S&P 500 SPX 5.3% 12.3% Source: FactSet Some notes about this data: Investors shouldn’t be overly fixated on a low P/E, of course. The point with Alphabet is that it is expected to grow sales and earnings at considerably higher paces than the S&P 500, while its shares trade at a lower valuation than that of the index as a whole. Nvidia has a relatively high P/E of 34.1, but that valuation has come down considerably over the past year. Nvidia tops this list of 25 of the best-performing stocks in the S&P 500 whose EPS estimates have risen more quickly than the share prices. Related: Nvidia’s stock could hit $1,200, this bull says. Here’s the key to that rally. Getting back to Alphabet, the stock is down 5% from where it was at the end of 2021. It is useful to look at performance from that date, because the S&P 500 fell 18.2% in 2022, only to rise 26.3% in 2023. (All returns in this article include reinvested dividends.) So the S&P 500 is up only 3.4% since the end of 2021, while Alphabet is down 5% and Nividia’s stock has tripled in price. On Monday, Michael Nathanson, a senior research analyst at MoffettNathanson, wrote in a note to clients that Alphabet’s stock had been ”de-rated” relative to the S&P 500, reflecting investors’ concern over artificial intelligence and its possible effect on Google’s search business. He also pointed to a recent misstep, when Google botched the rollout of its Gemini AI tool for generating images. “Ironically, Alphabet’s long-term reluctance to ship AI products that were not yet safe, reliable, and responsible did not compute with what just happened here,” Nathanson wrote. The analyst also cited a ceding of advertising market share to Meta and Amazon “for much of the past decade.” But then he pointed to Meta, another company that had disappointed investors: CEO Mark Zuckerberg’s initial vision of the metaverse didn’t work out very well, and it was followed by a “year of efficiency” for the company in 2023, which helped reverse its share-price slide. Nathanson rates Alphabet’s Class A shares a buy, with a $175 price target, which is 29% higher than the stock’s closing price of $135.41 on Friday. Summing up, the analyst wrote that “the basic question is about Alphabet’s ability to harness their deep pool of world-class engineers and their long-term embrace [of] machine learning to build products thatconsumers want to use.” He concluded: “Judging by past accomplishments, despite current headlines, that seems like a bet that investors should be willing to make akin to buying Meta in the 4th quarter of 2022.” Here’s a summary of ratings and price targets for the Magnificent Seven among analysts polled by FactSet: Company Ticker Share buy ratings Share neutral ratings Share sell ratings March 8 price Consensus price target Implied 12-month upside potential Microsoft Corp. MSFT 95% 5% 0% $406.22 $469.97 16% Apple Inc. AAPL 58% 30% 12% $170.73 $199.86 17% Nvidia Corp. NVDA 92% 8% 0% $875.28 $897.21 3% Amazon.com Inc. AMZN 95% 5% 0% $175.35 $208.22 19% Alphabet Inc. Class A GOOGL 80% 20% 0% $135.41 $164.60 22% Meta Platforms Inc. Class A META 84% 11% 5% $505.95 $515.97 2% Tesla Inc. TSLA 36% 48% 16% $175.34 $211.45 21% Source: FactSet Among analysts polled by FactSet, 80% rate Alphabet a buy or the equivalent, and its 12-month upside potential implied by the consensus price target is the highest among the Magnificent Seven. As always, if you are considering an individual company for investment, you should do your own research and form your own opinion about that company’s likelihood of remaining competitive over the next decade at least. One way to begin that process is to click on the tickers. Click here for Tomi Kilgore’s detailed guide to the wealth of information available for free on the MarketWatch quote page. Don’t miss: Beyond Nvidia, these companies are making money from AI Alphabet is the bargain stock among the ‘Magnificent Seven’ We rent our $750,000 home with a 2.5% mortgage rate for $4,000 a month, but the tenant is leaving. Should we sell now or later? ‘They’re threatening to go to a lawyer’: My in-laws gave us $300,000 and are on the deed to our home. Now they insist we give our niece $125,000. Coinbase’s bear camp shrinks further as analyst says stock’s rally could continue Here’s how Apple could uniquely leverage AI — and send its sagging stock higher Related Quotes "
}