{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.businessinsider.in/tech/news/googles-gemini-firestorm-shows-the-risks-of-the-companys-race-to-catch-up-with-its-ai-rivals/articleshow/108267216.cms",
    "text": "Liked the article? Share it with your friends... or copy link Google hasn't managed to put out its Gemini fire quite yet. The company has been defending itself against fierce backlash sparked by its AI chatbot's image-generating feature. The feature, which was creating historically inaccurate images of people of color, was later paused by the company and senior execs apologized for the incident. The product has landed Google at the center of what was described in some circles as a \"woke\" culture war. Critics have seized on the controversial model as evidence that Google's products are being overly influenced by its left-leaning employees. Senior exec's apology efforts appear to have done little to little to calm the critics, many of whom have questioned how the product managed to ship with such glaring issues. Google's place amid an escalating AI arms race with fellow Big Tech companies could have sparked the internal urgency, Andrés Gvirtz, a lecturer at King's Business School, told Business Insider. \"We see a general trend, where companies are rushing towards incorporating and building AI solutions,\" he said, adding that this pressure to bring products to market could lead to corners being cut. \"Engineers I am talking with are well aware that this gold rush to integrate AI into existing software stacks is fraught with new legal and commercial risks, but have limited agency on deciding when a new feature gets shipped,\" he said. One of the company's cofounders, Sergey Brin, addressed the complaints on Saturday, claiming the model's left-leaning bias was not the company's intention and that execs were working to fix the issues. CEO Sundar Pichai also apologized for the incident and promised \"structural changes\" in a memo to employees, although there are rumblings that some would rather he step aside. Brin said the strange images were likely down to a lack of thorough testing, something The Verge's Alex Heath blamed on employees feeling rushed to ship the product. Heath pointed to the photo generation used in the Gemini app, which was powered by an older text-to-image model and included in Gemini to get the feature out faster, as an example of Google's haste. The Verge also reported that there was a lack of alignment between the research team building the underlying models and the team putting them into products. Pichai claimed late last year Google was entering its \"Gemini era.\" The model is widely seen as the company's answer to OpenAI's GPT-4, a product heavily backed by Microsoft and already powering many of the company's AI products. Google has been keen not to appear to be falling behind its old rival, following Microsoft with similar product launches, including AI-powered search and workplace assistants. Gemini's image generation slip-up is not the first time Google has been publicly embarrassed by its AI. Last year, Google's Bard, an AI-powered chatbot widely seen as the company's response to ChatGPT, made an error during its first live demo. The mistake inadvertently highlighted the danger of replacing search engines with chatbots and sent Google parent Alphabet's shares tumbling. Microsoft and OpenAI's tech has also had similar slip-ups. A few days after Bard's blunder, Microsoft's AI-powered Bing started delivering \"unhinged responses\" to users, including confessions of love and angry arguments. But Google has tried hard to position itself as the responsible guardian of AI. In an op-ed in the Financial Times last year, Pichai said the \"race to build AI responsibly\" mattered even more than the need to ship user products. For Google, the main problem with the Gemini controversy is its brand perception, Gvirtz said. \"Most people perceived Google as \"neutral\" before and never really asked themselves what their search engine provider stands for,\" he said. Sandra Wachter, a professor at Oxford Internet Institute, told Business Insider: \"I think it is important to move away from the 'move fast and break things' mantra and focus on 'move at a responsible speed and fix things.' Tech should be used to solve a problem, and not just a way of beating others to the market.\"Companies do not exist in a vacuum and their actions have consequences for individuals and society, Wachter said. \"The world is not a sandbox or a big field experiment, and so we have to be careful what products are opened up for the market and when,\" she added. Representatives for Google did not immediately respond to a request for comment from BI. Advertisement "
}