{
    "title": "Why Alphabet Stock Popped Again Today",
    "date": "3/22/2024",
    "url": "https://finance.yahoo.com/news/why-alphabet-stock-popped-again-165744407.html?prefer_reader_view=1&prefer_safari=1",
    "text": "Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) stock, which started this week on a high note -- rising 4.6% Monday on news Apple (NASDAQ: AAPL) may license Google's Gemini for use on the iPhone -- is looking as if it may end the week on a similarly high note, up 2.1% through 11:55 a.m. ET. On Friday, investment banker Wedbush announced it's raising its price target on Alphabet stock to $175 a share, up from $160. The banker also said it's putting Alphabet stock on its \"best ideas list\" of stocks most likely to reward investors over the next 12 months, as StreetInsider.com reports today. Considering how the week began, you'll be unsurprised to learn that artificial intelligence is key to Wedbush's buy thesis. \"Alphabet ... has an unmatched breadth of data to develop and train AI models across text, images, and video, [and] a massive user base spanning Google Search, YouTube, Android, and other Google applications,\" argues Wedbush. And given these advantages going into AI battle, Wedbush simply believes that investor worries about Google coming late to the game are \"overstated.\" Simply put, Alphabet will find a way to catch up to ChatGPT and other rivals -- an argument Apple's endorsement would appear to agree with. Beyond the AI argument, though, Wedbush reminds investors that Alphabet continues to dominate in what has always been its core business -- digital advertising. As Statista data confirm, Alphabet's Google remains No. 1 in this market with a 24.6% share in the U.S. and an even more dominant share of the mobile internet search activity that supports Google's ads market -- 95%. For all the hype around AI lately, it remains an open question whether companies will find AI tools valuable enough to pay for. But even if the AI bull argument falls apart, Alphabet still has a healthy core business to fall back on. With dominant market share and a stock valued at only 25 times earnings -- 12% cheaper than the S&P 500 index, by the way -- Alphabet stock looks like a buy to me. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of March 21, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Rich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Apple. The Motley Fool has a disclosure policy. Why Alphabet Stock Popped Again Today was originally published by The Motley Fool Related Quotes "
}