{
    "title": null,
    "date": "3/1/2024",
    "url": "https://seekingalpha.com/article/4675296-google-alphabet-stock-in-our-too-hard-pile-but-does-get-attention",
    "text": "Michael M. Santiago Michael M. Santiago The following segment was excerpted from this fund letter. Google, just like the other Magnificents, produced a terrific 24.5% 10-year return through 2021. 21.1% annual sales growth accounted for the majority of the return while multiple expansion from 21. Ix to 28.8x chipped in 3.2% per year.  As a growing tech firm, executives were (and are) paid with large option and RSU grants. Google's share count rose modestly, costing investors 0.2% of return per year. By 2019 the company was buying shares back on a net basis and retired 5.9% of shares from 2021 to 2023, adding 3.1 % to total return per year for those two years. Google's growth in dollar sales is now advancing at less than half of its prior rate. Despite growing by 9.2% a year and benefitting from fewer shares outstanding, growth in annual sales per share of 12.6% from 2021 to 2023 was insufficient to prevent a loss in the stock. It's never a good thing when margins and multiples both compress. With no dividends paid, Google's annual return since 2021 was -1.8%. If the company can maintain or grow its 24.8% net profit margin, then a case can be made that the current 22.8x multiple (closer to 20x net of net cash) may allow for a decent prospective return. You are paying three quarters of Apple's (AAPL) multiple with more sales growth. The balance sheet shines with $80 billion net cash. Over the last three years management repurchased roughly $60 billion a year of its shares, about 60% of cash from operations and almost all of net income. Like Microsoft (MSFT) and Amazon (AMZN), Google is investing big bucks in cloud capital. Throw in the occasional home run like YouTube and the stock may wind up being the most magnificent of the group prospectively. Earnings may be pushing $150 billion by 2028 or 2029. The stock climbed 58.3% in 2023. I find it very difficult to have clarity on the regulatory and competitive landscape for Google and several of the businesses under discussion. At a mid-teens multiple net of cash a year ago, believe me, we were tempted. The price doesn't strike us as ridiculous today. Google remains in the \"Too-Hard Pile\" but does get attention around here. Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}