{
    "title": "Alphabet (GOOGL) to Add Privacy Control Feature in ChromeOS",
    "date": "3/26/2024",
    "url": "https://www.tradingview.com/news/zacks:8408f2aae094b:0-alphabet-googl-to-add-privacy-control-feature-in-chromeos/",
    "text": "Alphabet’s GOOGL Google is leaving no stone unturned to enhance its Chromebook offerings on the back of advanced ChromeOS features. Notably, the company is set to introduce a “Privacy control” feature in ChromeOS, enabling users’ discretion while allowing access to their geolocation by Android apps, web browsers and system services. The privacy feature will also enable application-level permissions on cameras and microphones for web and Android apps. Additionally, ChromeOS will offer secure local data recovery for enterprise customers, requiring users to access their account and device to restore lost passwords, with unauthorized access detected immediately. Alphabet is expected to gain solid traction among Chromebook users on the back of the latest move. Alphabet Inc. Price and Consensus Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Growing Chromebook Efforts In addition to the latest privacy feature, Google is set to launch ‘App Mall’ to help users discover their favorite apps or games on their Chromebook or ChromeOS tablet. The App Mall will enable users to find and install new Android apps from the Google Play Store and games through Steam and Linux development environments like Android Studio. Further, the company is set to enhance ChromeOS' quality-of-life features, including launcher updates, profile picture hiding, new settings icon, Diagnostics app cards and app installation from the Play Store, similar to Android and iOS. Strengthening Chromebook offerings are likely to aid Alphabet in capitalizing on growth opportunities present in the laptop and tablet markets. Per an EMR report, the global laptop market is expected to witness a CAGR of 4.7% between 2024 and 2032. An MMR report indicates the global tablet market size to reach $53.78 billion by 2029, exhibiting a CAGR of 3.4% during the forecast period of 2023-2029. Moreover, these Chromebook advancements will, in turn, aid Alphabet to strengthen its Google Services segment, which has been the key growth driver of the company. Its shares have rallied 45.9% in the past year compared with the Zacks Computer & Technology sector’s growth of 44.6%. The strengthening Google Services segment is expected to aid its overall financial performance in the near term. The Zacks Consensus Estimate for 2024 total revenues stands at $290.4 billion, indicating year-over-year growth of 13.2%. Intensifying Competition Alphabet's growing Chromebook updates are expected to strengthen its competitive edge against rivals like Apple AAPL and Microsoft MSFT, which are also making concerted efforts to enhance their notebook and laptop offerings. Apple’s macOS Sonoma update for compatible Macs remains noteworthy. This free software update features several improvements over its predecessor, Venture, bringing new features like desktop widgets, screen savers, video conferencing, Safari and optimized gaming, enhancing the Mac experience. The company recently unveiled the new MacBook Air with an M3 chip, offering up to 60% faster performance than the M1 model and 13x faster than the fastest Intel-based model. The 13- and 15-inch models feature a thin, lightweight design, 18-hour battery life, a Liquid Retina display and support for up to two external displays and 2x faster Wi-Fi. Meanwhile, Microsoft introduced the Surface Pro 10 for Business and the Surface Laptop 6 for Business, both featuring enhanced specs and generative AI features. These devices offer improved natural language processing for business users. Zacks Rank & A Stock to Consider Currently, Alphabet carries a Zacks Rank #3 (Hold). A better-ranked stock in the broader technology sector is Badger Meter BMI, carrying a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Shares of Badger Meter have gained 35.5% in the past year. The long-term earnings growth rate for BMI is 12.27%. Zacks Investment Research Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}