{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.insidermonkey.com/blog/top-5-stocks-in-george-soros-stock-portfolio-1265729/3",
    "text": "Alphabet Inc. (NASDAQ:GOOGL) is a conglomerate holding company that invests in and runs different companies, including Google, Waymo, X Development, and others. On February 23, Redburn Atlantic raised the price target on Alphabet Inc. (NASDAQ:GOOGL)’s stock to $170 from $165 and kept a Buy rating on the shares. Over the last three months, 37 Wall Street analysts covered Alphabet Inc. (NASDAQ:GOOGL), and 29 kept a Buy rating on the stock. The average price target of $164.59 represented an upside of 20.68% as of the February 28 market close. In the fourth quarter, 214 hedge funds held a stake in Alphabet Inc. (NASDAQ:GOOGL)’s stock at a combined stake value of $28.79 billion. Fisher Asset Management was the top investor and owned 45.22 million company shares worth $6.3 billion, representing 3.11% of the firm’s portfolio. Follow Alphabet Inc. (NASDAQ:GOOG) Follow Alphabet Inc. (NASDAQ:GOOG)              or     Subscribe with Google      We may use your email to send marketing emails about our services. Click here to read our privacy policy. NYSE:NVONYSE:AERNASDAQ:SPLKNASDAQ:LBRDANASDAQ:GOOGLSplunk Inc (NASDAQ:SPLK)Novo Nordisk A S (NYSE:NVO)Alphabet Inc. (NASDAQ:GOOGL)AerCap Holdings N.V. (NYSE:AER)Liberty Broadband Corporation (NASDAQ:LBRDA)Top 5 Stocks in George Soros' Stock Portfolio25 Best Free Tech Newsletters to Subscribe to in 202413 Best Environmental Dividend Stocks To Invest In According To AnalystsShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}