{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/bouchey-financial-group-ltd-cuts-stock-position-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Bouchey Financial Group Ltd lessened its stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 1.5% during the 4th quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The fund owned 8,654 shares of the information services provider’s stock after selling 136 shares during the period. Bouchey Financial Group Ltd’s holdings in Alphabet were worth $1,209,000 as of its most recent filing with the Securities and Exchange Commission (SEC). Other institutional investors and hedge funds also recently added to or reduced their stakes in the company. Live Oak Investment Partners purchased a new stake in shares of  Alphabet during the fourth quarter worth about $26,000.  VitalStone Financial LLC boosted its position in  Alphabet by 1,900.0% in the second quarter. VitalStone Financial LLC now owns 280 shares of the information services provider’s stock valued at $34,000 after buying an additional 266 shares during the last quarter.  Sanctuary Wealth Management L.L.C. purchased a new stake in  Alphabet in the fourth quarter valued at approximately $34,000.  Turim 21 Investimentos Ltda. purchased a new stake in  Alphabet in the third quarter valued at approximately $38,000.  Finally, Meritage Group LP boosted its position in  Alphabet by 1,061.5% in the third quarter. Meritage Group LP now owns 302 shares of the information services provider’s stock valued at $40,000 after buying an additional 276 shares during the last quarter. Hedge funds and other institutional investors own  40.03% of the company’s stock. In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the company’s stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The sale was disclosed in a document filed with the SEC, which can be accessed through this link. In other news, CAO Amie Thuener O’toole sold 425 shares of the stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the completion of the transaction, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The transaction was disclosed in a document filed with the SEC, which is accessible through the SEC website. Also, SVP Prabhakar Raghavan sold 16,088 shares of the stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total value of $2,237,840.80. Following the transaction, the senior vice president now owns 52,440 shares of the company’s stock, valued at $7,294,404. The disclosure for this sale can be found here. Insiders sold a total of 263,312 shares of company stock worth $37,268,315 in the last three months. 0.88% of the stock is owned by corporate insiders. NASDAQ GOOGL opened at $150.93 on Friday. The business has a fifty day moving average price of $143.67 and a 200 day moving average price of $138.21. Alphabet Inc. has a one year low of $99.78 and a one year high of $153.78. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. The company has a market cap of $1.88 trillion, a P/E ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating the consensus estimate of $1.60 by $0.04. The company had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same period in the prior year, the business earned $1.05 EPS.  Research analysts anticipate that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. A number of equities research analysts recently commented on GOOGL shares. Mizuho upped their target price on Alphabet from $155.00 to $170.00 and gave the company a “buy” rating in a research report on Wednesday, January 17th. Roth Mkm dropped their target price on Alphabet from $166.00 to $164.00 and set a “buy” rating on the stock in a research report on Wednesday, January 31st. Wells Fargo & Company boosted their price target on Alphabet from $141.00 to $144.00 and gave the company an “equal weight” rating in a report on Monday, March 18th. StockNews.com raised Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Finally, Citigroup boosted their price target on Alphabet from $153.00 to $168.00 and gave the company a “buy” rating in a report on Wednesday, January 31st. Five investment analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have given a strong buy rating to the company. According to data from MarketBeat.com, Alphabet presently has an average rating of “Moderate Buy” and a consensus price target of $155.48. Get Our Latest Stock Analysis on Alphabet (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 1,264 Shares in Kenvue Inc. (NYSE:KVUE) Bought by Planned Solutions Inc. Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by Parisi Gray Wealth Management "
}