{
    "title": "Alphabet Inc. (NASDAQ:GOOG) CEO Sundar Pichai Sells 22,500 Shares",
    "date": "3/20/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-goog-insider-buying-and-selling-2024-03-20/",
    "text": "Alphabet Inc. (NASDAQ:GOOG - Get Free Report) CEO Sundar Pichai sold 22,500 shares of the business's stock in a transaction dated Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the completion of the transaction, the chief executive officer now directly owns 2,310,191 shares in the company, valued at $343,710,216.98. The sale was disclosed in a legal filing with the SEC, which is accessible through this hyperlink. Sundar Pichai also recently made the following trade(s): On Wednesday, March 6th, Sundar Pichai sold 22,500 shares of Alphabet stock. The stock was sold at an average price of $132.70, for a total transaction of $2,985,750.00. On Wednesday, February 21st, Sundar Pichai sold 22,500 shares of Alphabet stock. The stock was sold at an average price of $143.08, for a total transaction of $3,219,300.00. On Wednesday, February 7th, Sundar Pichai sold 22,500 shares of Alphabet stock. The stock was sold at an average price of $146.29, for a total transaction of $3,291,525.00. On Wednesday, January 17th, Sundar Pichai sold 22,500 shares of Alphabet stock. The stock was sold at an average price of $142.14, for a total transaction of $3,198,150.00. On Wednesday, January 3rd, Sundar Pichai sold 22,500 shares of Alphabet stock. The shares were sold at an average price of $140.11, for a total transaction of $3,152,475.00. Alphabet Price Performance Shares of GOOG traded up $1.76 during midday trading on Wednesday, hitting $149.68. 17,667,114 shares of the company traded hands, compared to its average volume of 23,633,152. The stock has a 50-day moving average of $143.91 and a 200-day moving average of $138.80. Alphabet Inc. has a one year low of $100.28 and a one year high of $155.20. The firm has a market cap of $1.86 trillion, a P/E ratio of 25.81, a PEG ratio of 1.37 and a beta of 1.05. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet (NASDAQ:GOOG - Get Free Report) last announced its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, beating the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The firm had revenue of $86.31 billion for the quarter, compared to analysts' expectations of $85.28 billion. During the same period in the prior year, the business posted $1.05 earnings per share. The company's revenue was up 13.5% on a year-over-year basis. As a group, sell-side analysts predict that Alphabet Inc. will post 6.77 EPS for the current fiscal year. Analyst Ratings Changes Several research firms have commented on GOOG. Raymond James upped their price objective on shares of Alphabet from $150.00 to $160.00 and gave the company an \"outperform\" rating in a report on Wednesday, January 24th. Susquehanna upped their price objective on shares of Alphabet from $150.00 to $170.00 and gave the company a \"positive\" rating in a report on Wednesday, January 31st. Five analysts have rated the stock with a buy rating, According to data from MarketBeat, the company presently has a consensus rating of \"Buy\" and an average price target of $146.33. View Our Latest Research Report on GOOGInstitutional Investors Weigh In On Alphabet Several hedge funds and other institutional investors have recently modified their holdings of the stock. Tandem Wealth Advisors LLC bought a new position in shares of Alphabet in the third quarter worth approximately $25,000. HWG Holdings LP bought a new position in shares of Alphabet in the second quarter worth approximately $26,000. Bruce G. Allen Investments LLC bought a new position in shares of Alphabet in the fourth quarter worth approximately $26,000. Partnership Wealth Management LLC bought a new position in Alphabet during the fourth quarter valued at approximately $26,000. Finally, Equitec Proprietary Markets LLC purchased a new position in shares of Alphabet during the fourth quarter worth approximately $28,000. 27.13% of the stock is currently owned by institutional investors. Alphabet Company Profile (Get Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.See AlsoFive stocks we like better than AlphabetHow Investors Can Identify and Successfully Trade Gap-Down StocksIs Ollies Bargain Outlet a Smart Buy-On Post-Release Weakness?What is the Hang Seng index?  Chipotle Stock Shoots Higher, Announcing 50 for 1 Stock Split5 Top Rated Dividend Stocks to ConsiderGeneral Mills Stock Price Reversal Gains Momentum on Good NewsThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Bill Ackman will be blindsided by this event (From Porter & Company) (Ad)Should you invest $1,000 in Alphabet right now?Before you consider Alphabet, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list.While Alphabet currently has a \"Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 10 Best Cheap Stocks to Buy NowMarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}