{
    "title": "Alphabet's (GOOGL) Waymo Offers Ride Services in Los Angeles",
    "date": "3/15/2024",
    "url": "https://finance.yahoo.com/news/alphabets-googl-waymo-offers-ride-142400091.html",
    "text": "Alphabet’s GOOGL self-driving unit Waymo has started offering its ride-hailing service, Waymo One, in Los Angeles, CA, for free.This move comes after the company carried out its Waymo One Tour program in the city successfully, which began in late 2023.Approval from the California Public Utilities Commission, which the company received earlier this month for Waymo One, remains noteworthy.Currently, the service is available for select members, covering around 63 square miles of Los Angeles, from Santa Monica to Downtown. It is also available 24/7.Alphabet intends to make Waymo One a paid service in the coming weeks. It will also expand its operation in Los Angeles gradually.  Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote The latest move bodes well for Alphabet’s growing efforts toward the expansion of its Waymo ride-hailing service across the United States.It is in sync with the company’s deepening focus on California, where Waymo began operating from the streets of San Francisco.Waymo’s expansion to San Francisco, CA, on the back of its Early Rider program called Trusted Tester, remains a major positive. Notably, this marked its first expansion outside Phoenix.Waymo received regulatory approval to expand in the San Francisco Peninsula in addition to Los Angeles.Waymo’s growing footprint in Phoenix, AZ, where it started operating its robotaxi first, remains noteworthy. The expansion of the operating area of Waymo One in the city, which now includes rides to Phoenix Sky Harbor International Airport, is another plus.Waymo’s effort to expand its operations to downtown Phoenix is another positive. It also rolled out a rider-only service in downtown Phoenix.Alphabet’s multi-year partnership with Uber Technologies to offer an autonomous driving experience to the latter’s customers in Phoenix, AZ, is a remarkable deal.Waymo is also testing its self-driving vehicles on the streets of Bellevue, WA, and Austin, TX. Notably, Austin is marked as the fourth autonomous ride-hailing city after San Francisco, Phoenix and Los Angeles.The above-mentioned endeavors will help Alphabet further penetrate the booming autonomous driving space.Per a Precedence Research report, the global autonomous vehicle market is expected to reach $2.35 trillion by 2032, witnessing a CAGR of 35% between 2023 and 2032.We believe that the Zacks Rank #3 (Hold) company’s growing prospects in this promising market will help it win investors’ confidence in the days ahead. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Notably, Alphabet has gained 42.6% in the past year. Waymo’s growing footprint across the United States has taken the autonomous vehicle competition to another level.General Motors GM, which is also leaving no stone unturned to boost the operations of its autonomous driving arm, Cruise, is facing stiff competition from Alphabet.GOOGL gets a competitive edge over General Motors, as Cruise is currently facing scrutiny after an accident in which a Cruise car dragged a pedestrian 20 feet.Expanding Waymo’s efforts will continue to strengthen Alphabet’s competitive position against Amazon AMZN and Baidu BIDU, which are also making every effort to capitalize on the growth prospects in the autonomous driving space.Amazon’s buyout of Zoox, a developer of autonomous ride-hailing vehicles, remains a major positive. The company’s launch of its first self-driving robotaxi strengthened its position in the autonomous driving space.Zoox has been testing its autonomous vehicles in San Francisco, Las Vegas and Foster City. It intends to open an engineering office and operations facility, which will act as a base for its autonomous vehicle testing.It also plans to establish a large-scale manufacturing facility for its autonomous vehicles. The facility will be located at Hayward Exchange @ 92, 25810 Clawiter Rd. The facility is being built to expand Zoox’s presence in the East Bay.Meanwhile, Baidu is gaining from the strong momentum of the Apollo Go Robotaxi service across China on the back of its increasing availability in several cities and a growing number of rides.Apollo Go is available in ten cities, namely Beijing, Shanghai, Guangzhou, Shenzhen, Chongqing, Changsha, Cangzhou, Yangquan, Wuzhen Water Town and Wuhan. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Baidu, Inc. (BIDU) : Free Stock Analysis Report General Motors Company (GM) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}