{
    "title": null,
    "date": "3/25/2024",
    "url": "https://www.axios.com/2024/03/25/eu-dma-competition-investigations-meta-apple-google",
    "text": "European Commission Executive Vice President Margrethe Vestager talks to media about non-compliance investigations against Alphabet, Apple and Meta under the Digital Markets Act (Thierry Monasse/Getty Images) The European Union on Monday announced investigations into Apple, Meta and Google parent Alphabet for potential breaches of the bloc's new Digital Markets Act. Why it matters:  The new law has been in force for two weeks and the EU is signaling a rapid-fire approach to antitrust enforcement, a departure from a global tendency among regulators to mount backward-looking cases that drag on for years. By the numbers: A total of five investigations have been opened into the three companies by the European Commission, the EU's executive arm, with decisions promised within 12 months. Context: The DMA inverts the usual structure of antitrust investigations, particularly in the U.S., where the onus is on regulators to prove a company holds a monopoly and has illegally maintained it. Another innovation in the DMA is that companies found to be in violation of the rules are given time to provide fixes to their products to avoid a fine. By the numbers:  The Commission can issue initial fines up to 10% of a company's annual global revenue, rising to 20% of revenue when there is \"repeated infringement. What they're saying: \"We are not convinced that the solutions by Alphabet, Apple and Meta respect their obligations for a fairer and more open digital space for European citizens and businesses,\" EU Commissioner Thierry Breton said. The other side: \"We're confident our plan complies with the DMA, and we'll continue to constructively engage with the European Commission as they conduct their investigations,\" Apple said in a statement. \"Teams across Apple have created a wide range of new developer capabilities, features, and tools to comply with the regulation.\" "
}