{
    "title": "Google under fire: Is Sundar Pichai stepping down?",
    "date": "3/3/2024",
    "url": "https://www.thedailystar.net/tech-startup/news/google-under-fire-sundar-pichai-stepping-down-3557846",
    "text": "Death of an architecture Green factories: Bangladesh is a global champion India's forex reserves jump to record high Dancing with Sycophancy It seems that Google found itself amidst a storm of challenges and controversies. Google's latest project, the Gemini image generator, aimed to showcase the company's prowess in AI image generation. However, the initiative backfired when it produced historically inaccurate images, leading to a significant dip in the company's stock prices. This incident, deemed \"completely unacceptable\" by Pichai, has not only tarnished Google's reputation but has also intensified claims that the company is lagging in the AI race. This is not the first AI-related blunder Google has faced. Earlier, the company's AI chatbot, Bard, made a glaring error during a public demonstration, affecting Google's stock market performance. Such missteps have fuelled perceptions that Google is hastily playing catch-up, a strategy that insiders argue is hampered by bureaucratic inertia and a reluctance to risk its dominant search business. The calls for a change at the helm are growing louder, the Business Insider. Analyst Ben Thompson, in his widely-read 'Stratechery' newsletter, suggested that a transformative overhaul at Google would necessitate removing current leadership, including Pichai. Similarly, Bernstein analyst Mark Shmulik questioned in a research note whether the current management is equipped to navigate Google through this pivotal era. Since assuming the role of CEO in 2015, and subsequently of Alphabet in 2019, Pichai has been lauded for his stewardship during more stable times. Under his leadership, Google's market capitalisation has surged from just over $400 billion in 2015 to around $1.7 trillion. However, critics argue that the company is now mired in stagnation, struggling to maintain its innovative edge amid rapid advancements in AI technology. The debate over Pichai's leadership occurs against the backdrop of significant shifts in the tech landscape. Google's AI endeavours are pivotal as the company confronts the dual challenges of maintaining its search engine dominance and pioneering new technological frontiers. Analysts like Shmulik remain cautiously optimistic about Google Search's resilience, even as Gartner predicts a potential 25% decline in traditional search traffic by 2026 due to AI-driven alternatives. Marissa Mayer, a Google veteran, echoed the sentiment on X (formerly Twitter) that the company must embrace a more innovative and challenger-minded approach to retain its competitive edge. The discourse around Google's leadership and strategic direction reflects broader industry uncertainties as companies navigate the complex and rapidly evolving AI domain. As Google grapples with these challenges, the question of whether Sundar Pichai will remain at the helm is more than a matter of corporate intrigue; it reflects the broader dilemmas facing tech giants at the intersection of innovation, leadership, and ethical responsibility. রোববার আইনশৃঙ্খলা সংক্রান্ত মন্ত্রিসভা কমিটির বৈঠকে এ সিদ্ধান্ত নেওয়া হয়। "
}