{
    "title": "Top Analyst Reports for Alphabet, McDonald's & RTX",
    "date": "3/14/2024",
    "url": "https://finance.yahoo.com/news/top-analyst-reports-alphabet-mcdonalds-160100945.html",
    "text": "Thursday, March 14, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Alphabet Inc. (GOOGL), McDonald's Corporation (MCD) and RTX Corporation (RTX). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Shares of Alphabet have gained +51.2% over the past year, in-line with the Zacks Tech sector’s gain of +51.5%, but significantly better than the S&P 500 index's +31.9% gain. The company’s robust cloud division is aiding substantial revenue growth. Expanding data centers will continue to bolster its presence in the cloud space. Further, major updates in its search segment are enhancing the search results.Moreover, Google’s mobile search is gaining solid momentum. Additionally, strong focus on bolstering generative AI capabilities should aid business growth in the near term. Alphabet’s deepening focus on wearables category remains a tailwind.Alphabet’s strong efforts to gain foothold in the healthcare industry are other positives. Also, its expanding presence in the autonomous driving space is contributing well. However, sluggish Network advertisement business is a negative. Increasing litigation issues and expenses remain concerns.(You can read the full research report on Alphabet here >>>)McDonald's shares have gained +8.6% over the past year against the Zacks Retail - Restaurants industry’s gain of +11.6%. The company is likely to benefit from strong comps performance, marketing campaigns and a loyalty program. During fourth-quarter 2023, McDonald's U.K. solidified its position as a go-to destination for quality food at exceptional value, thus, boosting customer loyalty.McDonald's is also increasing its focus on menu innovation, as it believes that the strengthening of the core menu and solid marketing are likely to pave the way for additional growth in the upcoming periods. Also, the focus on Accelerating the Arches strategy bodes well.Earnings estimates for 2024 have increased in the past 30 days, depicting analysts’ optimism about the stock’s growth potential. Yet, macroeconomic challenges and commodity and wage inflation are primary headwinds.(You can read the full research report on McDonald’s here >>>)Shares of RTX have outperformed the Zacks Aerospace - Defense industry over the past six months (+21.1% vs. +12.2%). The company continues to receive ample orders from the Pentagon and its foreign allies for its wide range of combat-proven defense products.A steadily recovering commercial air traffic, both domestic and international, is expected to bolster commercial OEM as well as commercial aftermarket sales for the company. RTX holds a solid financial position which should enable it to make successful share repurchase.However, the appreciating U.S. dollar has been burdening airlines, which may hurt the stock. Also, as rising crude price tends to put cost pressure on airlines, operating results of commercial OEM producers like RTX may be impacted. The company might also be affected if China enforces its announced sanctions against RTX’s missile and defense unit.(You can read the full research report on RTX here >>>)Other noteworthy reports we are featuring today include The Progressive Corporation (PGR), Southern Copper Corporation (SCCO) and Phillips 66 (PSX).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>> Today's Must Read Alphabet (GOOGL) Benefits From Cloud & Search Initiatives Solid Comps Growth Aids McDonald's (MCD), High Costs Hurt Order Growth Continues to Aid RTX, Amid Jet Fuel Price Hike Featured Reports Progressive's (PGR) Solid Policies in Force Aid, Cat Loss AilPer the Zacks analyst, Progressive is set to grow on, solid policies in force, competitive rates and leadership position. However, cat loss exposure inducing underwriting volatility ails. Expansion Actions to Drive Southern Copper (SCCO), Costs AilThe Zacks analyst believes Southern Copper is poised well to gain from its industry-leading copper reserves and expansion actions. However, higher labor costs will hurt margins. Phillips 66 (PSX) to Gain From Higher Distillate Fuel DemandPhillips 66 is well-poised to benefit from higher distillate fuel demand amid changes in the marine fuel sulfur limits. Yet, its rising costs of producing refined products concerns the Zacks analyst. Strong Demand & Acquisitions Aid Fortive's (FTV) PerformancePer the Zacks analyst, strong demand trends and acquisitions is driving Fortive's performance. Softness in Precision Technologies' segment coupled with leveraged balance sheet is concerning. Strong Demand for Key Drugs Drive BioMarin's (BMRN) ToplineWhile BioMarin's (BMRN) key drugs like Vimzim and Naglazyme have been driving sales, the Zacks Analyst is encouraged by rapid uptake for new drug, Voxzogo which has opened up a new sales opportunity. Robust Marketplace Activities & Services Benefit Etsy (ETSY)Per the Zacks analyst, Etsy is benefitting from accelerating marketplace and service revenues, driven by solid momentum across buyers and sellers. Global Clients Aid FTI Consulting (FCN) Despite High CostsPer the Zacks analyst, FTI Consulting's strong international operations make it an excellent partner for global clients, generating continued revenue growth. Rising investment costs are concerning. New Upgrades Iron Mountain (IRM) Gains From Data Center & Storage DemandPer the Zacks analyst, strong cash flows from the storage and records management businesses, data-center business expansion and healthy balance sheet are likely to support Iron Mountain's performance. DaVita (DVA) Rides on its Patient-Centric Business ModelThe Zacks analyst is upbeat about DaVita's patient-centric care model that leverages its platform of kidney care services and steady expansion in the international markets. Infrastructure Investments, Clean Assets Aid NiSource (NI)Per the Zacks analyst, NiSource' investment of around $16 billion through 2028, will strengthen its infrastructure, and adding more clean assets in generation portfolio will drive its performance. New Downgrades High Input Costs & Supply-Chain Issues to Hurt Lindsay (LNN)The Zacks analyst is concerned that higher input costs, labor shortage, increased transportation costs and supply-chain headwinds will hurt Lindsay's results in the near term. Hanesbrands (HBI) Remains Troubled by Soft Activewear UnitPer the Zacks analyst, Hanesbrands is hurt by soft Activewear unit. In Q4, Activewear sales fell 24.1% on tough apparel market dynamics, including soft consumer demand and cautious retailer orders. Reduced Visitation & Weather Woes Hurt Vail Resorts (MTN)Per the Zacks analyst, Vail Resorts's is likely to be hurt by reduced visitation levels and weather-related operational disruptions. Also, interest rate fluctuations pose concern. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report McDonald's Corporation (MCD) : Free Stock Analysis Report The Progressive Corporation (PGR) : Free Stock Analysis Report Southern Copper Corporation (SCCO) : Free Stock Analysis Report Phillips 66 (PSX) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report RTX Corporation (RTX) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}