{
    "title": "Waterway Wealth Management LLC Invests $306000 in Alphabet Inc. \n(NASDAQ:GOOGL)",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/waterway-wealth-management-llc-invests-306000-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 Waterway Wealth Management LLC purchased a new position in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) in the 4th quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission (SEC). The fund purchased 2,190 shares of the information services provider’s stock, valued at approximately $306,000. Several other hedge funds have also recently modified their holdings of the business. Vanguard Group Inc. grew its holdings in shares of  Alphabet by 1,919.4% in the third quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock worth $45,628,484,000 after acquiring an additional 453,413,389 shares during the period.  State Street Corp grew its holdings in shares of  Alphabet by 1,900.6% in the third quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock worth $20,770,809,000 after acquiring an additional 206,300,042 shares during the period.  Moneta Group Investment Advisors LLC grew its holdings in shares of  Alphabet by 111,197.8% in the fourth quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock worth $15,036,178,000 after acquiring an additional 170,267,122 shares during the period.  Price T Rowe Associates Inc. MD grew its holdings in shares of  Alphabet by 1,759.2% in the third quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock worth $11,106,502,000 after acquiring an additional 109,870,525 shares during the period.  Finally, Norges Bank bought a new stake in shares of  Alphabet in the fourth quarter worth $8,335,063,000. Hedge funds and other institutional investors own  40.03% of the company’s stock. In other news, Director John L. Hennessy sold 200 shares of the stock in a transaction that occurred on Wednesday, January 10th. The stock was sold at an average price of $143.49, for a total value of $28,698.00. Following the sale, the director now directly owns 6,784 shares in the company, valued at $973,436.16. The sale was disclosed in a document filed with the SEC, which is available at this link. In related news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction that occurred on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total value of $3,347,550.00. Following the transaction, the chief executive officer now owns 2,310,191 shares of the company’s stock, valued at $343,710,216.98. The sale was disclosed in a legal filing with the SEC, which can be accessed through the SEC website. Also, Director John L. Hennessy sold 200 shares of the stock in a transaction that occurred on Wednesday, January 10th. The stock was sold at an average price of $143.49, for a total value of $28,698.00. Following the completion of the transaction, the director now directly owns 6,784 shares in the company, valued at approximately $973,436.16. The disclosure for this sale can be found here. Insiders have sold a total of 251,138 shares of company stock worth $35,427,655 over the last ninety days. Company insiders own  0.88% of the company’s stock. Several analysts recently commented on the company. Roth Mkm cut their price objective on Alphabet from $166.00 to $164.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. Rosenblatt Securities cut their price target on Alphabet from $174.00 to $172.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. BMO Capital Markets boosted their price target on Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Royal Bank of Canada  reissued an “outperform” rating and set a $155.00 price target on shares of Alphabet in a report on Wednesday, January 31st. Finally, StockNews.com raised Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Five investment analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have assigned  a strong buy rating to the stock. According to data from MarketBeat, the stock presently has an average rating of “Moderate Buy” and a consensus price target of $155.48. View Our Latest Research Report on Alphabet Shares of GOOGL stock opened at $150.93 on Friday. Alphabet Inc. has a 1 year low of $99.78 and a 1 year high of $153.78. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. The stock’s 50 day simple moving average is $143.52 and its two-hundred day simple moving average is $138.12. The company has a market cap of $1.88 trillion, a PE ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. During the same period in the prior year, the business posted $1.05 earnings per share.  Research analysts predict that  Alphabet Inc. will post 6.77 earnings per share for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Highland Capital Management LLC Trims Stake in JPMorgan Chase & Co. (NYSE:JPM) The J. M. Smucker Company (NYSE:SJM) Shares Sold by Kingswood Wealth Advisors LLC "
}