{
    "title": "Google: I Am Bullish Despite The Mess With Gemini (NASDAQ:GOOG)",
    "date": "3/7/2024",
    "url": "https://seekingalpha.com/article/4676632-google-i-am-bullish-despite-the-mess-with-gemini",
    "text": "400tmax  400tmax Google's (NASDAQ:GOOG) (NASDAQ:GOOGL) digital advertising market dominance looks intact even after the recent \"mess\" with its Gemini AI pictures generator. I believe that even despite risks to be disrupted some time in future by generative AI, Google is still firmly positioned to earn superior profits from its almost 40% global digital advertising market share. Moreover, there is an apparent star, Google Cloud, which will highly likely become another major cash cow for the company. The stock is very attractively valued with a 16% upside potential, which makes GOOG a \"Strong Buy\". Google is a digital advertising powerhouse with a global 39% market share in this industry. To understand how strategically monstrous Google is just imagine that the company's market share in the digital advertising is more than twice higher than the second place and is higher than cumulative market share of competitors ranking from second to tenth. Statista Statista An unparalleled market share is ensured by the multi-billion audience of the company's key digital properties: Gmail, the search engine, and YouTube. Google's search engine handles 8.5 billion searches per day and approximately 2 trillion searches per year. According to demandsage.com, 121 billion emails are sent via Gmail daily, and users consume 1 billion hours of videos on YouTube every day. Therefore, Google's products seem to be as vital for the modern world as the internet itself. Considering Google's undisputed dominance in digital advertising, I am not surprised that the company's revenue growth has been almost vertical in recent years. The operating income did not follow revenue growth in recent quarters because the company aggressively invests in research and development (\"R&D\"), which totaled more than $80 billion in FYs 2022-2023. Data by YCharts The company invests heavily in innovation to build new revenue streams apart from digital advertising. Building additional revenue streams is sound strategically to decrease high revenue concentration in a single segment. In FY 2023, advertising revenue contributed 77% to total sales, which is a slight improvement from a 79% share in FY 2022. Google's 10-K Google's 10-K It is apparent that advertising business is Google's cash cow and given its market share compared to competitors I believe that Google's dominance in this industry is intact. Therefore, I will better focus on the potential new future cash cow of the company: Google Cloud, the segment that generated positive operating income for the first time in FY 2023 and a 26% revenue growth. According to the 10-K, Google Cloud's infrastructure and platform services were the largest drivers of growth in the Google Cloud Platform in FY 2023. Google's 10-K Google's 10-K Google is a prominent player in the cloud infrastructure industry but not even close to dominating as the company does in digital advertising. According to Statista, Google Cloud holds third spot in the industry with an 11% market share as of the 2023 year-end. The gap between Google Cloud and Microsoft (MSFT) Azure suggests that it's quite unlikely it will dominate in this industry. On the other hand, its third place also looks intact since the closest U.S.-based player, Salesforce (CRM), is miles behind Google Cloud. Statista Statista Considering Google's solid position in the cloud market among top players and the company's solid brand reputation, I think that its Cloud business will highly likely be able to grow at least in line with the whole industry. Precedence Research expects the cloud infrastructure market to compound with a 12% CAGR between 2023 and 2032, a solid industry tailwind for Google. The fact that Google Cloud became profitable from the operating margin perspective is another bullish sign. Considering Google's stellar profitability in advertising, I think that Cloud is also poised to demonstrate a positive operating margin dynamic as segment revenue grows. Therefore, I consider the Cloud business to be the company's star from the BCG matrix perspective, with the potential to become another cash cow in the long term. Precedence Research Precedence Research Despite a solid 19% revenue growth in 2023, Google subscriptions, platforms, and devices look like a question mark. First, the company does not carve out this revenue stream's profitability in its 10-K, leaving me uncertain about the margin trends in this particular line of business. Second, this revenue stream mostly includes revenue from paid YouTube subscriptions and devices like the Google Pixel smartphone. I think that both these industries, video streaming and smartphones (and other smart consumer devices) are highly competitive with big players focused solely either on video streaming or smart devices. Examples on the surface are Netflix (NFLX) and Walt Disney (DIS) in video streaming, and Apple (AAPL) or Samsung (OTCPK:SSNLF) in smart consumer electronics. Therefore, I am highly doubtful that this line of business can potentially ever become a cash cow for Google. \"Other bets\" are so small relative to the company's scale, and I think that discussing its prospects will be useless at this point due to the extreme level of uncertainty. Overall, I am bullish about Google as the company has a vast cash cow called the Advertising business and the Cloud Business, which can likely become another cash cow for the company. A strong presence with widening profitability in these two growing industries will likely provide shareholders with solid returns in the long run. Google's unparalleled performance across all profitability metrics increases my confidence that its annual $40 billion R&D spending is invested in a very efficient way to create shareholder value. SA SA The digital advertising market is expected to compound with a 9.7% CAGR up to 2032. At the same time, I want to highlight that despite the almost 10% projected CAGR, it looks like Wall Street analysts are much more conservative since a modest 5.5% CAGR is expected according to long-term consensus estimates. Therefore, it is highly likely that the stock is attractively priced at the moment. Allow me to be more precise and perform the discounted cash flow (\"DCF\") analysis to determine the exact fair share price. Future cash flows are discounted with an 8.5% WACC. The revenue estimate for FY 2024 relies on consensus estimates and a flat 9.7% CAGR is incorporated for 2025-2028, which aligns with the digital advertising industry growth projections provided in the previous paragraph. A modest 4% constant growth rate is used for the terminal value (\"TV\") calculation, and a 19.05% TTM levered free cash flow (\"FCF\") margin is expected to expand by 50 basis points every year until 2028. According to Seeking Alpha, 12.43 billion Google shares are outstanding. Calculated by the author Calculated by the author The DCF model suggests that the fair share price is around $156, meaning there is a 16% upside potential. I consider such a discount to be a real bargain for a company like Google, which undisputedly dominates the digital advertising market and will likely remain one of the cloud infrastructure market leaders. According to the screenshot below, Microsoft's Bing has increased its search engine market share, and it looks like it happened at Google's expense. It looks like the shift coincides with Bing's adoption of ChatGPT capabilities last year. Therefore, there is a threat that traditional search engines might be disrupted, and Google's search market share might suffer. On the other hand, the gap in terms of market share is so wide that it is very likely that Google will be able to adapt much faster to a new technological reality than Bing will be able to move closer to Google. But even if Google loses only a couple more percentage points in the nearest future, it might lead to big disappointment for investors in my view. Statista Statista When we speak about breakthroughs in generative AI, I think Google might not be as confident as OpenAI, the industry trendsetter. Recently, Google's co-founder, Sergey Brin, admitted that the company \"definitely messed up\" its Gemini AI picture generator. I also recall last year's awkward attempt to demonstrate that Google is keeping up with ChatGPT by introducing the AI chatbot called Bard. These cases not only hurt Google's reputation as a highly innovative company but also suggest that the company is lagging behind Microsoft (OpenAI's large investor) in the AI revolution. If chatbots disrupt traditional search engines faster than expected, Google might lose the lion's share of its profits unless the company accelerates its improvements in generative AI. Google's $40 billion annual investments in R&D suggest that the company will likely close the technological AI gap, but it should better happen as soon as possible. Despite a threat for Google's core business to be disrupted by the generative AI revolution, I think the company will be able to adapt before it will (if it will) suffer from the decreasing search engine traffic. The company is almost a monopolist in the global digital advertising market and its cloud business is likely to become the second big cash cow in future. A 16% discount for a stock like GOOG is very attractive, and I am inclined to assign a \"Strong Buy\" rating here. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}