{
    "title": "Nvidia, Alphabet, among other US tech stocks rally; S&P 500 technology \nindex gains 0.5% | Mint",
    "date": "3/19/2024",
    "url": "https://www.livemint.com/market/stock-market-news/nvidia-alphabet-among-other-us-tech-stocks-rally-s-p-500-technology-index-gains-05-11710814208219.html",
    "text": "US stock indices ended higher on Monday boosted by a rally in megacap technology and growth stocks ahead of the US Federal Reserve’s interest rate decision later this week. Tech stocks in the US rallied, lifting the Nasdaq 100 nearly 1% and a gauge of the ‘Magnificent Seven’ tech megacaps climbing twice as much. The S&P 500 technology index closed up 0.5%. Also Read: Indian stock market: 7 key things that changed for market overnight - Gift Nifty, US tech stocks rally to oil prices Among tech stocks, Google’s parent Alphabet shares jumped 4.4% as Bloomberg News reported Apple Inc. is in talks to build Google’s Gemini artificial intelligence engine into the iPhone. Apple stock price ended 0.6% higher. The communication services sector ended up almost 3%. Nvidia shares rose 0.7% and closed well below its session high after the chipmaker kicked off its annual developer conference and its Chief Executive Jensen Huang showed off new chips aimed at extending his company’s dominance of AI computing. Also Read: Nvidia launches AI-powered playground for building the future of 6G Tesla shares led S&P 500 percentage gains, ending 6.3% higher after the electric carmaker said it would soon increase the price of its Model Y EVs in parts of Europe. Meta shares gained 2.66% to close at $496.98 apiece. Overall, the Dow Jones Industrial Average gained 75.66 points, or 0.20%, to 38,790.43, while the S&P 500 rose 32.33 points, or 0.63%, to 5,149.42. The Nasdaq Composite ended 130.27 points, or 0.82%, higher at 16,103.45, snapping three straight days of losses. On the Nasdaq, 1,905 stocks rose and 2,400 fell as declining issues outnumbered advancers by about a 1.26-to-1 ratio, Reuters reported. Investors await the US Federal Reserve’s meeting this week for further cues on the timeline of interest rate cuts. (With inputs from Reuters) Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Get the best recommendations on Stocks, Mutual Funds and more based on your Risk profile! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}