{
    "title": "Google Stock: Future Focus On AI Possibilities (NASDAQ:GOOG)",
    "date": "3/23/2024",
    "url": "https://seekingalpha.com/article/4680020-google-future-focus-on-ai-possibilities",
    "text": "pcess609  pcess609 This article was coproduced with Chuck Walston. Following a report by Bloomberg that Apple (AAPL) was considering using Google’s Gemini artificial intelligence engine for the iPhone, shares of Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) jumped nearly 5%. That development underscores the role AI plays in Google’s business. While Alphabet holds more than 90% of the global Internet search market, and Google garnered $238 billion in advertising revenues last year alone, some view AI startups akin to Gemini as posing a threat to the company’s advertising business. That emerging problem, coupled with the company’s lack of revenue diversification, is the basis for the bear’s perspective on Google. So far, the company has weathered the initial stages of this storm, and Google, itself an AI centered company, has several initiatives underfoot to counter rivals. Furthermore, with the lowest forward price-to-earnings among the Magnificent Seven, one must ask if Google presents a prime investment opportunity. Investors are focused on anything and everything related to AI, and Google is in the thick of the fight. Google cast Bard aside to make room for the new AI chatbot, Gemini. Along with the introduction of Gemini, the company launched new mobile versions of the chatbot. Gemini Advanced, billed as Google’s most capable AI model, is now offered as a premium subscription service tied to Google One data-storage plans. For $19.99 a month, Gemini Advanced will provide subscribers with the most advanced version of the Gemini large language model: Ultra 1.0. Some of the tasks Gemini Advanced can handle include writing code, generating images, and creating content. Two terabytes of cloud storage, which can be shared with family members, also are part of the plan. Google also has a Gemini Workspace subscription model. With Business and Gemini Enterprise monthly subscriptions selling for $20 and $30 respectively, Gemini Workspace is designed for commercial clients. Akin to Microsoft’s Copilot 365 office suite software, it will give subscribers access to Gemini in Gmail, Docs, Slides, Sheet, and Meet. The Enterprise subscription also provides captions in over 15 languages to use during meetings. A free, albeit less sophisticated, version will remain available. Here's where we again discuss that prospective deal Apple had with GOOG to install Gemini on iPhones. Last October, Google introduced its latest phone lineup. All in all, the upgrades in the phones weren’t much to crow about. The Pixel 8 and Pixel 8 Pro processors are marginally faster, the cameras are slightly better, and the displays are a touch nicer. For these modest improvements, Google increased the price of both models by $100. Analysts are questioning whether Google’s or Apple’s phones will attract much interest. The consensus is that with little to differentiate the new models from the old, there will be little impetus for consumers to upgrade. This is where Gemini and AI may save the day. Google installed a new Gemini mobile app on Android devices that allows queries via text, voice, or image. And just last week, Bloomberg reported that Apple and Google are weighing a deal to add Gemini AI to the iPhone.  This is a major win for Google to get onto the Apple ecosystem and have access to the golden installed base of Cupertino with clearly a major license fee attached to this. Wedbush analyst team Another AI related development note occurred last October when Google agreed to invest up to $2 billion in the AI startup Anthropic. The deal between the two rivals had GOOG initially provide $500 million to Anthropic with an agreement to pay another $1.5 billion at a later date. Prior to this deal, GOOG invested $550 million in Anthropic. And early this year, Anthropic signed a multiyear deal with Google Cloud for more than $3 billion. Google also has investments in AI startups Runway, and Hugging Face. Lest one believe GOOG is in the process of taking over Anthropic know that Amazon (AMZN) recently invested $4 billion in the company. One more development that deserves attention relates to Google’s advertising growth. During the last earnings call, Philipp Schindler, GOOG’s Senior VP, provided this comment regarding advertising trends for the quarter. We had particular strength in retail in APAC, a trend that began in the second quarter of 2023 and continued through the end of the year. In part, that's because Temu is now one of Google’s five largest advertisers. Temu, an online marketplace operated by PDD holdings (PDD), is the fast-growing Chinese e-commerce platform. Temu is likely losing money on every sale, as it attempts to invest their way into a position in the marketplace. Brian Wieser, analyst I’ve conducted a considerable amount of research on Temu, and I can tell you that Mr. Weiser’s perspective is common among analysts. My point is that any growth in Google’s advertising revenue tied to Temu may be short lived. A recent report by Gartner predicts search engine volumes will fall 25% by 2026, due largely to the use of AI chatbots. The ongoing evolution to AI chatbots is changing how we access information on the Internet, and that could have far reaching consequences for Google’s advertising business. After all, it's a simple matter to change the way you conduct searches. Analysis by Bank of America shows Google has lost a small (79 basis point) share of the search market since ChatGPT came on the scene.  Generative AI (GenAI) solutions are becoming substitute answer engines, replacing user queries that previously may have been executed in traditional search engines. Alan Antin, Gartner analyst GOOG reported Q4 23 results on the 30th of January. Revenue was up 13% from the comparable quarter to $86.3 billion. That number beat analysts’ estimates by $1.04 billion and marked the fourth consecutive quarter in which GOOG reported accelerating sales growth. EPS of $1.64 beat consensus by $0.04. Operating income surged 30% over the comparable quarter to $23.7 billion. Google’s advertising revenues jumped by 11% over Q4 of last year to $65.5 billion. Year over year results had Google Search & Other’s net sales up 12.7% to $48.02 billion, net sales for YouTube Ads hit $9.2 billion, a 15.6% increase, Google Network’s revenue fell 2.1% to $8.3 billion, Google subscriptions, platforms, and devices saw a 22.6% increase to $10.79 billion, and revenue for Google Cloud hit $9.19 billion, up 25.5%. For the full fiscal year, Alphabet’s revenue of $307.4 billion was up 8.7%, and operating profit increased 13% to $84.3 billion. Google’s annual subscription revenue quintupled over the last five years to $15 billion. While AI may present a headwind for Google’s advertising business, it’s a boon for the firm’s cloud offerings. Google Cloud offers generative AI in the field of cybersecurity that now has more than 30,000 companies using the service. And that isn't the only way in which AI is driving cloud growth. The following is from one of last years’ earnings calls:  Our AI-optimized infrastructure is a leading platform for training and serving generative AI models. More than 70% of gen AI unicorns are Google Cloud customers… We provide the widest choice of AI supercomputer options with Google TPUs and advanced NVIDIA GPUs, and recently launched new A3 AI supercomputers powered by Nvidia's H100. Our new generative AI offerings are expanding our total addressable market…with a number of customers growing more than 15x from April to June. Our generative AI capabilities also give us an opportunity to win new customers and upsell into our installed base of 9 million paying Google Workspace customers. ..our AI capabilities are also expanding our partner ecosystem with hundreds of ISVs and SaaS providers…They've collectively committed to train more than 150,000 people on Google Cloud generative AI. A Forbes survey revealed 88% of respondents view AI as the key to successful business process automation. Consequently, 72% said their business will increase investments in AI over the next year by an average of 17%. Google’s cloud offerings and Gemini play into that movement. Furthermore, Alphabet uses AI in Google Photos, Maps, Search (speech recognition), Gmail (Smart Reply), and in Google cloud. Consequently, Google’s ecosystem generates a treasure trove of data across a broad array of products that aids Alphabet in developing its AI in an integrated fashion. In regard to search results, AI can enhance Google’s results, thereby improving the experience. Plus, with the current focus on AI, investors risk dismissing the potential in the company’s moonshot projects. Waymo is one of Google’s moonshots that holds a great deal of promise. Last year, California approved expansion of Waymo’s operations in San Francisco. Waymo was approved to transport customers 24 hours a day, without a human safety driver, and during inclement weather, and at speeds of up to 65 miles per hour. Analysts estimate Waymo’s potential valuation at $105 billion, and Eric Sheridan of UBS estimates Waymo’s taxi service could generate $114 billion in revenue in 2030. Google also stands to benefit from the evolution to digital advertising. Precedence Research forecasts the global digital ad spending market will record a CAGR of 9.22% from 2022 to 2030. And of course, Google’s cloud business has a long, enduring, growth runway. Fortune Business Insights estimates a CAGR for the global cloud computing market of 19.9% through 2029. Alphabet’s debt is rated AA+. GOOG has $111 billion in cash and roughly $11.9 billion in long term debt. Alphabet has a forward P/E of 21.85x, versus the 5-year average P/E for the stock of 26.54x. The 5-year PEG ratio for GOOG is 1.57x, in-line with the stock’s average PEG ratio over the last 5 years of 1.49x. GOOG currently trades for $148.74 per share. The 59 analysts that follow the company have an average 12-month price target of $164.06. It is rated as a strong buy by 32 analysts while 15 have the stock as a buy. Alphabet bought back $61.5 billion in stock in 2023. The company repurchased shares totaling $18.4 billion, $31.1 billion, $50.3 billion, and $59 billion in 2019, 2020, 2021, and 2022, respectively. To place that in perspective, GOOG has a market cap of $1.85 trillion. FAST Graphs FAST Graphs The rather sudden emergence of generative AI chatbots provides real competition for Google’s Gemini. More importantly, it's not unreasonable to assume that AI alternatives to “Google it” could erode Alphabet’s advertising business. At the same time, the Gemini Advanced offerings provide Google with a new revenue source, as well as a means to enhance its current products. Additionally, AI is working to drive demand for some of the company's cloud offerings. Furthermore, the company is at the forefront of AI in many respects, including its investments in startups Anthropic, Runway, and Hugging Face. Also, Google recently revealed Gemini 1.5, its next-generation AI model. Management is moving to increase capital spending markedly in 2024 to invest in GPUs, servers, and other infrastructure for AI purposes. And Alphabet’s Other Bets segment also holds promise, with Waymo in particular providing potential for tens of billions of dollars in future revenue. Finally, and as the title to this article suggests, Google is positioned to capitalize on the potential forced sale of TikTok. While we don't generally bet on M&A as a catalyst to support such a buy thesis, we must acknowledge that Google is best-positioned to add another bolt-on acquisition to its quiver. As my Seeking Alpha friend Brett Ashcroft Green explains, \"If regulators let Google purchase the company, this could be a revenue driver for years to come. This would be an amazing bolt-on for Google and they have the cash to pull this off. While there will be competition, if all it comes down to is who has the most powerful balance sheet and price is not the limiting factor, then Google should win.\" Weighing all these factors, and noting that GOOG trades for a reasonable valuation, I rate the stock as a BUY. FAST GraphsFAST Graphs FAST Graphs FAST Graphs I have a small position in GOOG, and do not intend to increase my investment in the near future. Author's note: Brad Thomas is a Wall Street writer, which means he's not always right with his predictions or recommendations. Since that also applies to his grammar, please excuse any typos you may find. Also, this article is free: written and distributed only to assist in research while providing a forum for second-level thinking. Join iREIT® on Alpha today... for more in-depth research on REITs, mREITs, Preferreds, BDCs, MLPs, ETFs, Builders, and Asset Managers. You'll get more articles throughout the week, and access to our Ratings Tracker with buy/sell recommendations on all the stocks we cover. Plus unlimited access to our multi-year Archive of articles. Here are more of the features available to you. And there's nothing to lose with our FREE 2-week trial. Just click this link.  And this offer includes a FREE copy of my new book, REITs for Dummies! This article was written by Brad Thomas has over 30 years of real estate investing experience and has acquired, developed, or brokered over $1B in commercial real estate transactions. He has been featured in Barron's, Bloomberg, Fox Business, and many other media outlets. He's the author of four books, including the latest, REITs For Dummies. Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}