{
    "title": null,
    "date": "3/21/2024",
    "url": "https://finance.yahoo.com/news/alphabet-inc-ceo-sundar-pichai-063049920.html",
    "text": "Alphabet Inc (NASDAQ:GOOG), the parent company of Google and a multitude of other subsidiaries that span across various sectors including technology, life sciences, investment capital, and research, has reported an insider selling event. The CEO of Alphabet Inc, Sundar Pichai, sold 22,500 shares of the company on March 20, 2024, according to a recent SEC filing.The transaction was executed with the shares priced at $148.78 each, resulting in a total sale amount of $3,347,550. This sale has adjusted Sundar Pichai's total sold shares over the past year to 157,500, with no recorded purchases of Alphabet Inc stock in the same period. The insider transaction history for Alphabet Inc reveals a pattern of insider selling, with 59 insider sells and no insider buys over the past year. This trend may be of interest to current and potential investors as they evaluate the stock's performance and insider confidence.Alphabet Inc's market cap stands at $1,854,615.16 billion as of the date of the insider sale. The company's price-earnings ratio is 25.81, which is above the industry median of 21.595 but below the company's historical median price-earnings ratio. Regarding valuation, Alphabet Inc's stock is currently trading at a price-to-GF-Value ratio of 0.99, with a GF Value of $149.68. This indicates that the stock is Fairly Valued based on GuruFocus's intrinsic value estimate. The GF Value is determined by considering historical trading multiples, a GuruFocus adjustment factor based on past returns and growth, and future business performance estimates from Morningstar analysts.Investors and analysts often monitor insider transactions as they can provide insights into an insider's perspective on the value and prospects of the company. While the reasons behind an insider's decision to sell shares can vary and may not necessarily reflect a negative outlook, the data provided offers a factual basis for market participants to interpret and incorporate into their investment decisions. Warning! GuruFocus has detected 5 Warning Signs with PI. This article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein. This article first appeared on GuruFocus. Related Quotes "
}