{
    "title": "Google Layoffs Hit Fitbit Co-Founders As Cost-Cutting Continues",
    "date": "1/11/2024",
    "url": "https://www.investors.com/news/technology/googl-stock-google-layoffs-hit-fitbit-co-founders-as-cost-cutting-continues/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Google-parent Alphabet (GOOGL) late Wednesday laid off hundreds of workers, as cost-cutting continues at the internet giant, according to reports. The company has not announced when it will report fourth quarter earnings for GOOGL stock. The layoffs impacted both hardware and software units, the reports said. A Google spokesperson told the Wall Street Journal that it's \"responsibly investing in our company's biggest priorities and the significant opportunities ahead.\" The co-founders of Fitbit, James Park and Eric Friedman, will also be leaving Google as part of the reorganization, Google said. Google acquired smartwatch maker Fitbit in January 2022 for $2.1 billion. In December, other reports said Google plans to reorganize its digital advertising business amid stepped up efforts to integrate artificial intelligence into automated platforms. Alphabet cut 12,000 jobs, or about 6% of staff, in its largest-ever layoffs almost a year ago. The company had over 182,000 employees as of Sept. 30, the WSJ report said. As of Thursday afternoon on the stock market today, GOOGL stock was down a fraction to 141.78. Google stock has gained 2.5% in 2024 after jumping 58% last year. Also, Google stock holds an entry point of 139.42 and trades within a 5% buy zone, according to IBD Marketsmith analysis. Follow Reinhardt Krause on X, formerly called Twitter, @reinhardtk_tech for updates on artificial intelligence, cybersecurity and cloud computing. YOU MIGHT ALSO LIKE: Eli Lilly, Crispr, Biogen Lead Pharma And Biotech Stocks To Great Expectations In 2024 IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Learn How To Time The Market With IBD's ETF Market Strategy Get Free IBD Newsletters: Market Prep | Tech Report | How To Invest Two Magnificent 7 Stocks Forge Buy Points In Can't Stop Market Rally 3/29/2024\nBuying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the... 3/29/2024\nBuying a stock is easy, but purchasing the right stock... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}