{
    "title": "Alphabet (GOOGL) Stock Moves -0.13%: What You Should Know",
    "date": "1/16/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-stock-moves-0-224517505.html",
    "text": "Alphabet (GOOGL) closed at $142.47 in the latest trading session, marking a -0.13% move from the prior day. This move was narrower than the S&P 500's daily loss of 0.37%. Elsewhere, the Dow saw a downswing of 0.62%, while the tech-heavy Nasdaq depreciated by 0.19%. Prior to today's trading, shares of the internet search leader had gained 5.04% over the past month. This has outpaced the Computer and Technology sector's gain of 1.22% and the S&P 500's gain of 1.56% in that time. Market participants will be closely following the financial results of Alphabet in its upcoming release. The company is expected to report EPS of $1.62, up 54.29% from the prior-year quarter. Meanwhile, the latest consensus estimate predicts the revenue to be $70.59 billion, indicating a 11.83% increase compared to the same quarter of the previous year. Investors should also pay attention to any latest changes in analyst estimates for Alphabet. Recent revisions tend to reflect the latest near-term business trends. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits. Our research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system. The Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 1.28% upward. Alphabet presently features a Zacks Rank of #3 (Hold). In the context of valuation, Alphabet is at present trading with a Forward P/E ratio of 21.15. This valuation marks a discount compared to its industry's average Forward P/E of 25.42. Also, we should mention that GOOGL has a PEG ratio of 1.27. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. Internet - Services stocks are, on average, holding a PEG ratio of 1.93 based on yesterday's closing prices. The Internet - Services industry is part of the Computer and Technology sector. This industry, currently bearing a Zacks Industry Rank of 77, finds itself in the top 31% echelons of all 250+ industries. The Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Remember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}