{
    "title": "Tech layoffs balloon in January as Wall Street rally lifts Alphabet, Meta, \nMicrosoft to records",
    "date": "1/26/2024",
    "url": "https://www.cnbc.com/2024/01/26/tech-layoffs-jump-in-january-as-alphabet-meta-microsoft-reach-high.html",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article The S&P 500 is trading at a record and the Nasdaq is at its highest in two years. Alphabet shares reached a new pinnacle on Thursday, as did Meta and Microsoft, which ran past $3 trillion in market cap. Don't tell that to the bosses. While Wall Street cheers on Silicon Valley, tech companies are downsizing at an accelerating clip. So far in January, some 23,670 workers have been laid off from 85 tech companies, according to the website Layoffs.fyi. That's the most since March, when almost 38,000 people in the industry were shown the exits. Activity picked up this week with SAP announcing job changes or layoffs for 8,000 employees and Microsoft cutting 1,900 positions in its gaming division. Additionally, high-valued fintech startup Brex laid off 20% of its staff and eBay slashed 1,000 jobs, or 9% of its full-time workforce. Jamie Iannone, eBay's CEO, told employees in a memo that, \"We need to better organize our teams for speed — allowing us to be more nimble, bring like-work together, and help us make decisions more quickly.\" Earlier in the month, Google confirmed that it cut several hundred jobs across the company, and Amazon has eliminated hundreds of positions spanning its Prime Video, MGM Studios, Twitch and Audible divisions. Unity said it's cutting about 25% of its staff, and Discord, which offers a popular messaging service used by gamers, is shedding 17% of its workforce. The swarm of activity comes ahead of a barrage of tech earnings next week, when Alphabet, Amazon, Apple, Meta and Microsoft are all scheduled to report quarterly results. Investors lauded the cost-cutting measures that companies put in place last year in response to rising inflation, interest rates hikes, recession concerns and a brutal market downturn in 2022. Even with an improving economic outlook, the thriftiness continues. Layoffs peaked in January of last year, when 277 technology companies cut almost 90,000 jobs, as the tech industry was forced to reckon with the end of a more than decade-long bull market. Most of the rightsizing efforts took place in the first quarter of 2023, and the number of cuts proceeded to decline each month through September, before ticking up toward the end of the year. One explanation for the January surge as companies budget for the year ahead: They've learned they can do more with less. At Meta, in CEO Mark Zuckerberg's words, 2023 was the \"year of efficiency,\" and the stock jumped almost 200% alongside 20,000 job cuts. Across the industry, artificial intelligence was the rallying cry as new generative AI technologies showed what was possible in automating customer service, booking travel and creating marketing campaigns. The AI hype raised concerns in many corners of the economy about the declining need for human labor as technology gets smarter. But it's having a more immediate impact on the workforce. AI demand is so great that some tech companies are cutting headcount in parts of the business to invest more heavily in developing AI products. \"These companies, in general, are reducing numbers of employees associated with product lines or divisions that have not been successful because they want to reposition themselves for AI,\" said Art Zeile, CEO of DHI group, which owns the tech recruiting platform Dice. Zeile was quick to point out that the cuts we're seeing this January are far below the numbers from a year prior, adding that \"it's not the kind of news that it was earlier.\" Company execs choose different verbiage to convey their downsizing message to employees and investors, but the through line is that they're trying to become more focused. Microsoft Gaming CEO Phil Spencer said his company's layoffs were part of a larger \"execution plan\" that would reduce \"areas of overlap,\" a little more than three months after Microsoft closed its acquisition of Activision Blizzard. SAP said its restructuring is designed to increase \"focus on key strategic growth areas, in particular Business AI.\" Alphabet CEO Sundar Pichai told employees in a memo titled \"2024 priorities and the year ahead\" that, \"we have ambitious goals and will be investing in our big priorities this year,\" and that \"to create the capacity for this investment, we have to make tough choices.\" And at Amazon's Audible unit, CEO Bob Carrigan said \"getting leaner and more efficient\" is the way the company needs to operate for the \"foreseeable future.\" Nigel Vaz, CEO of consulting firm Publicis Sapient, told CNBC that some companies are probably looking at the boon that Meta and Salesforce got after their hefty cost-cutting measures last year. Salesforce cut about 10% of its workforce in January 2023, and the stock ended up nearly doubling for the year, its best performance since 2009. Following Meta's announced cuts, the company's shares had their best year since Facebook debuted on the Nasdaq in 2012. \"I look at Meta and Salesforce as only two examples of companies that needed the impetus,\" Vaz said. \"The minute they got the impetus, then demonstrated what happens when you act with edge on stuff that you probably knew you needed to do.\" The layoffs aren't limited to the tech industry. Embattled bank Citigroup said earlier this month that it was cutting 10% of its workforce. And on Thursday Levi Strauss said it will lay off at least 10% of its global corporate workforce as part of a restructuring. Paramount became the latest media brand to announce cuts, with CEO Bob Bakish saying on Thursday the business needs to \"operate as a leaner company and spend less.\" Within tech, a wide variety of companies, big and small and spanning the consumer and enterprise markets, are eliminating jobs. At the large publicly traded companies, there's an \"intense focus\" on profitability, margins and cost cutting, said Tim Herbert, chief research officer at CompTIA, which tracks trends across the tech sector. But, he added, there's an \"enormous base\" of small and mid-sized tech companies across the U.S., and that in some cases contractors, freelancers and overseas workers are being hit particularly hard. However, Herbert echoed Zeile in noting that there's not enough data to get too panicked about the activity in January. \"There's a lot of nuance to the data, so we always want to be a little bit careful not to read too much into it,\" Herbert said. \"We don't want to ever get too hung up on just one month of data, or even two months of data.\" While investors will get a clearer picture on the near-term outlook for business and consumer spending in tech earnings announcements next week, the latest macroeconomic reports provide some reasons for optimism. The economy grew at a faster-than-expected pace in the fourth quarter, and inflation cooled over that stretch, the Commerce Department reported Thursday. Gross domestic product increased at a 3.3% annualized rate in the quarter, topping the Wall Street consensus estimate for a gain of 2%. Meanwhile, consumer prices rose 2.7% on annual basis in the quarter, down from 5.9% a year ago. Inflation has been easing from its pandemic-era peak in mid-2022. The market has been rallying, as investors see those key numbers leading to the likelihood of Federal Reserve rate cuts in 2024 after the central bank lifted its benchmark rate 11 times in less than two years to fight inflation. Vaz said many corporate leaders are optimistic over \"inflation actually meaningfully starting to come down\" at the same time that \"spending is essentially coming back in so many sectors.\" — CNBC's Michael Bloom, Annie Palmer and Jennifer Elias contributed to this report WATCH: Google layoffs hit Moonshots Factor Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by "
}