{
    "title": "Alphabet (GOOGL) Extends Google Photos Feature to Android",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-extends-google-photos-141600893.html",
    "text": "Alphabet’s GOOGL Google is leaving no stone unturned to enhance its Android offerings, which have been one of the key growth drivers of the company. Alphabet’s shares have gained 54.4% in the past year compared with the Zacks Computer & Technology sector’s growth of 46.6%.In this regard, Google recently announced that the “Photo Stacks” feature of Google Photos is now getting added to Android.The feature automatically groups similar photos within a short time frame, resulting in one image in the main grid. This is indicated by a number and icon in the Photos tab.Further, this grouping feature displays images in a carousel, with options to set top picks, remove photos, or keep some but delete others to clean up the library.Alphabet is expected to gain solid traction across Android users on the back of its latest move. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the Photo Stacks feature, Google introduced a system-wide photo picker in Android 13, allowing apps to import photos without requiring permission to view the user's library, a method adopted by some apps.Alphabet also updated Google Photos capabilities on Android by introducing an AI-powered \"Highlight videos\" feature for Android users, replacing the previous \"Movie\" maker functionality. The new \"plus\" icon opens a \"Create new\" sheet, allowing users to create albums, collages, cinematic photos and animations.The company also added another Google Photos feature in Android 14, which allows developers to create share sheets with app-specific actions, replacing Google Photos' custom implementation with a native one. The \"Sharing image\" sheet slides up, allowing users to select more images and use the Markup tool. All the above-mentioned endeavors will bolster the company’s Android offerings, which, in turn, will strengthen its Google Services segment, which constitutes the majority of the total revenues.Notably, Alphabet revamped its Android bookmarks page for Google Chrome, featuring larger image previews for saved links and folders and displaying blue folders for core bookmarks and available image previews.The company also added new features to its Google Messages app, including a \"plus\" shortcut, offering Android users a redesign, including a left-facing compose field and an emoji shortcut, along with Magic Compose, a new Gallery icon and a plus menu at the right.Alphabet’s growing endeavors to strengthen Google Services offerings are expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, which has risen by 5 cents in the past 30 days. Currently, Alphabet carries a Zacks Rank #3 (Hold).Some better-ranked stocks in the broader technology sector are Arista Networks ANET, Apple AAPL and Itron ITRI, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Arista Networks shares have returned 115.2% over the past year. The long-term earnings growth rate for ANET is pegged at 19.77%.Shares of Apple have returned 37.6% over the past year. The long-term earnings growth rate for AAPL is currently projected at 11.03%.Shares of Itron have gained 22.3% over the past year. The long-term earnings growth rate for ITRI is currently projected at 23%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Itron, Inc. (ITRI) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Arista Networks, Inc. (ANET) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}