{
    "title": "Alphabet Illegally Refused to Negotiate With YouTube Contract Staff, Labor \nBoard Rules",
    "date": "1/4/2024",
    "url": "https://finance.yahoo.com/news/alphabet-illegally-refused-negotiate-youtube-223538805.html",
    "text": "(Bloomberg) -- Alphabet Inc. has illegally refused to negotiate with a group of YouTube Music contract workers who voted to unionize, the US labor board ruled. Most Read from Bloomberg SEC X Account Compromised to Falsely Say Bitcoin ETFs Approved Amazon’s Twitch to Cut 500 Employees, About 35% of Staff US and Allies Met Secretly With Ukraine on Peace Plan BlackRock Cuts 3% of Global Workforce, Citing Dramatic Industry Shifts Xi, Biden and the $10 Trillion Cost of War Over Taiwan The Wednesday decision, issued by a panel of three members of the National Labor Relations Board, tees up a federal court battle over whether the internet company is legally the boss of subcontracted staff it claims are not its employees. The YouTube workers, who voted 41-to-0 last April to join the Alphabet Workers Union, are hired via the staffing agency Cognizant Technology Solutions Corp. Alphabet’s Google, which owns YouTube, has consistently denied being their boss, even after NLRB officials last year deemed it a “joint employer” of the workers – a company with enough control over them to be liable for their treatment and obligated to negotiate with them if they unionize. A Google spokesperson said the company plans to appeal the ruling in federal court. “As we’ve said before, we have no objection to these Cognizant employees electing to form a union,” the spokesperson said in an emailed statement. “We simply believe it’s only appropriate for Cognizant, as their employer, to engage in collective bargaining.” The treatment of contract workers has been a constant point of contention for Alphabet, which relies heavily on staffing firms. Contract staff became the majority of the company’s global workforce in 2018, and the Alphabet Workers Union, an affiliate of the Communications Workers of America, has been pushing to organize both those workers and Alphabet’s direct employees since it launched in 2021. “Any future appeals by Alphabet are just an attempt to avoid collectively bargaining with the union and pad the pockets of shareholders and executives,” YouTube Music worker Katie-Marie Marschner said in an emailed statement from the union. In their ruling Wednesday, a trio of Democratic NLRB members ordered Google to “cease and desist” from refusing to recognize and negotiate with the union, and “in any like or related manner interfering with, restraining, or coercing employees in the exercise of the rights guaranteed” under federal labor law. The Alphabet union filed a complaint with the NLRB early last year accusing Alphabet and Cognizant of responding to the union campaign by making threats, transferring work abroad and using new return-to-office rules to try to derail organizing. Cognizant has said the allegations have “no merit.” That complaint is still pending. Another group of Alphabet contract staff, who are employed via Accenture Plc to work on content for Google’s support pages, voted to unionize with the Alphabet Workers Union in November; Alphabet is appealing an NLRB regional director’s determination that it is a joint employer of those workers as well. (Updates with union comment in seventh paragraph.) Most Read from Bloomberg Businessweek Tropical Underworld: The Murder Case That Could Topple an Alleged Crime Empire Private Equity’s Horrible, No-Good ’23 Set to Continue Into ’24 Is There Any Hope for Hollywood? Elon Musk’s Alleged Drug Use Comes Under a Microscope Can Biden Convince Americans His Brand of Populism Is Better Than Trump’s? ©2024 Bloomberg L.P. Related Quotes "
}