{
    "title": "Alphabet stock tumbles after company misses expectations on Google ad \nrevenue",
    "date": "1/31/2024",
    "url": "https://finance.yahoo.com/news/alphabet-stock-tumbles-after-company-misses-expectations-on-google-ad-revenue-143420493.html",
    "text": "Google parent Alphabet's (GOOG, GOOGL) stock sank after the company reported its fourth quarter earnings after the bell on Tuesday, which missed analysts' expectations on ad revenue, the heart of the tech giant's business. The stock slid more than 5% in early trading Wednesday, part of a broad decline for the tech-heavy Nasdaq (^IXIC). Revenue, excluding traffic acquisition costs for the third quarter, was $72 billion versus expectations of nearly $71 billion. That's higher than the $63.12 billion the company generated during the same period in the prior year. But investors seemed to focus on the advertising miss. The company reported continued growth in its cloud business, which has grown in importance to investors because of its usefulness in the development of artificial intelligence. Google Cloud revenue beat expectations, crossing $9 billion and amounting to a 26% jump from a year ago. The company has been pushing to claim additional market share in the cloud computing market, where it currently sits in third place behind competitors Amazon (AMZN) and Microsoft (MSFT). Here are some of Alphabet’s most significant metrics compared to what Wall Street was expecting in the company’s fiscal fourth quarter, according to data from Bloomberg: Revenue, excluding traffic acquisition costs: $72.32 billion vs. $70.97 billion expected ($63.12 billion in Q4 2022) Adjusted earnings per share: $1.64 vs. $1.59 expected ($1.05 in Q4 2022) Cloud revenue: $9.19 billion vs. $8.95 billion expected ($7.32 billion in Q4 2022) Ad revenue: $65.5 billion vs. $65.8 billion expected ($59.04 billion in Q4 2022) During a call with analysts, both CEO Sundar Pichai and CFO Ruth Porat noted the importance of streamlining the business to achieve cost savings and efficiency. “Across different teams, we have wound down some non-priority projects which will help us invest and operate well in our growth areas,” said Pichai. Porat said the company is focused on removing organizational layers to boost efficiency, which has resulted in a slower pace of hiring. She added that the company will continue to invest in top talent. The earnings report arrives just weeks after Google laid off hundreds of workers across multiple divisions, as the company aims to cut expenses and focus on growth areas, including AI. The tech giant joined several of its peers and others across corporate America that have relied on layoffs to boost efficiency in the wake of significant expansions in the COVID era. Google's executives also responded to concerns that the advancement of AI may disrupt the company's search products since generative AI chatbots change the way people interact with the web. Pichai said that AI tools expand Google's arsenal, which offers a breadth and depth of information to users who crave a diversity of sources online. Google has been widely seen as playing catch-up to Microsoft, which was among the first in the tech world to reap the cultural excitement around consumer AI chatbots. Microsoft invested in OpenAI, the company behind the popular chatbot ChatGPT. Google has embarked on a host of efforts to both augment its search tools with AI (Bard and Search Generative Experience) and to offer new, advanced large language models, like Gemini. Hamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on Twitter @hshaban. Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance Related Quotes "
}