{
    "title": "Alphabet Full Year 2023 Earnings: In Line With Expectations",
    "date": "2/1/2024",
    "url": "https://simplywall.st/stocks/us/media/nasdaq-googl/alphabet/news/alphabet-full-year-2023-earnings-in-line-with-expectations",
    "text": "Stock Analysis All figures shown in the chart above are for the trailing 12 month (TTM) period Revenue was in line with analyst estimates.  Earnings per share (EPS) was also in line with analyst expectations. The primary driver behind last 12 months revenue was the United States segment contributing a total revenue of US$146.3b (48% of total revenue).   The largest operating expense was Research & Development (R&D) costs, amounting to US$45.4b (45% of total expenses).  Explore how GOOGL's revenue and expenses shape its earnings. Looking ahead, revenue is forecast to grow 9.2% p.a. on average during the next 3 years, compared to a 9.7% growth forecast for the Interactive Media and Services industry in the US. Performance of the American Interactive Media and Services industry. The company's shares are down 5.8% from a week ago. While it's very important to consider the profit and loss statement, you can also learn a lot about a company by looking at its balance sheet.  We've done some analysis and you can see our take on Alphabet's balance sheet. Find out whether Alphabet is potentially over or undervalued by checking out our comprehensive analysis, which includes fair value estimates, risks and warnings, dividends, insider transactions and financial health. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. Solid track record with excellent balance sheet. Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. "
}