{
    "title": null,
    "date": "2/18/2024",
    "url": "https://www.fool.com/investing/2024/02/18/3-top-tech-stocks-to-buy-in-february/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The artificial intelligence revolution has technology stocks on fire. And while there are certain comparisons being made to the dot-com bubble of the mid- to late 1990s, remember that that bubble lasted five years before bursting. The debut of ChatGPT was just a little over one year ago, so there could be more room to run. And many AI-related stocks today are actually posting strong bottom-line earnings growth, unlike the profitless pretenders of the dot-com era. Therefore, it's quite possible this tech bull market may have stronger legs beyond 2024. On that note, the following three stocks still seem like quite good buys as they continue to ride the AI wave. There has been some hysteria over the potential threat of artificial intelligence on Alphabet (GOOG 0.21%) (GOOGL 0.04%) and its core Google Search business. On Thursday, Alphabet's stock fell on news that OpenAI was rumored to be working on a search product, according to tech magazine The Information. While there is certainly the potential of a threat, it doesn't appear to justify Alphabet's lagging behind many other Magnificent 7 stocks over the past year -- especially since on the same day Alphabet announced the availability of Gemini 1.5, its newest and most powerful large language model (LLM), which Alphabet believes will be a tough rival to OpenAI's ChatGPT. According to a Google blog, Google's AI unit has managed to increase the number of \"tokens\" Gemini 1.5 uses to over 1 million. According to Google, tokens are, \"entire parts or subsections of words, images, videos, audio or code,\" that make up the building blocks of an AI's processing capabilities. That million tokens is far higher than the mere 32,000 tokens in Gemini 1.0, and the 128,000 for ChatGPT-4 Turbo. Moreover, in a research setting, Google also has run up to 10 million tokens on Gemini 1.5. The larger point is that just because OpenAI was first to market with an AI chatbot doesn't mean it will take the whole market. After all, one year ago, many thought Microsoft (MSFT -0.17%) Bing powered by ChatGPT, would take lots of market share away from Google search. But one year later, Google hasn't really lost any search market share to speak of, according to research firm Statcounter. Meanwhile, Google search is an incredibly well-known brand that most consumers go to first. In fact, \"Google\" has become synonymous with \"search.\" Therefore, as long as Google can keep up competitively with AI technology to a reasonable extent, as it appears to be doing, the search franchise looks pretty safe. Even though KLA Corporation (KLAC 0.24%) is up about 11% this year, the stock has trailed several other AI names. That's strange, as KLA's inspection and metrology tools are used to identify defects in the highly difficult and painstaking semiconductor manufacturing process. And the more complex chips become, the more transistors need to be inspected. That should lead to an increase in equipment intensity and thus more sales for KLA. Yet KLA stock fell initially after its January 25 earnings report, in which it forecast a soft second quarter. However, the short-termism of Wall Street is likely to blame for that, and the stock has retraced all of those losses since. Delving into the conference call with analysts, the soft second quarter was due to a push-out of one large chipmaking project to later in the year. But that revenue will eventually be realized, as the project isn't canceled. Like almost all semicaps, KLA saw its revenue decline in 2023, a result of the severe post-pandemic hangover in PCs and smartphones, as well as the Chinese recession. But if you believe in the current AI-fueled up-cycle, KLA's earnings should grow in 2024 and beyond into 2025. Image source: Getty Images. Another interesting tidbit. KLA has a two-year warranty period for its machines, after which those machines go under KLA's service contracts and begin to bring in recurring-like service revenue, which made up 23% of revenue last year. So as the large amount of equipment sold in 2020 and 2021 come off their warranties, KLA should see an acceleration in service revenue. KLA's services business grew 7% in calendar 2023 despite the downturn, but this all-important segment should reaccelerate to 12% to 14% average annual growth, according to management. While KLA's P/E ratio looks high at 33 today, remember these are bottom-of-the-cycle trailing earnings numbers. With growth likely in 2024 and 2025, it's a buy today. Not unlike KLA, photomask manufacturer Photronics is another undervalued way to play the growth of semiconductors. A photomask is a photographic quartz or glass plate onto which a semiconductor design is printed by lithography equipment. Photronics then takes that pattern and manufactures a master mask through which light passes, which then prints the image onto a semiconductor wafer. Photronics' business is more dependent on the growth of different semiconductor designs, and not really the total number of chips produced. That's why the company has actually been a steady grower over the past half-decade, even though the chip industry has experienced severe ups and downs over that time. In fact, Photronics just wrapped up a year in which it grew 8%. That's in contrast with a most of the semiconductor equipment industry that experienced declines last year. In fact, 2023 was Photronics' sixth straight year of revenue growth, which is somewhat remarkable for this industry. Over that time, the company has compounded revenue at a 12% annualized rate. Even better? Over that time, the company's operating margin exploded from around 8% to roughly 30% currently. That's led to earnings per share increasing seven times over in just six years. Clearly, management has executed for customers, while holding off competition.  PLAB EBIT Margin (TTM) data by YCharts But it doesn't look too late to buy. Photronics trades at just 15.5 times earnings. And with more and more chip companies diversifying into more customized chip designs for more applications, including AI, that increases the number of chip designs coming just about every year. That bodes well for Photronics, which looks like an under-the-radar play on semiconductor growth. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. William Duberstein has positions in Alphabet, KLA, and Microsoft. His clients may own shares of the companies mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}