{
    "title": "Google's AI Mistakes Are A Potential Risk For Shareholders (NASDAQ:GOOG)",
    "date": "2/26/2024",
    "url": "https://seekingalpha.com/article/4673325-why-googles-ai-mistakes-are-a-risk-to-shareholders",
    "text": "Google CEO Sundar Pichai Drew Angerer/Getty Images News Google CEO Sundar Pichai Drew Angerer/Getty Images News Alphabet (NASDAQ:GOOG), the company better known as Google, underperformed its big tech peers on Thursday, rising 1.03% when the NASDAQ-100 rallied 2.96%. Although the stock gained that day, its rise was only one-third of its peer group's rise. The entire tech sector was rallying Thursday on NVIDIA's (NVDA) blowout earnings results; other perceived AI winners like Meta (META) and Microsoft (MSFT) went on large rallies on the strength of NVDA's results. So, Google's performance, while positive, was disappointing on a relative basis. That's an interesting fact because Google has plenty of advantages in AI. AI is widely used in all of the company's products, and Google's generative AI is finally available worldwide in the form of Gemini. True, Google's generative AI launch was slower than that of the competition, but the company had more to lose by launching early: much more of its margin comes from search than does Microsoft's, and LLMs make operating search more expensive. So, there is a real case to be made that Google was right to delay the launch of Gemini. The issue is with everything else about the Gemini launch. In its early innings as \"Google Bard,\" the chatbot caused a short-lived selloff in Google shares thanks to it making a very public mistake. Later, the company turned this minor embarrassment around by doing a public demo that went much better than the first. Google entered a long-term uptrend after that demo. This week, however, things took a turn for the worse. Following the re-brand to Gemini, Google's LLM got publicity for all the wrong reasons, when it was caught giving inaccurate responses to user queries. Among other things, the app when prompted showed historically inaccurate images of people and groups - sometimes these were perceived as offensive. The content produced by the chatbot was politically controversial. Seeking Alpha has a policy against explicit political opinions in articles, so I don't want to go into too much detail, but basically, some were upset that groups and individuals were being misrepresented as something other than what they are. A particularly extreme example can be found in this Verge article. That Google is making apparent AI faux-pas is not an insurmountable challenge. After all, the company has some of the best AI experts in the world: it can improve products that are not working as intended. The bigger issue is the cause of these output errors. Google appears to be playing it so \"safe\" with its AI rollout, that the \"safety\" features are producing results that simply aren't what users intended. If Google can't get this issue under control, then it might cause users to flee to other services - and ChatGPT already has the first mover's advantage. When I last wrote about Google, I called the stock a 'strong buy' on the grounds that it was growing more rapidly than its stock price was appreciating. I still consider the stock a buy, but with much less conviction than I had then. I sold half of my Google shares at $150, which isn't all that much higher than today's prices. In the following paragraphs, I will explain why I am downgrading my GOOG rating in the aftermath of the company's latest AI controversy. Before going any further, I should explain what my buy rating on Google stock means. I opened with several paragraphs critical of Google, and explained that I sold half of my Google stock: why the buy rating? Put simply: I think that Google stock has upside, but not very much. The company's prospects do not in any way imply that it is about to crash, but after a significant rally off the 2022 lows, Google doesn't look like it has all that much further to run. Your principal is likely safe if you invest today, but you probably won't realize a huge return. At least not if the company doesn't improve its approach to AI, the flaws of which I will outline in the next section of this article. Google is one of America's biggest AI companies. It uses AI in Google Search and YouTube. Its Google Brain division was one of the first entities to build a functional large language model (\"LLM\"). It also developed the \"transformer\" method that would later be used in ChatGPT. Put simply, the company had every advantage in the early stages of the AI revolution. So, how'd we get here? A big part of it is simple \"over-conservatism.\" Google has a lot to lose by botching its generative AI rollout because its AI applications run alongside its search engine and other services on the web. Much like with Search, Google does not charge for its generative AI tools - at least not yet. The company has had success with its YouTube Premium service, which this author uses and is a massive fan of. It has not monetized Gemini yet, and with good reason: the obvious track to taking it mainstream - including it in Search - imposes vast costs yet does not have an equally obvious monetization benefit. Microsoft, which has been one of the AI leaders in the last year and a half, still has no plans to charge users for the GPT-powered Bing. Various AI companies operate as SaaS services and can make money by including AI in their subscription plans, using the new AI features as a reason to raise prices. This is less of an option for ad-supported businesses: their customers want clicks and conversions, whether it's shown on an AI app or not. Over a very long period of time, a company putting out great AI content might see an increase in users, but AI in an ad-supported platform isn't the selling point that it is in a user-paid for app. There is some evidence that AI when used in creating ads can boost conversions, but this isn't the kind of thing that apps like Gemini do. Such apps live in the browser, face the end user, and provide content that the user asked for. Microsoft recently started including ads in AI-powered responses on Bing, but it's not clear that it's working all that well: Microsoft's search and news revenue grew just 7% on a constant currency basis in the most recent quarter. So, to circle back to \"over-conservatism,\" a term that Google itself used in describing the flaws with Gemini: Google is trying to be conservative by rolling out its AI services more slowly than others. A poorly implemented AI launch would simply increase server costs without delivering a corresponding benefit, a bigger problem for Google than for Microsoft. So, Google is taking a slow and steady approach. However, this \"cautious\" approach apparently included making its AI output so inoffensive, that it paradoxically started offending people. Google not only launched its AI apps more slowly than the competition, but it also included more guardrails to keep content \"safe.\" This basic idea has been part of Google's product approach for years, but with Gemini, the guardrails were so tight that the app delivered output that was simply inaccurate. That in turn led to Google having to apologize for Gemini's \"embarrassing\" results. This is a very real risk to Google as a business. By emphasizing \"safety\" so much, the company paradoxically produced some of the most wildly inaccurate results any AI app has ever delivered. Such an outcome is anything but \"safe\": if an application doesn't do something that hooks users, it will lose users. Output that is different from what the users sought out, would appear unlikely to hook people. So, the aforementioned trend could be a threat to Google's business if left unchecked. Now, after explaining a risk to Google's business, I should explain why I'm still long - albeit at a much lower weighting than two months ago. First of all, Google Search is still gaining market share from Bing. Google Search revenues grew 12.7% last quarter, while Bing's grew 8% (7% on a constant currency basis). On a traffic basis, Google is also holding steady: Bing's market share peaked at 3.59% in October 2022, it sits at 3.43% today. Second, Google has a vast collection of extremely valuable web applications. YouTube is the world's #1 video sharing service, and is growing its revenue at a relatively high rate. Google Suite is ahead of Microsoft Office 365 in user count. Google Cloud is relatively disappointing, growing less rapidly than Azure last quarter, but still growing faster than AWS. Finally, there is the Google Play Store, which is the second mobile app store by revenue after the Apple app store. Other players in that space are far behind Apple (AAPL) and Google. When a company is first or second in a growing market, it tends to experience high growth. It should come as no surprise then that Google keeps growing: it has an excellent competitive position. All of this has a bearing on Google's valuation. At today's prices, GOOG is among the cheapest of the big tech pack, trading at: 25 times adjusted earnings. 24.84 times GAAP earnings. 5.8 times sales. 6.3 times book value. These multiples certainly aren't dirt cheap, but let's compare them to the same multiples for Meta, Microsoft, Apple and NVIDIA: Meta Microsoft Apple NVIDIA Adjusted P/E 32.6 37 28 60.5 P/E 32.6 37 28 65.8 Price/sales 9.3 13.45 7.5 31.8 Price/book 8 12.8 38 45 Google is the cheapest of these companies, going by all four multiples. Yet when we look at its long-term growth rates, we see that the company has compounded its earnings at 21% and its free cash flow by 16%, with the growth rates having accelerated in the trailing 12-month period. Clearly, this company is not going anywhere. And with the cheapest valuation in all of big tech at the moment, it is relatively cheap. That merits a position in the stock, but when considering the risks it faces, Google is no longer the \"overweight\" it once was for me. It looks like management is playing things so \"safe\" that it's become self-defeating, and in the fast-paced world of AI, \"too safe\" is the last thing you want to be. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG, AAPL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}