{
    "title": "Are These the 2 Best \"Magnificent Seven\" Stocks to Buy Right Now?",
    "date": "2/27/2024",
    "url": "https://www.fool.com/investing/2024/02/27/2-best-magnificent-seven-stocks-buy-right-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More A significant portion of the market's impressive run since the start of 2023 can be attributed to the monumental rise of the \"Magnificent Seven\" stocks. These businesses are industry-leading entities with a focus on innovation and tech-forward thinking. A quick look at these companies reveals that their stock prices might be on the expensive side of things. This makes sense, given how much they've rewarded shareholders in recent times. Prospective investors might be discouraged in thinking they missed the rally. But there are two Magnificent Seven constituents that still appear to be extremely smart buys right now. Let's take a closer look at Alphabet (GOOGL 0.04%) (GOOG 0.21%) and Meta Platforms (META -1.68%). Both of these internet giants touch the lives of billions of people on a daily basis. Alphabet has six products and services that have more than 2 billion users each. And Google Search, for instance, commands a remarkable 91% share of the global search industry. Meta, with its popular social media apps, counts 4 billion monthly active users. That figure was up 6% year over year in the fourth quarter of 2023. When it comes to unrivaled scale and limited competitive threats, I don't know if there are any two businesses on the planet that hold a candle to Alphabet and Meta. While it's true that anyone with some funding and tech prowess can create a new search engine or social media app from scratch, adding users would be an insurmountable task. Both of these companies benefit from powerful network effects and tremendous data advantages that minimize the risk of disruption. I don't think any other characteristics exemplify just how high quality Alphabet and Meta are. The result is that combined, they generate 57% of the world's digital ad revenue in an industry that is set to register sizable growth going forward. And with both enterprises focused on making huge investments in artificial intelligence capabilities, their ability to serve up better-targeted ads will be compelling for marketers. These companies have impressive track records of growing both revenue and income at high rates in the past, which has propelled their share prices. In the last five years, Alphabet's and Meta's operating margins averaged 25.8% and 34.2%, respectively, a clear sign of their outsized profitability. These are financially sound businesses that generate tens of billions of dollars in operating cash flow on a quarterly basis. Combined, they had a net cash position of $145 billion on their balance sheets as of Dec. 31. This favorable situation virtually eliminates any financial risk from their businesses, while providing seemingly unlimited resources to continue investing aggressively in growth opportunities. While Meta just announced a tiny dividend, these companies have generally returned capital to shareholders via stock buybacks. In the past few years, they have done a wonderful job at shrinking their outstanding share counts, which boosts their earnings per share. Even after their gains in the last year, these stocks aren't trading at nosebleed valuations. It's actually the opposite. As of this writing, Alphabet and Meta sell for forward price-to-earnings (P/E) ratios of 21.2 and 24.3, respectively. For comparison's sake, the tech-heavy Nasdaq-100 index trades at a forward P/E multiple of 30.3. And even more noteworthy, based on this metric, these two stocks are cheaper than any of the other Magnificent Seven companies. Based on all of the fantastic qualities, adding these two businesses to your portfolio looks like a no-brainer decision. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Neil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Meta Platforms. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}