{
    "title": null,
    "date": "2/2/2024",
    "url": "https://www.barrons.com/livecoverage/apple-amazon-meta-facebook-earnings-stock-price-today/card/meta-s-new-dividend-could-spur-similar-moves-from-alphabet-and-tesla-GvpKs0uV8LzNaNxvvuvw",
    "text": "LIVE COVERAGE | CONCLUDED Last Updated: Feb. 2, 2024 at 9:35 AM EST 2 months ago By Andrew Bary Meta Platforms surprised Wall Street Thursday by initiating a cash dividend. Meta said it would start paying a 50-cent quarterly dividend, which works out to a yield of less than 0.5% with Meta shares surging 13% to $447 in after-hours trading. The stock move reflects an earnings beat and the favorable reaction to the dividend. Meta’s new dividend could broaden Meta’s institutional ownership to investors who want or need dividends in their holdings. And it’s a sign of confidence by Zuckerberg in Meta’s outlook. The move from Meta could spur Big Tech rival Alphabet, controlled by founders Sergey Brin and Larry Page, to do the same. Alphabet has resisted paying a dividend, preferring to return cash to holders via a large stock repurchase program. Barron’s has argued many times that tech giants like Meta and Alphabet can do both – buy back stock and pay dividends. Meta bought back $20 billion of its stock in 2023, and the dividend will cost it about $5 billion annually. Amazon.com also is a candidate for a dividend given its growing earnings and free cash flow. Tesla could pay one, as well. Tech companies that don’t pay dividends have historically said it’s due to prioritizing spending elsewhere – around areas of growth. For investors, a dividend is increasingly seen as a sign of executive confidence in the business. Apple and Microsoft have long paid dividends (both yield under 1% now). They’ve since become the two largest companies in the world. Meta Platforms Inc. META (U.S.: Nasdaq) Alphabet Inc. Cl A GOOGL (U.S.: Nasdaq) Tesla TSLA (U.S.: Nasdaq) Microsoft Corp. MSFT (U.S.: Nasdaq) Apple Inc. AAPL (U.S.: Nasdaq) Advertisement - Scroll to Continue "
}