{
    "title": "What We Learned From Big Tech's Earnings Reports",
    "date": "2/4/2024",
    "url": "https://www.investopedia.com/what-we-learned-from-big-tech-earnings-enterprise-ai-is-paying-off-8557870",
    "text": "Microsoft, Alphabet, Amazon, Apple, and Meta Offered Key Insights Into Their Plans for AI Josh Edelson /AFP / Getty Images Big tech heavyweights Microsoft (MSFT), Alphabet (GOOGL), Amazon (AMZN), Apple (AAPL), and Meta (META) reported earnings in recent days, highlighting the role of enterprise artificial intelligence (AI) monetization and offering key insights into their AI plans. All five of the companies benefit from enterprise business segments with corporate customers paying for services like cloud and software platforms or devices to use in their workflow. They're also all members of the \"Magnificent 7\" and expected to be the top contributors to S&P 500 earnings for the quarter, according to FactSet projections. Microsoft's earnings beat estimates, propped up by growth in the company's cloud segment, Azure, driven by its \"AI advantage,\" Chief Executive Officer (CEO) Satya Nadella said. The company reported that there are 53,000 Azure AI customers, a third of whom are new to the service in the past year. Microsoft listed a few big names using Microsoft's AI tools, including Ally Financial (ALLY), Walmart (WMT), and Coca-Cola (KO), among others. Microsoft offers Copilot, its AI assistant, and its own AI-optimized chip, the Azure Maia AI Accelerator. The company also said it's working to scale AI initiatives across all its segments. Microsoft has defined itself as a leader in the AI race with its ongoing OpenAI partnership and is a top pick among analysts. Google parent Alphabet reported AI-powered the company's enterprise cloud and workspace customers and ad revenue, which fell short of expectations in the fourth quarter. The company said that Duet AI, which adds AI tools to Google Workspace, and Vertex AI, which enables Generative AI (GenAI) tools for Google Cloud customers using its Gemini chip, helped Google win a multitude of corporate clients including McDonald's (MCD), Verizon (VZ), Moody's, and Victoria's Secret (VSCO). \"Customers are increasingly choosing Duet AI packaged AI agents for Google Workspace and Google Cloud Platform to boost productivity and improve their operations,\" Alphabet CEO Sundar Pichai said. Google said it is using Gemini-powered AI to improve advertising across Search and YouTube for the benefit of retail advertisers. Gemini also powers the company's AI chatbot, Bard, which rivals OpenAI's ChatGPT. Higher costs caught investors' attention in the earnings report as AI is an expensive investment that drove capital expenditures in the fourth quarter. Pichai said that there would be “notably larger” capital spending in 2024, but noted that Alphabet is committed to discipline in its growth investment plans. Amazon reported that GenAI tools in Amazon Web Services (AWS), the company's cloud computing business and its largest profit driver, supported incremental quarterly revenue growth throughout 2023. The company said it was a \"significant year for delivery and customer trial\" for Gen AI services like Bedrock and its Amazon Q coding assistant. The e-commerce giant launched its own AI chips called AWS Inferentia at the end of 2023. Amazon said that several enterprise customers including Anthropic, Airbnb (ABNB), and Snap (SNAP), among others, are using the chips. Amazon's earnings reflected the start of GenAI monetization across the company's enterprise segment, with CEO Andy Jassy saying he expects GenAI to \"drive tens of billions of dollars of revenue over the next several years.\" The company is exploring consumer-facing GenAI tools for retail customers. For instance, Amazon launched a GenAI tool that summarizes customer reviews. Meta is still in the early days of its AI initiatives in comparison to some of its peers and is pushing for openness within the AI space as it develops new models. \"We expect our ambitious long-term AI research and product development efforts will require growing infrastructure investments beyond this year,” Meta CEO Mark Zuckerberg said, adding that the company has \"made a lot of progress on our vision for advancing AI and the metaverse.\" The Facebook parent company offers Llama 2, an open source Large Language Model (LLM) model and Meta said it is training Llama 3. Zuckerberg said on the company's earnings call that Meta intends to integrate future AI tools into its apps including Facebook, WhatsApp, Instagram, and Threads. He added that \"a major goal\" for the company is to provide an AI assistant for businesses, consumers, and developers that could help the company better compete with Microsoft and Google. Meta has been vocal in supporting openness among AI creators, unlike Microsoft and Google, which rely on closed AI models. So far, Apple has kept many of the details of its AI initiatives private, but said it expects to reveal more soon. When asked about the company's AI projects in an earnings call, CEO Tim Cook said that Apple has \"some things that we're incredibly excited about, that we'll be talking about later this year.\" Cook added that \"there's a huge opportunity for Apple with GenAI.\" Earlier this year, Bank of America analysts upgraded their Apple price target saying that the company could gain as AI capabilities are integrated into iPhones. Jefferies. \"AI + Improving Margins = Higher Stock, $465PT.\" Wedbush. “Microsoft Holding Shareholder Meeting that Caps a Trophy Case Year.” Google. \"Innovate faster with enterprise-ready generative AI—enhanced by Gemini.\" Google. \"Introducing Duet AI for Google Workspace.\" Amazon. \"Q4 2023 Amazon.com, Inc. Earnings Conference Call.\" "
}