{
    "title": null,
    "date": "2/20/2024",
    "url": "https://seekingalpha.com/article/4671604-google-why-latest-pullback-presents-a-buying-opportunity",
    "text": "400tmax  400tmax Alphabet Inc. (NASDAQ:GOOG, NASDAQ:GOOGL) aka Google is successfully navigating through the various macro challenges by managing to still grow its revenues at a double-digit rate and finally expanding its foothold in the artificial intelligence (AI) field. While the market was slightly disappointed with the advertising revenues during the most recent quarter, it’s safe to say that the company has everything going for it to improve the situation in the following months and ensure that the overall business continues to grow at an aggressive rate. As such, I think that buying Google’s shares on the recent pullback makes sense right now, especially considering that the company is undervalued against the broader market at the current price. Since the publication of my latest article on Google in October, the company’s shares have underperformed against the broader market but still made a decent ~10% return. Back then, I gave the company’s stock a rating of HOLD, as there were still concerns that the overall business might underperform in the coming months due to the rise of macro risks, while the market offered better buying opportunities at that time. However, after the release of the latest Q4 earnings results a few weeks ago, it seems that Google has everything going for it to continue to grow its revenues at a double-digit rate and scale its business with the help of various AI tools in the foreseeable future. As such, I’m changing the rating back to BUY and think that the stock is a good buying opportunity at the current pullback. There are several reasons why I think that to be the case. First of all, Google managed to end the recent fiscal year on a high note, as its Q4 revenues increased by 13.5% Y/Y to $86.31 billion, while its GAAP EPS during the period was $1.64, above the consensus. What’s more important is that we now have an understanding of how Google can properly monetize various AI tools that it began to implement within its search business, which managed to generate $48.02 billion in revenues in Q4, up 12.7% Y/Y. Just a few weeks ago, the company revealed a new tiered subscription structure for its Gemini chatbot that enhances the experience of users who use the company’s search tools. Considering the latest success of Microsoft’s (MSFT) generative AI chatbot Copilot in recent months, which helped the company achieve outstanding results during the latest quarter, it makes sense to assume that Gemini could make it possible for Google to continue to generate aggressive returns in the following quarters. Another good thing is that the broad implementation of generative AI tools comes at the right time when the digital advertising market is expected to expand while Google’s grip over the search market remains strong. The latest data shows that search ad spending will reach $306.7 billion in 2024, with most spending expected to happen in the United States. Given Google’s dominance over the search market, it’s safe to assume that the company stands to gain the most from such spending and create additional shareholder value along the way. Search Market Share (Statista) Search Market Share (Statista) In addition to the search business, Google also has an opportunity to scale its video and cloud businesses in the following quarters. In Q4 alone, the YouTube business generated $9.2 billion in revenues, up 15.6% Y/Y, as the rise of the content creator model makes it easier for advertisers to find their customers and creates an incentive to allocate more advertising funds into the video medium. Just recently, YouTube announced that over 3 million channels are now part of its Partner Program, while its short-form video product Shorts generates over 70 billion views per day. The upcoming launch of various new AI tools for video creators could scale the amount of content published on YouTube and attract more advertisers at the same time. At the same time, the recent releases of various AI offerings such as AI Hypercomputer and Duet AI for the cloud clients make it possible for Google to scale its cloud operations in the foreseeable future. In Q4 alone, the cloud business generated $9.19 billion in revenues, up 25.5% Y/Y and the company now has close to 90,000 generative AI consultants to assist the clients. Considering that the adoption of AI tools is likely to accelerate in the following months while the cloud market is expected to grow at a CAGR of 16.40% by 2029, it makes sense to believe that Google will be able to continue to aggressively grow its cloud revenues going forward. Given all of those growth catalysts, it’s safe to say that Google has more room for growth if it continues to exceed the estimates in the following quarters. With a forward P/E of ~21x, the company’s stock is trailing behind the market’s current P/E of ~27x, which could indicate that Google is undervalued in comparison to the rest of the pack. What’s more is that there are reasons to believe that the company would be able to grow at a double-digit rate in the following years, which makes the bullish case stronger than before, especially after Google received dozens of upward revisions in recent months. Add to all of this the fact that Seeking Alpha’s Quant system gives the company a rating of Strong Buy, while the street believes that its shares have a ~15% upside at the current price, and it becomes obvious that Google’s growth story is far from over. Google's Consensus Price Target (Seeking Alpha) Google's Consensus Price Target (Seeking Alpha) I believe that the rise of regulatory risks is the only major thing that can undermine Google’s growth story in the following years. In the past, I’ve already explained in great detail what’s at stake for the company if both the DOJ in the United States and the European Commission in the European Union take action to break the company’s near monopoly in the search and other businesses. While it’s a lengthy process that will take years and Google will likely appeal any decision to win additional time as was the case before, the potential loss of competitive advantages along with the need to pay monetary fines might disrupt the business’s operations in the future. Just last month, Google under regulatory pressure eliminated certain data fees within its cloud business. Then earlier this month it was announced that the DOJ antitrust case will go to trial in September. In Europe, the Digital Markets Act will come into full force in a couple of weeks. Under the new rules, Google will be required to meet strict requirements that could affect its business model on the old continent. There is also another issue that Google faces. Considering that the company’s stock has mostly underperformed against its peers like Microsoft (MSFT), Meta Platforms (META), Amazon (AMZN), and Nvidia (NVDA) in the last year, and currently it represents a single-digit upside, it risks depreciating in the future if it fails to meet its guidance, especially since it already trades at 5 times its forward sales. In addition to the regulatory and competition challenges that Google is currently facing, the potential deflation in China along with the rise of growth risks could create a perfect storm of macro issues that could have a direct negative impact on the advertising market. This could potentially result in a lower growth rate for Google, which is more than likely to disappoint the company’s investors. While some risks will continue to haunt Google for years to come and create additional selling pressure on its shares, it’s still safe to say that in the short to near term, the company has enough catalysts to outweigh those risks and create additional shareholder value along the way. Even though the company’s shares have depreciated from their highs in recent weeks, I believe that now might be a good time to start accumulating a position in Google stock. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Bohdan Kucheriavyi is not a financial/investment advisor, broker, or dealer. He's solely sharing personal experience and opinion; therefore, all strategies, tips, suggestions, and recommendations shared are solely for informational purposes. There are risks associated with investing in securities. Investing in stocks, bonds, options, exchange-traded funds, mutual funds, and money market funds involves the risk of loss. Loss of principal is possible. Some high-risk investments may use leverage, which will accentuate gains & losses. Foreign investing involves special risks, including greater volatility and political, economic, and currency risks and differences in accounting methods. A security’s or a firm’s past investment performance is not a guarantee or predictor of future investment performance. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}