{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.fool.com/investing/2024/02/06/why-cheapest-magnificent-seven-stock-screaming-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The \"Magnificent Seven\" is a collection of the world's largest technology stocks, and they led the broader market higher throughout 2023. The group stumbled somewhat in the early stages of 2024; just four of the Magnificent Seven are outperforming the 4% gain of the benchmark S&P 500  index so far:  META data by YCharts However, while Tesla is the biggest loser so far this year, its stock isn't the cheapest based on the traditional price-to-earnings (P/E) ratio valuation metric. That title goes to Google parent Alphabet (GOOGL 0.04%) (GOOG 0.21%), and here's why that represents an incredible long-term buying opportunity. Organizations spent most of 2022 and the early part of 2023 carefully managing their costs as they braced for weaker sales due to high inflation and rising interest rates crimping household budgets. Most of Alphabet's revenue comes from selling advertising spots on platforms like Google Search and YouTube, so the company suffered a slowdown during those periods as businesses trimmed their marketing spending. But the worst of those conditions appears to be in the past. In the fourth quarter of 2023 (ended Dec. 31), Google Search delivered a record-high $48 billion in revenue, which equaled a 12.7% year-over-year increase. It was the fastest pace of growth since mid-2022, right before interest rates shot higher. YouTube's quarterly ad revenue also jumped 15.5% to a record $9.2 billion. Artificial intelligence (AI) is playing an increasingly important role in Google Search, in particular. Alphabet launched two powerful generative AI models called Bard and Gemini in 2023, the latter of which outperforms OpenAI's flagship GPT-4 models in most multimodal benchmarks. In other words, Alphabet can make the case that Gemini is better at understanding, interpreting, and generating text, images, videos, and computer code. Generative AI is now embedded in Google Search. When you enter a query, Google produces a text-based response at the top of the results, which saves you from sifting through webpages to find answers. Alphabet calls this Search Generative Experience (SGE), and the company says Gemini is delivering responses 40% faster than previous models for U.S. users. GSE will help Google maintain its 91.4% global market share in internet search. Microsoft's ChatGPT-powered Bing was first to market with a generative AI search engine, which threatened Google's dominance and left Alphabet playing catch-up. If Google becomes faster, more convenient, and more accurate, it's likely to keep its user base and advertisers happy. Google Cloud is Alphabet's answer to the top two cloud computing platforms, Amazon Web Services (AWS) and Microsoft Azure. It generated a record $9.2 billion in revenue for Alphabet in Q4, equaling 25.7% year-over-year growth -- comfortably outpacing both Google Search and YouTube. Google Cloud is also home to a number of Alphabet's AI initiatives. It has developed its own tensor-core processors (TPUs) and graphics processors (GPUs) for the data center, which were designed to give Google Cloud an edge over competitors that use chips from industry leader Nvidia. Alphabet says this strategy delivers both cost and performance advantages, and it's attracting leading AI developers like Anthropic (a start-up in which Amazon recently invested $4 billion). Vertex AI is Google Cloud's enterprise AI platform, where businesses and developers can access more than 130 generative AI models, including those built by third-party developers and Alphabet's own Gemini. This helps Google Cloud customers accelerate the development of AI applications for their own purposes. Vertex AI saw an impressive sixfold increase in activity in the second half of 2023 compared to the six months prior. Based on Google Cloud's latest financial results, it should deliver around $40 billion in total revenue during 2024. That's less than half the $100 billion in revenue Amazon Web Services expects to generate, which tells you how far behind Google Cloud is. However, AWS only grew by 13% in Q4 compared to Google Cloud's 26%, which suggests Google Cloud is gradually taking market share. Alphabet's revenue for 2023 came in at $307.4 billion, with $73.8 billion dropping to the bottom line as net income (profit). That translated into $5.80 in earnings per share, an increase of 27.2% compared to 2022. The result places Alphabet shares at a price-to-earnings ratio of just 24.6. That's a 20.4% discount to the 30.9 P/E ratio of the Nasdaq-100 technology index, but more notably, it makes Alphabet the cheapest stock in the Magnificent Seven:  AMZN PE Ratio data by YCharts The other six stocks trade at an average P/E ratio of 53.2, implying Alphabet stock would have to climb 116% just to catch up. I'm not suggesting it will soar that high, but the company's accelerating growth and record financial results warrant a valuation more in line with the Nasdaq-100, at the very least. The size of Google Cloud relative to AWS and Microsoft Azure is one reason for the discount. Cloud services carry lofty profit margins because they are highly scalable, so investors have placed a premium on the valuations of Amazon and Microsoft based in part on their dominance in that segment. But Alphabet's future looks bright on that front given how fast Google Cloud is expanding relative to industry leader AWS (although it did trail Azure's 30% growth in the recent quarter). Investors have an opportunity to buy Alphabet stock as its core businesses rebound, all while paying a discount relative to its peers in the tech sector and the broader market. That sounds like a good deal. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}