{
    "title": "Alphabet’s Waymo car, Google’s self-driving venture, set on fire by crowd \nin California",
    "date": "2/12/2024",
    "url": "https://www.businesstoday.in/technology/news/story/alphabets-waymo-car-googles-self-driving-venture-set-on-fire-by-crowd-in-california-417067-2024-02-12",
    "text": "Feedback On Saturday in San Francisco, a Waymo self-driving car was vandalized and set ablaze by a crowd, according to statements from the Alphabet-owned company and local authorities. This incident marks the most severe attack on autonomous vehicles in the U.S. so far. The white SUV was surrounded by a crowd in the city's Chinatown district during Lunar New Year celebrations. A witness, Michael Vandi, said that a person jumped onto the Waymo vehicle and shattered its windshield, followed by another person who also jumped on the hood, to the applause of some in the crowd, according to a report by Reuters. The vehicle was later shown engulfed in flames after someone threw a firework inside. The fire department confirmed that a firework started the blaze, sharing images of the burnt vehicle on social media. The car was not transporting any passengers and no injuries were reported. The San Francisco Police Department is investigating the cause of the fire. This incident reflects an increasingly hostile public attitude towards self-driving cars following a pedestrian-dragging accident involving a General Motors' Cruise unit vehicle last year. In the past, similar disruptions have been caused by groups in San Francisco and Phoenix, Arizona. Just last week, a driverless Waymo car collided with a cyclist in San Francisco, causing minor injuries. Waymo offers autonomous ride-hailing service in Phoenix and is working to expand to Los Angeles and Austin, Texas.  Also read: Google Pay, PhonePe two 'ticking' time bombs, says LS member Supriya Sule Also read: 'Brushing up on my coding skills': How Google CEO Sundar Pichai is using Gemini AI Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}