{
    "title": null,
    "date": "2/16/2024",
    "url": "https://www.fool.com/investing/2024/02/16/the-bull-market-is-official-2-remarkable-growth-st/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More In 2023, the U.S. stock market experienced a remarkable rally with the S&P 500 and the Nasdaq Composite surging by 24.2% and 43%, respectively. That rally continued in early 2024, and the S&P 500 index set multiple new record highs in January. With the S&P 500 up by more than 20% from its bear market low of October 2022 and having crossed the threshold of its previous all-time high of January 2022, it has officially entered a bull market. Although the rising market has pushed up the valuations of many stocks, there are still numerous reasonably priced investment opportunities. Here's why Alphabet (GOOG 0.21%) (GOOGL 0.04%) and Amazon (AMZN 0.31%) can be smart picks for retail investors in this bull market environment. Although digital advertising titan Alphabet beat analysts' consensus top- and bottom-line estimates in the fourth quarter, ad revenues fell short of expectations. Since advertising provides nearly three-fourths of the company's total revenues, shares of the company sank after that result was revealed. While concerns about a potential U.S. recession affecting Alphabet's revenues and profits continue to loom, the recent share price pullback is no reason to panic. Google Search is still the indisputable leader in the global search market, with a share of nearly 91.5% according to Statcounter GlobalStats. This broad reach enabled Alphabet to capture nearly 39%of the $740.3 billion global digital advertising market last year. Alphabet incorporated artificial intelligence (AI) technologies into several areas of its advertising products, including bidding, targeting, creative development, and the core advertiser and publisher experiences. The company is also exploring the use of generative AI technology in search to deliver comprehensive and insightful responses to user queries and to show more relevant advertisements to users alongside search results. Moreover, the company is focusing on catering to diverse information needs by providing multimodal responses (a combination of multiple media such as text, images, audio, and video) with its recently launched Gemini large language model. These initiatives will further help Alphabet maintain its market dominance in the digital advertising market. Equally exciting is Alphabet's cloud computing business, Google Cloud, which has been gaining momentum over the past few years. Google Cloud revenues rose 26% to $33 billion in 2023, driven by increasing demand for AI-powered services and widespread adoption across government and enterprise clients. Alphabet also invested heavily in cloud-native AI infrastructure such as generative AI technologies and the Vertex AI platform to enable clients to build and train customized machine-learning models and AI applications. Despite this, Google Cloud is highly profitable, generating $864 million in operating income in 2023. Finally, Alphabet trades at a reasonable valuation, of just 6 times its trailing-12-month sales, close to its five-year average of 5.94. All these factors collectively underscore Alphabet's attractiveness as a compelling investment choice for 2024. E-commerce and cloud computing giant Amazon exhibited stellar performance in the fourth quarter, with revenues and earnings beating analysts' consensus estimates. In the weeks since the company announced these results on Feb. 1, the stock has risen by nearly 9%, but there are several reasons to expect the stock could go even higher in the coming months. First, Amazon's focus on restructuring its distribution network from a national to a regional model has brought items closer to customers. The subsequent improvement in delivery speeds helped increase the purchase frequency of Prime members, especially in the beauty, health, personal care, and everyday essentials categories. The regionalization strategy also helped reduce the cost of serving in 2023. Coupled with the company's extensive product selection and competitive pricing, Amazon's e-commerce business is positioned to maintain its dominant position in 2024. Second, Amazon Web Services (AWS) continues to be the leader in the cloud infrastructure market, with a 31% share. The business recorded a strong performance in the fourth quarter, with revenues rising 13% year over year to $24.2 billion. AWS' operating margin also rose by 500 basis points to 29.6% in the quarter. Despite enterprises continuing to optimize costs, AWS reached an annualized revenue run rate of $100 billion at the end of 2023. Third, Amazon is also investing to give AWS customers access to a wide range of generative AI capabilities. The company offers compute instances (fully managed cloud-based virtual workstations) running on a range of CPU and GPU chips, including Nvidia chips and its proprietary AI-optimized chips, to customers that are building their own AI models and require high-performance computing. It also offers Amazon Bedrock, a service that enables customers to leverage existing large language models and build customized generative AI applications securely on the AWS platform. Bedrock already gained significant traction in a matter of a few months, with thousands of customers using the service. Finally, AWS also gives customers access to easy-to-use AI-powered applications such as coding companion Amazon Q and shopping assistant Rufus. Considering the multiple tailwinds its businesses should benefit from, Amazon seems to be a smart buy now. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Manali Pradhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}