{
    "title": "Alphabet Inc. Cl A stock outperforms competitors despite losses on the day",
    "date": "2/23/2024",
    "url": "https://www.marketwatch.com/data-news/alphabet-inc-cl-a-stock-outperforms-competitors-despite-losses-on-the-day-830bb4ca-2d1415b5a2d2",
    "text": "Shares of Alphabet Inc. Cl A \n        GOOGL,\n        +0.04%\n       shed 0.09% to $143.96 Friday, on what proved to be an all-around positive trading session for the stock market, with the S&P 500 Index \n        SPX,\n        +0.11%\n       rising 0.03% to 5,088.80 and the Dow Jones Industrial Average \n        DJIA,\n        +0.12%\n       rising 0.16% to 39,131.53. The stock's fall snapped a three-day winning streak. Alphabet Inc. Cl A closed $9.82 short of its 52-week high ($153.78), which the company reached on January 29th. The stock demonstrated a mixed performance when compared to some of its competitors Friday, as Microsoft Corp. \n        MSFT,\n        -0.17%\n       fell 0.32% to $410.34, Amazon.com Inc. \n        AMZN,\n        +0.31%\n       rose 0.23% to $174.99, and Meta Platforms Inc. \n        META,\n        -1.68%\n       fell 0.43% to $484.03. Trading volume (19.0 M) remained 10.1 million below its 50-day average volume of 29.1 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. Billionaire investor Ray Dalio sees China heading for a ’100-year big storm.’ Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}