{
    "title": null,
    "date": "3/13/2024",
    "url": "https://seekingalpha.com/article/4677996-google-the-empire-will-strike-back",
    "text": " 400tmax We have seen the market turn against certain tech stocks (and many other companies) in the recent past and beyond. History has so many examples whereby buying a \"legendary\" or \"superstar\" tech company that has stumbled can be incredibly profitable. Let's review a few examples where there was a loss of faith in some tech giants. In 2017, Microsoft (MSFT) was trading in the $50 range and was considered as a \"has been\" tech company by many investors who felt this company missed some huge opportunities in mobile, search and more. Go forward just a few years and now this company is considered more cutting edge than ever and supposedly at the forefront of AI, according to many investors and analysts. The stock is now trading for more than $400 per share, which shows that sticking by this company through the tougher times has paid off enormously. More recently, we saw a huge selloff in Meta Platforms (META), which was trading around $380 per share in 2021, but then plunged below $100 per share in 2022. Once again, this former tech darling seemed to be suddenly viewed as a dog with fleas as investors dumped the stock over growth concerns. Many believed that Mark Zuckerberg had lost his touch. But those investors were so wrong to give up on Meta and Zuckerberg, and the stock has been on a tear ever since. It recently went above the $500 level for the first time. When the stock plunged below $100, it seems that Zuckerberg may have been more inspired than ever to prove his doubters wrong after Wall Street analysts were lowering price targets and shareholders were selling shares, when they should have been buying. I bring up all of this and cite these examples because it shows how investor sentiment can often get overly negative, which now appears to be exactly what has happened to Alphabet Inc. (NASDAQ:GOOG), (NASDAQ:GOOGL), which I will hereafter refer to as Google. All of a sudden, it seems like many investors and analysts have huge doubts about Google in terms of its AI product Gemini and its ability to hold on to the huge market share it has in search. While Google has stumbled recently with AI, it remains a powerhouse in so many ways. Instead of selling my shares, I am buying more on this weakness. Let's take a closer look at several factors to consider now: The bear case is that Google is going to lose a big part of its largest revenue producer, which is search. The bears believe that upstarts like OpenAI will grow so fast that they will disrupt Google's position in the market. Google is incredibly dominant in search, with just over 91% of the market (as of February 2024). The next largest competitor is Microsoft's Bing with just over 3% of the market and the rest of the players are so small, it's not worth spending any time on. So, it is true that Google is controlling most of the search market and when you are at the top, there is a lot to lose, but that doesn't mean Google won't continue to dominate search. In fact, OpenAI has been out for nearly a year and yet, Google continues to hold its market share in search. Google has repeatedly crushed competitors in search for many years, including promising upstarts in the past, so I would not count them out. The bears have also described Google management as being caught flat-footed when OpenAI launched and Google has been criticized (and rightly so), for errors when it launched Bard, which is now known as Gemini. It's true that Google made mistakes, but that doesn't mean it won't learn from these mistakes and then still come out as a highly competitive player in all things AI. While Google has had a number of mishaps with the rollout of Gemini, it is really not surprising because there are so many things that can go wrong with any product, especially one that is incredibly complex and in many cases nuanced, which could lead to inappropriate responses. OpenAI has had its share of issues as well, but as the \"upstart\", the market does not seem to judge it as harshly. Microsoft's Copilot recently decided to block some terms in order to avoid generating images that were not appropriate. With all the issues that have come up with AI tools, it seems very clear that these products were not ready for prime time. I believe Google knew this was the case and that's why it did not try to come to market first, even though it has been developing AI for many years. With absolute dominance in search, Google had a lot to lose by rolling out AI products (or any product) before it was perfected. OpenAI also probably knew their product wasn't ready, but as an upstart, it had almost nothing to lose. In 2021, OpenAI had around $34 million in revenues. By contrast, in 2021, Google generated about $257 billion in revenues. This shows that Google had much to lose and OpenAI did not, by rolling out AI tools that were not truly ready or perfected. With next to nothing to lose in comparison to Google, OpenAI decided to launch (taking a few shots at \"The Empire\"), and clearly Google was caught off guard, but that doesn't mean it can't win this battle. We are at the very early stages of AI and this is so far from being over in terms of who wins and who loses. But, I believe the market is huge and there will be multiple winners, with Google being one of them. Millions of Americans have never tried OpenAI or Gemini, and of course, that will change over time. I think Gemini will become universally adopted as soon as Google starts to embed this AI tool on the Google homepage, and as a sidebar in Gmail, and YouTube, etc. As of 2024, there are around 1.8 billion people using Gmail around the world. That represents more than 22% of the global population. This is a huge number of users and when you think of how many ways your email address is connected to everything from your financial accounts to your favorite shopping sites and more, your email account is not something that is easy to walk away from. That \"stickiness\" is great for Google, and if I am in my Gmail account and I need an AI tool, I am sure at some point that Google is going to make that very easy for me to access on my inbox page. At some point, I am confident Gemini will be added to the entire suite of products including YouTube, Gmail, and more. I believe it is absolutely ridiculous to think that Google has even started to fight for AI dominance; let's see how the bears feel when Gemini is more fully tested and perfected and then is easily accessed in your Gmail inbox, on your YouTube TV, and the Google homepage, etc. When this happens, more investors will appreciate the massive network effect that Google enjoys. In addition to this powerful network effect, Google also has an unsurpassed amount of data. DemandSage I recently heard that NVIDIA's CEO, Jensen Huang, uses Perplexity every day, and some feel this could be a growing threat to Google. I don't see it that way for a couple of reasons. Perplexity might be right for Jensen Huang, but most people don't need to be so \"cutting edge\", and most consumers are going to use the search and AI tools that are easily found in their Gmail inbox, or on the Google homepage which they have been comfortably using for years. It's important to remember that Google has the cash to buy any business (if regulators allow it) or duplicate any business model that poses a threat, (if regulators don't allow it to buy a competitor). So, I am confident that the R&D team at Google has taken a look at upstart competitors and will make any changes (if needed) to remain dominant. If there is a competitive or business risk I am worried about, it is not from OpenAI or Perplexity as much as it is from Apple (AAPL). Apple is my concern because they could develop some type of AI search tool, although Siri does not seem to have wowed too many users. However, this could change in the future, so I want to see what Apple comes out with in terms of AI development when they make some much anticipated announcements in June. If Apple just improves Siri for use as an AI assistant, that is one thing, but if Apple were to decide to replace Google as the default search engine on Apple devices, with their own AI search tool, that would be a problem. There is one huge factor that I believe mitigates this risk, which is that Google pays Apple about $18 billion per year to be the default search engine. For this reason, I doubt Apple will mess with the search engine default. As the chart below shows, Google shares recently dropped to the 200-day moving average level, which is around $133 per share. The stock is now trading around the 50-day moving average of nearly $138 per share. I would use any weakness at around the 200-day average of $133 or below as a buying opportunity. StockCharts.com Apple and Microsoft pay a dividend, and even Meta Platforms recently initiated a dividend. There has been some speculation that Google could follow up with an announcement to start paying a dividend as well. Given the amount of cash that Google has on the balance sheet, I would not be surprised if a dividend is initiated in the near future. This could be a strong upside catalyst for the stock as it would allow many dividend focused funds to make an investment. Analysts expect Google to earn $6.78 per share in 2024, with earnings rising to $7.82 for 2025, and rising yet again to $8.85 in 2026. Based on these estimates, Google shares appear undervalued in terms of the current PE Ratio. It appears even more undervalued when compared to stocks that investors recently seem to anoint as being AI leaders. As for the balance sheet, Google has around $111 billion in cash and nearly $30 billion in debt. This fortress-like balance sheet gives the company the power and flexibility to spend freely on R&D, it allows it to invest in upstart companies, and also to buyback shares. It also would allow it to easily initiate a dividend if the board of directors approved it in the future. While search generates the most revenues for Google at this time, that might not always be true in the future. Google has a number of investments in very promising companies, and it also has a few business divisions that it owns which could provide significant growth and contribute to earnings in the future. Here are some of the business divisions and investments that I find most promising: SpaceX: Google (though its VC division Google Ventures) reportedly owns a 7.5% stake in SpaceX. Verily: This Google owned company is using data to help advance solutions for major health issues, including cancer. Waymo: This division is developing autonomous vehicles. Wing: Google owns this drone delivery company. Google Fiber: This division provides high-speed Internet connections. Google seems to be undervalued right now thanks to what I think is the mistaken belief whereby some investors seem to be viewing this company as a has been or incapable of competing in AI. So, I like the buying opportunity that this bearish view has created. Google is trading around a market average multiple, when it really should be trading at a premium where many other AI leader stocks currently trade. Because of the recent stumbles, Google is getting some rare criticism, which might create some humility in the upper ranks and motivate management to prove doubters wrong. It's worth noting that co-founder Sergey Brin came back to Google to work on AI, so I believe he will be extremely motivated to prove doubters wrong. I also think there is a lot of room to cut costs, and that could improve future profits. I have to acknowledge there is some risk that despite the track record Google has established, it will continue to make mistakes with AI, but I really doubt this. I do have some concerns about the ongoing deal Google has with Apple, which keeps it as the default search engine. If this were to change, it would have some impact. However, I also believe that many consumers would establish Google as their search engine if it were no longer the default. In addition, Google pays a huge amount to Apple for this, so presumably the $18 billion per year could be used in other ways, which could offset the impact. It's way too early to count Google out, which many investors seem to have already done. I see the recent concerns about the launch of Gemini as an opportunity to buy an amazing tech company that has so much going for it. The massive cash hoard reduces risks for investors and enables Google to invest in R&D, initiate a dividend, buy upstart companies, and more. This stock trades at a discount valuation compared to stocks that investors have deemed to be \"AI leaders\". I see this setting Google shares up for multiple expansion once the company unleashes Gemini more fully. I think too many investors are currently underestimating the power of the Google network effect and the stickiness of its Gmail product and others. I am long now and have been buying on weakness. I think it makes sense to continue accumulating shares on pullbacks. As history shows, dominant tech companies can stumble at times, and yet reassert their dominance in many cases. No guarantees or representations are made. Hawkinvest is not a registered investment advisor and does not provide specific investment advice. The information is for informational purposes only. You should always consult a financial advisor. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}