{
    "title": null,
    "date": "3/6/2024",
    "url": "https://finance.yahoo.com/news/alphabet-ai-missteps-opportunity-one-144208958.html",
    "text": "(Bloomberg) -- Concerns about Alphabet Inc.’s artificial intelligence missteps have weighed heavily on the Google-parent’s stock, but a Boston Partners fund manager believes this has created a golden opportunity for investors. Most Read from Bloomberg One of the Most Infamous Trades on Wall Street Is Roaring Back China Has Never Canceled This Many Shipments of US Wheat Chinese Stocks Gain 20% From Lows, Fueling Market Bottom Calls Boeing Whistleblower Who Raised Safety Concerns Found Dead The shares trade at “a low multiple for an extraordinary business,” David Cohen, who manages just over $30 billion as a portfolio manager for Boston Partners’ large cap value strategy, said in an interview in London. “We don’t think the upside from what the company can do with AI is priced into the equity.” Alphabet’s misfiring Gemini AI product has been viewed as a major setback for a firm known for its technological prowess, with the company last month pausing an image generation feature that drew criticism over inaccurate historical depictions of race. That sparked concerns that one of the world’s most valuable firms over the past decade is falling behind in AI, having been overtaken by Nvidia Corp. and Amazon.com Inc. Cohen said the advantage for Alphabet — whose stock has dropped 5% this year compared with a 13% gain for the Bloomberg Magnificent 7 Index — is that its share price doesn’t reflect its capabilities in artificial intelligence. He believes the Gemini issues can be fixed relatively easily, and that this presents “a rare opportunity for fund managers looking for a value stock with massive growth potential.” Typically considered a growth bet and not commonly found in so-called value portfolios, Alphabet was the fourth-biggest holding in Cohen’s Robeco BP US Large Cap Equities fund as of Jan. 31, according to the latest fact sheet. The fund, which also counts JPMorgan Chase & Co., Walmart Inc., and Berkshire Hathaway Inc. as its top holdings, has returned nearly 17% in the past year, compared with a 10% gain in the benchmark Russell 1000 Value Index, according to data compiled by Bloomberg. “Don’t be quick to dismiss all of Big Tech as pure-play growth stocks,” Cohen said. Other tech behemoths have surged this year and, as a group, are trading at exalted valuations that are often prohibitive for value fund managers. Alphabet trades at 18 times forward earnings, according to data compiled by Bloomberg. That’s about 35% cheaper than that of the broader Magnificent Seven group, which also includes Nvidia, Apple Inc., Microsoft Corp., Facebook-parent Meta Platforms Inc., Tesla Inc. and Amazon.com, according to data compiled by Bloomberg. Alphabet shares rose higher on Wednesday. When it comes to Alphabet’s AI missteps, “we think this is a wakeup call for Google executives,” said Cohen. “The technical fix for Gemini doesn’t appear to be costly or particularly difficult. The long-term potential for Google in AI is still extremely strong.” --With assistance from Michael Msika. (Adds stock move in eighth paragraph.) Most Read from Bloomberg Businessweek Academics Question ESG Studies That Helped Fuel Investing Boom Luxury Postnatal Retreats Draw Affluent Parents Around the US How Apple Sank About $1 Billion a Year Into a Car It Never Built The Battle to Unseat the Aeron, the World’s Most Coveted Office Chair Primaries Show Candidates Can Win on TikTok But Lose at the Polls ©2024 Bloomberg L.P. Related Quotes "
}