{
    "title": "Union Pacific And Alphabet On CNBC’s ‘Final Trades’ - Alphabet \n(NASDAQ:GOOG), Alphabet (NASDAQ:GOOGL)",
    "date": "3/5/2024",
    "url": "https://www.benzinga.com/trading-ideas/long-ideas/24/03/37478507/union-pacific-and-alphabet-on-cnbcs-final-trades",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW On CNBC’s \"Halftime Report Final Trades,\" Joseph M. Terranova of Virtus Investment Partners named  Alphabet Inc.  GOOG GOOGL. “If you do own the puts, I'd keep them,” he said, adding that the stock could go even lower. Google cofounder Sergey Brin admitted that the Gemini image generator was \"messed up,\" days after CEO Sundar Pichai accepted that the errors were \"completely unacceptable.\" Jim Lebenthal of Cerity Partners said  Union Pacific Corporation UNP is a solid industrial. On Jan. 25, Union Pacific reported a fourth-quarter FY23 operating revenue of $6.159 billion, beating the consensus of $6.05 billion. Operating revenue was flat, driven by increased volume and core pricing gains offset by reduced fuel surcharge revenue and business mix. Don’t forget to check out our  premarket coverage here Steve Weiss of Short Hills Capital Partners picked  Alphabet Inc.  GOOG. Two winners in the race of AI for everyday tools, Google and Microsoft MSFT, he added. Alphabet’s Google faced a massive 2.1-billion-euro lawsuit from 32 media groups, including Axel Springer SE and Schibsted Media Group. The plaintiffs accused the tech giant of inflicting financial losses through its digital advertising practices. The lawsuit highlights Google’s alleged market dominance abuse, suggesting that without such practices, these media companies would have earned significantly more from advertising and paid less for ad tech services, Reuters reported. Check This Out:  Investor Optimism Improves Following PCE Report; Nasdaq Surges To Record High Image: © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}