{
    "title": "Calls grow for Sundar Pichai to step down from Google CEO position",
    "date": "3/2/2024",
    "url": "https://indianexpress.com/article/technology/tech-news-technology/google-sundar-pichai-step-down-ceo-9191645/",
    "text": "Despite multiple efforts with the Bard and Gemini chatbots, Google never really dug itself out of the hole it found itself in when OpenAI released ChatGPT in November 2022. After embarrassing results from Gemini’s AI image generation feature, there are growing calls for Sundar Pichai to step down as the search giant’s CEO. Gemini’s AI image generation tool was received very poorly and became the butt of many jokes due to being “too woke” and for “historical inaccuracies.” The company faced such criticism that it was forced to pull the image generation feature from the chatbot and said that it will only be brought back after it was fixed. It got so bad that Pichai addressed the issues in a statement to employees, calling it “completely unacceptable.” Google-parent Alphabet’s stock also plummeted in the meanwhile. But now, the focus has shifted to wider issues with the company’s culture and there are calls for Pichai to step down as CEO, reports Business Insider. Google had already made such errors. During a public demonstration of Bard, Gemini’s predecessor, the chatbot made an embarrassing mistake when asked a question about the James Webb Space Telescope. This makes it look like Google is rushing products to the market before they are completely finished. Now that can be acceptable if it comes from a startup like OpenAI or SpaceX, which work with the philosophy of “fail faster and reiterate,” but Google is an established company that we expect to get things right before they push it to customers. This represents a fundamental problem for the company — it is a major corporation that is now forced to act like a lean, mean startup just so that it does not fall behind in the AI race. The current consensus is that it is already losing that race. Analyst Ben Thompson wrote in his publication Stratechery that Google needs a major shift in culture. He had previously accused the company of being too “timid” in the AI race. But now, he thinks it is going in a different direction. “If timidity were the motivation, then it’s safe to say that the company’s approach with Gemini has completely backfired; while Google turned off Gemini’s image generation capabilities, it’s text generation is just as absurd,” he wrote. Thompson pointed to an example where Gemini was asked who was worse, Elon Musk tweeting memes or Hitler. The chatbot said it is “difficult to say definitively who had a greater negative impact on society.” While many decisions by the Tesla billionaire are questionable and probably were against the interests of society, what Gemini said is downright imbecilic. Thompson says this instance means that even Gemini’s text generation feature needs to be pulled down. “Google is a company that should dominate AI, thanks to their research and their infrastructure. The biggest obstacle, though, above and beyond the business model, is clearly culture. To that end, the nicest thing you can say about Google’s management is to assume that they, like me and everyone else, just want to build products and not be yelled at,” concluded Thompson, rather diplomatically. With Gartner predicting last month that search engine volumes will drop 25 per cent by 2026 due to AI chatbots and other virtual agents, this could very well be Sundar Pichai’s Steve Ballmer movement. When Ballmer was heading Microsoft, the company missed out on the smartphone revolution, meaning that both Apple and Google raced to the top of the market with iOS and Android respectively. “The most recent saga only further raises increasingly louder questions around whether this is the right management team to guide Google into this next era,” wrote Bernstein business analyst Mark Shmulik in a research note published last week, according to Business Insider. Aravind Srinivas, the CEO of Perplexity AI, gave his own answer for the questions of whether it is necessary for Pichai to step down and who will take his place — “Sundar is also the CEO of Alphabet, and he is best positioned to appoint the CEO of Google, whether it’s Nat (who I really admire as a great operator) or others or someone internal or having himself continue,” wrote the former OpenAI research in a post on X, formerly Twitter. Google’s struggle with a changing tech industry landscape has been bleeding the company for more than a year now. It said that it spent more than $2.1 billion in layoffs last year as it fired more than 12,000 employees. Google’s latest earnings report says that its digital ads and cloud computing businesses are steadily growing but Search remains its primary source of revenue, generating $48 billion.  BSEB will declare the Bihar Board 10th exam results 2024 today at 1:30 pm. Around 16.4 lakh students took the offline exams from February 15 to 23, with strict measures in place to prevent cheating. A press conference will be held at the board's headquarters to announce the toppers' names.    "
}