{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/whitaker-myers-wealth-managers-ltd-makes-new-investment-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Whitaker Myers Wealth Managers LTD. bought a new stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) during the 4th quarter, according to its most recent Form 13F filing with the SEC. The firm bought 2,245 shares of the information services provider’s stock, valued at approximately $314,000. Several other hedge funds have also recently bought and sold shares of the company. Vanguard Group Inc. grew its holdings in shares of  Alphabet by 0.3% during the 3rd quarter. Vanguard Group Inc. now owns 487,435,495 shares of the information services provider’s stock valued at $63,785,809,000 after purchasing an additional 1,302,104 shares during the last quarter.  FMR LLC grew its holdings in shares of  Alphabet by 5.6% during the 3rd quarter. FMR LLC now owns 227,317,469 shares of the information services provider’s stock valued at $29,746,764,000 after purchasing an additional 12,070,681 shares during the last quarter.  State Street Corp grew its holdings in shares of  Alphabet by 0.8% during the 2nd quarter. State Street Corp now owns 218,540,033 shares of the information services provider’s stock valued at $26,159,242,000 after purchasing an additional 1,666,205 shares during the last quarter.  Moneta Group Investment Advisors LLC grew its holdings in shares of  Alphabet by 111,197.8% during the 4th quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock valued at $15,036,178,000 after purchasing an additional 170,267,122 shares during the last quarter.  Finally, Geode Capital Management LLC grew its holdings in shares of  Alphabet by 2.3% during the 2nd quarter. Geode Capital Management LLC now owns 121,308,289 shares of the information services provider’s stock valued at $14,481,781,000 after purchasing an additional 2,731,671 shares during the last quarter. 35.08% of the stock is owned by institutional investors. Shares of NASDAQ GOOGL opened at $150.77 on Friday. Alphabet Inc. has a one year low of $99.74 and a one year high of $153.78. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. The firm’s 50 day simple moving average is $143.02 and its two-hundred day simple moving average is $137.79. The stock has a market capitalization of $1.87 trillion, a P/E ratio of 25.99, a PEG ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The business had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $70.77 billion. During the same period last year, the business earned $1.05 earnings per share.  As a group, analysts expect that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. In other Alphabet news, insider John Kent Walker sold 28,281 shares of the stock in a transaction that occurred on Thursday, December 28th. The shares were sold at an average price of $141.40, for a total transaction of $3,998,933.40. Following the transaction, the insider now directly owns 25,002 shares in the company, valued at $3,535,282.80. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this hyperlink. In related news, insider John Kent Walker sold 28,281 shares of Alphabet stock in a transaction on Thursday, December 28th. The shares were sold at an average price of $141.40, for a total value of $3,998,933.40. Following the transaction, the insider now directly owns 25,002 shares of the company’s stock, valued at $3,535,282.80. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. Also, Director Frances Arnold sold 230 shares of Alphabet stock in a transaction on Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total transaction of $35,433.80. Following the completion of the transaction, the director now directly owns 15,104 shares in the company, valued at $2,326,922.24. The disclosure for this sale can be found here. Insiders have sold 279,659 shares of company stock worth $39,460,310 over the last ninety days. Insiders own  0.88% of the company’s stock. A number of equities research analysts have weighed in on GOOGL shares. Needham & Company LLC  reissued a “buy” rating and set a $160.00 target price on shares of Alphabet in a report on Wednesday, January 31st. Redburn Atlantic boosted their price target on shares of Alphabet from $150.00 to $165.00 and gave the stock a “buy” rating in a research report on Wednesday, January 31st. JMP Securities boosted their price target on shares of Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a research report on Wednesday, January 31st. Susquehanna boosted their price target on shares of Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a research report on Wednesday, January 31st. Finally, Rosenblatt Securities dropped their price target on shares of Alphabet from $174.00 to $172.00 and set a “buy” rating on the stock in a research report on Wednesday, January 31st. Five equities research analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have assigned  a strong buy rating to the company. According to data from MarketBeat, the company presently has an average rating of “Moderate Buy” and a consensus price target of $155.48. Get Our Latest Report on Alphabet (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. iShares MSCI EAFE ETF (NYSEARCA:EFA) Shares Purchased by Etesian Wealth Advisors Inc. NatWest Group plc Lowers Stock Position in McDonald’s Co. (NYSE:MCD) "
}