{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/alphabet-inc-nasdaqgoogl-stock-holdings-decreased-by-ht-partners-llc.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 HT Partners LLC lowered its stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 1.7% in the 4th quarter, Holdings Channel.com reports. The firm owned 12,128 shares of the information services provider’s stock after selling 216 shares during the period. Alphabet makes up   0.7% of HT Partners LLC’s holdings, making the stock its 16th biggest holding. HT Partners LLC’s holdings in Alphabet were worth $1,694,000 as of its most recent filing with the SEC. Several other hedge funds and other institutional investors also recently modified their holdings of the stock. Spreng Capital Management Inc. lifted its stake in shares of  Alphabet by 4.0% in the 1st quarter. Spreng Capital Management Inc. now owns 131 shares of the information services provider’s stock worth $364,000 after acquiring an additional 5 shares during the period.  West Family Investments Inc. lifted its stake in  Alphabet by 0.3% during the first quarter. West Family Investments Inc. now owns 1,754 shares of the information services provider’s stock valued at $4,878,000 after purchasing an additional 6 shares during the last quarter.  Maple Capital Management Inc. lifted its stake in  Alphabet by 2.1% during the first quarter. Maple Capital Management Inc. now owns 296 shares of the information services provider’s stock valued at $823,000 after purchasing an additional 6 shares during the last quarter.  Private Advisory Group LLC lifted its stake in  Alphabet by 1.8% during the first quarter. Private Advisory Group LLC now owns 401 shares of the information services provider’s stock valued at $1,115,000 after purchasing an additional 7 shares during the last quarter.  Finally, Weik Capital Management lifted its stake in  Alphabet by 0.5% during the first quarter. Weik Capital Management now owns 1,533 shares of the information services provider’s stock valued at $4,264,000 after purchasing an additional 8 shares during the last quarter. Institutional investors own  40.03% of the company’s stock. In other news, CAO Amie Thuener O’toole sold 425 shares of Alphabet stock in a transaction dated Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total transaction of $59,334.25. Following the sale, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The sale was disclosed in a document filed with the SEC, which is available through this hyperlink. In other news, CAO Amie Thuener O’toole sold 425 shares of Alphabet stock in a transaction dated Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total transaction of $59,334.25. Following the sale, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The sale was disclosed in a document filed with the SEC, which is available through this hyperlink. Also, Director John L. Hennessy sold 200 shares of Alphabet stock in a transaction dated Wednesday, January 10th. The shares were sold at an average price of $143.49, for a total transaction of $28,698.00. Following the sale, the director now owns 6,784 shares in the company, valued at $973,436.16. The disclosure for this sale can be found here. In the last three months, insiders have sold 263,312 shares of company stock worth $37,268,315. Corporate insiders own  0.88% of the company’s stock. A number of equities research analysts have recently issued reports on GOOGL shares. Barclays cut their price target on shares of Alphabet from $180.00 to $173.00 and set an “overweight” rating on the stock in a report on Wednesday, January 31st. Susquehanna boosted their price target on shares of Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a report on Wednesday, January 31st. Wedbush boosted their price target on shares of Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a report on Friday, March 22nd. Mizuho boosted their price target on shares of Alphabet from $155.00 to $170.00 and gave the company a “buy” rating in a report on Wednesday, January 17th. Finally, Roth Mkm dropped their price objective on shares of Alphabet from $166.00 to $164.00 and set a “buy” rating on the stock in a research note on Wednesday, January 31st. Five investment analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have issued  a strong buy rating to the stock. According to MarketBeat, the stock currently has a consensus rating of “Moderate Buy” and an average price target of $155.48. Read Our Latest Stock Analysis on Alphabet Shares of Alphabet stock opened at $150.93 on Friday. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a fifty-two week low of $99.78 and a fifty-two week high of $153.78. The firm has a fifty day moving average price of $143.67 and a two-hundred day moving average price of $138.21. The company has a market cap of $1.88 trillion, a PE ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The firm had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. During the same period in the prior year, the firm earned $1.05 EPS.  Analysts expect that  Alphabet Inc. will post 6.77 EPS for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 1,264 Shares in Kenvue Inc. (NYSE:KVUE) Bought by Planned Solutions Inc. Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by Parisi Gray Wealth Management "
}