{
    "title": "Alphabet Inc (GOOG) DCF Valuation: Is The Stock Undervalued?",
    "date": "3/15/2024",
    "url": "https://acquirersmultiple.com/2024/03/alphabet-inc-goog-dcf-valuation-is-the-stock-undervalued/",
    "text": "The Absurdly Simple, Ridiculously Powerful Deep Value Stock Screener Johnny HopkinsMarch 15, 2024Stock ScreenerLeave a Comment As part of a new series, each week we typically conduct a DCF on one of the companies in our screens. This week we thought we’d take a look at one of the stocks that is not currently in our screens, Alphabet Inc (GOOG). Profile Alphabet is a holding company. Internet media giant Google is a wholly owned subsidiary. Google services account for nearly 90% of Alphabet’s revenue, of which more than 85% is from online ads. Other Google services revenue is from sales of apps and content on Google Play and YouTube, as well as sales of hardware such as Chromebooks, the Pixel smartphone, and smart home products, which include Nest and Google Home. Goolgle’s cloud computing offerings account for a bit more than 10% of total Alphabet revenue. Alphabet’s moonshot investments are in its other bets segment, where it bets on technology to enhance health (Verily), provide faster internet access (Google Fiber), enable self-driving cars (Waymo), and more. Recent Performance Over the past twelve months the share price is up 57.48%.  GOOG data by YCharts Inputs Forecasted Free Cash Flows (FCFs) Terminal Value Terminal Value = FCF * (1 + g) / (r – g) = 1494.74 billion Present Value of Terminal Value PV of Terminal Value = Terminal Value / (1 + WACC)^5 = 971.48 billion Present Value of Free Cash Flows Present Value of FCFs = ∑ (FCF / (1 + r)^n) = 338.23 billion Enterprise Value Enterprise Value = Present Value of FCFs + Present Value of Terminal Value = 1309.71 billion Net Debt Net Debt = Total Debt – Total Cash = -12.18 billion Equity Value Equity Value = Enterprise Value – Net Debt = 1321.89 billion Per-Share DCF Value Per-Share DCF Value = Enterprise Value / Number of Shares Outstanding = $106.09 Conclusion Based on the DCF valuation, the stock is overvalued. The DCF value of $106.09 per share is lower than the current market price of $144.35. The Margin of Safety is -36.06%. For all the latest news and podcasts, join our free newsletter here. FREE Stock Screener Don’t forget to check out our FREE Large Cap 1000 – Stock Screener, here at The Acquirer’s Multiple:  Tags:Stock Screener Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Notify me of follow-up comments by email. Notify me of new posts by email.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Click the link below for the latest episodes on Acquirers Channel:   Join 21,007 other investors in search of undervalued stocks, value investing news, investing strategies, and The Acquirer's Podcast Click here for a list of our value investing archives "
}