{
    "title": "Google restricts AI chatbot Gemini from answering queries on global \nelections",
    "date": "3/12/2024",
    "url": "https://www.theglobeandmail.com/business/technology/article-google-restricts-ai-chatbot-gemini-from-answering-queries-on-global/",
    "text": "Google is restricting AI chatbot Gemini from answering questions about the global elections set to happen this year, the Alphabet-owned GOOGL-Q firm said on Tuesday, as it looks to avoid potential missteps in the deployment of the technology. The update comes at a time when advancements in generative AI, including image and video generation, have fanned concerns of misinformation and fake news among the public, prompting governments to regulate the technology. When asked about elections such as the upcoming U.S. presidential match-up between Joe Biden and Donald Trump, Gemini responds with “I’m still learning how to answer this question. In the meantime, try Google Search”. Google had announced restrictions within the U.S. in December, saying they would come into effect ahead of the election. “In preparation for the many elections happening around the world in 2024 and out of an abundance of caution, we are restricting the types of election-related queries for which Gemini will return responses,” a company spokesperson said on Tuesday. Aside from the United States, national elections are set to be held in several large countries including South Africa and India, the world’s largest democracy. India has asked tech firms to seek government approval before the public release of AI tools that are “unreliable” or under trial, and to label them for the potential to return wrong answers. Google’s AI products are under the scanner after inaccuracies in some historical depictions of people created by Gemini forced it to pause the chatbot’s image-generation feature late last month. CEO Sundar Pichai had said the company was working to fix those issues and called the chatbot’s responses “biased” and “completely unacceptable”. Facebook-parent Meta Platforms META-Q said last month it will set up a team to tackle disinformation and the abuse of generative AI in the run-up to European Parliament elections in June. Report an editorial error Report a technical issue Study and track financial data on any traded entity: click to open the full quote page. Data updated as of 28/03/24 4:00pm EDT. Authors and topics you follow will be added to your personal news feed in Following. © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}