{
    "title": "Bridge Advisory LLC Lowers Holdings in Alphabet Inc. (NASDAQ:GOOGL)",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/bridge-advisory-llc-lowers-holdings-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 Bridge Advisory LLC decreased its stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 11.0% during the fourth quarter, according to its most recent disclosure with the Securities & Exchange Commission. The fund owned 7,212 shares of the information services provider’s stock after selling 888 shares during the quarter. Bridge Advisory LLC’s holdings in Alphabet were worth $1,007,000 as of its most recent SEC filing. Other hedge funds have also recently modified their holdings of the company. DE Burlo Group Inc. boosted its stake in shares of  Alphabet by 520.0% in the second quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider’s stock worth $11,551,000 after buying an additional 80,934 shares during the last quarter.  West Tower Group LLC purchased a new position in  Alphabet during the second quarter worth approximately $88,000.  Ballast Advisors LLC boosted its position in  Alphabet by 9.6% during the third quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider’s stock worth $2,061,000 after purchasing an additional 1,385 shares in the last quarter.  Quantum Financial Advisors LLC boosted its position in  Alphabet by 8.0% during the third quarter. Quantum Financial Advisors LLC now owns 7,623 shares of the information services provider’s stock worth $998,000 after purchasing an additional 564 shares in the last quarter.  Finally, Acadian Asset Management LLC boosted its position in  Alphabet by 2.4% during the third quarter. Acadian Asset Management LLC now owns 4,416,533 shares of the information services provider’s stock worth $577,908,000 after purchasing an additional 104,366 shares in the last quarter. Hedge funds and other institutional investors own  40.03% of the company’s stock. In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the completion of the sale, the chief executive officer now owns 2,310,191 shares of the company’s stock, valued at $343,710,216.98. The transaction was disclosed in a legal filing with the SEC, which is available through this hyperlink. In other news, SVP Prabhakar Raghavan sold 16,088 shares of the firm’s stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the completion of the transaction, the senior vice president now directly owns 52,440 shares in the company, valued at $7,294,404. The transaction was disclosed in a document filed with the SEC, which is available at this link. Also, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total value of $3,347,550.00. Following the transaction, the chief executive officer now owns 2,310,191 shares of the company’s stock, valued at $343,710,216.98. The disclosure for this sale can be found here. Insiders sold a total of 251,138 shares of company stock valued at $35,427,655 over the last quarter. 0.88% of the stock is owned by insiders. GOOGL has been the topic of a number of recent analyst reports. Redburn Atlantic increased their price target on Alphabet from $150.00 to $165.00 and gave the stock a “buy” rating in a research report on Wednesday, January 31st. Susquehanna increased their price target on Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a research report on Wednesday, January 31st. Needham & Company LLC  reiterated a “buy” rating and set a $160.00 price target on shares of Alphabet in a research report on Wednesday, January 31st. Truist Financial lowered their price target on Alphabet from $160.00 to $158.00 and set a “buy” rating on the stock in a research report on Wednesday, January 31st. Finally, Mizuho increased their price target on Alphabet from $155.00 to $170.00 and gave the stock a “buy” rating in a research report on Wednesday, January 17th. Five equities research analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have given a strong buy rating to the company’s stock. According to data from MarketBeat.com, the company currently has a consensus rating of “Moderate Buy” and an average target price of $155.48. View Our Latest Research Report on Alphabet GOOGL stock opened at $150.93 on Friday. The business has a fifty day moving average of $143.52 and a two-hundred day moving average of $138.12. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The stock has a market cap of $1.88 trillion, a price-to-earnings ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet Inc. has a 52-week low of $99.78 and a 52-week high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.60 by $0.04. The company had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same quarter last year, the firm earned $1.05 earnings per share.  As a group, research analysts anticipate that  Alphabet Inc. will post 6.77 earnings per share for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.    Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Kingswood Wealth Advisors LLC Trims Stock Holdings in The Kroger Co. (NYSE:KR) Alphabet Inc. (NASDAQ:GOOGL) Shares Sold by Family Legacy Inc. "
}