{
    "title": "This Billionaire Is Selling AI Stocks, Including Nvidia",
    "date": "3/4/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOGL-Q/pressreleases/24531832/this-billionaire-is-selling-ai-stocks-including-nvidia/",
    "text": "Billionaire David Tepper has a way of beating the rest of the market to major investing trends, and artificial intelligence was no exception. He rode Nvidia(NASDAQ: NVDA) and Microsoft(NASDAQ: MSFT) over the past year, but now he's selling. In this video, Travis Hoium shows how Tepper's portfolio has changed and what he may be seeing in the market. *Stock prices used were end-of-day prices of March 2, 2024. The video was published on March 3, 2024.  Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of February 26, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Travis Hoium has positions in Alphabet and MGM Resorts International. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, Oracle, and Uber Technologies. The Motley Fool recommends Alibaba Group and United Parcel Service and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Travis Hoium is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link, they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Alphabet Cl A stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}