{
    "title": "Alphabet's Magnificent Misstep: Why the Tech Titan's Dip Is Your Ticket to \nMassive Gains",
    "date": "3/14/2024",
    "url": "https://investorplace.com/market360/2024/03/alphabets-magnificent-misstep-why-the-tech-titans-dip-is-your-ticket-to-massive-gains/",
    "text": " GOOG stock offers portfolio participation in the intriguing robotaxi market Advertisement Source: IgorGolovniov / Shutterstock.com Google and YouTube parent company Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) is a Magnificent Seven or “Mag-7″ member, but GOOG stock hasn’t been the most magnificent performer lately. We’re still assigning the stock a “B” grade, however, as Alphabet can still offer good value to its shareholders. Alphabet’s Google is, of course, a dominator in the U.S. search-engine market. Plus, the company earns robust revenue from Google Cloud. Granted, Google stumbled recently in its rollout of a new generative artificial intelligence chatbot. Alphabet is making headway in a niche automotive market with growth potential. Investors constantly say that they’ll buy a stock on the dip. However, when they finally get a nice dip, they’re afraid to make a move. They see that a company is having problems, but you’ll rarely see a share-price dip without some sort of problem happening. To a certain extent, the recent dip in Alphabet stock from $155 to $136 can be attributed to Alphabet’s less-than-stellar rollout of the Gemini gen-AI chatbot. Apparently, Gemini has been accused of providing biased responses to some queries. If you’re going to invest in GOOG stock, you’ll need to be patient with Alphabet. Google CEO Sundar Pichai reportedly assured that the company is working “around the clock” to fix Gemini’s bias. Alphabet will not dominate the gen-AI wars next week or next month. Meanwhile, as these issues rattle some investors, Alphabet stock is trading at a more favorable price point. As Boston Partners fund manager David Cohen put it, Alphabet shares trade at a “low multiple for an extraordinary business.” In case you’re wondering what that “low multiple” is, Alphabet’s generally accepted accounting principles trailing 12-month price-to-earnings ratio is 23.34x. That’s not outlandishly high, especially for a Mag-7 company. As some investors fret about Gemini, they’re probably overlooking the value that Waymo brings to Alphabet. Waymo is the Alphabet-owned manufacturer of self-driving taxis, also known as robotaxis. Pardon the pun, but Waymo is making “way mo’” progress than you might expect. In fact, Waymo’s driverless taxis are now allowed to operate in Los Angeles and in Santa Monica, Beverly Hills and some other cities in California. In addition, Waymo’s robotaxis can operate in Austin, Texas and in Phoenix, Arizona. Perhaps, the public is warming up to the idea of driverless-taxi service. A recent report from The Los Angeles Times seemed to convey a generally positive tone about Waymo. In time, Waymo could prove to be a significant revenue generator for Alphabet. If Alphabet stock dips, what’s your response? Will you focus on the problems with Gemini? Or, will you calmly weigh the risks and potential rewards of holding a share stake in Alphabet? Overall, GOOG stock earns a “B” grade and you’re certainly not required to own it. However, at the very least, consider whether Alphabet can recover from its initial missteps with Gemini. Probably, Alphabet will recover and Gemini will improve. Alphabet will continue to generate revenue from Google Search and Google Cloud. On top of that, Waymo could provide substantial value to Alphabet in the long run. Hence, we encourage you to conduct your due diligence and decide whether Alphabet stock is appropriate for your portfolio. On the date of publication, neither Louis Navellier nor the InvestorPlace Research Staff member primarily responsible for this article held (either directly or indirectly) any positions in the securities mentioned in this article. Technology, Artificial Intelligence, Cloud   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/03/alphabets-magnificent-misstep-why-the-tech-titans-dip-is-your-ticket-to-massive-gains/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Stocks to Buy Hot Stocks Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}