{
    "title": "Alphabet (GOOGL) Aids YouTube Music With Song Search Feature",
    "date": "3/19/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-aids-youtube-music-164600410.html",
    "text": "Alphabet’s GOOGL Google is leaving no stone unturned to capitalize on growth opportunities present in the music streaming market space. Per a Grand View Research report, the global music streaming market size is expected to witness a CAGR of 14.4% between 2023 and 2030.In this regard, the company added a song search capability for YouTube Music on Android devices.Notably, YouTube Music now features a dedicated button next to voice search, allowing faster access by tapping the search icon in the top-right corner.Alphabet is likely to expand its YouTube Music subscriber base on the back of its latest move. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the song search feature, Google introduced a \"Trim Silence\" feature in the v6.43.52 version of YouTube Music, allowing users to skip past stretches of silence in a podcast, resulting in a slightly shorter runtime.Further, the company announced a redesign of the Now Playing feature on YouTube Music for web, introducing a full-screen experience with a Song and Video switcher, minimize button, overflow menu and cast controls.Additionally, Google added several new notifications for YouTube Music on Android and iOS, alerting users about new releases and playlists.These notifications include music recommendation notifications, playlist update notifications, podcast recommendation notifications, product update notifications and recap notifications. Users can disable these notifications in their preferences at any time.All the above-mentioned endeavors to enhance YouTube Music offerings will likely aid Alphabet to bolster its Google Services segment, which remains the key growth driver for the company. Its shares have rallied 45.9% in the past year compared with the Zacks Computer & Technology sector’s growth of 44.6%.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $286.52 billion, indicating year-over-year growth of 11.7%. Growing YouTube Music efforts will likely allow Alphabet to strengthen its competitive position against rivals like Apple AAPL and Amazon AMZN, which are also making substantial efforts to strengthen their footing in the global music streaming space.Recently, Apple offered USHER fans exclusive content on Apple Music ahead of his upcoming Apple Music Super Bowl LVIII Halftime Show. The content includes a trailer, studio album discography, playlists curated by USHER and NFL teams, and dedicated Apple Music Radio programming for Apple Music subscribers.Apple also launched a Discovery Station for Apple Music. The Discovery Station, available on Apple Music's mobile, desktop and web apps, is a curated selection of music based on users’ recent listening, which has not yet been added to the library.Amazon, on the other hand, is riding on the success of its music streaming service, Amazon Music.The company’s Amazon Music Unlimited service offers an expanded catalog and over 1,000 spatial remixes for Dolby Atmos soundbars, Android and iOS devices, and Amazon Echo Studio. Currently, Alphabet carries a Zacks Rank #3 (Hold).A better-ranked stock in the broader technology sector is CrowdStrike CRWD, carrying a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Shares of CrowdStrike have gained 28.7% in the year-to-date period. The long-term earnings growth rate for CRWD is 22.31% Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report CrowdStrike (CRWD) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}