{
    "title": "Cedar Mountain Advisors LLC Trims Stock Position in Alphabet Inc. \n(NASDAQ:GOOGL)",
    "date": "3/27/2024",
    "url": "https://www.defenseworld.net/2024/03/27/cedar-mountain-advisors-llc-trims-stock-position-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 27th, 2024 Cedar Mountain Advisors LLC cut its holdings in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 38.8% during the 4th quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission. The firm owned 379 shares of the information services provider’s stock after selling 240 shares during the quarter. Cedar Mountain Advisors LLC’s holdings in Alphabet were worth $53,000 as of its most recent filing with the Securities and Exchange Commission. Several other large investors have also recently added to or reduced their stakes in GOOGL. DC Investments Management LLC purchased a new position in shares of  Alphabet in the 1st quarter worth about $114,000.  Bridgefront Capital LLC acquired a new stake in shares of  Alphabet in the first quarter valued at about $225,000.  Worth Asset Management LLC purchased a new stake in  Alphabet during the 1st quarter worth approximately $206,000.  Eudaimonia Advisors LLC increased its holdings in  Alphabet by 15.1% during the 1st quarter. Eudaimonia Advisors LLC now owns 99 shares of the information services provider’s stock worth $275,000 after purchasing an additional 13 shares during the last quarter.  Finally, Aspire Capital Advisors LLC purchased a new stake in  Alphabet during the 1st quarter worth approximately $281,000. 40.03% of the stock is currently owned by hedge funds and other institutional investors. Shares of NASDAQ GOOGL opened at $150.67 on Wednesday. The business’s 50-day moving average price is $143.17 and its two-hundred day moving average price is $137.93. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a one year low of $99.74 and a one year high of $153.78. The company has a market capitalization of $1.87 trillion, a P/E ratio of 25.98, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The firm had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. During the same quarter in the previous year, the company posted $1.05 earnings per share.  Analysts anticipate that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. GOOGL has been the topic of several analyst reports. Needham & Company LLC  restated a “buy” rating and set a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Susquehanna lifted their price objective on Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a report on Wednesday, January 31st. BMO Capital Markets lifted their price objective on Alphabet from $170.00 to $178.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. StockNews.com upgraded Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Finally, JMP Securities lifted their price objective on Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a report on Wednesday, January 31st. Five equities research analysts have rated the stock with a hold rating, twenty-six have issued  a buy rating and two have given a strong buy rating to the company. Based on data from MarketBeat.com, the stock  has an average rating of “Moderate Buy” and a consensus price target of $155.48. Get Our Latest Report on Alphabet In other news, CEO Sundar Pichai sold 22,500 shares of the company’s stock in a transaction dated Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total transaction of $3,152,475.00. Following the completion of the sale, the chief executive officer now owns 2,422,691 shares in the company, valued at approximately $339,443,236.01. The transaction was disclosed in a filing with the SEC, which is accessible through this hyperlink. In related news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction that occurred on Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total transaction of $3,152,475.00. Following the completion of the sale, the chief executive officer now owns 2,422,691 shares in the company, valued at approximately $339,443,236.01. The sale was disclosed in a filing with the SEC, which is available through the SEC website. Also, CAO Amie Thuener O’toole sold 425 shares of the stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the sale, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. In the last quarter, insiders sold 279,659 shares of company stock worth $39,460,310. 0.88% of the stock is owned by corporate insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Alphabet Inc. (NASDAQ:GOOGL) is Thompson Investment Management Inc.’s 2nd Largest Position Fort Washington Investment Advisors Inc. OH Has $50.99 Million Stock Position in JPMorgan Chase & Co. (NYSE:JPM) "
}