{
    "title": "Google CEO Sundar Pichai Criticized for Lack of ‘Visionary Leadership’ and \nBeing Part of ‘Boring Management’",
    "date": "1/24/2024",
    "url": "https://americankahani.com/business/google-ceo-sundar-pichai-criticized-for-lack-of-visionary-leadership-and-being-part-of-boring-management/",
    "text": "  Google employees are criticizing the company for its most recent round of layoffs, and are taking to social media to express their frustration, claiming that the “boring management” lacks “a visionary leader.” In a LinkedIn post, software engineer Diane Hirsh Theriault post a lengthy tirade on LinkedIn, blasting the company’s leadership. “From the C-suite to the SVPs to the VPs, they are all profoundly boring and glassy-eyed,” she wrote, reacting to news that the company was laying off several hundred people from its ad sales team. Last week, CEO Sundar Pichai told staffers to expect more layoffs this year, though it would not be at the same scale as last year’s. He has confirmed layoffs in its core engineering team and a hardware division “to remove layers to simplify execution and drive velocity in some areas.” the New York Post reported. In a memo shared with its employees on Jan. 18, which was reported by The Verge,  “the company referenced its belt-tightening plans” for this year. Among the company’s goals for this year are “improve company velocity, efficiency, and productivity, deliver durable cost savings, and deliver the world’s most advanced, safe, and responsible AI.”  The memo also mentioned boosting innovation through Google Cloud services and building “the most helpful personal computing platforms and devices,” The Verge said. As Business Insider noted, employees are also lamenting the lack of a “family” environment.  Last January, the tech giant said it was to lay off about 12,000 employees — the equivalent of 6% of its workforce — in a bid to cut costs and focus on high-priority areas such as artificial intelligence. Many foreigners of Indian origin have had the honor of being CEOs of the world's largest multinational companies. While Indian origin Sundar Pichai has got the honor of heading a giant company like Google, it is not without interest that he is being called the worst CEO in the… Meanwhile, on Jan. 18, the Alphabet Workers Union planned protests at five Google campuses across the country “push back against the bogus talking points that Google employs to rationalize decision-making,” Business Insider reported, citing a press release from the union. “The truth is that these layoffs cause chaos in our workplace, leaving us with increased workloads and widespread anxiety over which team will be the next to disappear overnight” added the statement. Last November, former Google employee Ian “Hixie” Hickinson criticized Pichai for displaying a lack of “visionary leadership” and disinterest in maintaining the ethos of Google that made it a successful company. He also stated that the employee morale at Google is at an all-time low and that therapists in the Bay Area would say that all Googlers are “unhappy” with the company. (Top photo, Sundar Pichai/Facebook) Get notified about exclusive stories every week!     Your email address will not be published. Save my name, email, and website in this browser for the next time I comment.  © 2020 American Kahani LLC. All rights reserved. Our site uses cookies. Learn more about our use of cookies: cookie policy Get notified about exclusive stories every week! "
}