{
    "title": "Alphabet (GOOGL) To Boost Google Maps With 3D View Update",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-boost-google-maps-155300117.html",
    "text": "Alphabet’s GOOGL Google is leaving no stone unturned to enhance its Android offerings, which have been one of the key growth drivers of the company. Alphabet’s shares have gained 56.2% in the past year compared with the Zacks Computer & Technology sector’s growth of 47.6%.The company’s growing efforts to bolster its Google Maps offerings on Android through new feature updates testifies to the aforesaid fact.In this regard, Alphabet is testing a 3D building display on Google Maps for mobile navigation and Android Auto.With this new launch, Google Maps will be able to display 3D buildings during navigation, offering 3D view and zooming-in features. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the latest move, Google added a new color palette feature to its Maps application. The feature uses a lighter green color for parks and nature, in contrast with the off-white roads. It also uses a white tone for street crossings, which now appear at more zoomed-out levels.Google also added some other features to its Maps application, including Immersive View for routes, detailed navigation and transit filters.Additionally, Alphabet’s update of Google Maps for Android Auto now allows users to save their parking location upon arrival, displaying it on the arrival screen and triggering a reminder the following day.Google is set to introduce additional features for its Maps application, which will allow users to delete place-related activity on Android and iOS, with location controls like Location History and Timeline status available.All the above-mentioned endeavors are expected to bolster the Google Services segment that accounts for the majority of GOOGL’s total revenues.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%. Alphabet’s growing efforts to boost its Google Maps offerings will enable it to compete well against its peers like Apple AAPL and Microsoft MSFT, which are also making concerted efforts to boost its Maps offerings.Apple is enjoying the growing momentum of its Apple Maps offerings.Notably, Apple introduced an offline navigation feature for its iPhone app suite, enhancing its comprehensive range of Maps services.Meanwhile, Microsoft is riding on the success of Bing Maps with new feature updates.Recently, Microsoft introduced live traffic reports for smartphone users via Bing Maps, providing notifications about accidents, suggested routes and departure times, either directly or through the Microsoft Start app. Currently, Alphabet carries a Zacks Rank #2 (Buy).Another top-ranked stock in the broader technology sector is Camtek CAMT, sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Camtek shares have returned 194.6% over the past year. The long-term earnings growth rate for CAMT is pegged at 12.26%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Camtek Ltd. (CAMT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}