{
    "title": "Alphabet (GOOGL) Ascends While Market Falls: Some Facts to Note",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-ascends-while-market-224518365.html",
    "text": "The latest trading session saw Alphabet (GOOGL) ending at $140.95, denoting a +1.52% adjustment from its last day's close. This change outpaced the S&P 500's 0.15% loss on the day. Elsewhere, the Dow lost 0.42%, while the tech-heavy Nasdaq added 0.09%. Heading into today, shares of the internet search leader had gained 4.16% over the past month, outpacing the Computer and Technology sector's gain of 1.19% and the S&P 500's gain of 3.5% in that time. Analysts and investors alike will be keeping a close eye on the performance of Alphabet in its upcoming earnings disclosure. On that day, Alphabet is projected to report earnings of $1.62 per share, which would represent year-over-year growth of 54.29%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $70.59 billion, up 11.83% from the year-ago period. It is also important to note the recent changes to analyst estimates for Alphabet. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability. Our research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system. The Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 1.29% increase. As of now, Alphabet holds a Zacks Rank of #3 (Hold). Looking at its valuation, Alphabet is holding a Forward P/E ratio of 20.59. This valuation marks a discount compared to its industry's average Forward P/E of 23.86. We can also see that GOOGL currently has a PEG ratio of 1.24. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. GOOGL's industry had an average PEG ratio of 1.99 as of yesterday's close. The Internet - Services industry is part of the Computer and Technology sector. This industry, currently bearing a Zacks Industry Rank of 36, finds itself in the top 15% echelons of all 250+ industries. The Zacks Industry Rank assesses the strength of our separate industry groups by calculating the average Zacks Rank of the individual stocks contained within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Remember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}