{
    "title": "Google-parent Alphabet's EU antitrust bill exceeds €8bn",
    "date": "1/11/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1038128/google-parent-alphabet-s-eu-antitrust-bill-exceeds-8bn-1038128.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence William kickstarted his career as a researcher and reporter for a global legal publication, covering everything from public law to M&A. Before moving to Proactive Investors, he worked as a reporter for a major fintech company with a focus on cryptocurrency and blockchain technology.\r\n\r\nHarking from Queensland, Australia, William obtained first-class honours in journalism and media from Birkbeck University before going on to complete an MA in creative and critical writing. Other jobs have... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 14:54 11 Jan 2024 GMT Google parent Alphabet Inc (NASDAQ:GOOG) may have to stump up nearly €2.5 million in antitrust fines handed out by the European Commission over its anticompetitive shopping practices. In 2017, the Commission determined that the results of product searches made using Google’s general search engine were positioned and displayed in a more eye-catching manner when the results came from Google’s own comparison shopping service than when they came from competing comparison shopping services. Moreover, competing results were displayed as generic blue links and were prone to being demoted by adjustment algorithms in Google’s general results pages. Alphabet has vigorously contested the accusations, but Juliane Kokott, Advocate General at the Court of Justice of the European Union (CJEU), has advised judges to confirm the fine in a ruling due in the coming months. \"Google, as found by the Commission and confirmed by the General Court, was leveraging its dominant position on the market for general search services to favour its own comparison shopping service by favouring the display of its results,\" she said. Google has racked up more than €8 billion (£6.7 billion) worth of European antitrust fines in the past seven years under the bloc’s hawkish approach to anti-competitive practices. These include: The European Commission fined Google €2.42 billion in June 2017 for abusing its dominance as a search engine by promoting its own comparison shopping service at the expense of competitors. Google was required to stop its anti-competitive practices and offer equal treatment to rival comparison shopping services. In July 2018, the European Commission fined Google €4.34 billion for imposing illegal restrictions on Android device manufacturers and mobile network operators to strengthen its dominance in general internet search. Google was ordered to cease these practices. In March 2019, Google was fined €1.49 billion by the European Commission for abusing its dominant position in online advertising with its AdSense platform. The company was accused of preventing third-party websites from displaying rival search ads. In June 2020, the European Commission opened a formal antitrust investigation into Google's online advertising practices, specifically focusing on the company's display advertising business. The case is ongoing. Sign up to receive alerts and news direct to your inbox Oriole Resources PLC (AIM:ORR) CEO Tim Livesey and chief financial officer Bob Smeeton join Proactive's Stephen Gunnion with details of the company's 2023 financial and operational performance.\r\n\r\nLivesey highlighted successful exploration programs in Cameroon, at the Bibemi and Mbe projects,... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}