{
    "title": "What to expect from Alphabet's Q4 results",
    "date": "1/23/2024",
    "url": "https://www.ig.com/en-ch/news-and-trade-ideas/alphabet--goog-_s-share-price--what-to-expect-for-q4-2023-result-240124",
    "text": "CFDs are leveraged products. CFD trading may not be suitable for everyone and can result in losses that exceed your deposits, so please consider our Risk Disclosure Notice and ensure that you fully understand the risks involved. \n CFDs are leveraged products. CFD trading may not be suitable for everyone and can result in losses that exceed your deposits, so please consider our Risk Disclosure Notice and ensure that you fully understand the risks involved. WHY IG BANK? GET TO KNOW US TRADING THE FINANCIAL MARKETS IMPORTANT INFO KEY MARKETS MORE OPPORTUNITIES EXTENDED HOURS OUR PLATFORM AND FEATURES THIRD-PARTY PLATFORMS START EXPLORING NEWS AND ANALYSIS LEARN TO TRADE View more search results Get the latest insights on Alphabet's anticipated Q4 2024 financial results, highlighting potential double-digit growth in Google cloud and services, the impact of generative AI on products. Alphabet Inc is set to release its fourth quarter (Q4) financial results on Wednesday, 31 January at 8am AEDT, after the market closes. For Alphabet’s upcoming results, expectations are for a broad recovery on all fronts. Double-digit growth in both its key segments (Google cloud and Google services) are expected to power a 12.1% year-on-year (YoY) growth in overall revenue to US$85.3 billion. Likewise, its 4Q 2023 earnings per share (EPS) is expected to improve to US$1.59 from previous quarter’s US$1.55, which will extend its streak of positive YoY EPS growth to the third straight quarter. Advertisement revenue accounts for 78% of Alphabet's top line. Having reverted to positive YoY growth over the past two quarters, the recovery momentum for this segment is expected to continue with a stronger 11.6% growth in Q4 2023, up from 9.5% in Q3 2023. Increasing views of a US soft landing and further clarity on the peak in the Federal Reserve (Fed)'s hiking cycle in Q4 2023 may see business confidence return, potentially accelerating ad spending. Back in Q3 2023, Alphabet's management noted some 'stabilisation' in advertising spend, setting the tone for better times ahead.  With the ongoing traction towards generative artificial intelligence (AI), Alphabet has previously incorporated AI-powered solutions like Search and Performance Max to help customers increase their ads' return on investment (ROI). This may allow Alphabet to maintain its edge over the broader advertising industry. Further integration of Bard with Google apps and services is also in the pipeline. However, it's a race against time against Microsoft, who has been a first mover with its ChatGPT. Microsoft's CoPilot feature, integrating AI into its office applications, poses a threat to Alphabet's cloud-based products, including Google Sheets and Google Docs. Meanwhile, further developments of Microsoft's search engine Bing could continue to vie for Google’s market share. The race to unlock synergies of generative AI in product offerings remains tight, with any progress of new features closely monitored at the upcoming earnings call. In the Q3 2023 results, Alphabet topped both revenue and EPS estimates, but its share price plunged as much as 10% in a single day due to a miss in its cloud revenue. This highlights the importance market participants place on this segment as Alphabet's key growth driver, amid the rising trend of generative AI, which should translate to growing demand for public cloud services. Any lack of growth momentum could mean losing market share to Amazon Web Services (AWS) and Microsoft Azure, the other frontrunners in the highly competitive cloud computing space. A significant miss in this segment could singlehandedly drag the stock price down, given the heavy investments in its cloud unit and the high expectations for its growth.  YouTube Shorts, Alphabet's short-form video feature as a response to competitor TikTok, has been performing well. In the Q3 2023 results, it reported 70 billion daily views, a significant increase from the 50 billion daily views at the beginning of 2023. Focus will be on whether the solid momentum in both YouTube's ads and subscription businesses from Q3 2023 can be mirrored in the upcoming results.  Alphabet’s share price has been trading on a series of higher highs and higher lows since the start of 2023, fitting into a broad ascending channel pattern. Trading above its Ichimoku cloud on the daily chart, along with various moving averages (MAs) (100-day, 200-day), validates the overall upward trend. On the weekly chart, its weekly relative strength index (RSI) has been trading above its key 50 level since March 2023, briefly retesting the key level in October 2023, which saw some defending from buyers. Buyers may aim for a potential retest of its all-time high at the US$152.00 level, with current prices standing just 3% away from the target. On the downside, immediate support to defend may be at the US$142.50 level. A stronger area of support confluence may be found at the US$132.40 level, where the lower channel trendline coincides with the lower edge of its Ichimoku cloud on the daily chart. The information on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG Bank S.A. accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. See full non-independent research disclaimer. Go long or short on thousands of international stocks with CFDs. Try a risk-free trade in your demo account, and see whether you’re on to something. Don’t miss your chance – upgrade to a live account to take advantage. Don’t miss your chance. Log in to take your position. See more forex live prices See more shares live prices See more indices live prices Prices above are subject to our  website terms and agreements. Prices are indicative only. All shares prices are delayed by at least 15 mins. Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Indices Forex Commodities Shares Our charges Premium services Institutional clients Web platform Trading apps Advanced platforms Compare features News and trade ideas Trading strategy New client: +41 58 810 77 42 Clients: +41 58 810 77 02 Corporate governance WhatsApp: Click here IG | Sitemap | Terms and agreements | Privacy | Cookies | About IG Follow us online: CFDs are leveraged products. CFD trading may not be suitable for everyone and can result in losses that exceed your deposits, so please consider our Risk Disclosure Notice and ensure that you fully understand the risks involved. This website is owned and operated by IG Bank S.A. Registered address at 42 Rue du Rhone, 1204 Geneva, authorised and regulated by FINMA. The information on this site is not directed at residents of the United States and Belgium, or any particular country outside Switzerland and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. TOP PARTNER IG Group | Careers "
}