{
    "title": "Insider Selling: Alphabet Inc. (NASDAQ:GOOGL) CEO Sells 22,500 Shares of \nStock",
    "date": "1/4/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-insider-buying-and-selling-2024-01-04/",
    "text": "Alphabet Inc. (NASDAQ:GOOGL - Get Free Report) CEO Sundar Pichai sold 22,500 shares of the business's stock in a transaction that occurred on Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total value of $3,152,475.00. Following the transaction, the chief executive officer now owns 2,422,691 shares of the company's stock, valued at $339,443,236.01. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at the SEC website. Sundar Pichai also recently made the following trade(s): On Wednesday, December 20th, Sundar Pichai sold 22,500 shares of Alphabet stock. The shares were sold at an average price of $141.43, for a total value of $3,182,175.00. Alphabet Stock Down 1.3 % GOOGL traded down $1.82 during midday trading on Thursday, hitting $137.10. The company had a trading volume of 15,246,066 shares, compared to its average volume of 20,798,566. Alphabet Inc. has a 52 week low of $84.86 and a 52 week high of $142.68. The company has a quick ratio of 2.01, a current ratio of 2.04 and a debt-to-equity ratio of 0.05. The company has a market capitalization of $1.72 trillion, a price-to-earnings ratio of 26.66, a PEG ratio of 1.23 and a beta of 1.05. The stock's 50 day moving average price is $134.05 and its 200 day moving average price is $131.29. Alphabet (NASDAQ:GOOGL - Get Free Report) last issued its quarterly earnings data on Tuesday, October 24th. The information services provider reported $1.55 earnings per share (EPS) for the quarter, beating analysts' consensus estimates of $1.45 by $0.10. The firm had revenue of $64.05 billion during the quarter, compared to analysts' expectations of $63.13 billion. Alphabet had a net margin of 22.46% and a return on equity of 25.24%. On average, research analysts anticipate that Alphabet Inc. will post 5.83 earnings per share for the current fiscal year. Institutional Inflows and Outflows A number of hedge funds have recently made changes to their positions in GOOGL. Vanguard Group Inc. raised its position in shares of Alphabet by 0.3% in the third quarter. Vanguard Group Inc. now owns 487,435,495 shares of the information services provider's stock valued at $63,785,809,000 after purchasing an additional 1,302,104 shares during the period. FMR LLC increased its holdings in shares of Alphabet by 5.6% in the 3rd quarter. FMR LLC now owns 227,317,469 shares of the information services provider's stock worth $29,746,764,000 after buying an additional 12,070,681 shares during the last quarter. State Street Corp increased its holdings in shares of Alphabet by 0.8% in the 2nd quarter. State Street Corp now owns 218,540,033 shares of the information services provider's stock worth $26,159,242,000 after buying an additional 1,666,205 shares during the last quarter. Moneta Group Investment Advisors LLC increased its holdings in shares of Alphabet by 111,197.8% in the 4th quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider's stock worth $15,036,178,000 after buying an additional 170,267,122 shares during the last quarter. Finally, Geode Capital Management LLC increased its holdings in shares of Alphabet by 2.3% in the 2nd quarter. Geode Capital Management LLC now owns 121,308,289 shares of the information services provider's stock worth $14,481,781,000 after buying an additional 2,731,671 shares during the last quarter. 35.08% of the stock is currently owned by institutional investors and hedge funds. Analyst Upgrades and Downgrades Several brokerages have issued reports on GOOGL. Piper Sandler boosted their target price on shares of Alphabet from $147.00 to $150.00 and gave the company an \"overweight\" rating in a research note on Wednesday, October 25th. Monness Crespi & Hardt downgraded shares of Alphabet from a \"buy\" rating to a \"neutral\" rating in a research note on Wednesday, October 25th. Morgan Stanley dropped their price target on shares of Alphabet from $155.00 to $150.00 and set an \"overweight\" rating on the stock in a research note on Wednesday, October 25th. Bank of America increased their target price on shares of Alphabet from $142.00 to $146.00 and gave the stock a \"buy\" rating in a research report on Wednesday, October 4th. Finally, Rosenblatt Securities increased their target price on shares of Alphabet from $163.00 to $174.00 and gave the stock a \"buy\" rating in a research report on Wednesday, October 25th. Five investment analysts have rated the stock with a hold rating, twenty-seven have given a buy rating and two have assigned a strong buy rating to the stock. Based on data from MarketBeat.com, the stock presently has an average rating of \"Moderate Buy\" and an average target price of $147.53. View Our Latest Research Report on AlphabetAlphabet Company Profile (Get Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, hardware, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.Further ReadingFive stocks we like better than AlphabetElection Stocks: How Elections Affect the Stock MarketIs American Airlines a good stock to buy? How to invest in blue chip stocksWhat is a growth stock mutual fund?Best of the list of Dividend Aristocrats: Build wealth with the aristocrat indexIs Delta Air Lines stock a buy? This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Trump’s “Tax Free” Retirement Strategy  (From Gold Safe Exchange) (Ad)Should you invest $1,000 in Alphabet right now?Before you consider Alphabet, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list.While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 10 Best Cheap Stocks to Buy NowMarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat just released its list of 10 cheap stocks that have been overlooked by the market and may be seriously undervalued. Click the link below to see which companies made the list. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}