{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.indiatimes.com/worth/news/google-ceo-sundar-pichai-warns-about-more-tech-layoffs-625548.html",
    "text": "Its not been a happy beginning to new year 2024 for tech employees across the world. More than 7,500 employees have already been laid off this year in the first two weeks of January. And there doesn't seem to be any light at the end of this dark tunnel for employees, with Google CEO Sundar Pichai warning of more layoffs. Sundar Pichai Warns Of More Layoffs At Google/Reuters Google and its parent Alphabet's CEO Sundar Pichai has warned his employees to brace more layoffs. In an internal memo shared with Google employees on Wednesday, Pichai said “We have ambitious goals and will be investing in our big priorities this year. The reality is that to create the capacity for this investment, we have to make tough choices.” So far, those “tough choices” at Google have included not just layoffs but also reorganizations in the tech giant's hardware, search, shopping, ad sales, maps, policy, core engineering, and YouTube teams. “These role eliminations are not at the scale of last year’s reductions, and will not touch every team,” CEO Sundar Pichai wrote in the memo, as per a report by American technology news website TheVerge. Pichai added that he knows it’s very difficult to see colleagues and teams impacted. Pichai said this year's layoffs are about “removing layers to simplify execution and drive velocity in some areas. Many of these changes are already announced, though to be upfront, some teams will continue to make specific resource allocation decisions throughout the year where needed, and some roles may be impacted,” Pichai wrote in the memo. Also Read: Why Apple & Google CEOs Fight To Hire & Retain Two IITians Sundar Pichai's Big Paycut After 12,000 Google Layoffs/shutterstock In January 2023,, Google had announced layoff of about 12,000 of its employees. To help employees cope with the \"difficult news\" of layoffs, Pichai had allowed remote work. And a town hall meeting with Google employees a few days after the mass layoffs last year in January, CEO Sundar Pichai had said that all roles above the senior vice president level will see a significant reduction in their annual bonus. It is likely that Sundar Pichai himself also took a pay cut, as his compensation is linked to the company's performance, and his role (CEO) falls amongst the positions mentioned by him for pay cuts. Pichai had received $226 million in total compensation in 2022. Also Read: Why Netflix Once Rejected Amazon's $15 Million Offer To Buy The Streaming Giant More Than 7,500 Tech Employees Laid Off Already In 2024/shutterstock It has been a dreadful start for tech employees this year, with more than 7,500 pink slips already been handed over in January according to layoffs tracking website Layoffs.fyi.However, as per a Reuters report, the size of layoffs is expected to be smaller this year, compared to the thousands of mass layoffs done announced by Meta, Amazon,Google, Microsoft and many other tech giants last year. This year till date, Google and Amazon have already laid off hundreds of employees, besides US based proptech company FrontDesk, videogame provider Unity Software, social startup Discord, and Flipkart being among those who have already begun layoffs this year. For the latest and more interesting financial news, keep reading Indiatimes Worth. Click here. Get the NEWS that fits your groove. Subscribe to Indiatimes Newsletter and get handpicked updates based on your interests! Connect With Us On "
}