{
    "title": "Read the memo Sundar Pichai sent to staffers after Google Gemini fail",
    "date": "2/28/2024",
    "url": "https://www.businessinsider.com/google-gemini-bias-sundar-pichai-memo-2024-2",
    "text": "       Google CEO Sundar Pichai says the company got it wrong after its flagship AI system Gemini showed bias, which sparked backlash from some users. In a memo sent to employees, which Business Insider obtained, Pichai acknowledged the recent controversy over Gemini.Semafor first reported on the story. Pichai said in the memo: \"I want to address the recent issues with problematic text and image responses in the Gemini app (formerly Bard). I know that some of its responses have offended our users and shown bias — to be clear, that's completely unacceptable and we got it wrong.\" Related stories Google was forced to pause Gemini's image-generating feature after users complained it was generating historically inaccurate images of people of color. The chatbot also faced criticism for some of its written responses, including a widely shared example where the bot appeared to be unable to say if Elon Musk or Adolf Hitler was worse. When BI tested the prompt a few days later, Gemini said it was \"inaccurate and grossly inappropriate\" to compare Musk with Hitler. The controversy has caused some critics to claim that left-leaning workers have had a disproportionate influence on Google's culture, which can, in turn, play a role in how AI models are built. Tesla CEO Elon Musk has been especially vocal during the backlash, heavily criticizing the tech giant and using the drama to promote his own chatbot, Grok. Pichai appeared to acknowledge some of this criticism in the memo sent to staff. He said the company was driving a \"clear set of actions\" and would \"make the necessary changes.\" These actions include structural changes, updated product guidelines, improved launch processes, and technical recommendations, Pichai added.Representatives for Google did not immediately respond to a request for comment from Business Insider, made outside normal working hours. Read the full memo that Pichai sent to staffers: On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Read next Jump to "
}