{
    "title": "Nvidia Market Cap Passes Google Parent Alphabet, Now 3rd-Biggest in US",
    "date": "2/14/2024",
    "url": "https://markets.businessinsider.com/news/stocks/google-nvidia-stock-price-alphabet-amazon-tech-stocks-ai-semiconductors-2024-2",
    "text": "       Nvidia just overtook Alphabet to become the third most valuable company in the US. Nvidia's shares are up 3.64% in the past five days alone, giving it a market cap now equal to $1.83 trillion, Reuters reported on Tuesday. Alphabet, Google's parent company, has a market cap of $1.82 trillion. The chipmaker's valuation now trails behind only Microsoft and Apple. Nvidia has been on a tear for months, with its stock up 51% this year alone. Its market cap surpassed Amazon's as well on Monday for the first time since 2002, when both companies were in the doldrums of the dot-com crash. A big part of what's been propelling the chipmaker forward is the AI boom, which heralded a surge in demand for semiconductors. AI models need semiconductors that can run the cutting-edge tech, and Nvidia is one of the biggest players in the chip industry. The company's eye-watering ascent has raised its valuation to beyond that of China's stock market, and is even worth Spain's entire GDP, BofA has noted. AI hype has bled into other tech stocks too. ARM, another semiconductor company, blasted upwards by 81% in the last month, while the iShares Semiconductor ETF is also up 10% since mid-January. There could be even more upside to Nvidia's stock, some analysts say. Bank of America has forecasted the share price will hit $800, mainly because \"enterprise genAI adoption has yet to kick off.\" The stock is currently sitting at about $725. Meanwhile, other experts have compared the company's blockbuster gains to that of a dot-com era stock. Rob Arnott said the chipmaker is a \"textbook story of a Big Market Delusion\" — and when the bubble bursts, it will tip the dominoes for a wider market rout. Read next Indices Commodities Currencies Stocks Jump to "
}