{
    "title": "U.S. internet company market cap 2024",
    "date": "2/23/2024",
    "url": "https://www.statista.com/statistics/209331/largest-us-internet-companies-by-market-cap/",
    "text": "Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 100m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: Additional Information Show sources information\n                            \n                                Show publisher information\n                            \n                                Use Ask Statista Research Service February 2024 United States February 2024 Online Search Google: revenue distribution 2017-2023, by segment Brands & Leaders Largest advertisers in the U.S. 2022 Online Search Alphabet: global annual net income 2011-2023 Online Search Google: annual operating income 2013-2023 You only have access to basic statistics.  Business Solutions including all features.  Industry benchmark Financials Segments Google Lobbying Spotlight: artificial intelligence (AI) Further related statistics "
}