{
    "title": "Alphabet Inc CEO Sundar Pichai Sells 22,500 Shares",
    "date": "2/8/2024",
    "url": "https://finance.yahoo.com/news/alphabet-inc-ceo-sundar-pichai-071930957.html",
    "text": "Sundar Pichai, CEO of Alphabet Inc (NASDAQ:GOOG), executed a sale of 22,500 shares in the company on February 7, 2024, according to a recent SEC Filing. Alphabet Inc is a global technology company that specializes in internet-related services and products, which include online advertising technologies, a search engine, cloud computing, software, and hardware. Warning! GuruFocus has detected 5 Warning Signs with BLBD. Over the past year, the insider has sold a total of 90,000 shares and has not made any purchases of the company's stock. The insider transaction history for Alphabet Inc indicates a pattern of insider sales, with 51 insider sells recorded over the past year and no insider buys during the same period. On the date of the insider's recent transaction, shares of Alphabet Inc were trading at $146.29, resulting in a market capitalization of $1,821,698.17 billion. The company's price-earnings ratio stands at 25.38, which is above the industry median of 21.11 but below the historical median price-earnings ratio for Alphabet Inc. With the current share price at $146.29 and the GuruFocus Value at $147.96, the price-to-GF-Value ratio is 0.99, indicating that the stock is Fairly Valued in relation to its GF Value. The GF Value is calculated considering historical trading multiples, a GuruFocus adjustment factor based on the company's past performance, and future business performance estimates provided by Morningstar analysts. This article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein. This article first appeared on GuruFocus. Related Quotes "
}