{
    "title": "Google Acquisitions",
    "date": "2/4/2024",
    "url": "https://fourweekmba.com/google-acquisitions/",
    "text": "The Leading Source of Insights On Business Model Strategy & Tech Business Models The Leading Source of Insights On Business Model Strategy & Tech Business Models With 48 acquisitions in 2010 and 57 in 2011, Google was acquiring companies at a rate of around one per week over this two-year period around a decade ago. While that impressive rate has no doubt slowed in recent times, the total number of Google acquisitions has surpassed 250 with many of those vast companies in their own right. Who are some of the notable Google acquisitions? Let’s have a look below. Table of Contents Google acquired Motorola Mobility in 2011 for $12.5 billion and the purchase remains its largest today. The move was seen primarily as a way for Google to enhance the Android ecosystem and, according to CEO Larry Page, because Motorola was considered a “market leader in the home devices and video solutions business.” Post-acquisition, Google continued to run the company as a separate business and gained access to Motorola’s vast portfolio of 14,600 patents and 6,700 patents pending. It then sold the company for a loss to Chinese multinational tech company Lenovo in 2014. In January 2014, Google announced a $3.2 billion cash purchase of thermostat and smoke-alarm manufacturer Nest Labs. While some were initially puzzled as to the motivation behind the deal, others saw it as a way for Google to enter the homes of its users and use Nest’s technology in its own devices. As part of the acquisition, Google welcomed entrepreneur Tony Fadell, an ex-Apple employee who designed its famous iPod music player, and a host of other talented designers and engineers. Google acquired YouTube in 2006 for the sum of $1.65 billion which was considered exorbitant at the time. Today, however, the video platform is estimated to be worth around $180 billion and contributes around 11% of total company revenue. In fact, if YouTube was a standalone listed company, it would be worth more than Netflix, Twitter, Spotify, and Snapchat combined and be second only to Disney. Cybersecurity firm Mandiant is a more recent Google acquisition having only been completed in March 2022 for $5.4 billion. At the time of writing, Mandiant is Google’s second-largest acquisition. Mandiant joined Google’s cloud computing division primarily to enable the company to enhance its security operations suite and advisory services. This would enable Google to better address customer security concerns and compete with the likes of Azure and AWS. Google acquired data analytics startup Looker for $2.6 billion in 2020. Like the Mandiant purchase, Looker became absorbed into the Google Cloud platform where it would be used to support vendors utilizing a multi-cloud strategy. For Looker CEO Frank Bien, the benefits of Google’s involvement were immediately obvious: “Joining Google Cloud provides us better reach, strengthens our resources, and brings together some of the best minds in both analytics and cloud infrastructure to build an exciting path forward for our customers and partners.” Google completed the purchase of wearable fitness tech company Fitbit in January 2021 after first announcing it in November of 2019. The deal, worth around $2.1 billion, took some time to be finalized by the European Commission over concerns that it may have violated antitrust and data privacy laws. Google made several concessions to ensure the takeover was successful. Chief among which was a promise not to incorporate any GPS or health data into its targeted advertising. Google acquired the Israeli start-up Breezometer in September 2022 for an estimated $200-250 million. Breezometer monitors air quality based on data collected from AI and machine learning algorithms that are trained to recognize different pollutants. Before the acquisition, companies such as AstraZeneca, Dyson, and Bosch delivered air quality recommendations to customers via mobile apps, IoT devices, cars, and various other connected experiences. Breezometer’s tools also predict environmental hazards such as fires and elevated pollen levels. Some believe Google will incorporate Breezometer data into Google Maps and the Pixel 6 smartphone – two products to which it has recently added air pollution indicators. Google acquired the Seattle-based health tech start-up Sound Life Sciences in October 2022. The start-up, which developed an app to monitor breathing and was later spun out of the University of Washington (UW), was purchased for an undisclosed sum. Sound Life Sciences was founded in 2018 by computer scientist Shyam Gollakota and UW Medicine associate professor Jacob Sunshine. The app monitors breathing via sonar technology that detects movement and has benefits for those who suffer from sleep apnea, asthma, and congestive heart failure. It is unclear how Google will use the company’s tech, but Alphabet subsidiary Verily Life Sciences uses similar devices for patient care and has a JV in place with digital health company ResMed which also focuses on sleep apnea. Open Source Robotics Corporation (OSRC) is a taxable subsidiary of Open Robotics, a non-profit with the mission to support “the development, distribution and adoption of open source software for use in robotics research, education, and product development.” OSRC was founded in 2016 to increase collaboration within the industry, with fellow subsidiary Open Source Robotics Foundation (OSRF) contracted to provide simulation software for the DARPA Robotics Challenge and also for NASA’s Space Robotics challenge. Google subsidiary Intrinsic acquired OSRC and its Singapore entity OSRC-SG in December 2022. Intrinsic is a relatively recent graduate of Alphabet’s moonshot factory whose main objective is to democratize access to robots. In July 2021, Google acquired the Indian social commerce start-up Simsim. While the terms of the deal were undisclosed, TechCrunch reported that the deal valued the company at more than $70 million. Simsim helps small businesses develop an eCommerce presence via the power of video and creators. To that end, the company’s app of the same name serves as a platform where local businesses are connected with influencers and customers. The deal came at a time when YouTube decision-makers were exploring ways to expand into eCommerce, with a Simsim spokesperson also explaining that “Being a part of the YouTube and Google ecosystem furthers Simsim in its mission.” But after lackluster growth and a plan by Google to reduce its global workforce by around 12,000 employees, Simsim was shut down in March 2023. With the launch of ChatGPT in November 2022, the AI market has moved at an exponential rate. ChatGPT, developed by OpenAI, which sealed a partnership with Microsoft, put a substantial amount of pressure on Google. Indeed, Google invested $300 million in Antrhopic, an AI research lab founded by a former OpenAI member who focused on building AI conversational interfaces with built-in safety. Thus, Google is leveraging Anthropic’s technology to launch its own AI conversational tool. Read Next: Google Business Model, How Does Google Make Money Who Owns Google How Does Google Make Money Google Business Model Google Other Bets Google Cloud Business How Big Is Google? Google Traffic Acquisition Costs YouTube Business Model Google vs. Bing Google Profits Google Revenue Breakdown Google Advertising Revenue Apple vs. Google Google Employees Number Google Revenue Per Employee YouTube Ad Revenue Main Free Guides: Read next:   Copyright © 2024  FourWeekMBA Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}