{
    "title": "Alphabet's Earnings",
    "date": "2/9/2024",
    "url": "https://www.electronicsweekly.com/blogs/mannerisms/general-mannerisms/834789-2024-02/",
    "text": "By  David Manners \n9th February 2024  Alphabet had  Q4 revenue growth of 13% –  the second time in a row the company has reached double-digits in year-on-year growth since Q2 2022. Alphabet had  Q4 revenue growth of 13% –  the second time in a row the company has reached double-digits in year-on-year growth since Q2 2022. Alphabet saw increases in advertising revenue to $65.5 billion, up from $59 billion a year ago.  Cloud revenues had a 26% increase from the same time last year. This development is expected to continue in 2024, with Alphabet announcing its newest large language model Gemini in December and planning to license Gemini via Google Cloud. Alphabet also reported that 182,502 employees currently work there, marking a four percent decrease year-over-year following layoffs earlier in 2023. These layoffs also were responsible for a short-term hit to the company’s bottom line, with about $2.1 billion paid out in severance and other related compensation in 2023. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Ruminations on the electronics industry from David Manners, of Electronics Weekly. Get our news, blogs and comments straight to your inbox! Sign up for the Electronics Weekly newsletters: Mannerisms, Gadget Master and the Daily and Weekly roundups.  Find out more » Read our special supplement celebrating 60 years of Electronics Weekly and looking ahead to the future of the industry. Read the Electronics Weekly @ 60 supplement »\n\nRead the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it.\nRead the very first edition »  Read the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it. Read the very first edition » Keep up with developments relating to space technology - satellite technology, PNT, thermal imaging, SatIoT, spaceports and more View our busy aerospace section »  Image: ESA Read our special supplement celebrating 60 years of Electronics Weekly and looking ahead to the future of the industry. Read the Electronics Weekly @ 60 supplement »\n\nRead the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it.\nRead the very first edition »  Read the first ever Electronics Weekly online: 7th September 1960. We've scanned the very first edition so you can enjoy it. Read the very first edition » Keep up with developments relating to the Internet of Things (IoT) - Industrial IoT, sensors, Edge AI, battery technology, SatIoT and more View our popular Internet of Things section »  Image: ESA "
}