{
    "title": "Alphabet Inc (NASDAQ:$GOOG) Slides As AI Controversies Trigger Sell-Off",
    "date": "2/27/2024",
    "url": "https://www.analyticsinsight.net/alphabet-inc-nasdaqgoog-slides-as-ai-controversies-trigger-sell-off/",
    "text": "Analytics Insight SingularityNET (AGIX) and Ondo (ONDO) Whales Turn to KangaMoon (KANG) for 50x Pote0 Prepare for Blastoff: Dogecoin (DOGE), Floki (FLOKI), and KangaMoon (KANG) Poised for Meteoric Rise in the Meme Coin Space Best Meme Coins To Include in Your Portfolio This Year for Massive Potential Gains Reasons for Companies Shift Cloud from On Premise Softwares The 10 Most Influential Tech Leaders to Follow in 2024 Empowering Change: A Journey in Tech Leadership with Boitumelo Makgoba David Ellison: Pioneering the Future of AI The Top 10 Data Science Leaders   Google’s parent company, Alphabet Inc. (GOOG), had a tough Monday, the 26th of February, 2024, as investors reacted to the recent AI controversies the tech giant has been steeped in. Shares of the tech giant Google slumped 4.50% to close at $138.75. This sell-off occurred when the GOOG company was flooded by diverse criticisms concerning the new Gemini chatbot technology. The week before yesterday, the software was released with the restriction that it could not create samples of human faces, given that users only had negative photos generated with it. Google disclosed the existence of “inaccuracies in some historical depictions” in the depictions generated by the machine learning technology. Google sits at the top as one of the largest tech companies around the globe; it became one of the largest players globally when it was founded in 1998. Whether search process of billions of queries every day via its universal search engine or smartphones worldwide running on Android operating system, Google is everywhere! Over the last several years, Google has invested heavily in AI technology in general and has established itself to be a leading force in generative AI systems including chatbots. The malfunction of Gemini’s on the face generation raised suspicions that Google may fall behind its competitors in the timely implementation of AI programs. Microsoft-supported OpenAI that was responsible for GPT-3 used video-generator, which has made it clear that they are planning to provide web search service for Google. AI systems such as Gemini and ChatGPT from OpenAI can build natural-sounding texts, visuals (pictures, audio and video), as they very well work on text prompts. These put their logical conception to use through using enormous datasets and neural networks to generate top quality outputs without being programmed explicitly. Besides, these large language models can also an ignoramus perception and information lack of care in their training. Google omitted structural details on the timing of bringing Gemini back to the stream of producing humanlike images. Google launched Gemini Tech.  in December 2023 as competition heated up in generative AI. The recent suspension of some Gemini features deals with a setback to Google as it tries to showcase its progress. “Gemini headwinds but we believe Google is one of the core winners in AI revolution,” said Wedbush analyst Daniel Ives. Google has touted new advertising products powered by Gemini and plans to monetize AI via paid subscriptions. But the tech giant now faces tough questions on its AI safeguards. Meanwhile, Microsoft and OpenAI persist to aggressively court developers and users. This mounting pressure may have influenced Google’s decision to introduce Gemini before it was fully prepared rapidly. In addition to the Gemini concerns, Google’s stock price analysis chart reveals growing technical weakness. Its relative strength line has diminished considerably since its last earnings announcement, and institutional holders have been decreasing their shareholdings as well, which might be a warning sign.  GOOGL Stock 1day Price Chart: TradingView  With the stock approaching the 30 Relative Strength Index (RSI) range, a strong indication of an oversold condition, Google must reclaim this key support level soon. Otherwise, it risks further downside ahead. Uncertainty persists around Google’s AI capabilities and strategy as investors are most likely to closely monitor how quickly and effectively it addresses the recent Gemini issues. Successfully navigating the ethically complex AI landscape could determine Google’s long-term dominance.  Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here. Analytics Insight® is an influential platform dedicated to insights, trends, and opinion from the world of data-driven technologies. It monitors developments, recognition, and achievements made by Artificial Intelligence, Big Data and Analytics companies across the globe. Disclaimer: Any financial and crypto market information given on Analytics Insight is written for informational purpose only and is not an investment advice. Conduct your own research by contacting financial experts before making any investment decisions, more information here. "
}