{
    "title": "Alphabet And Mueller Industries Are Balance-Sheet Powerhouses",
    "date": "2/12/2024",
    "url": "https://www.forbes.com/sites/johndorfman/2024/02/12/alphabet-and-mueller-industries-are-balance-sheet-powerhouses/",
    "text": "Replica of a dinosaur skeleton at the Googleplex, headquarters of Google Inc. Google is only one of ... [+] several units that make up Alphabet Inc.  (Photo via Smith Collection/Gado/Getty Images). Many investors see only half the picture. They are like a baseball scout who looks only for hitting ability, not fielding. They focus obsessively on a company’s income statement (profit and loss), mostly ignoring the balance sheet (assets and liabilities). I believe the balance sheet is important, particularly now that we have exited a long period of ridiculously low interest rates. The costs of carrying a lot of debt – increased risk of bankruptcy and decreased strategic flexibility – have risen. Once a year, I compile a list of Balance Sheet Powerhouses, companies that are rich in assets and don’t have much debt. To make my Balance Sheet Powerhouses list, a company must: · Have a market value of $5 billion or more. · Have debt no more than 10% of the company’s net worth. · Be based in the United States. · Have a current ratio (current assets divided by current liabilities) of 2.0 or more. · Have positive earnings of 20 cents per share or more. This year, 41 companies make the list, but many of their stocks are too expensive for my taste. I recommend three of them, starting with Mueller Industries\nMLI\n Inc. . Mueller is new to this list because it only recently became large enough to qualify. When I think of Mueller, I think first of refrigerator coils, one of the products for which they are best known. But it also makes a variety of other copper, brass, aluminum and plastic products. Mueller’s debt is a mere 2% of the company’s net worth. While many of the Powerhouse stocks sell for 25 to 50 times earnings, Mueller trades at only 13 times earnings. Its ten-year earnings growth rate is a highly creditable 23%. T. Rowe Price Group Inc. (TROW), based in Baltimore, is one of the larger U.S. mutual-fund companies. Its stock has lost ground in recent years, as people flocked to index funds and ETFs, rather than the mutual funds T. Rowe Price is best known for. Call me Quixotic, but I believe that active fund management will come back to prominence in the next two to three years. In my view, the market can’t and won’t stay forever dominated by a few big growth stocks, the so-called Magnificent Seven. I expect old-fashioned stock picking to make a comeback. More expensive is Alphabet Inc. (GOOGL), at 26 times earnings. I rarely pay that much, but I regard Alphabet as the most innovative company in the United States. It owns the Google\nGOOG\n search engine, You Tube video service, Waymo self-driving cars, and Deep Mind, which deals in artificial intelligence. Over the past ten years, Alphabet has increased its sales 20% a year and earnings at almost a 22% clip. The company has made the Powerhouse list 11 times. Those are all my recommendations today, but I also want to honor several companies that have been on the Balance Sheet Powerhouse list five times or more, Dolby Laboratories\nDLB\n Inc. has been on the Powerhouse list 13 times, more than any other company. Based in San Francisco, it makes audio and surround sound equipment for homes, cars, and theatres. The stock is on the expensive side, at 41 times recent earnings. Gentex\nGNTX\n Corp., best known for making car rearview mirrors, makes this list for a 12th time. Eleven-time honorees are Alphabet and SEI\nSEI\n Investments Co., an investment consultant. The only ten-time winner this year is Intuitive Surgical\nISRG\n Inc., which makes surgical instruments. On the honor roll for an eighth time are Arista Networks\nANET\n Inc. and Cognizant Technology Solutions Corp. (CTSH). Monster Beverage Co. (MNST) is in for a seventh time. Six-timers are Epam Systems Inc. (EPAM), First Solar\nFSLR\n Inc., and Veeva Systems (VEEV). Five times: Exelixis\nEXEL\n Inc. and Vertex Pharmaceuticals\nVRTX\n Inc. Prior to today, I’ve compiled the Balance Sheet Powerhouse list 19 times, starting in 2001. Each year, I find from one to five stocks on the list to recommend. The average one-year return on my Powerhouse recommendations has been 13.2%, which compares favorably with 10.3% for the Standard & Poor’s 500 Total Return Index. Bear in mind that my column results are hypothetical and shouldn’t be confused with results I obtain for clients. Also, past performance doesn’t predict the future. Twelve of the 19 columns showed a profit, but only eight beat the index. My picks a year ago, however, fared terribly. They were down 25.6% while the S&P returned 23.5%. The worst performer was Moderna\nMRNA\n Inc. (MRNA), which fell 49%. Disclosure: I own Alphabet and Arista Networks personally and for most of my clients. I own Moderna for some clients.  "
}