{
    "title": "Who Is Larry Page?",
    "date": "2/1/2024",
    "url": "https://fourweekmba.com/larry-page/",
    "text": "The Leading Source of Insights On Business Model Strategy & Tech Business Models The Leading Source of Insights On Business Model Strategy & Tech Business Models Larry Page is an American entrepreneur, computer scientist, and business magnate who co-founded Google with Sergey Brin in 1998 and, to these days, is the main shareholder with Brin. Page showed an early interest in computers and technology and went on to study computer engineering at the University of Michigan. After completing his undergraduate degree with honors, he then pursued a Ph.D. in computer science at Stanford University. Table of Contents At Stanford, Page selected human-computer interaction pioneer Terry Winograd as his advisor. He considered around 10 ideas for his dissertation but found himself attracted to the emergent World Wide Web. While many others were interested in the Web for its ability to make them rich, Page was more interested in its mathematical characteristics. With each computer a node and each link on a Web page a connector of nodes, Page theorized that the Web was the largest graph ever created and was growing at breakneck speed. During his research, Page discovered that while it was trivial to follow links from one page to another, it was less trivial to follow the links back. That is, when he looked at a page, he had no idea what pages linked back to it. This bothered Page for some reason and he believed it would be useful information to know. He then launched a project called BackRub based on academic citations and their ability to build on previous knowledge, emphasize important information, and increase credibility. Page first met Brin in the summer of 1995 while the latter was a second-year grad student. Larry believed Sergey to be arrogant, while Sergey thought Larry was obnoxious. But the two would later share a mutual love of backlinks and their arguments enabled them to bounce innovative ideas off each other. Page had come up with the idea of weighted rankings, but he needed a math prodigy like Brin to help him crawl the Web and determine its link structure. Working in tandem, they created a system that rewarded links from important sources and penalized those that were not. Their breakthrough came with the development of PageRank, an algorithm that considered the number of links to a site and the number of links to each of those linking sites. As they tinkered with the data, the pair realized their work may have implications for the way people search for information on the internet. In fact, Page later noted that their results were better than those produced by AltaVista and Excite: “They were only looking at text and not considering this other signal”, he once recalled. Realizing PageRank could scale as the internet grew in size, Page and Brin named the new engine Google after the term googol – or the numeral 1 followed by 100 zeroes. Google was incorporated as a company in 1998 with Page initially serving as CEO. He stepped down from CEO in 2001 and was replaced by Eric Schmidt, but Page nevertheless remained involved with Google’s product development and strategic direction. He also played a key role in Google Maps and Google Books. When Google held an IPO in 2004, he became a billionaire at the age of 30. In April 2011, Page returned to the CEO role at Google and replaced Schmidt who became executive chairman of Google’s board. His return to the CEO role was marked by a renewed focus on innovation and a willingness to take risks on new products and technologies. Page also instituted CEO-like managers at the top of the company’s most important divisions such as Google Search, YouTube, and AdWords. Early in his second tenure as CEO, Page responded to the popularity of Facebook with Google’s own social platform Google+. He also announced that Google would acquire Motorola Mobilities for $12.5 billion to secure Android-related patents and protect it from lawsuits instigated by companies such as Apple. His “10x” mentality also became a key part of Google’s culture of innovation. Page is an EV advocate who has invested in Tesla and other renewable energy technology via Google.org. He has also backed Opener, a startup and developer of aerial transportation services for consumers. Page is also interested in the impact of AI and it can be used to create abundance in society. In other words, how it will shorten the workweek, provide for people’s needs, and reduce the negative impact of technological unemployment. Google Business Model Who Owns Google Google Other Bets Google Cloud Business How Big Is Google? Google Traffic Acquisition Costs How Does Google Make Money YouTube Business Model Google vs. Bing Google Profits Google Revenue Breakdown Google Advertising Revenue Apple vs. Google Google Employees Number Google Ad vs. Facebook Ad YouTube Ad Revenue Elon Musk Net Worth Warren Buffet Net Worth Jeff Bezos Net Worth Tim Cook Net Worth Bill Gates Net Worth Satya Nadella Net Worth Larry Page Net Worth Sergey Brin Net Worth Mark Zuckerberg Net Worth Eduardo Saverin Net Worth Larry Ellison Net Worth Howard Schultz Net Worth Daniel Ek Net Worth Lawrence “Larry” Page (born March 26, 1973) is an American computer scientist and Internet entrepreneur who, with Sergey Brin, is best known as the co-founder of Google. On April 4, 2011, he took on the role of chief executive officer of Google, replacing Eric Schmidt. As of 2012, his personal wealth is estimated to be $20.3 billion, ranking him #13 on the Forbes 400 list of richest Americans. He is the inventor of PageRank, which became the foundation of Google’s search ranking algorithm.  Copyright © 2024  FourWeekMBA Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}