{
    "title": "Google Stock May Be At A Crossroads (NASDAQ:GOOGL)",
    "date": "3/23/2024",
    "url": "https://seekingalpha.com/article/4680063-google-stock-may-be-at-a-crossroads",
    "text": "Yuri_Arcurs/E+ via Getty Images  Yuri_Arcurs/E+ via Getty Images My previous article on Alphabet Inc. (NASDAQ:GOOGL) (NASDAQ:GOOG) was published in December 2023. At the time, I pointed out that Google's launch of Gemini, a large language model for AI applications, challenges \"Microsoft's AI monopoly\" and could boost Google's projected EPS figures in the medium term. My \"Hold\" rating was influenced by the underwhelming (in my opinion) GCP and the stock's relatively high valuation. The thesis aged well, as the stock has underperformed the broad market by 490 basis points over the last 3 months: Seeking Alpha, the author's previous article on Google stock Seeking Alpha, the author's previous article on Google stock In addition to the new financial report for Q4 and FY2023, which Google managed to present after my last article, there were some other very important pieces of news that could determine the stock's future price action. I have therefore decided to update my thesis on the company today. In Q4 FY2023, Google showed a 15% YoY increase in consolidated net revenue ($72.3 billion), driven chiefly by an 11% rise in advertising revenue, totaling $65.5 billion (i.e. >90% of the total). This growth was driven by a 13% surge in Search advertising and a 16% uptick in YouTube ads (both YoY) mainly thanks to the strength of the retail sector. Google Cloud also showcased substantial improvement, reporting a 26% YoY revenue jump, while the Subscriptions Platforms & Devices segment also experienced a noteworthy 23% revenue growth. Thanks to the strong figures for the last quarter, the results for the year as a whole were also better than Wall Street analysts had expected. Google's 10-K, Seeking Alpha, the author's notes Google's 10-K, Seeking Alpha, the author's notes In Q4 FY2023, we also saw some operational efficiencies as the company reported a 37.11% increase in operating income to $24.9 billion, with an expanded operating margin of 28.85%. As a result, EBIT for the full year amounted to $88.2 billion, representing year-on-year growth of 8.3% and a margin expansion of 224 b.p. (from 26.46% to 28.7%), which is quite solid in my opinion. Google's diluted earnings per share amounted to $5.8 for FY2023, an increase of 27.2% compared to FY2022 and a logical continuation of the increase in EBIT. My old readers may remember my article last year about the layoffs at Google and their positive impact on the company's margins over time. In early 2024, the company decided not to stop there and in January announced further layoffs - this time at Google X (where space elevators, robotics projects, and the infamous self-driving car are being developed). Argus Research analysts noted in their recent research report (proprietary source) one interesting thing: Ruth Porat, Google's CFO, added chief investment officer (CIO) to her job titles last year, seemingly bringing spending on Alphabets \"moonshot\" projects under control. I agree with this opinion because as we can see from the dynamics of Google's margins, there have been significant improvements in corporate spending over the last 6 months. One of the biggest advantages of Google is its balance sheet, which has almost $111 billion in cash and investments. In the last 10 years, the company has had 0 periods with negative cash flow from operating activities (aka \"CFO\" - don't confuse with the CFO Ruth Porat). Instead, the CFO's CAGR was 16% (from 2014 to 2023), which is pretty solid. We also know that the share count has fallen by ~3% in the last 12 months, which completely offsets the lack of dividends, in my view. I do not doubt that Google will be able to continue to buy back its shares from the market, thereby supporting the stock price and rewarding shareholders this way. Moreover, if I were at the top of Alphabet, I would consider initiating quarterly dividend payouts - that would only increase Google's attractiveness to potential investors looking for income. But there are a few things that worry me a little (and we're not talking about the valuation of the company yet). First, the European Union's new regulation, the Digital Markets Act (DMA), came into force in March 2024. Simply put, the DMA \"describes what digital industry leaders — called gatekeepers by the DMA — can and cannot do, based on what is considered fair or unfair business practices.\" According to Barclays' recent study (proprietary source), it appears that Google is rolling out choice screens to all users (not just new phones). Alternative browsers (apart from Safari and Chrome) are becoming increasingly popular, so it can be assumed that Brave's download dynamics also apply to its peers. From Barclays' recent study (proprietary source) From Barclays' recent study (proprietary source) According to the analysts at Barclays, the impact is unlikely to be massive, but this brings with it a degree of uncertainty. Secondly, Gemini has become a real PR disaster for Google, as the authors of The Market Ear newsletter pointed out a few days ago (proprietary source). It’s hard to disagree because only the lazy haven’t discussed Google’s \"technological backwardness\" of ChatGPT. However, I don't think it's backwardness per se — I tend to agree with Shaun Maguire, a former partner at Google Ventures, who linked Gemini's failure to a culture that over-espouses DEI principles.  Google Gemini’s failures revealed how broken Google’s culture is in such a visually obvious way to the world. But what happened was not a one-off incident. It was a symptom of a larger cultural phenomenon that has been taking over the company for years. Source: Shaun Maguire's words, thefp.com This negative sentiment towards Gemini could hurt future growth in this area. Furthermore, Google's market share in search, although still over 90% of the total market, is slowly stagnating and this is likely to continue, in my view. BofA (proprietary source) BofA (proprietary source) But some things should be said very positively about Google (besides its strong financial profile). According to Bloomberg, Apple (AAPL) is in talks to use Google's Gemini for the iPhone's AI features. This news not only shows that Apple is not capable of handling the AI revolution on its own but is also a signal to Google shareholders (and the market in general) that Gemini might not be so bad from a technology perspective. In general, if I add up all the positive and negative aspects of the company's development, I find more positives. But what is going on with the valuation of GOOG? As far as I can see, Google's FCF yield of 3.61% makes the stock about 50% undervalued to an average \"Magnificent 7\" stock out there: YCharts, author's notes YCharts, author's notes But does the FCF yield of 3.62% look reasonable for Google stock? From a historical perspective, this rate is a little too low - in other words, the stock could be a bit overvalued right now. But compared to other mega-caps, this FCF yield looks far above average. So who should you believe? Let's make a simple DCF model to find out. Let's assume that the current consensus estimates for revenue growth rates are approximately accurate - moreover, Google's revenue will grow at a slight premium to today's consensus over the last 3 forecast years. I also expect Google to gradually reach an EBIT margin of 32% by 2026 and maintain this high mark until the end of the model forecast, despite the cyclical nature of its business. We also know from management's words that the company plans to spend more on CAPEX - this is logical for the time of existence against a backdrop of disruptive innovation in the industry. So this is what my initial inputs will look like: FinChat, author's notes FinChat, author's notes Having a cost of debt of 4%, a risk-free rate of 4.25%, and an industry-accepted MRP of 5%, we get a WACC of 9.4%. FinChat, author's notes FinChat, author's notes For the firm's terminal value, I suggest using 2 options at once: Gordon's \"g\" rate and the exit multiple of EV/FCF. In the first option, I assume that Google's business will grow at an annual growth rate of 5% (\"in perpetuity\"), and in the second option, I assume that GOOG's EV/FCF will be 25x at the end of the last forecast year. So given all these inputs, Google stock becomes roughly fairly valued as of today: FinChat, author's notes FinChat, author's notes For me, Google stock are at a crossroads. On the one hand, the company's financial situation continues to recover and has improved dramatically recently, giving more confidence that more buybacks are on the cards. On the other hand, I am concerned about the potential negative impact of new regulation in Europe, which could spread globally and potentially hurt Google's profit margins. There is also a risk that despite Apple’s choice, Gemini may indeed not be able to compete with other LLM models, which are growing by leaps and bounds worldwide. Google is becoming a cash cow, but the market is still paving the way for crazy corporate growth. Just look at BofA's chart - Google's key value multiples are expected to lose almost half their value by the end of 2026: BofA (proprietary source) BofA (proprietary source) The multiple contraction priced-in today looks crazy. But even if I take the relatively generous consensus estimates and do the math on Google's future, I get a price target comparable to today's, with no upside at all. Google really needs to show a qualitative improvement in competition with other AI rivals in order to move away from the current crossroads and get great (or at least sufficient) upside potential. As long as this is not the case, I remain neutral on the stock. So Google stock is a \"Hold\", in other words. Thanks for reading! Now you can get access to the latest and highest-quality analysis of recent Wall Street buying and selling ideas with just one subscription to Beyond the Wall Investing! There is a free trial and a special discount of 10% for you. Join us today! This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}