{
    "title": null,
    "date": "3/6/2024",
    "url": "https://seekingalpha.com/article/4675758-google-gemini-will-be-its-destruction-or-its-resurrection",
    "text": " Kenneth Cheung As an Alphabet (NASDAQ:GOOGL, GOOG) shareholder, I am disappointed at the Gemini debacle as it could have been completely avoided. The latest blunder out of GOOGL revolves around it's AI-powered chatbot Gemini providing incorrect depictions of historical and current events. Less than two weeks ago, live on Finance Junkies, Gemini was asked exact questions by co-hosts living in different states, and the results were completely different. This will either lead to Google's destruction as trust from the end user is lost or lead to its resurrection as GOOGL utilizes this moment to crush its competition. Personally, I think GOOGL trades at the most enticing valuation of the Magnificent Seven, and while I am still very bullish on its future, the recent events are concerning. Think about this for a moment, paintings of George Washington hang in the White House, and when you Google his name, countless pictures and biographies appear at the top of the search results. For the Gemini team to program Gemini in a way that does not provide accurate answers to questions when it utilizes the same subset of data as Google Search and for senior leadership to allow Gemini to be launched without fully testing its results is negligent. The bottom line is that there are alternative products to use rather than Google Search or Gemini; losing public trust could lead to Google's demise. All eyes will be on GOOGL as the ball is in their court. GOOGL will either rise like a phoenix from the ashes or allow its competitors to capitalize on this moment and control the narrative about how the results from GOOGL can't be trusted. I believe Google won't take this lying down, internal changes will be made, and it will dominate AI-enabled search. Seeking Alpha On November 9, I wrote my latest article about GOOGL (can be read here), where I discussed why it could be an opportunity as a catch-up play in the tech sector. I also discussed why I felt it could trade at the most enticing valuation in big tech. Since that article, shares of GOOGL have appreciated by 5.3%, which has significantly trailed the S&P 500 as it has appreciated by 18.17%. I am following up with a new article to discuss how the Gemini debacle could derail the investment case and why I am still investing in GOOGL. Seeking Alpha We're not even through Q1 of 2024, and GOOGL is being left in the dust by the S&P and the majority of big tech companies. Nvidia (NVDA) and Meta Platforms (META) are the frontrunners, having appreciated by 70.82% and 45.05%, while the SPDR S&P 500 ETF Trust (SPY) has gained 8.51%. GOOGL has declined by -0.75% after strong earnings, largely because of the Gemini debacle as shares have retraced by roughly -8% since February 9. On the surface, GOOGL's trend isn't enticing, and investors may look to other alternatives in big tech that have upward momentum rather than investing in GOOGL. We also have Apple's (AAPL) Worldwide Developer Conference coming in June, and with resources being diverted from the Apple Car project to generative AI this could end up being the go-to catch-up play rather than GOOGL. Seeking Alpha There is no way to sugarcoat this, the Gemini incident is a major misstep for Google. Technology has created a society that demands instant gratification. The days of having to walk or drive to a bank to deposit a check are long gone. You can download music instantly and watch your favorite movie or TV show with a few clicks of the remote, and depending on where you live, Amazon (AMZN) will deliver products the same day. Everything about society today is focused on ease of use and reducing friction. The services that win are the services that make life easier for the end users, as the focus on time has become the most important commodity. When users utilize Google Search, they expect accuracy and their desired information to be displayed in the top results. Google won the search wars by indexing the internet and providing a better product than its competitors. Today, GOOGL owns search with 91.62% of the global market. Google Chrome is also the top browser, with 65.31% of the market share. The recent Gemini incident has spilled over into mainstream media as many news publications, including The Economist, and prominent investors such as Brad Gerstner from Altimeter Capital are discussing the ramifications. Google's CEO Sundar Pichai has gone on the record calling Gemini's recent text and image responses \"completely unacceptable\" while saying that structural changes will occur. This could end up being nothing in the long run, or the turning point for Google as a company. This event could cause GOOGL to lose trust with its customers, and if trust is lost, then they will look to other search engines or chatbots to facilitate their needs. While Google It has become a verb, it doesn't have to stay that way. Corporate dynasties have come and gone, and with Microsoft (MSFT) and ChatGPT looking to capitalize on this moment, the sharks are circling as they smell blood in the water. The downfall won't happen overnight, but if Google doesn't do a Mea Culpa and quickly remedy the situation, Mr. Market may not care about its valuation, and shares could continue to sit out of the rally. Google Search & Other generated $175.03 billion of revenue in 2023, which is 73.59% of the revenue generated from Google advertising and 56.94% of its 2023 total revenue. The last thing GOOGL needs is its user base shrinking and advertisers redirecting their advertising dollars to META. Alphabet Google operates the two largest search engines in the world, which include Google Search and YouTube. GOOGL also has the third largest cloud service provider with Google Cloud, and controls the largest operating system across all platforms worldwide. Technology has become embedded in our lives, and that's never going away. The Android operating system has 43.74% of the global market share for operating systems across all platforms. When it comes to tablets, Android represents 45.23% of the market, while it represents 71.43% of the global smartphone market. GOOGL owns search with 91.62% of the global market, while Google Chrome is the top browser with 65.31% of the market. Google is far from a one-trick pony, and within its ecosystem, YouTube is a flourishing business that contributed $31.51 billion to its advertising revenue. From utility, to entertainment to advertising, Google has a moat that is hard to penetrate. My feeling is that the recent Gemini debacle may be what is needed for GOOGL to reprioritize its endeavors and out-deliver its competitors. Statcounter Google is basically operating a masterclass in business when looking at its financials. This is a company that has only $13.25 billion in long-term debt obligations and is producing $307.39 billion in total revenue. The company is sitting on $110.92 billion in cash and marketable securities on hand, with another $31 billion in non-marketable securities. Its total liquidity position exceeds $140 billion, which is more than 10x the debt on its balance sheet and around $21 billion more than its total liabilities. This is one of the cleanest balance sheets of any company in the market, and Google continues to generate massive profits. In 2023, GOOGL generated $307.39 billion in revenue and operated at a gross profit margin of 56.63% as its cost of revenue was $133.33 billion. After its operating expenses were factored in and its provision for income taxes, it generated $73.8 billion in net income, which is a 24% profit margin. Google produced $101.75 billion in cash from operations in 2023, and after its CapEx is factored in, its free cash flow (FCF) was $69.5 billion in 2023. This is a company that is producing cash hand over fist and beat its Q4 earnings estimates on the top and bottom line. Despite people looking at this as a slowing business, the Q4 consolidated revenues increased 13% YoY to $86 billion in revenue, while the 2023 top line grew 9% YoY from $282.84 billion. GOOGL's operating margin also increased from 26% to 27%, while its diluted EPS jumped from $4.56 to $5.80. This is a company that is hard not to get excited about as they are on the path to generating $100 billion in annualized profitability in the future while having a 12-digit war chest and is repurchasing shares at a rapid pace. In 2023 Google repurchased $62 billion of its Class A and Class C shares while ending the year with $110 billion in on-hand cash and marketable securities. Over the past three years, Google has allocated $171.07 billion toward buybacks and averaged $57.02 billion of buybacks on an annualized basis. While the current Gemini situation is a public relations nightmare and could hurt public trust if it isn't handled immediately, Google is too embedded in our lives for me to be too concerned at this point. It has the capital to innovate and fix the problem, and the real question is will they? While I plan on adding to my position, I will closely monitor what occurs over the next several quarters. Alphabet When you invest in a company, you're paying the current value for all of its future profits. The analyst community only sees GOOGL expanding its earnings capability over the next several years. When I look at Google from a valuation perspective, it looks dirt cheap compared to its peers in big tech. When I look at GOOGL and its peers from a forward price-to-earnings perspective, it looks drastically undervalued. GOOGL is trading at 20.26 times 2024 earnings, while the average company in its peer group of AMZN, AAPL, MSFT, META, Tesla (TSLA), and NVDA trades at 35.37 times 2024 earnings. Looking out to 2026, GOOGL trades at just 15.46 times its 2026 earnings, while the peer group average is 24.49 times 2026 earnings. GOOGL is expected to grow its EPS by 31.02% from the close of 2024 through 2026, which is not how Google is being valued. GOOGL is being valued as a low to no-growth company, and that isn't what the analysts are projecting. Steven Fiorillo, Seeking Alpha Seeking Alpha In addition to the EPS, I also like to see how companies are trading against their FCF. This is my favorite measure of profitability because it's harder to manipulate than net income, as it's simply cash in vs cash out. This also allows me to see how many years it would take to generate the entire market cap in profitability. Today, GOOGL trades at 24.64 times its FCF, while four of its peers trade at more than 30 times their FCF. MSFT generated $67.45 billion in FCF during 2023, which is -$2.05 billion less than GOOGL, yet the market has placed a 45.78 times multiple on its FCF. MSFT is also expected to grow its EPS by 33.76% over the next two years, which isn't that different from the 31.02% EPS growth projected for GOOGL. Something seems off as Google looks to be massively undervalued for the amount of growth it is projected to generate and its current profitability level. Steven Fiorillo, Seeking Alpha Despite the recent headlines about Gemini, I think shares of GOOGL are drastically undervalued, and this could be the best opportunity in big-tech. There are many risks to the investment thesis, but Google is too embedded in the global landscape for me to exit my position. I believe the company will make internal changes and emerge stronger than before. This could be exactly what Google needs to unlock its technological potential and become a gigantic problem for the competition. Today, GOOGL is trading at 20.26 times 2024 earnings and just 15.46 times 2026 earnings, which is well below its peers. I think Google will continue growing its top and bottom line while buying back $50 billion-plus worth of shares annually. I am planning on adding to my position, and if shares continue to fall, I will just buy more. The next several quarters will be interesting, and I am looking forward to the next earnings call to see how CEO Sundar Pichai and the executive team rectify the current debacle. If we find out that changes haven't been made and it looks like Google's business will start to erode due to lost trust, then I would have to rethink my position in this investment, but I don't think it will come to that. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL, AMZN, META, AAPL, TSLA either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Disclaimer: I am not an investment advisor or professional. This article is my own personal opinion and is not meant to be a recommendation of the purchase or sale of stock. The investments and strategies discussed within this article are solely my personal opinions and commentary on the subject. This article has been written for research and educational purposes only. Anything written in this article does not take into account the reader’s particular investment objectives, financial situation, needs, or personal circumstances and is not intended to be specific to you. Investors should conduct their own research before investing to see if the companies discussed in this article fit into their portfolio parameters. Just because something may be an enticing investment for myself or someone else, it may not be the correct investment for you. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}