{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) is San Luis Wealth Advisors LLC's 10th Largest \nPosition",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/alphabet-inc-nasdaqgoogl-is-san-luis-wealth-advisors-llcs-10th-largest-position.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 San Luis Wealth Advisors LLC decreased its holdings in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 0.4% in the fourth quarter, according to the company in its most recent 13F filing with the SEC. The fund owned 42,078 shares of the information services provider’s stock after selling 180 shares during the quarter. Alphabet accounts for approximately  2.5% of San Luis Wealth Advisors LLC’s holdings, making the stock its 10th biggest position. San Luis Wealth Advisors LLC’s holdings in Alphabet were worth $5,878,000 as of its most recent SEC filing. A number of other hedge funds have also bought and sold shares of GOOGL. Spreng Capital Management Inc. lifted its holdings in shares of  Alphabet by 4.0% during the first quarter. Spreng Capital Management Inc. now owns 131 shares of the information services provider’s stock worth $364,000 after purchasing an additional 5 shares during the period.  West Family Investments Inc. lifted its holdings in shares of  Alphabet by 0.3% during the first quarter. West Family Investments Inc. now owns 1,754 shares of the information services provider’s stock worth $4,878,000 after purchasing an additional 6 shares during the period.  Maple Capital Management Inc. lifted its holdings in shares of  Alphabet by 2.1% during the first quarter. Maple Capital Management Inc. now owns 296 shares of the information services provider’s stock worth $823,000 after purchasing an additional 6 shares during the period.  Private Advisory Group LLC lifted its holdings in  Alphabet by 1.8% in the first quarter. Private Advisory Group LLC now owns 401 shares of the information services provider’s stock valued at $1,115,000 after acquiring an additional 7 shares during the period.  Finally, Weik Capital Management lifted its holdings in  Alphabet by 0.5% in the first quarter. Weik Capital Management now owns 1,533 shares of the information services provider’s stock valued at $4,264,000 after acquiring an additional 8 shares during the period. Hedge funds and other institutional investors own  40.03% of the company’s stock. Shares of Alphabet stock opened at $150.93 on Friday. Alphabet Inc. has a 52 week low of $99.78 and a 52 week high of $153.78. The business’s fifty day simple moving average is $143.52 and its 200-day simple moving average is $138.12. The firm has a market cap of $1.88 trillion, a PE ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The firm had revenue of $86.31 billion for the quarter, compared to analyst estimates of $70.77 billion. During the same quarter in the prior year, the company earned $1.05 EPS.  Equities analysts forecast that  Alphabet Inc. will post 6.77 earnings per share for the current year. In related news, Director Frances Arnold sold 230 shares of the stock in a transaction dated Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total transaction of $35,433.80. Following the transaction, the director now owns 15,104 shares of the company’s stock, valued at approximately $2,326,922.24. The transaction was disclosed in a filing with the SEC, which is available through this hyperlink. In other Alphabet news, SVP Prabhakar Raghavan sold 16,088 shares of the company’s stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the sale, the senior vice president now owns 52,440 shares in the company, valued at approximately $7,294,404. The sale was disclosed in a document filed with the SEC, which is available through the SEC website. Also, Director Frances Arnold sold 230 shares of the company’s stock in a transaction dated Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total value of $35,433.80. Following the sale, the director now owns 15,104 shares in the company, valued at approximately $2,326,922.24. The disclosure for this sale can be found here. In the last 90 days, insiders have sold 251,138 shares of company stock valued at $35,427,655. Corporate insiders own  0.88% of the company’s stock. A number of brokerages have issued reports on GOOGL. Wedbush boosted their price target on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a report on Friday, March 22nd. Redburn Atlantic boosted their price objective on Alphabet from $150.00 to $165.00 and gave the company a “buy” rating in a research report on Wednesday, January 31st. KeyCorp boosted their price objective on Alphabet from $153.00 to $165.00 and gave the company an “overweight” rating in a research report on Monday, January 29th. Susquehanna boosted their price objective on Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a research report on Wednesday, January 31st. Finally, Mizuho boosted their price target on Alphabet from $155.00 to $170.00 and gave the stock a “buy” rating in a research report on Wednesday, January 17th. Five equities research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have assigned  a strong buy rating to the stock. Based on data from MarketBeat, the company  has a consensus rating of “Moderate Buy” and a consensus price target of $155.48. Check Out Our Latest Analysis on GOOGL (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Gemmer Asset Management LLC Acquires 96 Shares of JPMorgan Chase & Co. (NYSE:JPM) Monarch Capital Management Inc. Sells 270 Shares of Alphabet Inc. (NASDAQ:GOOGL) "
}