{
    "title": "Zacks Investment Ideas feature highlights: Microsoft, Alphabet, Nasdaq 100 \nETF and CBIZ",
    "date": "3/7/2024",
    "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-085000671.html",
    "text": "Chicago, IL – March 7, 2024 – Today, Zacks Investment Ideas feature highlights Microsoft MSFT, Alphabet GOOGL, Nasdaq 100 ETF QQQ and CBIZ CBZ. Many similarities exist between the internet boom of the late 1990s and the AI revolution that is taking place today, including blistering growth, soaring stock prices, and lots of hype. However, significant differences exist as well. For example, Wall Street and the biggest AI winners thus far are already proven companies with massive cash hoards and well-established businesses like Microsoft and Alphabet. At the same time, the AI buildout has buoyed the stock prices of these companies and led to robust earnings, it’s difficult to move the needle on a multi-trillion-dollar business like GOOGL or MSFT. Furthermore, many of these companies have broad and diverse businesses that stretch beyond AI. Several data points suggest that the AI boom is in its 1995 moment rather than its 1999 moment. For instance, stock valuations are relatively inexpensive (at least compared to 99’), and the Nasdaq 100 ETF is just now breaking out to all-time highs. Still, the most significant divergence between then and now is the IPO market. In 2023, there were 154 IPOs on the U.S. stock market. Conversely, in 1999, a staggering 473 IPOs went public. Quite the difference! IPOs, or Initial Public Offerings, serve as the lifeblood of the stock market by infusing it with new, publicly traded companies. These offerings provide opportunities for investors to buy shares in promising, often innovative enterprises, fostering market growth. In the late 1990s, the IPOs provided the most significant gains because many were agile, had blistering growth expectations, and were pure plays in the space. Obviously, investors cannot change the fact that there are few pure-play AI avenues on Wall Street. Presently, they can invest in the aforementioned dominant big tech juggernauts. Nevertheless, the best investors prepare for and study non-public companies ahead of time. They watch early-stage innovators early so that they fully understand the industry and can pounce when the opportunity comes. An example of an AI start-up worth watching is Propense.ai. Today, Propense.ai announced a successful seed funding round. The Miami-based company combines AI technology with data science, user psychology, human behavior, and industry insights to anticipate client needs. Propense.ai streamlines the sales experience for accounting and legal professionals by providing them with highly probable cross-selling recommendations for existing customers, making it the first platform of its kind to maximize revenue opportunities for professional services firms. In recent comments, Propense.ai CEO and Co-Founder Timothy Keith said, “The most successful professional service firms are actively engaged in adding service offerings to help their clients, but often struggle with educating their teams on when to offer new services. Propense.ai solves this challenge, elevating client satisfaction while also driving revenue. Behavior is one of the most difficult factors to change in the workplace, especially when sales professionals are expected to cross-sell services they don’t understand nearly as well as their core lines of business. That’s where Propense.ai and its revenue automation capabilities come into play. Using generative AI, accounting and legal professionals can propel new revenue by anticipating and supporting their client’s needs ahead of time.” The best ideas are ones that solve issues. Propense.ai is an example of a company that solves the issue of employee education while adding efficiency and revenue growth. Though the company is still young, it already counts public companies such as public consulting juggernaut CBIZ as clients. While the AI buildout is in motion, Wall Street and the AI industry have yet to experience the IPO frenzy that took place in the mid-to-late 1990s. Though many private AI start-ups still need to be bigger to enter public markets, I expect that will change in the coming years. In the interim, investors should take the time to investigate and study up-and-coming AI companies such as Propense.ai to educate themselves about the industry and prepare for the eventual influx of IPOs. These IPOs will likely provide the best opportunities because of their industry tailwind, high-growth potential, and asymmetric investment potential. Since 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year. Today you can access their live picks without cost or obligation. See Stocks Free >> Media Contact Zacks Investment Research 800-767-3771 ext. 9339 support@zacks.com https://www.zacks.com Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report CBIZ, Inc. (CBZ) : Free Stock Analysis Report Invesco QQQ (QQQ): ETF Research Reports Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}