{
    "title": "Is Alphabet Stock a Buy Now?",
    "date": "3/11/2024",
    "url": "https://www.fool.com/investing/2024/03/11/is-alphabet-stock-a-buy-now/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Alphabet (GOOGL 0.04%) (GOOG 0.21%) has long been a stock market winner. Shares have risen by 338% in the past 10 years. This performance outpaces both the S&P 500 and the Nasdaq Composite. But at a market cap of nearly $1.7 trillion, you might be wondering if this \"Magnificent Seven\" stock is a smart buy today. Here is why I think it is. One mark of a great business is its financial performance, particularly over several years. Here's where Alphabet absolutely shines. For starters, growth has been impressive. In the last decade, the company's revenue and diluted earnings per share (EPS) increased at compound annual rates of 18.7% and 19.6%, respectively. Tackling massive -- and expanding -- end markets, while benefiting from scale advantages, helps. And looking ahead, it's easy to be optimistic that the double-digit gains will continue. Wall Street analysts' consensus estimates predict revenue will rise at an annualized pace of 10.6% over the next three years, with diluted EPS growing at a 15.1% yearly clip. Alphabet's finances are in tip-top shape. In the last three years, the company produced a whopping $285 billion of cumulative operating cash flow. That figure alone exceeds the market caps of the majority of public companies out there.. With more money than it knows what to do with, Alphabet has consistently bought back stock, reducing the outstanding share count by roughly 10% in the past five years. As of Dec. 31, the company had a net cash position of $98 billion. This reduces financial risk by adding a huge buffer should economic conditions deteriorate. At the same time, Alphabet should still be able to invest aggressively in growth initiatives, while smaller rivals might have to play defense just to survive. Alphabet owns and operates some of the most widely used digital services on the face of the planet. CEO Sundar Pichai summed up this dominance when he commented in the Q2 2023 earnings press release: \"With fifteen products that each serve half a billion people, and six that serve over two billion each, we have so many opportunities to deliver on our mission.\" Of course, Google Search, which generated 56% of overall company revenue in the fourth quarter, remains Alphabet's crown jewel. It commands a 90%-plus share of the global search market, a figure that has remained steady even with the launch of ChatGPT in late 2022. There's also Chrome (web browser), Android (mobile operating system), and Gmail (email service). All of these lead their respective product categories on a worldwide stage. Besides those popular internet properties that make Alphabet a leading tech titan, there are other significant value drivers that can't be ignored. YouTube, which the company acquired for $1.7 billion in 2006, generated $31.5 billion in sales in 2023, making it arguably one of the most successful acquisitions in corporate history. According to data from Nielsen, YouTube attracts the most TV viewing time of any streaming service in the U.S. -- even more than Netflix. And it benefits from powerful network effects. Google Cloud posted revenue growth of 26% in 2023, and it reported four straight quarters of positive operating income. Because the cloud market is set to continue expanding at a rapid clip in the years ahead due to enterprise and government clients moving to off-premises IT infrastructure, this segment will be propelled by a powerful tailwind. And with Waymo, Alphabet also has a top player in autonomous driving software. The self-driving segment increases Alphabet's optionality, because it could pay off over the long term. Driven by Q4 financial results that the market wasn't happy with, shares of Alphabet have fallen 12% since Jan. 30 (as of March 7). And the stock is currently 13% below its peak price. But I view this as an opportunity. Shares are trading hands at a forward price-to-earnings ratio of 19.7. In my opinion, this looks like an absolute no-brainer buying decision for investors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Neil Patel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Netflix. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}