{
    "title": "5 Stocks Most Bought By Hedge Funds",
    "date": "3/4/2024",
    "url": "https://www.insidermonkey.com/blog/5-stocks-most-bought-by-hedge-funds-1268268/2",
    "text": "4. Alphabet Inc. (NASDAQ:GOOGL) Number of Hedge Fund Holders: 214 Alphabet Inc. (NASDAQ:GOOGL) are Class A shares that come with voting rights, allowing shareholders to have a say in corporate decisions during shareholder meetings. Alphabet Inc. (NASDAQ:GOOGL) is one of the most owned stocks by hedge funds. According to Insider Monkey’s fourth quarter database, 214 hedge funds were bullish on Alphabet Inc. (NASDAQ:GOOGL), compared to 221 funds in the last quarter. Madison Sustainable Equity Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOGL) in its fourth quarter 2023 investor letter: “Alphabet Inc. (NASDAQ:GOOG) was positive during the quarter but had a more modest gain in the fourth quarter following a strong third quarter and as a result, lagged the Technology sector more broadly. Alphabet’s third quarter included solid Search and YouTube results while Cloud growth was a bit softer, growing at 22% year-over-year. Google continues to incorporate AI in its core search businesses. It has been rolled out to a wide number of users across multiple geographies. We will continue to watch how Google adapts AI in its businesses and monitor cloud growth.” NASDAQ:AMZNNASDAQ:METANASDAQ:MSFTNASDAQ:NVDANASDAQ:GOOGLAlphabet Inc. (NASDAQ:GOOGL)Amazon.com Inc. (NASDAQ:AMZN)NVIDIA Corporation (NASDAQ:NVDA)Meta Platforms Inc. (NASDAQ:META)5 Stocks Most Bought By Hedge FundsMicrosoft Corporation (NASDAQ:MSFT)14 Stocks With Heavy Insider Buying In 202415 Best Stocks to Buy According to Billionaire D.E. ShawShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}