{
    "title": "Google Stock Forecast 2023",
    "date": "3/18/2024",
    "url": "https://crowdwisdom.live/us-stocks/google-stock-forecast-2023/",
    "text": "The Canadian government and Google have reached an agreement on the Online News Act, which mandates large internet companies to share advertising revenue with news publishers in Canada. Google, having initially threatened to remove news from its search platform in Canada, will now continue sharing Canadian news on its platforms. The agreement involves annual payments totaling 100 million Canadian dollars (US$73.7 million) from Google to support various news businesses, including independent operations and those from indigenous and minority communities. This ensures that Google will maintain links to Canadian news. Alphabet has bolstered its search capabilities with new tools for website owners. The new Profile Page markup tool allows creators to showcase their profiles in Google Search results, presenting details such as name, handle, photo, follower count, and content popularity. Another tool, Discussion Forum Posting markup, improves Google’s ability to identify and categorize online forum conversations, enhancing their visibility in search results. Additionally, Google has introduced reporting features in its Search Console to help site owners address issues and implement changes effectively. These enhancements aim to provide more accurate and comprehensive display of first-person perspectives in Google’s search results. Strong financials: Alphabet as a company has been highly profitable for most of the time. The company maintains a history of strong financial performance, with consistent revenue growth and high profit margins. Innovation and investment: Alphabet is known for its innovation and investment in new technologies and ventures. It has a number of ambitious projects in areas like AI, autonomous vehicles, healthcare, and renewable energy, which could provide future growth opportunities. Diversified revenue: Alphabet has a diversified business model. The company has a strong presence in advertising, cloud computing, and hardware. This diversification makes the company less reliant on any single product or service, which can reduce its exposure to risk. Strong leadership: Alphabet has a strong leadership team, including CEO Sundar Pichai, who has been credited with leading the company through a period of sustained growth and innovation. Tesla Stock Forecast 2023 Meta Stock Forecast 2023 Amazon Stock Forecast 2023 Apple Stock Forecast 2023 NVDA Stock Forecast 2023 Google Cloud – While Alphabet’s third-quarter results were lukewarm, there were few bright spots in the results. Google Cloud is the flag bearer from Alphabet in the red-hot cloud computing market. Google Cloud revenue has been rising at jaw-dropping levels. This year the revenue has already hit $19 billion, a 39% YoY growth rate. Google cloud revenue of $24.5 billion over the trailing 12 months has surpassed IBM’s $ 22.2 billion over the same time. The Cloud computing market is expected to grow from $405.7 billion in 2021 to $1.7 trillion by 2029 and has a CAGR of 20% over the next seven years. Google Cloud is already capturing this market and is ranked third among the cloud computing companies. Alphabet also acquired, cybersecurity firm Mandiant at $5.4 billion to strengthen Google Cloud’s security and identify threats and vulnerabilities. Although Google Cloud is not generating net positive income right now and has given a negative 10% return in the third quarter of 2022, it is growing its top line at a healthy rate and its path and its competitor Amazon Web Services is putting 30% profit margins, so there is no reason Google Cloud won’t get close to that. In 2023, Google Cloud is expected to continue the dream run and turn net positive income boosting Alphabet’s revenue and profitability. Value investors must keep valuations in sight – While the short-term pessimism is justified towards Alphabet Inc, investors should not be doubtful of its long-term value. The recent sell-off has proved to be an opportunity for long-term investors to enter afresh in Alphabet. On both price-to-earnings and price-to-free cash flow basis, Alphabet is trading towards the lower end of 10-year values. It is only trading at 17 times forward earnings basis 16 times price to free cash flow. Another strong point is that Alphabet is generating strong free cash flow to fuel business growth. It generated a free cash flow of $63 billion in the trailing 12 months. Google still has a firm grip on search engine domination- Google search contributes more than 50% of total revenue in each quarter.  Google Search has a virtual monopoly in the search engine market and according to an estimate, the engine has more than 90% market share in the majority of countries (except China). Every year not only a few hundred million people start using the internet, but the time spent by the existing users is also increasing. This means an opportunity for Google to show more ads and increase revenue. Unless something drastic changes in the search engine market, Google’s dominance should continue in 2023 and lead to constant growth in revenue. Pessimistic Ad Industry- Advertising is still Alphabet’s bread and butter and there is no denying that the growth from ads is falling. This is primarily because of inflation. When the cost of goods and services is rising, advertisers are being more careful about ad budget allocation. The more worrisome sign is that the contribution of the advertising business overall Alphabet’s revenue is almost 80% and when the ad industry is facing headwinds, there is no denying that Alphabet will also face the heat. In the latest quarter’s earnings, Google ad contributed $54.5 billion out of Alphabet’s $69.1 billion. Also, this segment saw only 2.5% growth YoY, the slowest in the last few quarters. Also, it was the first time YouTube ad sales declined in a quarter YoY since Alphabet started to report its revenue separately in 2019. YouTube’s revenue declined about 2% YoY. There is little doubt that it is facing stiff competition from ByteDance’s TikTok The impact of the advertising industry was seen on operating income also in the third quarter which dropped 19% YoY to $17.1 billion.  The operating margin was also 25%, down from 32% in the same quarter last year. Headwinds faced by Alphabet in the advertising business are not going to slow down any time soon. With the Fed increasing the interest rates in every meeting and recessing impending, 2023 can prove to be a very tough year for the advertising business and more so for Alphabet Inc. Lack of diversification from Alphabet Inc.– If we compare Alphabet Inc. with Apple Inc., investors are most likely to choose Apple Inc. in macro uncertain situations, because Apple has a more diversified business than Alphabet. While Apple generated 79% of its revenue from selling hardware like iPhones, and iPads and the remaining 21% from its Services businesses, Alphabet generated 79% from its advertising business and only 10% from its growing Google cloud business. Alphabet’s lack of diversification in other services and overdependence on advertising is hurting its top and bottom lines. Also, a stronger dollar is hurting Alphabet as more than 50% of revenue comes internationally. Keeping 2023 into perspective, the dollar is likely to remain at a much stronger level compared to other currencies and it may thwart the company’s revenue growth. Google has the highest P/S ratio of 4.0x when compared to Meta Platforms and Amazon, which are both search titans in their own right. Currently, Google is at a PE of 29.7 with an EPS of 4.7 which translates to a price of $139.59. Google is also anticipated to produce $5.43 in EPS during the fiscal year 2023, translating to a P/E ratio of 17.7 X. Depending on how harsh the upcoming recession can be, Google’s earnings are at risk. Due to those factors, Google’s stock may see short-term pressure and retest its most recent low of $83.45.Investors will be willing to pay a 13-14x P/E ratio for GOOG, which translates to a price range of $70-76 which is when the advertising demands would bottom out. This means that Google revenues will be at their lowest and the stock will be undervalued then and hence would be a great buy. This ratio compares a company’s share price to its earnings per share. This PE is at an all-time low for Google since 2015 which means that the company is undervalued right now. The forward PE of Google is around 18 which means that the company is going to get more undervalued in the coming times which can create a good buying price for the stock. It compares a company’s market value to its operating cash flow and the lower it is, the more undervalued a stock is. Looking at the historical ratio of Google in Price to cash flow, we can say that right now it is very low as compared to where it was in 2021 (19.3). It is used to compare a firm’s market capitalization to its book value. P/B ratios under 1 are the ones that attract most of the value investors. There is also some gap between ROE (26.89%) and this ratio for Google which is going in line with how both these ratios are coming down along with the price. This measure is used to determine the value of a company. The best use of this ratio happens when it is compared with the industry average. It values the company, debt included, to the company’s cash earnings less non-cash expenses. Here the IT sector has a ratio of 15 and Google is at 13.48 which means it is not exactly as undervalued as the price tells us. This percentage is used to check the company’s capital efficiency and profitability. It can simply be interpreted as a higher value means higher the company’s profitability. In this case, Google’s ROCE has kept on decreasing since 2021 but has not taken that major a hit. The company will have to maintain strong fundamentals in this environment and invest in artificial intelligence and machine learning skills so as to continue to maintain the finest position in the Internet industry. This brings us to the point that Google will be at its best price on the day when the advertising demands in the globe bottom out which will directly imply Google revenues bottoming out. This will bring out the best value of Google for investors. Right now, platforms like Meta, TikTok, and Twitch are gathering a lot of consumers’ attention which might bring a shift in where the advertising market will go in the coming future if Google remains stringent in bringing any improvisation in its own platform. However, because of the dominance of its search business and substantial cash holdings, the company continues to be wary of the uncertain macroeconomic times that will affect them and hence is trying to be ready to face them which makes Google a safe bet in the current scenario. Google has weathered major economic storms in the past like the 2000 dot com bubble or the 2008 financial crisis and has come out of it even stronger. Google Cloud is on the right track to contribute significantly in 2023 and so does the Google search engine. The balance sheet looks very strong with strong cash flows. 2023 can prove to be a neutral year for Alphabet at worst, but let us catch the big fish while it is still below $100. Note: Crowdwisdom360 collates Predictions and data from all over the net and has no in-house view on the likely trends in the Stocks or Crypto Coins. Please consult a registered investment advisor to guide you on your financial decisions. © Crowdwisdom360 2024 All rights reserved "
}