{
    "title": "Are Big Techs getting too big?",
    "date": "3/2/2024",
    "url": "https://www.thehindubusinessline.com/portfolio/are-big-techs-getting-too-big/article67908251.ece",
    "text": "Get businessline apps on Connect with us TO ENJOY ADDITIONAL BENEFITS Connect With Us Get BusinessLine apps on Comments READ LATER $174 billion – no, we are not referring to a major item in the annual Budget of a large economy, or the GDP of a mid-size country. This is the amount of capex to be incurred by just four — Microsoft, Meta Platforms (Facebook), Amazon and Alphabet (Google) — of the Magnificent Seven in a single year 2024, and is the highest ever by these companies. Capex of all the seven companies in 2024 is estimated at around $197 billion — a 22 per cent YoY increase. Within capex plans, their focus and priority will be on building and enhancing AI capabilities. Even after incurring this, they will remain cash rich. With cumulative estimated operating cash flows of over $600 billion in FY24, it is way more than sufficient to enable them to comfortably implement their gigantic capex plans. With a cumulative estimated 2024 revenue of nearly $2 trillion — more than 50 per cent of India’s GDP and bigger than the GDP of many other countries — their clout sometimes may be bigger than that of many nations. Further, unlike most countries that are in huge debt and run large deficits to make ends meet, the Magnificent Seven companies churn huge surpluses year after year. For example, $450 billion is the net profit they are expected to make in 2024 after meeting all expenses and paying taxes! This is more than the total receipts (excluding borrowings) forecast in India’s interim Budget for FY2025. There are two ways to look at this. If you are an investor in these companies, you can feel good. With such strong revenues, profits, cash flows and capabilities in technology including AI, they are structurally well positioned to continue dominating the tech landscape. But what about the rest in the ecosystem? Last week’s chaos stemming from Google removing some apps from its Play Store shows how many in the ecosystem may be at the mercy of what Big Techs decide. While what Google did may have been within the law, this should be a wake-up call on the enhanced clout they will have as they continue to get bigger. In a broader context, this should matter to countries, corporations and citizens across the world as few companies you can count on your fingers leapfrog ahead, while the rest are constrained by insufficient resources. Nvidia’s FY24 filings (ended January) indicate one customer (apparently a Magnificent Seven company) alone accounted for 19 per cent of its revenues. This customer had spent $11 billion on Nvidia GPUs to build its AI capabilities. Can other countries and governments invest on that scale to develop their own sovereign AI capabilities? Building AI capabilities and infrastructure involves spends of billions of dollars. And hard truth is that many countries and governments may not have the financial resources to build large internal capabilities. For example, the capex incurred by the Magnificent Seven companies in FY24 is nearly 50 per cent more than the entire FY25 capex outlay of the Indian government, per the interim Budget. Citizens, too, may not have much control how their private data is used. This is not to paint the Big Tech companies in any unfavourable colour, but just to point out how dominant they can become in an AI-dominated world which, though may take years to take shape, may not be too far away for comfort either. Software entrepreneur Sridhar Vembu, too, this week in a tweet warned how nations/states are increasingly powerless against Big Techs with the Top 5 giants bigger than most countries and growing bigger. While nothing to fear right now, the key question is: Are all stakeholders taking note? Comments BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Terms & conditions  |  Institutional Subscriber "
}