{
    "title": "‘Culture of Fear:’ Google Insiders Share Stories of Woke DEI Insanity \nRuining Company",
    "date": "3/5/2024",
    "url": "https://www.breitbart.com/tech/2024/03/05/culture-of-fear-google-insiders-share-stories-of-woke-dei-insanity-ruining-company/",
    "text": "Google, once a titan of innovation, now faces an existential crisis as a result of misguided priorities, lack of leadership, and a pervasive culture of fear driven by a DEI-obsessed HR department, according to insider accounts. PirateWires editor-in-chief Mike Solana reports that the recent failure of Google’s highly anticipated Gemini AI project has shed light on the company’s deeper systemic issues. Solana’s interviews with concerned employees from various teams, including management, engineering, sales, and marketing, have revealed a troubling portrait of a company in disarray. Breitbart News has reported extensively on the leftist brain rot that has festered within Google for many years, including exclusively reporting on “The Google Tapes,” an all-hands meeting held after the election of Donald Trump that features executives crying and promising to do a better job censoring conservatives in future elections. Google LGBT pride bus (AFP Contributor/Getty) A Google Inc. employee marches towards City Hall during the Global Climate Strike in Seattle, Washington. Photographer: Chloe Collyer/Bloomberg According to insiders, a profound lack of leadership and direction lies at the heart of Google’s problems. Despite being a $1.7 trillion company with over 150,000 employees and nearly 30,000 engineers, the company appears to be rudderless. Employees express uncertainty about who is truly in charge, with a strange dynamic between the founders, Larry Page and Sergey Brin, the board, and CEO Sundar Pichai leaving most employees confused about the company’s direction. This leadership vacuum has given rise to a “culture of fear” that permeates the entire organization. Employees at every level are afraid to challenge the processes and practices that have crippled the company’s ability to innovate. “I think it’s impossible to ship good products at Google,” said one senior engineer. Another major issue plaguing Google is the outsized influence of its sprawling HR bureaucracy, which is deeply obsessed with left-wing political dogma. From policing language to imposing bizarre pronoun expectations and forcing affinity groups to change their names, the HR department’s excessive focus on diversity, equity, and inclusion (DEI) initiatives has become a source of frustration for many employees. The Gemini disaster highlights the consequences of Google’s misguided priorities. The team responsible for the project was reportedly warned about its “overdiversification” problem, which led to the erasure of white people from human history, but the company’s thorough “diversity” mandates took precedence over product quality. According to insiders, up to half of the engineering hours were spent on DEI-related efforts, compromising the performance of the AI model. The divided nature of Google’s culture has also hindered cross-team collaboration and accountability. Employees describe a lack of communication and coordination between teams, leading to wasted resources and missed opportunities. Despite its vast resources, this dysfunctional environment has contributed to the company’s failure to win new product categories since Gmail, according to insiders. As Google faces the existential threat of losing its core search business to AI competitors, the need for a clear vision and strong leadership has become increasingly urgent. Some employees express hope that co-founder Sergey Brin might step up and provide the necessary guidance, but many still doubt that the company can overcome its entrenched cultural issues and regain its innovative edge. Read more at PirateWires here. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Please let us know if you're having issues with commenting.     Copyright © 2024 Breitbart "
}