{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/presidio-capital-management-llc-has-298000-holdings-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Presidio Capital Management LLC decreased its stake in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 10.0% in the 4th quarter, according to the company in its most recent filing with the Securities & Exchange Commission. The firm owned 2,135 shares of the information services provider’s stock after selling 238 shares during the quarter. Alphabet comprises approximately  0.2% of Presidio Capital Management LLC’s investment portfolio, making the stock its 29th largest holding. Presidio Capital Management LLC’s holdings in Alphabet were worth $298,000 as of its most recent SEC filing. Other large investors also recently modified their holdings of the company. DC Investments Management LLC acquired a new stake in shares of  Alphabet during the 1st quarter worth approximately $114,000.  Bridgefront Capital LLC bought a new position in shares of  Alphabet in the 1st quarter worth $225,000.  Worth Asset Management LLC bought a new position in shares of  Alphabet in the 1st quarter worth $206,000.  Eudaimonia Advisors LLC lifted its holdings in shares of  Alphabet by 15.1% in the 1st quarter. Eudaimonia Advisors LLC now owns 99 shares of the information services provider’s stock worth $275,000 after purchasing an additional 13 shares in the last quarter.  Finally, Aspire Capital Advisors LLC bought a new position in shares of  Alphabet in the 1st quarter worth $281,000. Institutional investors and hedge funds own  35.08% of the company’s stock. A number of equities analysts recently issued reports on the company. StockNews.com upgraded Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Rosenblatt Securities cut their target price on Alphabet from $174.00 to $172.00 and set a “buy” rating on the stock in a report on Wednesday, January 31st. Susquehanna increased their target price on Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a report on Wednesday, January 31st. Wells Fargo & Company raised their price objective on Alphabet from $141.00 to $144.00 and gave the company an “equal weight” rating in a research note on Monday, March 18th. Finally, BMO Capital Markets raised their price objective on Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a research note on Wednesday, January 31st. Five equities research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have issued  a strong buy rating to the company. According to data from MarketBeat.com, Alphabet currently has a consensus rating of “Moderate Buy” and a consensus price target of $155.48. Get Our Latest Stock Analysis on Alphabet In other news, CAO Amie Thuener O’toole sold 425 shares of Alphabet stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares in the company, valued at approximately $3,805,628.99. The sale was disclosed in a filing with the SEC, which is accessible through this hyperlink. In other news, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction dated Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total transaction of $3,152,475.00. Following the completion of the sale, the chief executive officer now owns 2,422,691 shares in the company, valued at approximately $339,443,236.01. The sale was disclosed in a filing with the SEC, which is accessible through this hyperlink. Also, CAO Amie Thuener O’toole sold 425 shares of the business’s stock in a transaction that occurred on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. In the last 90 days, insiders sold 279,659 shares of company stock worth $39,460,310. 0.88% of the stock is currently owned by insiders. GOOGL stock opened at $150.77 on Friday. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The firm has a market capitalization of $1.87 trillion, a PE ratio of 25.99, a PEG ratio of 1.39 and a beta of 1.04. Alphabet Inc. has a twelve month low of $99.74 and a twelve month high of $153.78. The stock has a 50-day simple moving average of $143.02 and a two-hundred day simple moving average of $137.79. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. The business had revenue of $86.31 billion during the quarter, compared to analyst estimates of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same quarter in the previous year, the firm earned $1.05 EPS.  On average, equities analysts predict that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Willis Johnson & Associates Inc. Has $306,000 Stock Holdings in The Southern Company (NYSE:SO) Morgan Stanley (NYSE:MS) Shares Sold by CX Institutional "
}