{
    "title": "Alphabet (NASDAQ:GOOGL) Trading Up 2.4% on Analyst Upgrade",
    "date": "3/22/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-percent-advance-2024-03-22/",
    "text": "Shares of Alphabet Inc. (NASDAQ:GOOGL - Get Free Report) rose 2.4% on Friday after Wedbush raised their price target on the stock from $160.00 to $175.00. Wedbush currently has an outperform rating on the stock. Alphabet traded as high as $151.51 and last traded at $151.18. Approximately 9,777,277 shares changed hands during mid-day trading, a decline of 69% from the average daily volume of 31,450,773 shares. The stock had previously closed at $147.60. A number of other equities research analysts also recently weighed in on GOOGL. Susquehanna raised their price objective on Alphabet from $150.00 to $170.00 and gave the company a \"positive\" rating in a research report on Wednesday, January 31st. Needham & Company LLC reaffirmed a \"buy\" rating and set a $160.00 price objective on shares of Alphabet in a research report on Wednesday, January 31st. Wolfe Research raised their price objective on Alphabet from $170.00 to $180.00 and gave the company an \"outperform\" rating in a research report on Wednesday, January 31st. Citigroup raised their price objective on Alphabet from $153.00 to $168.00 and gave the company a \"buy\" rating in a research report on Wednesday, January 31st. Finally, Mizuho raised their price objective on Alphabet from $155.00 to $170.00 and gave the company a \"buy\" rating in a research report on Wednesday, January 17th. Five equities research analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have assigned a strong buy rating to the company's stock. According to MarketBeat, Alphabet presently has an average rating of \"Moderate Buy\" and an average price target of $155.48. View Our Latest Report on GOOGL In other Alphabet news, CFO Ruth Porat sold 48,077 shares of the company's stock in a transaction dated Friday, March 8th. The stock was sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the sale, the chief financial officer now owns 1,777,106 shares in the company, valued at approximately $243,854,485.32. The sale was disclosed in a document filed with the SEC, which is available through the SEC website. In other news, CFO Ruth Porat sold 48,077 shares of the company's stock in a transaction dated Friday, March 8th. The stock was sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the completion of the transaction, the chief financial officer now directly owns 1,777,106 shares of the company's stock, valued at approximately $243,854,485.32. The transaction was disclosed in a legal filing with the SEC, which is available at this hyperlink. Also, CAO Amie Thuener O'toole sold 425 shares of the company's stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the transaction, the chief accounting officer now directly owns 27,259 shares of the company's stock, valued at $3,805,628.99. The disclosure for this sale can be found here. In the last 90 days, insiders have sold 279,659 shares of company stock worth $39,460,310. 0.88% of the stock is currently owned by company insiders. Several hedge funds and other institutional investors have recently bought and sold shares of the company. DE Burlo Group Inc. grew its position in shares of Alphabet by 520.0% in the second quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider's stock valued at $11,551,000 after purchasing an additional 80,934 shares during the period. West Tower Group LLC purchased a new stake in Alphabet during the second quarter valued at about $88,000. Ballast Advisors LLC grew its position in Alphabet by 9.6% during the third quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider's stock valued at $2,061,000 after acquiring an additional 1,385 shares during the period. Quantum Financial Advisors LLC grew its position in Alphabet by 8.0% during the third quarter. Quantum Financial Advisors LLC now owns 7,623 shares of the information services provider's stock valued at $998,000 after acquiring an additional 564 shares during the period. Finally, Acadian Asset Management LLC grew its position in Alphabet by 2.4% during the third quarter. Acadian Asset Management LLC now owns 4,416,533 shares of the information services provider's stock valued at $577,908,000 after acquiring an additional 104,366 shares during the period. 35.08% of the stock is owned by institutional investors and hedge funds. The stock has a 50-day simple moving average of $142.86 and a 200-day simple moving average of $137.68. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. The stock has a market cap of $1.87 trillion, a PE ratio of 26.04, a P/E/G ratio of 1.37 and a beta of 1.04. Alphabet (NASDAQ:GOOGL - Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The company had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. During the same quarter in the prior year, the business earned $1.05 earnings per share. Equities analysts predict that Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.Featured ArticlesFive stocks we like better than AlphabetDividend King Proctor & Gamble Is A Buy On Post-Earnings Weakness KB Home: Building on Strong Foundations During Volatile TimesThe How and Why of Investing in Gold StocksNike Stock and the 30% Rally That's ExpectedHow to invest in marijuana stocks in 7 steps Headwinds for Darden Restaurants are an Opportunity For Investors Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here As the AI market heats up, investors who have a vision for artificial intelligence have the potential to see real returns. Learn about the industry as a whole as well as seven companies that are getting work done with the power of AI. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}