{
    "title": "Alphabet’s advertising and stock are on a roll, but antitrust worries linger",
    "date": "1/29/2024",
    "url": "https://www.marketwatch.com/story/alphabets-advertising-and-stock-are-on-a-roll-but-antitrust-worries-linger-550fbedc",
    "text": "Google parent Alphabet Inc.’s stock has been on a tear, achieving a record all-time high last week as it rumbles toward projected bang-up results for the quarter on Tuesday. A rebound in advertising sales, growing optimism about its plans for generative artificial intelligence and the routine shedding of workers in the past several weeks all have analysts and investors in buoyant spirits. “We believe Google can grind higher even after rising 58% in 2023” because of accelerating ad revenue, easy comparisons, strong  search and cloud sales and AI tailwinds, Jefferies analyst Brent Thill wrote in a note to investors last week, summarizing the mood around Alphabet’s \n        GOOGL,\n        +0.04%\nGOOG,\n        +0.21%\n       stock. He lifted his price target on Alphabet shares to $170 from $165 while maintaining a buy rating. All the positive talk is reflected in a record stock price of $152.19 and a market valuation of $1.911 trillion. Read more: Alphabet shares close at all-time high It all starts with advertising: Ad buyers expect Google Search to remain the leading platform for digital-ad spending, even while slightly losing market share from 23% in 2023 to 22% in 2025, according to a survey of 54 senior U.S. ad buyers in late 2023. Those buyers expect YouTube’s share to rise slightly from 24% in 2023 to 25% in 2024-25. The survey results prompted Cowen analyst John Blackledge earlier this month to raise his price target on Google shares to $170 from $155 and to maintain an outperform rating. Evercore ISI’s Mark Mahaney is keenly focused on advertising revenue. He projects $67.4 billion in fourth-quarter revenue, 2% above street estimates. He’s particularly enthused by YouTube/YouTube TV, which is  benefiting from the Hollywood strikes. Amid all the sunny outlooks, however, there is a dark cloud: antitrust regulation. Even as the Justice Department awaits a verdict in its lawsuit against Alphabet, the Federal Trade Commission is investigating the generative-AI investments and partnerships of Alphabet, Amazon.com Inc. \n        AMZN,\n        +0.31%,\n       Anthropic, Microsoft Corp. \n        MSFT,\n        -0.17%\n and OpenAI Inc. Epic Games Inc. has already prevailed in its anticompetitive lawsuit against Google. Read more: Alphabet, Amazon and Microsoft face FTC probe into AI ‘investments and partnerships’ “We remain cautious on [fiscal 2024] due to regulatory risks and emerging AI developments,” Wells Fargo analysts said in a note earlier this month.” Our concern for the full year is driven less on fundamentals” than on “outcomes from ongoing regulatory and legal matters, including Play Store, Search, and Ad Tech. [They] have the potential to meaningfully alter Google’s business strategy and add risk to out-year results.” The stock looks like a bet on Trump himself more than a company with significant revenue and profits. Jon Swartz is a senior reporter for MarketWatch in San Francisco, covering many of the biggest players in tech, including Netflix, Facebook and Google. Jon has covered technology for more than 20 years, and previously worked for Barron's and USA Today. Follow him on Twitter @jswartz. Visit a quote page and your recently viewed tickers will be displayed here. "
}