{
    "title": "Google parent Alphabet laying off innovation lab workers",
    "date": "1/22/2024",
    "url": "https://www.foxbusiness.com/lifestyle/google-parent-alphabet-laying-off-innovation-lab-workers",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Piper Sandler managing director and SR economist Jake Oubina sits down with 'Mornings with Maria' to discuss the shift from focusing on inflation to unemployment and the risk of recession on the horizon. Google parent Alphabet Inc. is reportedly slashing jobs within its innovation lab called X as it adopts a new structure. In recent months, X – described as a diverse group of inventors and entrepreneurs that develops technologies to solve the world's hardest problems – has increased talks regarding funding with venture capitalists and other investors, so they can launch projects even faster, people familiar with the matter told Bloomberg. X was established in 2010 by Google co-founders Larry Page and Sergey Brin with the goal of working on \"far-out, sci-fi sounding technologies that could one day make the world a radically better place.\" Since then, the division has \"incubated hundreds of different moonshot projects,\" with many going on to become independent businesses. GOOGLE SHOWS OFF LATEST AI TOOLS AT CES The lab's new structure will help projects spin out to become independent businesses even more quickly with support from Alphabet as well as outside backers, Bloomberg reported, citing one of the people and an email to staff obtained by the outlet. In this photo illustration, a Google logo is displayed on a smartphone. (Mateusz Slodkowski/SOPA Images/LightRocket via / Getty Images) The cuts resulting from this transition will impact support staff, sources told the outlet. The number of roles impacted was not disclosed. Representatives for Alphabet did not respond to FOX Business' request for comment. GOOGLE LAUNCHES ADVANCED AI MODEL ‘GEMINI’ A woman passes the Google logo during the digital society festival in Berlin, Germany, June 9, 2022.  (Annegret Hilse / Reuters Photos) The move comes after Alphabet's Google announced it was laying off several hundred employees as it continues to focus on cost-cutting measures. Those Google cuts will affect its advertising-sales team. GET FOX BUSINESS ON THE GO BY CLICKING HERE Earlier this month, Google announced that a few hundred employees working on the company's voice assistant unit and another few hundred people working on the augmented reality hardware team would be laid off. A few hundred roles within its central engineering team are also impacted. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}