{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.businesstoday.in/technology/news/story/google-ceo-sundar-pichai-tells-employees-to-expect-more-job-cuts-this-year-413861-2024-01-18",
    "text": "Feedback Google has laid off over a thousand employees spanning various departments since January 10. The announcement came in the form of an internal memo from CEO Sundar Pichai, who also cautioned employees to brace themselves for additional cuts in the future, as reported by The Verge. Pichai addressed the entire Google workforce on Wednesday, revealing, \"We have ambitious goals and will be investing in our big priorities this year.\" The CEO acknowledged the challenges ahead, stating, \"The reality is that to create the capacity for this investment, we have to make tough choices.\" The impact of these \"tough choices\" has already been felt across multiple divisions, including hardware, ad sales, trust and safety, shopping, maps, policy core engineering, and YouTube teams. Pichai stressed that these layoffs and reorganisations, while significant, do not mirror the scale of the 12,000 job cuts executed by Google around the same time last year. \"These role eliminations are not at the scale of last year’s reductions, and will not touch every team,\" Pichai wrote in the memo. He acknowledged the emotional toll on employees, stating, \"But I know it’s very difficult to see colleagues and teams impacted.\" Providing insight into the company's rationale, Pichai explained that the layoffs this year aim at \"removing layers to simplify execution and drive velocity in some areas.\" However, he did not shy away from confirming the fears of many within Google, stating that more \"role eliminations\" are on the horizon. \"Many of these changes are already announced, though to be upfront, some teams will continue to make specific resource allocation decisions throughout the year where needed, and some roles may be impacted,\" Pichai cautioned. Google finds itself in a trend shared by several technology companies resorting to layoffs this month. Notably, Amazon, one of Google's major competitors in cloud and artificial intelligence, has also initiated layoffs in January. This includes the reduction of more than 500 positions within Twitch, Amazon's popular livestreaming video platform. Additionally, Amazon has also had staff cuts in the hundreds within its Prime Video and MGM Studios teams. According to Layoffs.fyi, a layoff tracking website, the tech industry has witnessed over 7,500 job cuts in the early months of 2024. Also Read Samsung Galaxy S24 series unveiled; see India pricing, offers and pre-booking details Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}