{
    "title": "This Underappreciated AI Play Is Trading At 'Really Attractive Valuations' \nCompared To Its Magnificent 7",
    "date": "1/9/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/01/36560152/this-underappreciated-ai-play-is-trading-at-really-attractive-valuations-compared-t",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Nvidia NVDA has long held the spotlight for its strides in artificial intelligence. However, there’s an underdog in the AI race that has been gaining momentum, and according to strategist Matt Orton of Raymond James Investment Management, that underappreciated gem is Alphabet Inc GOOG GOOGL. \"This is more of the institutional play, and it's underappreciated, I think, by the broader market,\" Orton said on CNBC's Street Signs Asia on Monday. Orton highlighted Alphabet’s groundbreaking move with the launch of Gemini, touted as Alphabet’s largest and most potent AI model to date. This innovation has the potential to revolutionize customer service engagement, trend identification for targeted advertising, content creation, and productivity applications. The strategist dubbed Gemini, a “game changer” in the AI landscape. The significance of Gemini stems from its ability to narrow the “GenAI gap.” Given the robust state of the U.S. consumer market, Gemini has the potential to fuel advertising revenue acceleration. Also Read: Is Tesla A Buy After Over 100% Gains In 2023? Analyst Says Stock Relatively Attractive VS. ‘Mag 7’ Peers Orton also took the opportunity to highlight the fact that Alphabet’s stock is “trading at a really attractive valuation still, especially relative to some of the other Magnificent Seven.” We looked at valuation ratios for the ‘Mag 7’ stocks, namely, Alphabet, Tesla Inc TSLA, Nvidia, Microsoft Corp MSFT, Meta Platforms Inc META, Amazon.com Inc AMZN and Apple Inc AAPL. Clearly, forward P/E multiple appears to favor Alphabet’s stock. As Alphabet continues to unveil its AI capabilities and solidify its position in the tech landscape, investors might find a hidden treasure in this underappreciated yet formidable player, potentially reaping significant rewards in the evolving AI-driven market of 2024 and beyond. Now Read: Nvidia Is Analyst’s Top Sector Pick With Potential $100B FCF For Growth Initiatives Such As AI Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}