{
    "title": "Alphabet Announces Separation From Appen, The Training Partner Behind \nGoogle's Chatbot Bard - Apple (NASD",
    "date": "1/23/2024",
    "url": "https://www.benzinga.com/news/24/01/36751336/alphabet-announces-separation-from-appen-the-training-partner-behind-googles-chatbot-bard",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Days after it was reported that Alphabet Inc.'s GOOG GOOGL Google has come under scrutiny from employees who think that the company’s leadership lacks vision, it appears the tech giant has called off its contract with Australian AI firm Appen. What Happened: Alphabet decided to part ways with Appen, which has been a major source of revenue for the latter, accounting for around one-third of its total earnings. The move comes into effect on March 19 and has been initiated after a strategic review process by the Sundar Pichai-led company, reported CNBC. This move will likely affect at least two thousand subcontracted Alphabet workers, according to the Alphabet Workers Union. Appen, a key player in training Google Bard and Google Search results, was reportedly unaware of this development until recently. The Australian firm has been in the business for nearly three decades. It has a prestigious list of clients including Microsoft Corporation MSFT, Apple Inc. AAPL, Meta Platforms Inc. META, Amazon.com, Inc. AMZN, and Alphabet. These tech giants constitute 80% of Appen’s total revenue. Last year, Alphabet alone contributed $82.8 million to Appen’s total sales of $273 million, the report noted. However, the company has been facing a series of challenges, including client attrition, leadership departures, and declining financials, with a 30% drop in revenue in 2023. Ex-employees, who preferred to remain anonymous due to concerns about potential reprisals, said in September that the company’s ongoing challenge in transitioning to generative AI is a result of a history of inadequate quality controls and a disorganized organizational structure, according to the report. See Also: Google’s AI Search – A Double-Edged Sword for Publishers Like the Atlantic Why It Matters: Alphabet's decision to sever ties with Appen comes in the backdrop of Google's recent focus on developing proprietary AI technology. In December, Google launched Gemini AI, its most advanced AI model, which is integrated into the chatbot Bard. The same month, Google also rolled out a new AI game to help users create images using text prompts. Moreover, Alphabet is currently defending its AI technology in a $7 billion lawsuit over alleged patent infringement in relation to its AI processors. Image Credits – Shutterstock Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Can AI Write Your Emails? Google Tests ‘Draft With Voice’ In Gmail Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}