{
    "title": "What does Googles mass layoffs mean for tech industry?",
    "date": "1/11/2024",
    "url": "https://www.thenews.com.pk/latest/1146839-what-does-googles-mass-layoffs-mean-for-tech-industry",
    "text": "Google fired hundreds of workers from its engineering, hardware, and voice assistance divisions as part of cost-cutting efforts. According to a statement from the firm, Google is making these reductions in order to \"responsibly invest in our company's biggest priorities and the significant opportunities ahead,\" reported AP. “Some teams are continuing to make these kinds of organisational changes, which include some role eliminations globally,” it said. A few hundred jobs would be eliminated, according to a statement made by Google previously, primarily affecting its augmented reality hardware team. The layoffs come after Alphabet, the parent company of Google, and its leadership promised to slash expenses. Google announced a year ago that it would lay off 12,000 workers, or around 6% of its total staff. The Alphabet Workers Union referred to the job cuts as \"another round of needless layoffs\" in a post on X, the former name of Twitter. “Our members and teammates work hard every day to build great products for our users, and the company cannot continue to fire our coworkers while making billions every quarter,” the union wrote. “We won’t stop fighting until our jobs are safe!” Google is hardly the only tech company making cost reductions. To reassure investors, Facebook's parent company, Meta, has cut almost 20,000 workers in the last year. In 2023, Meta's stock price increased by almost 178%. ‘Rich Dad, Poor Dad’ writer Robert Kiyosaki doubles down on Bitcoin, expecting big surge after halving event New US relocation plans offer fresh start to inflation-burdened Americans looking for financial comfort Premier directs to remove all obstacles to Reko Diq project \"Secretary Commerce Khurrum Agha will undertake a two-day visit to Afghanistan on Monday,\" says FO Mark Bristow says estimated investment of $10 billion will boost mining industry and local economy PM Shehbaz had earlier decided to keep the key committee with himself Copyright © 2024. The News International, All Rights Reserved | Contact Us | Authors "
}