{
    "title": "Advertising woes knock Alphabet in the fourth quarter",
    "date": "1/31/2024",
    "url": "https://www.sharesmagazine.co.uk/news/shares/advertising-woes-knock-alphabet-in-the-fourth-quarter",
    "text": "Shares in Alphabet (GOOG:NASDAQ) fell over 5% to $153 in a bout of profit-taking after the US tech giant’s fourth quarter results disappointed the market. The fall is a drop in the ocean compared with the 53% gains delivered over the last year. Although the company reported 13% year-on-year growth in consolidated revenues to $86 billion, some of the company’s revenue in other divisions fell short. Google Cloud saw revenue increasing to $9.12 billion for the fourth quarter ending 31 December compared to $7.31 billion in the same year ago period. Analysts were expecting fourth-quarter revenue of $8.94 billion for Google Cloud. In relation to YouTube ads, Alphabet reported revenue of $9.2 billion in line with Wall Street estimates. Which ‘Magnificent Seven’ stock has the most 2024 upside according to analysts? Russ Mould, investment director at AJ Bell said: ‘Last time it was the cloud computing arm causing a downpour on Alphabet’s results, now it is the advertising segment which has made investors switch off. Analysts were optimistic for Alphabet-owned Google and YouTube to scoop up bucket loads of cash from advertising, but the group has fallen short of what was expected. ‘The backdrop for advertising has been challenging. An uncertain economic backdrop makes corporations nervous about spending big on advertising and many companies are taking a more cautious approach. Those that are spending want more information to show they are getting the best bang for their buck. That means better audience profiling and measurement tools. ‘Alphabet is pinning its hopes on artificial intelligence to help enhance its advertising offering. Naturally, that comes at a cost, and it is spending big on infrastructure underpinning AI.’ CAN ARTIFICIAL INTELLIGENCE (AI) SAVE ALPHABET? Alphabet also announced continued investment in AI, but analysts have questioned whether this will pay off. Ben Barringer, technology analyst at Quilter Cheviot said: ‘Interesting the business has seen an acceleration in its cloud computing unit too as business look to adopt artificial intelligence capabilities and go through less cost-cutting now the economic picture is beginning to improve. This has pushed Alphabet to reallocate resources and spend more on the cloud. Despite the buoyant advertising market, Alphabet is behind other competitors when it comes to cloud computing and AI. As such, it must spend to keep up. ‘That said, Alphabet remains an AI winner, but there are big risks around its search function and the disruption it is likely to see from those who can better implement AI tools.’ DISCLAIMER: Financial services company AJ Bell referenced in this article owns Shares magazine. The author of this article (Sabuhi Gard) and the editor (Martin Gamble) own shares in AJ Bell. LEARN MORE ABOUT ALPHABET You can opt out at any time. "
}