{
    "title": "Google stock hits record high following 'AI wake-up call'",
    "date": "1/25/2024",
    "url": "https://www.proactiveinvestors.com.au/companies/news/1039305/google-stock-hits-record-high-following-ai-wake-up-call-1039305.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. William kickstarted his career as a researcher and reporter for a global legal publication, covering everything from public law to M&A. Before moving to Proactive Investors, he worked as a reporter for a major fintech company with a focus on cryptocurrency and blockchain technology.\r\n\r\nHarking from Queensland, Australia, William obtained first-class honours in journalism and media from Birkbeck University before going on to complete an MA in creative and critical writing. Other jobs have... Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 05:28 25 Jan 2024 AEDT Alphabet Inc (NASDAQ:GOOG), the parent company of search engine titan Google, is repositioning its artillery for the year ahead following what Bank of America dubbed an “AI wake-up call” in 2023. Chief among America’s third-largest corporation’s arsenal is the development of its suite of ChatGPT-killing (wishfully speaking) Gemini large-language models (LLMs). Alphabet rushed to commercialise its AI technology after OpenAI’s groundbreaking ChatGPT LLM turned the technology sector on its head in 2023. Although the Google parent faces a potentially insurmountable task in besting Microsoft-backed OpenAI’s first-mover advantage, BoA analysts still touted Gemini’s revenue-generating potential. Analysts highlighted the dual potential of AI integration into Google's search engine, which promises enhanced user experiences, new use cases and new monetization avenues through targeted advertising and Performance Max adoption. Yet the company also faces a slew of risks, including the potential devaluation of its search engine due to the proliferation of AI across various platforms, increased competition in direct response advertising, concerns over capital allocation, and the persistent bugbear of antitrust litigation. Alphabet’s European Union antitrust bill alone stands at more than €8 billion ($8.7 billion) under the bloc’s hawkish approach to anti-competitive practices. Google Play, the corporation’s market-leading mobile app store, faces a perpetual onslaught of lawsuits against it, causing a degree of uncertainty to its future cash flows. Nonetheless, these risks have yet to cause much of a discount factor on Alphabet shares. Following more than 50% worth of gains throughout 2023, Alphabet cheered a new all-time high of $151.50 this Wednesday, bringing the firm’s market capitalisation to $1.88 trillion. Sign up to receive alerts and news direct to your inbox Rowena Smith, CEO and managing director of Australian Strategic Materials Ltd (ASX:ASM, OTC:ASMMF), joins Jonathan Jackson in the Proactive studio to discuss the company’ s Dubbo Project, in Central West New South Wales. This project aims to extract and process critical minerals and rare earth... Copyright © Proactive Group Holdings Inc, 2024 All Rights Reserved - Proactive Australia PTY LTD ACN:132787654 ABN:19132787654. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}