{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.forbes.com/sites/greatspeculations/2024/02/20/up-3x-over-the-past-year-will-q4-beat-drive-nvidia-stock-higher/",
    "text": "SANTA CLARA, CALIFORNIA - FEBRUARY 05: A sign is posted at Nvidia headquarters on February 05, 2024 ... [+] in Santa Clara, California. Shares of Nvidia stock hit record highs on Monday after analysts increased their outlook on company. (Photo by Justin Sullivan/Getty Images) Nvidia (NASDAQ: NVDA) is expected to publish its Q4 FY’24 results on February 21. We expect the company to have another upbeat quarter, as technology companies and developers have been scrambling to deploy generative AI into their applications following the success of the ChatGPT chatbot from OpenAI. This is driving a windfall for Nvidia, whose high-end graphics processing chips remain the go-to products for AI workloads. We expect Nvidia’s revenue for the quarter to come in at $20.3 billion, roughly in line with the consensus estimates and roughly 3.3x last year’s number. We expect earnings to come in at roughly $4.55 per share, marginally ahead of consensus estimates. So what should investors expect as Nvidia reports its Q4 2024 results? Demand for Nvidia’s high-end GPUs such as the A100 and H100 has surged driven by demand from the generative AI space. Nvidia’s chips remain meaningfully ahead of rivals such as AMD and Google’s\nGOOG\n Tensor processing units in terms of performance at the moment. Moreover, the company has built an ecosystem around its AI tools, with its programming languages, and software, which are helping the company drive incremental sales and lock in customers. Over Q3 FY’24, Nvidia’s revenue surged 206% year-over-year. Nvidia is also turning incredibly profitable due to the AI surge. Net income during the last quarter was at $9.24 billion, up from just $680 million in the year-ago period as gross margins rose to 74% from under 54% in the year-ago quarter. The company has attributed the increase in margins to higher sales of complex data center products as well as bundled software. Now, while Nvidia has indicated that it expects some negative impact over Q4 due to the export restrictions the U.S. has imposed on its sales to organizations in China and some other countries, the surging demand for AI chips from other regions should more than offset this impact. Nvidia has been developing new data center products that comply with U.S. government policies although it could take some time before they positively impact the company’s earnings. Now, the increase in NVDA stock has been far from consistent. Returns for the stock were 125% in 2021, -50% in 2022, and 239% in 2023. In comparison, returns for the S&P 500 have been 27% in 2021, -19% in 2022, and 24% in 2023 - indicating that NVDA underperformed the S&P in 2022. In fact, consistently beating the S&P 500 - in good times and bad - has been difficult over recent years for individual stocks; for other heavyweights in the Information Technology sector including MSFT, AAPL, and AVGO, and even for the megacap stars GOOG, TSLA, and AMZN. In contrast, the Trefis High Quality Portfolio, with a collection of 30 stocks, has outperformed the S&P 500 each year over the same period. Why is that? As a group, HQ Portfolio stocks provided better returns with less risk versus the benchmark index; less of a roller-coaster ride as evident in HQ Portfolio performance metrics. Given the current uncertain macroeconomic environment with high oil prices and elevated interest rates, could NVDA face a similar situation as it did in 2022 and underperform the S&P over the next 12 months - or will it see a strong jump? While we think that Nvidia stock could move a bit higher if it beats earnings, we think the stock is meaningfully overvalued at current levels, trading at almost 20x forward sales. This compares to the broader semiconductor industry average price-to-sales multiple of about 4.5x. Although Nvidia remains in the pole position in the market for AI chips, we see a couple of risks. Firstly, the big surge in GPU demand that we are currently seeing could potentially ease, as the initial training of AI large language models slows down. Moreover, competition in the market could also mount with players such as AMD investing considerably to catch up in this space given the high stakes. Moreover, big tech players such as Google, Microsoft\nMSFT\n, and Amazon\nAMZN\n - which are incidentally some of Nvidia’s biggest customers - are also doubling down on AI and machine learning-related silicon. This could also pose a risk for the company. We value NVDA at about $480 per share, about 35% below the market price. See our analysis on Nvidia Valuation: Is NVDA Stock Expensive Or Cheap? for more details on what’s driving our price estimate for NVDA stock. NVDA Return Compared With Trefis Reinforced Portfolio Invest with Trefis Market Beating Portfolios See all Trefis Price Estimates  "
}