{
    "title": "Alphabet, Meta ad sales in Q4 unlikely to reflect gen AI investments",
    "date": "2/4/2024",
    "url": "https://cyprus-mail.com/2024/02/04/alphabet-meta-ad-sales-in-q4-unlikely-to-reflect-gen-ai-investments/",
    "text": "March 27, 2024 March 26, 2024 March 26, 2024 March 26, 2024 March 27, 2024 March 24, 2024 March 23, 2024 March 22, 2024 March 20, 2024 March 8, 2024 March 3, 2024 March 2, 2024 March 27, 2024 March 26, 2024 March 25, 2024 March 25, 2024 March 22, 2024 March 21, 2024 March 21, 2024 March 20, 2024 March 20, 2024 March 15, 2024 March 15, 2024 March 9, 2024 February 26, 2024 February 24, 2024 Despite the buzz over generative artificial intelligence last year, the technology’s impact on the advertising business of Alphabet (GOOGL.O) and Meta Platforms (META.O) is likely to be muted when the companies report fourth-quarter results this week, though investors are mapping out its future potential. The search giant has rolled out AI tools that help advertisers target audiences in a less costly way and decide how their marketing budgets should be distributed across Google’s ad network. Facebook parent Meta is using generative AI to create different variations of ad campaigns. Generative AI, which can create text and photos from prompts, is still in the “hype cycle,” Bernstein analysts said in a research note earlier this month, but added that investors were now looking for “incremental use cases and revenue streams to spawn from these recent advancements.” The core business of digital advertising is expected to have been resilient in the quarter ended Dec. 31, and warnings that economic and geopolitical uncertainty could dampen the ad market are likely to prove overblown, the brokerage said in a separate note last week. Microsoft (MSFT.O), which is scheduled to report quarterly results on Tuesday, is likely to be the earliest winner in the nascent generative AI race, which has consumed nearly every tech and social media company from Amazon.com (AMZN.O) to Snap (SNAP.N). For Microsoft, generative AI has fueled demand for its cloud services. Alphabet stock surged 58 per cent last year, while Meta’s stock nearly tripled. The broader S&P 500 index (.SPX) gained roughly a quarter in 2023, helped by an AI-fueled tech rally. Going into 2024, “an additional catalyst … other than AI, will be the big focus on political advertising and will boost businesses at Meta and Google,” said D.A. Davidson and Co analyst Gil Luria. Spending on political advertising in the U.S. will jump 30 per cent this year from the last presidential election in 2020, partly driven by higher spending on digital platforms, research firm Insider Intelligence has estimated. On Tuesday, Google parent Alphabet is expected to report that fourth-quarter advertising revenue – its mainstay – grew 11.8 per cent to $66 billion, according to LSEG data. Google introduced its experimental AI chatbot Bard early last year and launched what it calls a search generative experience (SGE) that generates written responses to some Google Search queries. It rolled out SGE to 120 countries in November, but the new search experience could have very little impact on its business in the near-term. By 2025, SGE could account for between $35.6 million and $113 million in incremental search advertising revenue in the “upside scenarios,” said New Street Research analysts in a research report in October, adding that the biggest factor depends on how often people click on ads shown in AI-generated responses. Meta, the second-largest digital ad platform, has already proven that its work in AI can produce results for its advertisers. In a survey of advertisers who tested Meta’s AI tools that can generate images and backgrounds for ads, half said they estimated the tools could save them at least five hours of work per week, Bernstein analysts said. After cautioning in October that the Israel-Hamas conflict could hurt ad spending, analysts estimate Meta will report $39.1 billion in fourth-quarter revenue on Thursday, at the higher end of Meta’s guidance. A suite of AI tools that automatically finds potential customers and tests which ads will perform best is earning $10 billion on an annualized basis, Meta has said. If the company introduces paid ads later this year within the AI assistants it recently launched to answer questions inside WhatsApp, Messenger and Instagram, it could generate $6.7 billion in ad revenue in 2025, New Street Research estimated. Such ads could also be a much-needed boon for Snap (SNAP.N), owner of photo messaging app Snapchat, which partnered with Microsoft (MSFT.O) in September to place sponsored product links in its chatbot called My AI. New Street Research estimated Snap will earn $234 million this year from these links, which will grow to $686 million in 2025, or more than 11 per cent of annual revenue. Analysts estimate Snap will report fourth-quarter revenue of $1.4 billion, up 5.7 per cent from the previous year. Amazon.com, which will begin showing ads on its Prime Video service this week, is building partnerships for Amazon Bedrock, a service that lets businesses create applications with a range of AI models, RBC Capital Markets said. The launch of Prime Video ads could boost Amazon’s ad revenue growth by 5 per cent to 10 per cent, RBC Capital Markets said in its 2024 outlook report. The retail giant reports results on Thursday. Sign up to the Cyprus Mail Newsletter We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. Please read this Cookie Policy carefully as it contains important information on who we are and how we use cookies on our website. This policy should be read together with our Privacy Policy  which sets out how and why we collect, store, use and share personal information generally, as well as your rights in relation to your personal information and details of how to contact us and/or the supervisory authorities in case you have any complaint. This Cookie Policy applies to the access and use of the Cyprus Mail Website hosted at https://cyprus-mail.com/ (hereinafter referred to as the “Website”), which is operated by NEO CYMED PUBLISHING LIMITED (hereinafter the “Company”, “we” or “us”). Our Company strives to protect personal data and apply high standards of conduct when it comes to privacy issues. We ensure that we provide our employees and staff with the appropriate training to handle personal data promptly and in accordance with the laws. Furthermore, we endeavour to ensure that any parties with whom we co-operate apply the same high standards when it comes to data protection and privacy as we do. Cookies A cookie is a small text file which is placed onto your device (e.g. computer, smartphone or other electronic device) when you use our Website. We use cookies on our Website. These help us improve your experience and at the same time help us to support our security features i.e. detect for malicious visitors, recognize you and your device and store some information about your preferences or past actions. For example, we may monitor . This information helps us to identify trusted web traffic, generate statistical and analytical data on how our visitors use our Website, our reach and click on links. We also uses cookies to personalize your online experience. Some of this data will be aggregated or statistical, which means that we will not be able to identify you individually. For further information on our use of cookies, including a detailed list of your information which we and others may collect through cookies, please see below. For further information on cookies generally, including how to control and manage them, visit the guidance on cookies published by the Office of the Commissioner of Personal Data Protection in Cyprus, or www.allaboutcookies.org/. Consent to use cookies and changing settings We will ask for your permission (Consent) to place cookies or other similar technologies on your device, except where they are essential for us to provide you with a service that you have requested (enabling basic functions like page navigation and access to secure areas of the Website) and ensure the security of our website and users. You may withdraw any consent provided regarding the use of cookies or manage any other cookie preferences by clicking on the Cookie Settings icon at the bottom end of any page on our Website. You can then adjust the sliders regarding the cookies as per your preferences. It may be necessary to refresh the page for the updated settings to take effect. For more information on how you can change your preferences via browser settings please see ‘How to turn off all cookies and consequences of doing so’ below. It may be necessary to refresh the page for the updated settings to take effect. Our use of cookies Categories of Cookies: The table below provides more information about the cookies we use and why: Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites  Third party access to the cookies The cookies we use will only be accessed by us and those third parties named in the table above for the purposes referred to in this Cookie Policy. Those cookies will not be accessed by any other third party. How to turn off all cookies and consequences of doing so If you do not want to accept any cookies, you may be able to change your browser settings so that cookies (including those which are essential to the services requested) are not accepted. If you do this, please be aware that you may lose some of the functionality of our Website. How to contact us Please contact us if you have any questions about this Cookie Policy or the information we hold about you. If you wish to contact us, please send an email to [email protected],  write to us at 195, Arch. Makariou III, Neocleous House, 1st-5th floor, 3030, Limassol, Cyprus, or call us at ++357 22818585. Changes to this policy This policy was last updated on 4/7/2023. We may change this policy from time to time, when we do so we will inform you via notification on our Website.   Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Please enable Strictly Necessary Cookies first so that we can save your preferences! "
}