{
    "title": "Alphabet, Google’s parent company, faces $90 billion market value fall",
    "date": "2/23/2024",
    "url": "https://nairametrics.com/2024/02/27/alphabet-googles-parent-company-faces-90-billion-market-value-fall/",
    "text": "Alphabet, the parent company of Google, plummeted by around $90 billion on Monday, triggered by mounting concerns surrounding the company’s generative artificial intelligence (AI) product. The controversy surrounding Google’s Gemini AI service has cast a shadow over Alphabet, impacting its stock performance on Wall Street. Alphabet’s stock (GOOGL) experienced a substantial 4.5% decline, closing at $138.75 on Monday, marking its lowest price since January 5 and marking the second-largest daily loss over the past year, Forbes first reported. More insight There are concerns over the brand reputation of Google particularly if it is perceived as an unreliable source for AI, it could adversely impact the company’s standing among a portion of the population. Also, suggestions point to the fact that Alphabet’s recent entanglement in cultural debates, fueled by controversies related to AI bias, could potentially challenge its dominant position in the online search market. As AI continues to play a growing role in online search functionalities, there are speculations that user concerns about Google’s biases and hallucinations could erode the company’s standing. Gemini’s apparent bias adds to Alphabet’s struggles in the AI competition, with Microsoft gaining prominence as a strong competitor. Alphabet’s AI missteps have become a recurring theme, with the company famously losing over $100 billion in market capitalization last February on the day of the announcement of its AI chatbot service. The announcement included factual errors made by the service, contributing to a significant market value decline. Deborah Dan-Awoh is a seasoned lifestyle analyst with a knack for storytelling. The focus of her work covers people, money and culture as it relates with business and economy.\r\nWhen she's not keeping tabs on the latest trends in lifestyle and finance- Deborah enjoys networking with industry experts to gain insight into major markets as it affects the populace Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ       Business News | Stock Market | Money Market | Cryptos | Financial Literacy | SME | Follow us on social media: © 2024 Nairametrics Login to your account below   Remember Me  Fill the forms below to register    Please enter your username or email address to reset your password.   © 2024 Nairametrics "
}