{
    "title": "Google: The Underappreciated Magnificent 7 Stock (NASDAQ:GOOG)",
    "date": "2/5/2024",
    "url": "https://seekingalpha.com/article/4667458-google-the-underappreciated-magnificent-7-stock",
    "text": "Anadolu/Anadolu via Getty Images Anadolu/Anadolu via Getty Images Since its IPO in 2004 people have been saying Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL), then Google, has been overhyped, that search can't continue at this pace, and that the market cap is too high. This whole time, Alphabet has been a moving mountain continuing to deliver quarter after quarter and 2023 was no different. In the wake of AI product roll-outs like ChatGPT and other AI tools in late 2022, investors continued to turn on Alphabet's Google Search money maker. Yet full year 2023 results demonstrated the negativity is unwarranted and Google Search continues to run. Couple that with the massive tailwinds in the YouTube Premium space, there are multiple avenues for Alphabet's ad business to continue its dominance. Then there is Google's cloud offering, GCP, which expanded revenues by over 26% and has sniffed out profitability for the first time this year. Coupling all that revenue growth with capital reinvestment in other bets businesses and share buybacks reducing the float, it is no wonder EPS grew 27% year over year. The stock continues to trend in the right direction. Those who have been watching the stock after earnings on January 30th know the stock ended the week 7% lower. The recent dip in stock price seems overdone and will provide an opening for those looking for a 5-10-year hold. Bringing it back to the shorter term, Alphabet's execution of the corporate strategy underpins a $7.50 EPS estimate for 2025. Maintaining the current 25x price to earnings (P/E) multiple into the future would elevate Alphabet's stock price to $185-$190/share over the next two years. This move represents a 31% increase in the stock compared to today's price of $143. Yes, I like the stock. Alphabet is a global-spanning technology conglomerate. The largest chunk of the company holds Google, the search engine business the company was built upon. Today, it holds other organizations that span different focuses from Google Workspace, hosting of content creation, venture capital, and autonomous driving. The list of companies underneath Alphabet is long, hence the 26 letters in the alphabet. A few of the larger well-known businesses under Alphabet to note are Android, YouTube, Nest, Fiber, Google Ventures, and Waymo. A list of Alphabet Subsidiary Companies (Google Search) A list of Alphabet Subsidiary Companies (Google Search) At the moment, yes, 57% of the revenue from Alphabet is Google Search, but Alphabet's Google Cloud Platform (GCP) continues to grow at a ridiculous pace. In the past 5 years, GCP has grown 150%, outgrowing the worldwide cloud market by 50% in that time. Worldwide Cloud Growth (Statista) Worldwide Cloud Growth (Statista) Alphabet continues to steal market share from the smaller cloud providers and now has an 11% market share, up from 8% in 2019. Now some may be saying that the cloud has run its course, it has been the cash engine for Amazon (AMZN) and Microsoft (MSFT) for a decade now, and it is done. On the contrary, the Cloud is not an item to ignore - multiple sources note that the cloud will continue to grow at a 15-20% CAGR into the 2030s. All of that means, the entirety of cloud will grow from just around $600bn in 2023 and will nearly double in the coming 5 years. Cloud Provider Market Share (TechCrunch / Synergy Research) Cloud Provider Market Share (TechCrunch / Synergy Research) If Alphabet continues to accumulate market share and double its cloud business in the coming 4-5 years (15-20% CAGR), that would increase revenue from $33bn in 2023 to nearly $70bn in 2027/2028. Assuming GCP grows its margin from 5% in 2023 to closer to 30% observed by AWS or 45% observed by Microsoft, then there is a chance segment net income grows from less than $2bn in 2023 to between $20bn and $30bn in 2028. Yes, that means Alphabet's cloud business could be worth between $400bn-$750bn in the next 5 years. Share repurchases: Secondly, there is likely to be EPS growth over the coming years as the board continues to authorize legendary share buybacks. Over the past 5 years, Alphabet's board has authorized the purchase of $218bn of shares equivalent to 2.2B shares, or almost 15% of the float in that time. That 15% reduction has been partly offset by share-based compensation to employees and directors, leaving a total float reduction of just over 9%. The board customarily announces upcoming share repurchase plans in the 1Q earnings release (April). Last year the board authorized $70bn in share repurchases, to which the company purchased 528m shares in 2023. Alphabet Share Repurchases Over Time (Alphabet Earnings) Alphabet Share Repurchases Over Time (Alphabet Earnings) I anticipate next year to be no different, with cash flow from operations in 2023 of over $100bn and capex remaining less than 30% of the ops cash, buyback authorization in 2024 should run in the $70bn-$75bn range buying back roughly 4% of the float. Over a 5-year period, I anticipate that Alphabet will buy back close to 15-20% of the shares outstanding. After share-based compensation, this will effectively reduce the float by 10-15%. This alone will boost EPS by 11-17.5% on top of already stellar organic growth. Alphabet Shares Outstanding Over Time (Alphabet Earnings) Alphabet Shares Outstanding Over Time (Alphabet Earnings) There is also something to be said about YouTube Premium and its ability to get into NFL Sunday Ticket, YouTube Music, and other features like downloading content and watching videos offline. The service has grown to over 100M subscribers and growing… but I have not done the due diligence needed to dive fully into it, so I will save this for a future article. When it comes to how Alphabet stacks up on a price-to-earnings multiple basis compared to the rest of the Magnificent 7, Alphabet and Apple (AAPL) are the only ones that seem reasonably priced. That said, I want to note that Nvidia (NVDA) is the only one of the Mag7 that has yet to report earnings this season and thus could reduce its P/E multiple in the coming weeks. I am a firm believer that premium large-cap companies with moats deserve a 20-25x multiple on next year's earnings as they will experience cash inflows associated with mass ETF buying and will generally be considered safe havens for capital. Market Cap and FY 2023 Incomes of Magnificent 7 (Earnings from Respective Companies) Market Cap and FY 2023 Incomes of Magnificent 7 (Earnings from Respective Companies) I would personally consider P/Es north of 30x of next year's earnings to be expensive - however if the net income growth of the company persists at 20% for the upcoming two years, 30x might be deemed cheap. So with the persistent growth Microsoft has seen and is predicting in the coming years, a P/E of 37x on a trailing twelve-month (TTM) basis is nothing wild. But then note Alphabet at 25x based on 2023 earnings. I think Alphabet's EPS will be $7.50 in 2025, which is up 30% from 2023. $7.50 EPS would mean the stock is currently valued at just 19x 2025 earnings. In reality, Alphabet could afford a 2023 P/E of 30-33x as EPS will grow from $5.80 in FY2023 to $7.50 in 2025 - warranting a price lift of 30% between $185 and $190 per share. However, the recognition of risks to Google search from AI chatbots and other LLMs will be ever-present going forward, presenting a drag on the future valuation of the stock. Thus the stock growing into $185-$190/share within the next two years is sufficient for me as an investor. Street and Seeking Alpha analysts for Alphabet recommend the stock as a solid buy at current prices. My $185-190 price target over the next two years is on the high end considering the $125 to $175 Street price range for the coming 12 months. The average Street price of $159 represents an 11% upside to today's price. The $185-190 price target is a 30% upside to the stock price over the next two years or 14% per year. Whereas the bullish Street analysts predict an increase of 11-22% in the coming 12 months. Peer analysts on Seeking Alpha currently rate Alphabet a 3.9 out of 5, which signals a buy on the stock. 4 SA analysts rate the stock a strong buy, 9 rating the stock a buy, and 3 rating it a hold. There is a single seller. Wall Street analysts currently rate Alphabet a 4.3 out of 5, with 31 SA analysts rate the stock a strong buy, 13 consider it a buy, 12 consider it a hold and there are no sellers. Quant currently rates Alphabet a 4.9 out of 5, a Strong Buy. One Year Price Target (Seeking Alpha) One Year Price Target (Seeking Alpha) I see breaking up of the company to avoid monopoly laws and loss of Google Search revenue to be the largest risks to Alphabet's future. Alphabet break-up: The organization continues to face regulatory hurdles and government anti-trust lawsuits across the globe leading the company down a path of splitting up just to maintain normal business operations. Several times throughout the past decade, Google has been fined by the European Union for antitrust and lost. The EU claims Google is using its dominance in search to throttle or deprioritize specific results or embellish features that push down rival results. The U.S. Justice Department is also working with the Attorney Generals of California, Colorado, Connecticut and several other states claiming that Alphabet, more specifically, Google has monopolized digital advertising and is in violation of Section 1 and 2 of the Sherman Act. I am under the firm belief that Google's search dominance has been through its quality product, beating out competitors over the years like Ask Jeeves, Yahoo, Bing, and many other search engines to arrive at the top. All of that said, the intricacies of what is actually happening with the search algorithms and throttling of specific results are beyond my area of expertise. All I know is companies have been taken down by the government for less and I would not be surprised if they find a way to break down Alphabet's search business. Generative AI products like ChatGPT, Bard, Bing, and DuckAssist all are changing how search is being done on the internet. The fear that traditional products like Google Search and SEO fall by the wayside while generative AI improves search to provide a single link or select few links or paragraphs, resulting in lower ad revenue over time, could be a reality. I see this being a short-term problem, and just like YouTube, the problem will be solved with time and ingenuity. Originally Meta's (META) Instagram did not have ads. YouTube did not have ads. Facebook did not have ads. However, here we are in 2023, with these being the largest advertisers on the planet. If there is traffic to a product like ChatGPT, Bard, or other, there will be a preferred search flow or advertisements - both will drive revenue. Asking Bard's AI chat prompt about black wafer cookies could immediately return results specific to upsell Oreos or Kroger store brand. After providing a response, Bard could simply ask in return if you want it to add Oreos to your shopping list. Or if you ask about Jeans it immediately starts referring to Levi's. There are ways around the traditional revenue stream that is Google Search. It has just not been built yet. The above demonstrates that Alphabet has defied the negative sentiment of the market and consumers over the past two decades by delivering strong performance and revolutionizing how the world operates. Despite the Street and many retail investor's concerns about the longevity of Google's search business, the company continued to grow handsomely while picking up other revenue streams in recent years, like YouTube Premium. The Google Cloud Platform adds another vertical to Alphabet's arsenal. With GCP's future growth, it is likely to be worth between $400bn to $750bn in the next 5 years. All of this dominance in search, cloud, and entertainment is part of Alphabet's strategic corporate approach that contributes positively to the bottom line. The share price is then further uplifted by plentiful share repurchases that continue to get approved by the board. All of this will lift EPS from its $5.80 in 2023 to nearly $7.50 in 2025. Combined with a 25x P/E multiple, this supports a price of $185-$190 in the next two years - representing a 30% upside on today's stock price. The recent price action post Q4 earnings should entice anybody who has been looking to enter Alphabet and hold it for the next 5-10 years. The stock could dip into the $130 range, but I would not get greedy. My bullish thesis on Alphabet is echoed by the Street and Seeking Alpha analysts, both sharing a \"Buy\" rating. All the positives have to be partly outweighed by the risks of challenging regulatory environments across the globe presenting anti-trust lawsuits and the impact that generative AI may have on traditional search revenues. I am confident Alphabet will navigate these waters well but there may be a drag on the valuation in the interim and the risks, even if mitigated may always come to fruition. I am sure I missed a lot on the positive and negative side! Please share with me what makes you bullish or bearish on Alphabet below in the comments. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I own shares in GOOGL Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}