{
    "title": "‘Unacceptable,’ Google CEO Sundar Pichai’s Memo To Employees Over Recent \nControversy On AI chatbot Gemini",
    "date": "2/29/2024",
    "url": "https://www.india.com/business/unacceptable-google-ceo-sundar-pichas-memo-to-employees-over-recent-controversy-on-ai-chatbot-gemini-6754531/",
    "text": "click this icon for latest updates  Updated: March 29, 2024 7:49 AM IST By Anirudha Yerunkar \n\n\n\n\n\n | Edited by  Anirudha Yerunkar Google CEO Sundar Pichai broke silence over recent controversy on its AI Chatbot Gemini’s image generation tool. “That’s completely unacceptable,” said Pichai in a memo that first appeared on Semafor. “I know that some of its responses have offended our users and shown bias – to be clear, that’s completely unacceptable and we got it wrong,” Sundar Pichai said.  Google CEO Sundar Pichai’s Letter As It Appeared On Semafor, Reported TOI I want to address the recent issues with problematic text and image responses in the Gemini app (formerly Bard). I know that some of its responses have offended our users and shown bias – to be clear, that’s completely unacceptable and we got it wrong.Our teams have been working around the clock to address these issues. \n\n We’re already seeing a substantial improvement on a wide range of prompts. No AI is perfect, especially at this emerging stage of the industry’s development, but we know the bar is high for us and we will keep at it for however long it takes. And we’ll review what happened and make sure we fix it at scale. \n\nOur mission to organise the world’s information and make it universally accessible and useful is sacrosanct. We’ve always sought to give users helpful, accurate, and unbiased information in our products. That’s why people trust them. This has to be our approach for all our products, including our emerging AI products.We’ll be driving a clear set of actions, including structural changes, updated product guidelines, improved launch processes, robust evals and red-teaming, and technical recommendations. We are looking across all of this and will make the necessary changes.Even as we learn from what went wrong here, we should also build on the product and technical announcements we’ve made in AI over the last several weeks.  What is Gemini AI?Google recently launched its official artificial intelligence (AI) tool for users globally. Gemini Pro 1.0 model is available in over 40 languages across more than 230 countries and territories. \n\nIt is a paid tool which charges $19.99/month, starting with a complimentary two-month trial period. Gemini Advanced is part of the Google One AI Premium Plan. It is also integrated into various Google applications such as Gmail, Docs, Slides, Sheets, and more (formerly known as Duet AI). Gemini AI ControversiesEarlier Elon Musk has also raised serious concern over Google’s AI Chatbot Gemini. He wrote ‘Given that the Gemini AI will be at the heart of every Google product and YouTube, this is extremely alarming!\nAlso Read:  \n\n\n  \n\n\nGoogle CEO Sundar Pichai & Apple CEO Tim Cook’s Photo At A Restaurant Goes Viral; Check Hilarious Reactions\n\n\n \n \n\n\n  \n\n\nSundar Pichai, Elon Musk On AGI; SpaceX Founder Says ‘AI Will Probably Be Smarter Than Human ’, Are We Close To AGI?\n\n\n \n \n\n\n  \n\n\nGoogle CEO, Sundar Pichai, Will Be Fired Or He Will Resign, Says Helios Capital founder, Samir Arora\n\n\n \n  \nFor breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest\n                        Business News on India.com.\n                \n\n\nTopics\nSundar Pichaisundar pichai memo to employeesundar pichai on ai chatbotsundar pichai on gemini ai \n\n\n\n\nMore Stories   Google CEO Sundar Pichai’s Letter As It Appeared On Semafor, Reported TOI I want to address the recent issues with problematic text and image responses in the Gemini app (formerly Bard). I know that some of its responses have offended our users and shown bias – to be clear, that’s completely unacceptable and we got it wrong.Our teams have been working around the clock to address these issues.  We’re already seeing a substantial improvement on a wide range of prompts. No AI is perfect, especially at this emerging stage of the industry’s development, but we know the bar is high for us and we will keep at it for however long it takes. And we’ll review what happened and make sure we fix it at scale. Our mission to organise the world’s information and make it universally accessible and useful is sacrosanct. We’ve always sought to give users helpful, accurate, and unbiased information in our products. That’s why people trust them. This has to be our approach for all our products, including our emerging AI products.We’ll be driving a clear set of actions, including structural changes, updated product guidelines, improved launch processes, robust evals and red-teaming, and technical recommendations. We are looking across all of this and will make the necessary changes.Even as we learn from what went wrong here, we should also build on the product and technical announcements we’ve made in AI over the last several weeks. Google recently launched its official artificial intelligence (AI) tool for users globally. Gemini Pro 1.0 model is available in over 40 languages across more than 230 countries and territories. It is a paid tool which charges $19.99/month, starting with a complimentary two-month trial period. Gemini Advanced is part of the Google One AI Premium Plan. It is also integrated into various Google applications such as Gmail, Docs, Slides, Sheets, and more (formerly known as Duet AI). Earlier Elon Musk has also raised serious concern over Google’s AI Chatbot Gemini. He wrote ‘Given that the Gemini AI will be at the heart of every Google product and YouTube, this is extremely alarming! For breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest\n                        Business News on India.com. ‘Unacceptable,’ Google CEO Sundar Pichai’s Memo To Employees Over Recent Controversy On AI chatbot Gemini Check Petrol, Diesel Prices Today (29th March 2024) In Delhi, Noida, Mumbai, Chennai, Kolkata; Check Here Petrol Prices In Your City RBI Update: Exchange And Deposit of Rs 2,000 Notes Won't Be Available On This Date; Check Here India Among Top Semiconductor Producers In Next 5 Years: Ashwini Vaishnaw 'Over 88% of HRs Prefer Skills Over Experience'; Key Takeaways From Unstop Talent Report 2024 ‘Unacceptable,’ Google CEO Sundar Pichai’s Memo To Employees Over Recent Controversy On AI chatbot Gemini Google CEO Sundar Pichai & Apple CEO Tim Cook’s Photo At A Restaurant Goes Viral; Check Hilarious Reactions Sundar Pichai, Elon Musk On AGI; SpaceX Founder Says ‘AI Will Probably Be Smarter Than Human ’, Are We Close To AGI? Google CEO, Sundar Pichai, Will Be Fired Or He Will Resign, Says Helios Capital founder, Samir Arora Google Offers 300% Salary Hike To Stop An Employee From Joining Rival AI Company Headed By IIT-Madras Alumni By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts Cookies Policy. "
}