{
    "title": "Alphabet stock lower on analyst's AI warning",
    "date": "2/26/2024",
    "url": "https://finance.yahoo.com/video/google-stock-lower-analysts-ai-202719737.html",
    "text": "Alphabet (GOOG, GOOGL) shares slide ahead of Monday's closing bell after Melius Research Analyst Ben Reitzes warned about Google's AI direction, reiterating his Hold rating on the stock. Yahoo Finance Live monitors the Google parent company's stock. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan. JOSH LIPTON: Shares of Google parent company Alphabet, they are down today. That's after one analyst shared some concerns over the tech giant. Melius analyst Ben Reitzes highlighting that Alphabet's missteps in AI may fuel the perception that Google is an unreliable source for artificial intelligence. The analyst reiterated his hold rating on that company. So this was interesting-- an interesting note, Julie, in that yes, he did reiterate the whole target is $1.64. But this was a pretty tough note. And bottom line, yes, he says it has a moat in search, but this space is about to be disrupted, he says. He says other Mag Seven companies, frankly, are outflanking them in margin optimization in growth, in recurring revenues, talks about how the company last week released that AI image generator called Text Image AI, which was frankly a debacle. It made headlines for all the wrong reasons. And says if this fuels the perception that, in fact, the company is an unreliable source for AI, that is understandably bad for business. JULIE HYMAN: Yeah. His note on this is called Cheap for a Reason. JOSH LIPTON: Yeah. JULIE HYMAN: You know, and he has this hold rating on the stock. It's also interesting because he suggests alternatives to Google Search. He encourages people to play with Perplexity AI's solution. He says in the note that is a private company, Perplexity AI here. And he also talks about OpenAI running a new search product. Perplexity does run on the OpenAI platform. You have to wonder sort of habit is a powerful force. And so you do wonder it seems like it would take a lot for people to stop using Google. But this is an interesting question about the sort of reliability because Google has worked, in part, because of its reliability in Search. JOSH LIPTON: Yeah. I think it speaks to this broader concern you're hearing with Alphabet, though, among kind of analysts, investors that they. And they're kind of positioned AI and they have the data. They've got some of the smartest engineers on the planet. They certainly have a mountain of cash. But this perception that they're not moving as fast as maybe some of their peers. Related Quotes "
}