{
    "title": "Alphabet drops during renewed fears about Google's AI offerings",
    "date": "2/27/2024",
    "url": "https://www.moneyweb.co.za/news/ai/alphabet-drops-during-renewed-fears-about-googles-ai-offerings/",
    "text": "Alphabet is falling amid renewed fears that the Google owner’s missteps in artificial intelligence are putting its search business at risk. The stock dropped as much as 4.4% Monday following last week’s pause of a Google image generation feature that drew criticism over inaccurate historical depictions of race. Alphabet shed more than $70 billion from its market value.  Problems with AI tools may fuel the perception that Google is “an unreliable source for AI” and create an opening for competitors, Melius Research analyst Ben Reitzes warned in a research note. “We have been arguing that Search behaviour is about to change – with new AI-infused features,” said Reitzes. “This ‘once in a generation’ change by itself creates opportunities for competitors, but even more if a meaningful portion of users grow concerned about Google’s hallucinations and bias.” Last week, Google acknowledged inaccuracies in image generation depictions of people and said it’s addressing the problems. Google aims to resume the feature in the “next couple of weeks,” Demis Hassabis, head of the research division Google DeepMind, said on Monday at the Mobile World Congress in Barcelona. JavaScript is disabled in this browser. To access this article and many more from our archive, please enable JavaScript in your browser and purchase an Insider Gold subscription. SIGN IN SUBSCRIBE or create a free account. Free users can leave 4 comments per month.\nSubscribers can leave unlimited comments via our website and app. Among the tools will be one that expands on Visa’s current artificial-intelligence technology that helps detect and block fraud in digital transactions where no credit card is present. Email\n\n\nPassword\n\n Stay logged in\n\n\nForgot password Email Password Stay logged in  You can cancel at any time. "
}