{
    "title": null,
    "date": "2/16/2024",
    "url": "https://bgr.com/business/thanks-to-openai-its-never-been-clearer-that-sundar-pichai-is-googles-steve-ballmer/",
    "text": "Sign up for our daily newsletter If you buy through a BGR link, we may earn an affiliate commission, helping support our expert product labs. A poll earlier this month on the jobs site Blind asked users to click yes or no in response to the following statement: “Sundar Pichai is Google’s Steve Ballmer.” As of this writing, 76% of the poll’s respondents have agreed with the statement — that is, with the idea that Pichai is comparable to the former Microsoft CEO who led the company during a period of decline, when it missed out on ascendent technologies and lost its market dominance. In other words, the exact opposite of the kind of CEO Google needs at this very moment — with ominous legal challenges continuing to multiply, many of the search giant’s core products now showing their age, employees being laid off in seemingly arbitrary droves, and Google’s head start in AI having been eroded by the lightning pace of progress at Sam Altman’s OpenAI. The more you think about it, it’s not hard at all to see why the respondents to that poll feel like Pichai is this generation’s Ballmer. Both men, for example, were business managers who took over from revolutionary founders. Both Pichai and Ballmer became known for maximizing sales, and keeping investors happy, while likewise getting caught flat-footed by major technology shifts. Windows, of course, was too slow to recognize the shift to mobile, while Google has similarly found itself leap-frogged by OpenAI. “As a xoogler with a decent chunk of $GOOG,” reads a comment from the user who posted that Blind poll, “I’m hoping (Pichai) doesn’t last as long as Ballmer did.” Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. It’s not just OpenAI, by the way, that brings this realization about Google’s uninspiring leadership into stark relief. And you don’t even have to look all that hard to see the signs. Arguments wrapped in November, for example, in the search monopoly case against Google (which still has an 83% market share as of January). At the same time, Google Search is an increasingly garbage-filled hellscape of everything from Reddit, Quora, and Forbes posts — as well as People Also Ask questions and other automated nonsense — that make it harder than ever to find the damn thing you searched for in the first place. Along those lines, you can find dozens of Reddit threads over the past several months with some permutation of “Google sucks” in the title: Google search sucks now. F*** Google. Absolutely done with Google Search. What the hell happened to Google? “My hot take,” begins a LinkedIn post from a Googler that went viral in January. “Google does not have one single visionary leader. Not a one. From the C-suite to the SVPs to the VPs, they are all profoundly boring and glassy-eyed.” If you read or listen to interviews with Pichai — who made a base salary of $2 million last year, or more than $166,000 per month — you’d think his company is still the same technotopia it was as recently as the 2010s, when free on-campus massages were given out like candy and armies of people with six-figure salaries spent big chunks of their time on wacky, pie-in-the-sky projects (like ending death). The fact of the matter, though, is that this is a company whose CEO correctly predicted back in 2017 that we would “move from mobile first to an AI first world” and then proceeded to blow its head start in AI. Now, not only is OpenAI approaching a valuation of $100 billion and big enough to present a real, credible challenge to Google. Its AI capabilities are also advanced enough that the company is reportedly developing a search product that would take direct aim at Google Search. In a recent interview with Wired timed to Google’s 25th anniversary, Steven Levy asked Pichai whether Microsoft’s current CEO, Satya Nadella, was right when Nadella said his company “made Google dance” after Google rush-released its own AI search chat product following Microsoft’s move to plug OpenAI’s chatbot ChatGPT into Bing. Responded Pichai: “In cricket, there’s a saying that you let the bat do the talking. We have been innovating on AI, and also applying AI to search, every year. There’s always been competition. We’ve seen Alexa launch and Siri launch — this is not new. Around the end of last year, my thoughts were, how can we bring generative AI to search in a way that makes sense for our users?” Hi Sharks,I am seeking to destroy $1 trillion of shareholder value. pic.twitter.com/94gMmSqds1 I, however, remain skeptical that Pichai’s Google can successfully navigate that transition to “AI-first,” partly because it seems to me the company is increasingly slipping on the little things. Scoff at this if you want, but I have to check my Gmail spam folder every day now, lest I miss an important communication that Google has just started randomly routing to spam instead of my inbox. Search, Google’s mainstay, is also a hopeless mess now. Spam and AI-produced junk are everywhere. “It’s the worst quality results on Google I’ve seen in my 14-year career,” Lily Ray, senior director of search engine optimization at digital marketing agency Amsive Digital, told Fortune. “Right now, it feels like the scammers are winning.” There’s a great story from the early days of Google, as recounted in Ken Auletta’s 2009 book Googled, when founders Larry Page and Sergey Brin were showing Viacom executive Mel Karmazin how Google Search’s ad business works. They showed him how their new ad system makes everything trackable and measurable now. Isn’t it great? Gone would be the days of admen wooing buyers and having them pay partly for a brand’s aura. Back then, you knew a TV spot or a Super Bowl commercial worked — you just didn’t know to what extent it worked or who was buying your product as a result. Google Search ads promised to change all that. Karmazin, though, recoiled at the presentation; it’s terrible, he decided. He reasoned that you could keep squeezing more ad dollars out of buyers if they didn’t know what worked and why. Karmazin wanted buyers to keep paying for a little mystery. And then he declared to Page and Brin: “You guys are f*****g with the magic.” Pichai’s Google is still doing the same thing today, but in an altogether different way than Karmazin meant it back then. Andy Meek is a reporter based in Memphis who has covered media, entertainment, and culture for over 20 years. His work has appeared in outlets including The Guardian, Forbes, and The Financial Times, and he’s written for BGR since 2015. Andy's coverage includes technology and entertainment, and he has a particular interest in all things streaming. Over the years, he’s interviewed legendary figures in entertainment and tech that range from Stan Lee to John McAfee, Peter Thiel, and Reed Hastings. Sign up for the most interesting tech & entertainment news out there. By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice. BGR’s audience craves our industry-leading insights on the latest in tech and entertainment, as well as our authoritative and expansive reviews. We guide our loyal readers to some of the best products, latest trends, and most engaging stories with non-stop coverage, available across all major news platforms. Founded in 2006 Over 2 billion visitors 100K+ articles published Millions of readers helped Honest news coverage, reviews, and opinions since 2006. -\n\t\t\t\t\t\tJonathan S. Geller, Founder BGR is a part of Penske Media Corporation.\n© 2024 BGR Media, LLC. All Rights Reserved. "
}