{
    "title": "Snap faces investor backlash as ad revenue stumbles against tech giants \nMeta, Alphabet",
    "date": "2/8/2024",
    "url": "https://www.wionews.com/business-economy/snap-faces-investor-backlash-as-ad-revenue-stumbles-against-tech-giants-meta-alphabet-688153",
    "text": "The plummeting stock value, coupled with the struggle to compete for advertising dollars against industry giants like Meta and Alphabet, raises concerns about Snap's ability to maintain its market momentum. In a staggering downturn, Snap, the parent company of Snapchat, witnessed a sharp decline of over 32 per cent in its shares on Wednesday, following disappointing fourth-quarter revenue results that fell short of Wall Street expectations. This is based on a Reuters report. The plummeting stock value, coupled with the struggle to compete for advertising dollars against industry giants like Meta and Alphabet, raises concerns about Snap's ability to maintain its market momentum. Snap's fourth-quarter revenue reached $1.36 billion, missing the estimated $1.38 billion, marking a significant setback for the company in the fiercely competitive advertising landscape. Unlike Snap, Meta experienced a remarkable 25 per cent surge in advertising sales during the holiday quarter, while Alphabet's Google ad business grew by 11 per cent, with YouTube ad sales increasing by 16 per cent in the same period. Jasmine Enberg, principal analyst at Insider Intelligence, commented on Snap's performance, stating, \"Once again, Snap's results have disappointed investors,\" noting that the company's rebound is struggling to keep pace with the significant successes of tech giants in the advertising arena. Susannah Streeter, head of money and markets at Hargreaves Lansdown, emphasised the concern over Snap's management, stating that the recent disappointing results have turned into a \"crisis of confidence”. The market reaction to Snap's underwhelming performance is further intensified by the company's decision to lay off 10 per cent of its workforce, amounting to 528 employees. This move aims to \"invest incrementally\" in Snap's growth over time, but Bernstein analyst Mark Shmulik points out that despite these layoffs, the cost per employee remains high compared to industry benchmarks, while ad revenue growth lags behind. Snap's shares currently trade at a forward price-to-earnings (PE) ratio of 88.37, in stark contrast to Meta's 22.71 and Pinterest's 29.47, indicating a less attractive investment opportunity. \"Investor patience has been tested, and it's clear fewer are optimistic about Snap's ability to bounce back from the ad slump,\" noted Susannah Streeter. The market response signals a crisis for Snap, with its shares heading for the worst day since July 2022. (With inputs from Reuters) "
}