{
    "title": "Tech Giants Including Microsoft, Alphabet, PayPal Slashed 34,000 Positions \nFor Generative AI Investment I",
    "date": "2/12/2024",
    "url": "https://www.benzinga.com/news/24/02/37062601/tech-giants-including-microsoft-alphabet-paypal-slashed-34-000-positions-for-generative-ai-investmen",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW In a strategic move to invest in generative artificial intelligence (AI), major tech companies have collectively cut 34,000 jobs since the beginning of 2024. What Happened: Companies such as Microsoft Corp MSFT, Alphabet Inc GOOGL GOOG, PayPal Holdings Inc PYPL, and eBay Inc EBAY have been restructuring their workforces to focus on AI, reported the Financial Times. Analysts believe that these layoffs are part of a broader trend in the industry, where companies are reevaluating their workforce and reallocating resources to invest in new technologies. This move is also seen as a demonstration of the companies’ commitment to cost discipline. According to Layoffs.fyi, a website that tracks job cuts in the industry, a total of 138 tech companies have laid off staff this year. This number is significantly lower than the 263,000 job cuts that occurred in 2023, following a period of over-investment during the pandemic. \"Anybody working in tech or games right now is worried about lay-offs to some degree, either for themselves or someone they know,\" said Autumn Mitchell, a quality assurance tester at Microsoft video game subsidiary ZeniMax. \"You see one company announce lay-offs and think ‘Here we go, who's it going to be next week?'\" See Also: GameStop’s Tweet Adds Fuel To Panic Over Xbox’s Future: What’s Next For The Brand? Companies are also re-evaluating their investment priorities and cutting positions in non-core divisions. For example, Amazon.com Inc AMZN has cut hundreds of jobs in its Twitch video streaming platform. Why It Matters: The tech industry has been experiencing a significant shift in employment trends. After a period of massive hiring during the pandemic, the industry saw a wave of layoffs in 2023, with companies like Microsoft and Meta Platforms Inc META announcing thousands of job cuts. Despite a declining trend in tech layoffs during the second half of 2023, the trend reversed in January, with the number of employees laid off in the tech sector increasing by 304%. This trend has been attributed to various reasons, including restructuring, cost-cutting, and a push for a leaner organization. Amid these layoffs, tech companies are also making significant changes in restructuring and investments in AI. Google, for instance, estimates that it will spend $700 million in the first quarter of 2024 on employee severance amid a flurry of layoffs in the tech industry. Read Next: Elon Musk Calls Disney ‘DEI Gestapo’ After Memo Leak: ‘No Wonder Most Of Their Content … Has Sucked’ – Image Via Shutterstock Engineered by Benzinga Neuro, Edited by \nKaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}