{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by LVW Advisors LLC",
    "date": "3/26/2024",
    "url": "https://www.defenseworld.net/2024/03/26/alphabet-inc-nasdaqgoogl-shares-acquired-by-lvw-advisors-llc.html",
    "text": "Posted by Defense World Staff on Mar 26th, 2024 LVW Advisors LLC raised its stake in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 4.4% during the fourth quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The fund owned 27,861 shares of the information services provider’s stock after acquiring an additional 1,183 shares during the quarter. Alphabet makes up   0.7% of LVW Advisors LLC’s portfolio, making the stock its 28th biggest position. LVW Advisors LLC’s holdings in Alphabet were worth $3,892,000 as of its most recent filing with the Securities and Exchange Commission (SEC). Several other hedge funds and other institutional investors have also recently bought and sold shares of the company. Bornite Capital Management LP bought a new stake in shares of  Alphabet during the 1st quarter worth about $16,688,000.  Markel Corp lifted its holdings in shares of  Alphabet by 17.0% during the first quarter. Markel Corp now owns 15,500 shares of the information services provider’s stock valued at $43,110,000 after acquiring an additional 2,250 shares during the period.  United Bank increased its holdings in shares of  Alphabet by 5.9% during the first quarter. United Bank now owns 2,033 shares of the information services provider’s stock worth $5,654,000 after buying an additional 113 shares in the last quarter.  Mirae Asset Global Investments Co. Ltd. increased its holdings in  Alphabet by 23.4% during the 1st quarter. Mirae Asset Global Investments Co. Ltd. now owns 323,918 shares of the information services provider’s stock valued at $900,929,000 after purchasing an additional 61,427 shares in the last quarter.  Finally, Dakota Wealth Management grew its holdings in  Alphabet by 20.4% during the 1st quarter. Dakota Wealth Management now owns 9,279 shares of the information services provider’s stock worth $25,806,000 after acquiring an additional 1,570 shares during the last quarter. 35.08% of the stock is owned by institutional investors. In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the company’s stock in a transaction that occurred on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at $3,805,628.99. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. In other news, insider John Kent Walker sold 28,281 shares of the stock in a transaction that occurred on Thursday, December 28th. The stock was sold at an average price of $141.40, for a total transaction of $3,998,933.40. Following the completion of the sale, the insider now owns 25,002 shares of the company’s stock, valued at $3,535,282.80. The transaction was disclosed in a legal filing with the SEC, which is accessible through the SEC website. Also, CAO Amie Thuener O’toole sold 425 shares of the firm’s stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the completion of the sale, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. Insiders sold a total of 279,659 shares of company stock valued at $39,460,310 over the last 90 days. Insiders own  0.88% of the company’s stock. Several equities research analysts have recently commented on GOOGL shares. StockNews.com upgraded shares of Alphabet from a “buy” rating to a “strong-buy” rating in a research report on Wednesday, December 20th. Wedbush upped their target price on shares of Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a research note on Friday. Roth Mkm decreased their price target on shares of Alphabet from $166.00 to $164.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. Royal Bank of Canada  reiterated an “outperform” rating and set a $155.00 target price on shares of Alphabet in a report on Wednesday, January 31st. Finally, Needham & Company LLC  reissued a “buy” rating and issued a $160.00 price target on shares of Alphabet in a research note on Wednesday, January 31st. Five equities research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have given a strong buy rating to the company’s stock. Based on data from MarketBeat.com, the stock currently has an average rating of “Moderate Buy” and an average price target of $155.48. View Our Latest Report on GOOGL Shares of Alphabet stock opened at $150.07 on Tuesday. The company’s 50-day moving average price is $143.02 and its 200-day moving average price is $137.83. The company has a market cap of $1.87 trillion, a price-to-earnings ratio of 25.87, a PEG ratio of 1.39 and a beta of 1.04. The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a 12-month low of $99.74 and a 12-month high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The company had revenue of $86.31 billion during the quarter, compared to analyst estimates of $70.77 billion. During the same quarter in the previous year, the firm earned $1.05 earnings per share.  On average, equities analysts expect that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.    Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. AMETEK, Inc. (NYSE:AME) VP Thomas M. Montgomery Sells 6,891 Shares Alphabet Inc. (NASDAQ:GOOGL) Stake Lowered by JTC Employer Solutions Trustee Ltd "
}