{
    "title": "Here's Why It May Be Time To Sell Shares Of Google Stock",
    "date": "3/4/2024",
    "url": "https://www.investors.com/research/google-stock-sell-signals-openai-microsoft/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Investors in Google-parent Alphabet (GOOGL) may be experiencing a sense of deja vu in the wake of the company's fourth-quarter results on Jan. 30. The reason: Google stock has triggered two sell signals since then. The \"Magnificent Seven\" stock rallied to 153.78 after breaking out at a buy point of 139.42 in a cup with handle ahead of earnings. But IBD MarketSurge chart analysis shows that the stock gapped down after results. Shares then formed a flat base only to fall sharply and close 4% below the 10-week moving average last week. That drove Google stock below the earlier handle buy point of 139.42. That is a loss of 10.3% and triggered the round-trip sell rule. Shares were down another 3% on Monday and are trying to hold support at the 200-day moving average. But the stock has undercut its more recent flat base on a weekly chart. Meanwhile Google's Relative Strength Rating dropped steadily to 73 from 91 six months back. That shows the stock is outperforming fewer stocks in the Investors' Business Daily database. The Google stock chart also is showing other signs of weakening. The relative strength line took a plunge and continues to fall after shares gapped down on earnings on Jan. 31. Fourth-quarter sales of $95 billion rose 10% while earnings per share of $1.93 climbed 18% from the prior-year quarter. Meanwhile, the search giant faces increasing competition from OpenAI, in which Microsoft (MSFT) has a big stake. Microsoft has added OpenAI-developed search capability into its Bing search engine. Please follow VRamakrishnan on X/Twitter for more news on the stock market today. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders MarketSmith: Research, Charts, Data And Coaching All In One Place How To Research Growth Stocks: Why This IBD Tool Simplifies The Search For Top Stocks 3/29/2024\nBuying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the... 3/29/2024\nBuying a stock is easy, but purchasing the right stock... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}