{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/west-oak-capital-llc-boosts-stock-holdings-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 West Oak Capital LLC grew its position in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 5.4% in the 4th quarter, Holdings Channel.com reports. The firm owned 2,950 shares of the information services provider’s stock after buying an additional 150 shares during the period. West Oak Capital LLC’s holdings in Alphabet were worth $421,000 as of its most recent filing with the Securities and Exchange Commission (SEC). Several other institutional investors have also recently made changes to their positions in the company. DC Investments Management LLC purchased a new stake in  Alphabet in the 1st quarter worth $114,000.  Bridgefront Capital LLC purchased a new stake in  Alphabet in the 1st quarter worth $225,000.  Worth Asset Management LLC purchased a new stake in  Alphabet in the 1st quarter worth $206,000.  Eudaimonia Advisors LLC increased its holdings in  Alphabet by 15.1% in the 1st quarter. Eudaimonia Advisors LLC now owns 99 shares of the information services provider’s stock worth $275,000 after acquiring an additional 13 shares in the last quarter.  Finally, Aspire Capital Advisors LLC purchased a new stake in  Alphabet in the 1st quarter worth $281,000. 40.03% of the stock is owned by hedge funds and other institutional investors. Several equities research analysts recently commented on the stock. Mizuho boosted their price target on shares of Alphabet from $155.00 to $170.00 and gave the stock a “buy” rating in a report on Wednesday, January 17th. Roth Mkm cut their price target on shares of Alphabet from $166.00 to $164.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. StockNews.com raised shares of Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Needham & Company LLC  reaffirmed a “buy” rating and set a $160.00 target price on shares of Alphabet in a research note on Wednesday, January 31st. Finally, JMP Securities lifted their target price on shares of Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a research note on Wednesday, January 31st. Five equities research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have assigned  a strong buy rating to the company’s stock. According to data from MarketBeat, the company currently has a consensus rating of “Moderate Buy” and an average price target of $155.48. Get Our Latest Analysis on Alphabet In related news, CAO Amie Thuener O’toole sold 425 shares of the company’s stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total transaction of $59,334.25. Following the sale, the chief accounting officer now directly owns 27,259 shares in the company, valued at $3,805,628.99. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this link. In related news, insider John Kent Walker sold 12,084 shares of the company’s stock in a transaction that occurred on Wednesday, March 27th. The shares were sold at an average price of $151.19, for a total transaction of $1,826,979.96. Following the sale, the insider now directly owns 48,717 shares in the company, valued at $7,365,523.23. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this link. Also, CAO Amie Thuener O’toole sold 425 shares of the company’s stock in a transaction that occurred on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the sale, the chief accounting officer now owns 27,259 shares in the company, valued at $3,805,628.99. The disclosure for this sale can be found here. Insiders have sold 263,312 shares of company stock worth $37,268,315 over the last three months. Company insiders own  0.88% of the company’s stock. NASDAQ GOOGL opened at $150.93 on Friday. The firm’s 50-day moving average is $143.67 and its two-hundred day moving average is $138.21. Alphabet Inc. has a 12 month low of $99.78 and a 12 month high of $153.78. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. The stock has a market capitalization of $1.88 trillion, a P/E ratio of 26.02, a PEG ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. The company had revenue of $86.31 billion for the quarter, compared to analyst estimates of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same period in the prior year, the firm earned $1.05 earnings per share.  On average, sell-side analysts anticipate that  Alphabet Inc. will post 6.77 earnings per share for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Alphabet Inc. (NASDAQ:GOOGL) Shares Purchased by West Wealth Group LLC Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by First National Corp MA ADV "
}