{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) Shares Sold by Family Legacy Inc.",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/alphabet-inc-nasdaqgoogl-shares-sold-by-family-legacy-inc.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 Family Legacy Inc. trimmed its position in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 1.7% in the fourth quarter, according to its most recent disclosure with the SEC. The institutional investor  owned 34,685 shares of the information services provider’s stock after selling 582 shares during the period. Alphabet accounts for about  1.8% of Family Legacy Inc.’s investment portfolio, making the stock its 12th biggest holding. Family Legacy Inc.’s holdings in Alphabet were worth $4,845,000 at the end of the most recent reporting period. A number of other hedge funds have also bought and sold shares of the company. DE Burlo Group Inc. raised its holdings in shares of  Alphabet by 520.0% during the second quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider’s stock valued at $11,551,000 after buying an additional 80,934 shares during the last quarter.  West Tower Group LLC bought a new stake in shares of  Alphabet during the second quarter valued at approximately $88,000.  Ballast Advisors LLC raised its holdings in shares of  Alphabet by 9.6% during the third quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider’s stock valued at $2,061,000 after buying an additional 1,385 shares during the last quarter.  Quantum Financial Advisors LLC raised its holdings in shares of  Alphabet by 8.0% during the third quarter. Quantum Financial Advisors LLC now owns 7,623 shares of the information services provider’s stock valued at $998,000 after buying an additional 564 shares during the last quarter.  Finally, Acadian Asset Management LLC raised its holdings in shares of  Alphabet by 2.4% during the third quarter. Acadian Asset Management LLC now owns 4,416,533 shares of the information services provider’s stock valued at $577,908,000 after buying an additional 104,366 shares during the last quarter. 40.03% of the stock is currently owned by institutional investors and hedge funds. GOOGL has been the topic of a number of recent analyst reports. BMO Capital Markets lifted their price target on Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Rosenblatt Securities dropped their target price on Alphabet from $174.00 to $172.00 and set a “buy” rating on the stock in a report on Wednesday, January 31st. StockNews.com raised Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Truist Financial dropped their target price on Alphabet from $160.00 to $158.00 and set a “buy” rating on the stock in a report on Wednesday, January 31st. Finally, Susquehanna boosted their target price on Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a report on Wednesday, January 31st. Five research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have given a strong buy rating to the stock. According to data from MarketBeat.com, Alphabet presently has a consensus rating of “Moderate Buy” and an average target price of $155.48. Check Out Our Latest Research Report on GOOGL Shares of NASDAQ GOOGL opened at $150.93 on Friday. The stock has a market cap of $1.88 trillion, a price-to-earnings ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. Alphabet Inc. has a twelve month low of $99.78 and a twelve month high of $153.78. The company’s fifty day moving average is $143.52 and its 200-day moving average is $138.12. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating the consensus estimate of $1.60 by $0.04. The business had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same period in the previous year, the firm posted $1.05 EPS.  Equities research analysts predict that  Alphabet Inc. will post 6.77 EPS for the current year. In other Alphabet news, CFO Ruth Porat sold 48,077 shares of Alphabet stock in a transaction on Friday, March 8th. The shares were sold at an average price of $137.22, for a total value of $6,597,125.94. Following the sale, the chief financial officer now directly owns 1,777,106 shares in the company, valued at approximately $243,854,485.32. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this link. In other news, CEO Sundar Pichai sold 22,500 shares of the business’s stock in a transaction dated Wednesday, March 6th. The shares were sold at an average price of $132.70, for a total transaction of $2,985,750.00. Following the transaction, the chief executive officer now directly owns 2,332,691 shares in the company, valued at approximately $309,548,095.70. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, CFO Ruth Porat sold 48,077 shares of Alphabet stock in a transaction dated Friday, March 8th. The stock was sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the sale, the chief financial officer now directly owns 1,777,106 shares of the company’s stock, valued at approximately $243,854,485.32. The disclosure for this sale can be found here. In the last ninety days, insiders have sold 251,138 shares of company stock valued at $35,427,655. 0.88% of the stock is owned by corporate insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.    Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Gemmer Asset Management LLC Acquires 96 Shares of JPMorgan Chase & Co. (NYSE:JPM) Monarch Capital Management Inc. Sells 270 Shares of Alphabet Inc. (NASDAQ:GOOGL) "
}