{
    "title": "Cambridge Advisors Inc. Has $1.39 Million Position in Alphabet Inc. \n(NASDAQ:GOOGL)",
    "date": "3/27/2024",
    "url": "https://www.defenseworld.net/2024/03/27/cambridge-advisors-inc-has-1-39-million-position-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 27th, 2024 Cambridge Advisors Inc. lifted its stake in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 2.0% in the fourth quarter, HoldingsChannel.com reports. The institutional investor  owned 9,923 shares of the information services provider’s stock after buying an additional 190 shares during the quarter. Cambridge Advisors Inc.’s holdings in Alphabet were worth $1,386,000 as of its most recent filing with the SEC. A number of other hedge funds also recently modified their holdings of GOOGL. Vanguard Group Inc. increased its position in  Alphabet by 1,919.4% during the third quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock worth $45,628,484,000 after acquiring an additional 453,413,389 shares during the period.  State Street Corp raised its position in shares of  Alphabet by 1,900.6% in the 3rd quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock valued at $20,770,809,000 after buying an additional 206,300,042 shares in the last quarter.  Moneta Group Investment Advisors LLC raised its position in shares of  Alphabet by 111,197.8% in the 4th quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock valued at $15,036,178,000 after buying an additional 170,267,122 shares in the last quarter.  Price T Rowe Associates Inc. MD raised its position in shares of  Alphabet by 1,759.2% in the 3rd quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock valued at $11,106,502,000 after buying an additional 109,870,525 shares in the last quarter.  Finally, Norges Bank acquired a new position in shares of  Alphabet in the 4th quarter valued at approximately $8,335,063,000. Institutional investors and hedge funds own  40.03% of the company’s stock. Several equities analysts have recently commented on the stock. Susquehanna boosted their target price on shares of Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a research report on Wednesday, January 31st. Wolfe Research upped their price objective on shares of Alphabet from $170.00 to $180.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Rosenblatt Securities lowered their price objective on shares of Alphabet from $174.00 to $172.00 and set a “buy” rating for the company in a research report on Wednesday, January 31st. StockNews.com raised shares of Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Finally, KeyCorp increased their price objective on shares of Alphabet from $153.00 to $165.00 and gave the stock an “overweight” rating in a research report on Monday, January 29th. Five research analysts have rated the stock with a hold rating, twenty-six have issued  a buy rating and two have given a strong buy rating to the company. According to MarketBeat.com, the company presently has a consensus rating of “Moderate Buy” and an average target price of $155.48. Get Our Latest Stock Analysis on GOOGL Shares of NASDAQ:GOOGL opened at $150.67 on Wednesday. The stock has a 50 day moving average of $143.17 and a 200 day moving average of $137.93. The company has a market cap of $1.87 trillion, a PE ratio of 25.98, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a 12-month low of $99.74 and a 12-month high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. During the same period in the prior year, the company posted $1.05 EPS.  As a group, equities research analysts expect that  Alphabet Inc. will post 6.77 EPS for the current year. In other news, Director Frances Arnold sold 230 shares of the stock in a transaction that occurred on Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total transaction of $35,433.80. Following the completion of the transaction, the director now directly owns 15,104 shares in the company, valued at approximately $2,326,922.24. The transaction was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total value of $3,347,550.00. Following the sale, the chief executive officer now owns 2,310,191 shares in the company, valued at $343,710,216.98. The transaction was disclosed in a legal filing with the SEC, which is accessible through the SEC website. Also, Director Frances Arnold sold 230 shares of the stock in a transaction on Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total value of $35,433.80. Following the completion of the sale, the director now owns 15,104 shares in the company, valued at approximately $2,326,922.24. The disclosure for this sale can be found here. In the last ninety days, insiders sold 279,659 shares of company stock worth $39,460,310. 0.88% of the stock is currently owned by insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Invera Wealth Advisors LLC Takes Position in Alphabet Inc. (NASDAQ:GOOGL) Alphabet Inc. (NASDAQ:GOOGL) is Thompson Investment Management Inc.’s 2nd Largest Position "
}