{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.businessinsider.com/calls-for-google-ceo-sundar-pichai-alphabet-step-down-ai-2024-3",
    "text": "       It's tough in the Googleplex right now. The search giant, already feeling the heat of sudden and fierce competition in AI, has been making some public snafus. Google just hit pause on its Gemini image generator, which was creating historically inaccurate pictures. The slip-up was so bad it sent the company's stock tumbling and had Sundar Pichai, Google's CEO, address the troops, calling the situation \"completely unacceptable.\" The debacle has strengthened the narrative that Google is suddenly behind in the AI race, and now there's a growing chorus of voices calling for the company to replace Pichai. Ben Thompson, an analyst and the author of the \"Stratechery\" newsletter, wrote this week that Google was in need of a transformation that would \"mean removing those who let the former run amok, up to and including CEO Sundar Pichai.\" Googlers and others in Silicon Valley widely read Thompson's newsletters. Mark Shmulik, an analyst at Bernstein, also ruminated on whether it was time for a shake-up at the top of the internet giant in a research note published this week. \"The most recent saga only further raises increasingly louder questions around whether this is the right management team to guide Google into this next era,\" he wrote. Business Insider reached out to Google for comment. Combined with a prior Bard slip-up, where Google's AI chatbot made a stock-knocking error in a public demo, Google looks like it's suddenly rushing. And here's the problem: Google isn't good at rushing, thanks to what insiders say is too much bureaucracy and an aversion to harming its search business. Related stories Pichai, who was appointed CEO of Google in 2015 and Alphabet in 2019, has proven to be a strong peacetime CEO. He's been an effective and steady hand who protects Google's prized search business and deals diplomatically with regulators. His tenure has been good for shareholders: Google's market cap is currently around $1.7 trillion, up from just over $400 billion in 2015 when Pichai took over. But as BI reported this week, current and former employees are concerned that stasis has set in at the Googleplex, and that those problems are now surfacing publicly as the company tries to ship products to market as fast as possible. Aravind Srinivas — a founder and CEO of Perplexity, a former OpenAI researcher, and a former Google and DeepMind intern — also weighed in on the debate about Pichai's future this week and even theorized who might replace the CEO. But he did emphasize his admiration for Pichai. \"Sundar is also the CEO of Alphabet, and he is best positioned to appoint the CEO of Google,\" whether that's someone new from outside the company, or an internal candidate, or \"having himself continue,\" Srinivas wrote on X. Even Marissa Mayer, who was Google's 20th employee ever and worked there for 13 years, got involved in the debate. Responding to a tweet by Othman Laraki, the CEO of Color Health, who said Google is facing an \"unsolvable problem,\" Mayer somewhat defended Google. \"I want them to win and think they can,\" she wrote, but added: \"They've got to get focused on innovation and adopt a \"challenger\" (as opposed to a/the market leader) mindset.\" Shmulik said he's \"not ready to declare Google Search dead or even at risk from Generative AI\" until users start moving to other platforms for their search queries. But that may come sooner rather than later. Gartner recently predicted that traditional search could see a 25% drop by 2026 due to AI alternatives — such as Perplexity's chatbot-style offering. Google knows this is the reality it's facing, and so it's developing a new AI-powered search, slowly but surely. But the latest snafu has analysts worried about the long-term prospects, and whether Pichai can power Google through one of the biggest storms it's ever faced. The question is, if not Pichai, then who? Are you a current or former Googler with a tip? You can contact Hugh Langley encrypted messaging apps Signal and Telegram (628-228-1836) or email. On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Axel Springer, Business Insider's parent company, has a global deal to allow OpenAI to train its models on its media brands' reporting. Read next Jump to "
}