{
    "title": "Could UiPath Become the Next Alphabet?",
    "date": "3/23/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/AI/pressreleases/25002587/could-uipath-become-the-next-alphabet/",
    "text": "UiPath(NYSE: PATH) initially impressed investors when it went public in April 2021. The developer of tools for robotic process automation (RPA) listed its IPO at $56, and its stock rallied to a record high of $85.12 the following month. At the time, investors were dazzled by the growth potential of its RPA tools, which could be plugged into a company's applications to automate repetitive tasks like entering data, processing invoices, onboarding customers, and sending mass emails. UiPath's growth supported that bullish thesis. Its revenue soared 81% in fiscal 2021 (which ended in January 2021) and rose 47% in fiscal 2022. The pandemic also drove more companies to automate their office tasks. Image source: Getty Images. But in fiscal 2023, UiPath's revenue only rose 19% as inflation, rising interest rates, and the war in Ukraine drove companies to rein in software spending. Its revenue grew 24% in fiscal 2024 as some of those headwinds weakened, but its stock now trades nearly 60% below its IPO price at around $23. The bulls are still ignoring UiPath, so could this $13 billion RPA leader expand and evolve into a tech titan like Alphabet(NASDAQ: GOOG)(NASDAQ: GOOGL) over the next two decades? UiPath generated $1.3 billion in revenue in 2023. Alphabet, which went public as Google in 2004, generated $1.5 billion in revenue in 2003. But from 2003 to 2023, Alphabet's revenue had a compound annual growth rate (CAGR) of 30%, rising from $1.5 billion to $307.4 billion. That rapid expansion was driven by the growth of its market-leading search engine, YouTube's streaming video platform (which it acquired in 2006), mobile OS and apps, and other cloud-based services. It could be challenging for UiPath to grow at a comparable rate over the next 20 years. For now, analysts expect its revenue to have a CAGR of just 18% from fiscal 2024 to fiscal 2026 as the macroeconomic environment stabilizes. The company might still leverage its dominance of the growing RPA market to pump out double-digit growth through the end of the decade. UiPath controlled about 36% of the global RPA market last year, according to Gartner, while its closest competitors each held shares of less than 10%. Fortune Business Insights believes the RPA market could still show a CAGR of 20% from 2023 to 2030. If UiPath keeps pace with that market, its annual revenue could hit $7.2 billion by 2030. If the company continues to have a more moderate CAGR of 15% from 2030 to 2044, its revenue could rise to $50 billion by the final year. That would be much lower than the $307 billion in revenue that Alphabet generated in 2023 -- but that growth trajectory could still drive UiPath's stock to be nearly a 40-bagger over the next 20 years if its valuations hold steady. UiPath's long-term prospects seems promising, but it faces stiff competition from tech companies like Salesforce and Microsoft, which have both been rolling out more RPA services for their cloud-based ecosystems. Also, UiPath faces pressure from C3.ai, which plugs its AI algorithms into a company's software infrastructure to accelerate, automate, and optimize certain tasks. There's also a strong chance that newer generative-AI platforms like ChatGPT will make it easier for companies to automate their own tasks without UiPath's stand-alone RPA tools. UiPath insists it can roll with the punches by upgrading its RPA platform with more AI tools. It believes those tools will help it process tasks across an unstructured work environment by understanding the data instead of merely automating repetitive tasks. But without the support of its own dedicated cloud infrastructure platform, UiPath could struggle to scale those AI services and keep pace with its larger competitors. UiPath's business is stabilizing, but it remains unprofitable on the basis of generally accepted accounting principles (GAAP) and faces daunting long-term challenges. Its niche RPA market is growing, but it's nowhere as vast as Alphabet's core markets of digital advertising and cloud computing. Therefore, UiPath might still have room to grow as more companies accelerate their digital transformations, but it's far too early to consider it to be the next Alphabet. To be seriously compared to that tech leader, UiPath will need to significantly scale up its RPA business, expand its ecosystem into other markets, and possibly build its own cloud infrastructure to support that growth. Most of those things probably won't happen within the next few years. Should you invest $1,000 in UiPath right now? Before you buy stock in UiPath, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and UiPath wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 21, 2024  Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Microsoft, Salesforce, and UiPath. The Motley Fool recommends C3.ai and Gartner and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is C3.Ai Inc Cl A stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}