{
    "title": "Why I Just Increased My Google Position (NASDAQ:GOOG)",
    "date": "3/19/2024",
    "url": "https://seekingalpha.com/article/4679163-why-i-just-increased-my-google-position",
    "text": "400tmax  400tmax Here's the problem with Alphabet Inc. aka Google (NASDAQ:GOOG, NASDAQ:GOOGL). It became boring with all the \"AI hype.\" However, for anyone concerned with its actual AI prospects, boring Google is not. We saw many \"magnificent seven\" and other AI-related stocks skyrocketing recently. For instance, if we look back as little as eighteen months ago, here's how the magnificent seven have done since bottoming in late 2022 (from trough to peak): Despite a solid rebound off the bottom, Google's stock has lagged the other \"Mag 7\" stocks (excluding Apple). While the average magnificent seven return has been around 266%, Google's stock only appreciated by 85%. Moreover, Google's stock stumbled recently after reporting earnings on January 30th. Alphabet 1-year chart GOOG (stockcharts.com ) GOOG (stockcharts.com ) Alphabet's recent correction brought its share price down to $132, around the 200-day MA buy-in zone. Alphabet became considerably oversold, and the selloff offered a considerable long-term buying opportunity. I increased my Alphabet position to around $140, and there is likely substantial upside ahead for Google's stock. Despite the lack of \"AI hype\" surrounding Google, it is one of the top AI stocks. Moreover, Google remains the king of search and will likely continue dominating this core segment. Finally, trading below 19 times forward EPS estimates, Google is cheap and is the cheapest Mag 7 name around. Additionally, Google has considerable revenue and EPS growth potential, making it one of the most attractive stocks to buy right now. While analysts often emphasize Nvidia, Microsoft, and other companies' AI potential, Google frequently gets overlooked. Nonetheless, as the leading global search engine and Android operating system provider, Google may have more AI potential than almost anyone. Google Gemini is a family of AI models that can generate text and understand and operate on information such as images, audio, videos, and code. It is designed for developers to build AI-powered apps and integrate AI into their products. Google also uses Gemini to power its chatbot. Apple and Google are \"in talks\" to enable Google's Gemini to power the iPhone's AI features. This is a massive development for Google and Apple as it should bring the two tech giants closer together, opening enormous opportunities for both companies. In my view, the iPhone has become dull and stale recently. However, the new AI integration in the iPhone 16 should provide users with a much different and more exciting experience. An AI deal with Apple could expand Google's reach, leading to widespread use of its AI tools by the two billion+ iPhones Apple has in the market. Also, earlier this year, Samsung added Google-powered AI technology as Galaxy AI-branded features to its Galaxy S24 smartphones. Therefore, we see Google steadily spreading its AI tentacles throughout the smartphone kingdom, a dynamic that should translate to continued sales and EPS growth as we advance. We should also consider Google's advantage as it integrates its search and Android dominance into the equation. Despite attempts by Microsoft Bing and other competing search engines, Google remains the unrivaled search leader globally. Google's search dominance is especially prevalent in the ultra-lucrative mobile search market. Mobile search (oberlo.com) Mobile search (oberlo.com) Google dominates mobile search with about a 95.5% share of the mobile search market. This search dynamic obliterates its competitors, with Bing only around 0.5%. Also, likely why Yandex and Baidu have any \"significant\" search share is due to Google essentially being outlawed in communist China and the totalitarian modern-day Russian regime. Google has about a 91% share in tablet search and roughly an 82% share in desktop search, respectively. Google's \"total search\" share is around 92% and has not dipped below 90% since 2014. Google remains on top of its search game and should continue dominating as we advance. Additionally, Google's search advantage and its leading position in AI, Android, and other areas should enable Alphabet to provide excellent results in the coming years. Google's stock recently corrected by about 15%, creating an excellent long-term buying opportunity. Despite providing top and bottom line beats, Google's stock sold off unfairly, in my view. Revenue came in at $86.31 billion, a 13.5% YoY gain, and a beat of over $1B over the consensus estimate. EPS came in at $1.64, a beat of four cents, but the market expected something extraordinary. Nonetheless, Google is unlike Nvidia and many other \"hyped-up names\" it's not priced for perfection. On the contrary, Google is relatively cheap. EPS vs. estimates (seekingalpha.com) EPS vs. estimates (seekingalpha.com) First, Google is accustomed to beating consensus estimates. Consensus EPS forecasts for 2023 were $5.46, but Google delivered $5.80 instead, an outperformance rate of over 6%. The 2024 consensus EPS is $6.79, but a similar 6% outperformance rate implies that Alphabet could achieve about $7.20 this year. Also, applying a modest 5% outperformance rate to next year's consensus EPS figures suggests Google could earn around $8.25 in 2025. This dynamic implies that Google could be trading around 17 times forward earnings expectations, which is remarkably cheap for a company in Alphabet's advantageous position. Therefore, Google may be even cheaper than the current sub-19 forward P/E illustrates. The dual dynamic of increased EPS growth and multiple expansion may push Google's stock considerably higher as we advance. Where Google's stock could be in future years: Source: The Financial Prophet. I've raised my estimates modestly since my prior analysis concerning Google, and there is probably room for further upward revisions as we advance. Quantifying Google's AI effect is challenging, but given the company's advantageous position in critical markets we may see more money trickle down to its bottom line than many analysts expect. This dynamic and other favorable factors make Google one of the top stocks to buy and hold for the next ten years or longer. Despite Google's favorable prospects, there are risks involved. Alphabet faces continuous competition in search, AI, cloud, and other crucial markets. Top companies like Amazon, Microsoft, and others continuously battle for dominance in various markets. Google needs to innovate perpetually to continue increasing its stock price. Moreover, Google faces macroeconomic and regulatory risks that could impact its sales and earnings growth in future years. Investors should consider these and other risks before investing in Google. Are You Getting The Returns You Want? All-Weather Portfolio vs. The S&P 500 Don't Wait! Unlock Your Financial Prophet! Take advantage of the 2-week free trial and receive this limited-time 20% discount with your subscription. Sign up now and start beating the market for less than $1 a day! This article was written by Victor Dergunov is an independent investor and author with 20 years experience. He preaches diversification and shares investment ideas across all market sectors. Victor aims to help readers build portfolios that perform well in all economic conditions. Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG, NVDA, TSLA, AMZN either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I am long a diversified portfolio with hedges. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}