{
    "title": null,
    "date": "3/25/2024",
    "url": "https://nz.news.yahoo.com/finance/news/alphabet-inc-googl-beats-q2-212009474.html",
    "text": "Alphabet Inc. GOOGL just released its Q2 2016 earnings results, posting earnings of $6.47 per share and revenue of $21.5 billion. Currently, GOOGL has a Zacks Rank #3 (Hold), but it is subject to change following the release of the company’s latest earnings report. Here are 5 key statistics from this just announced report below. Alphabet Inc.: 1. Beat earnings estimates. The company posted earnings of $7.00 per share, beating our Zacks Consensus Estimate of $6.47. 2. Beat revenue estimates. The company saw revenue figures of $21.5 billion, crushing our estimate of $16.88 billion. 3. \"Our terrific second quarter results, with 21% revenue growth year on year, and 25% on a constant currency basis reflect the successful investments we've made over many years in rapidly expanding areas such as mobile and video. We continue to invest responsibly in support of our many compelling opportunities,” said Ruth Porat, CFO of Alphabet. 4. GOOGL saw a 29% year-over-year increase in aggregate paid clicks and a 7% increase from last quarter. It also saw a 37% year-over-year increase in paid clicks on Google websites, representing a 9% increase over last quarter. 5. GOOGL was up $23.86, or 3.12%, to $789.70 as of 4:19 p.m. EDT in after-hours trading shortly after its earnings report was released. Here’s a graph that looks at Alphabet Inc’s latest earnings performance: ALPHABET INC-A Price and EPS Surprise | ALPHABET INC-A Quote Alphabet Inc. is engaged in technology business. The Company provides web-based search, advertisements, maps, software applications, mobile operating systems, consumer content, enterprise solutions, commerce, and hardware products through its subsidiaries. Alphabet Inc., formerly known as Google Inc., is headquartered in Mountain View, California. Check back later for our full analysis on Alphabet Inc’s latest quarterly earnings report! If you want information on how to trade during earnings season, check out the Zacks Market Edge Podcast below. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report ALPHABET INC-A (GOOGL): Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research The King has smiled and waved at members of the public as he arrived for the Easter Sunday service at Windsor Castle. Cronulla have gone from 18-0 down after 25 minutes against Canberra to pull off a 36-22 comeback win, infuriating Raiders coach Ricky Stuart. 這款男性活力「超級配方」的一劑強效劑量就能消除虛弱……但令人驚訝的是它的作用原理。 Melbourne Victory surprised Sydney FC 4-0 on the last day of the A-League Women, allowing Melbourne City to win the premiership at the death. Import guard Jordon Crawford led the Tasmania JackJumpers to an 83-81 win over Melbourne United that clinched a rollicking best-of-five NBL Championship Series. Richmond have prevailed for an upset five-point win over Sydney at the MCG to give Adem Yze his first win as Tigers coach. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Australia have beaten Bangladesh by 10 wickets in their women's Twenty20 in Dhaka, with speedster Tayla Vlaeminck making a statement on return from injury. The Warriors have moved to 2-2 for the NRL season after seeing off Newcastle for a 20-12 win at Mt Smart Stadium on Sunday. Melbourne Victory have held on for a 2-1 victory over Perth Glory, with Bruno Fornaroli scoring a brace at AAMI Park.  Young Geelong ruckman Toby Conway will play on Easter Monday on a big day for the Cats, with Tom Hawkins to reach 350 games. Japanese health authorities have checked a second Kobayashi Pharmaceutical factory after deaths linked to dietary supplements. St Kilda young gun Marcus Windhager has been offered a one-game ban for a high bump on Essendon's Sam Durham.  Tim Tszyu's camp insists they have a world-title rematch clause against Sebastian Fundora after the Australian's fight was derailed by a head gash. The Victorian government has confirmed there will be a state memorial service for youth outreach workers Les Twentyman. West Coast were restricted to one of their lowest scores in history as the Western Bulldogs cruised to a 76-point win at Marvel Stadium.  Network Ten has lodged an application to reopen the Bruce Lehrmann defamation case, citing fresh evidence days before the judgment is due to be handed down. Broncos veteran Corey Oates has revealed why his new utility role is nothing new and how he battled through a knee injury to play wherever the coach wants him. A man will face court accused of threatening two taxi drivers with a knife and injuring one of them during botched robbery attempts.  Messages of forgiveness and renewal featured throughout Easter messages and religious services, as volunteers served feasts to those who are doing it tough. An ADF member deployed in a peacekeeping operation is recovering after being injured in a blast during a routine patrol of the Israel-Lebanon border. The Boston Celtics have rebounded from back-to-back defeats at the hands of Atlanta by scoring a 104-92 NBA win over the New Orleans Pelicans "
}