{
    "title": "2 Trillion-Dollar \"Magnificent Seven\" Stocks to Buy Hand Over Fist in March",
    "date": "3/7/2024",
    "url": "https://finance.yahoo.com/news/2-trillion-dollar-magnificent-seven-102900312.html",
    "text": "The \"Magnificent Seven\" is the apt moniker placed on a group of seven of the world's largest technology companies: Apple Microsoft Amazon Nvidia Tesla Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) Meta Platforms (NASDAQ: META) The Magnificent Seven stocks delivered an average return of 112.7% in 2023, handily outperforming the S&P 500 index, which was up just 24%. Last year, owning all seven of them worked like a charm, but the group is fraying in the early stages of 2024, with Tesla stock plunging 29% and Apple down 12% so far this year. As a result, investors might have to be more selective in 2024. Here's why Alphabet and Meta Platforms might be two of the best Magnificent Seven stocks to buy this month. Google stock came public in 2004, but it created Alphabet in 2015 after expanding beyond its flagship internet search engine. Alphabet is now home to Google and a number of other high-profile subsidiaries, including YouTube, DeepMind, and Waymo. The $1.6 trillion tech conglomerate still rules the internet with Google Search, maintaining a 91% global market share, but investors have been more focused on its progress in artificial intelligence (AI) lately. Microsoft made a $10 billion investment in ChatGPT creator OpenAI last year, and immediately integrated the chatbot into its Bing search engine. Investors grew concerned that Google Search could be disrupted, sparking Alphabet's quest to catch up to Microsoft in the AI race. Following a slate of AI product releases, Alphabet says its latest Gemini chatbot outperforms OpenAI's GPT-4 models across most multimodal benchmarks. In other words, it's better at interpreting and creating text, images, videos, and computer code. Gemini is now available as a stand-alone chatbot, and it can also help businesses craft Search ads. Plus, Google Workspace customers can now access it for an additional fee, empowering them to increase their productivity across Gmail, Docs, Slides, and more. Alphabet delivered $307.4 billion in revenue during 2023, which was a 9% increase from 2022. The advertising-based business of Google Search still accounts for most of the conglomerate's revenue, and it saw an acceleration in growth in the fourth quarter. It's a positive sign the ad market continues to improve following a 2022 slump driven by rising inflation and interest rates. Those results saw Alphabet stock hit an all-time high in January of this year, but it has since declined by 13%, which presents investors with a buying opportunity. Based on the company's $5.80 in 2023 earnings per share and its current stock price of $133.35, it trades at a price-to-earnings (P/E) ratio of just 23. That's a 30% discount to the 33 P/E ratio of the Nasdaq-100 index, and it makes Alphabet the cheapest of the Magnificent Seven stocks. That's an incredibly attractive valuation for a company that has quickly become a leader in the AI space. Meta Platforms is the parent company of popular social networks Facebook, Instagram, and WhatsApp. Its stock price soared 194% in 2023, making it the second-best performer in the entire S&P 500 index behind only Nvidia. AI is one reason Meta Platforms is so popular among investors at the moment, but the company is also reaping the rewards from its expansive cost cuts, which have sent its profits soaring. Meta is using AI in a few ways. First, it's deploying the technology to deliver more relevant content to users on Facebook and Instagram, which drove an uptick in the amount of time they spent on those platforms during 2023. AI learns what content users like, and it curates their feeds to show them more of it. That additional time allows Meta to feed users more ads, which translates into more revenue for the company. Second, Meta gives businesses AI tools to help them craft more engaging ads to drive more conversions. Additionally, each business on Meta's social platforms will eventually be able to deploy their own AI chatbot to handle incoming queries from customers through Messenger and WhatsApp. The chatbot will possess a broad knowledge of each unique business and reflect its core values. Finally, Meta has developed its own large language model (LLM) called Llama. It's open source whereas the LLMs underpinning generative AI applications like ChatGPT and Gemini are not. This strategy allows Meta to absorb feedback from thousands of developers to eliminate blind spots and accelerate improvements. CEO Mark Zuckerberg recently announced plans to acquire 350,000 industry-leading H100 graphics processing units (GPUs) from Nvidia at an estimated cost of $9 billion, which will speed up Llama's development. Zuckerberg declared 2023 a \"year of efficiency\" following a 76% peak-to-trough plunge in its stock price between 2021 and 2022. He slashed more than 21,000 jobs and committed to moderating the company's spending on initiatives like the metaverse in favor of investing heavily in its core social platforms and AI. The result was a 16% year-over-year jump in revenue and a whopping 73% increase in earnings per share (profit) during 2023. Despite the 544% gain in Meta stock from its 2022 low point -- which catapulted the company back to a $1 trillion valuation -- it still only trades at a P/E ratio of 33.2, which is basically in line with the Nasdaq-100. Considering Wall Street is forecasting a further 34% earnings growth in 2024, Meta stock still looks cheap at its current price. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. 2 Trillion-Dollar \"Magnificent Seven\" Stocks to Buy Hand Over Fist in March was originally published by The Motley Fool Related Quotes "
}