{
    "title": "Google Q4: Strong Results And Weak Reaction (NASDAQ:GOOG)",
    "date": "1/30/2024",
    "url": "https://seekingalpha.com/article/4666169-google-q4-strong-results-and-weak-reaction",
    "text": "Sundry Photography Sundry Photography Alphabet Inc. (NASDAQ:GOOG, NASDAQ:GOOGL) aka Google reported its most recent quarterly earnings results on Tuesday. The company beat estimates easily, but the market reaction was negative -- the company's shares sold off. While the valuation is not as low as it was, Alphabet still is an attractive investment, I believe. I last covered Alphabet in October, in which I called the post-earnings share price slump a buying opportunity. Shares have risen by 18% since then, indicating my thesis has been right. In this article, we'll update the thesis while looking at the most recent quarterly results. Alphabet Inc. has reported its fourth-quarter earnings results on Tuesday following the market's close. The headline numbers can be seen in the following screencap from Seeking Alpha: GOOG results (Seeking Alpha) GOOG results (Seeking Alpha) We see that the company was able to grow its revenues by 14% year-over-year, which is a nice growth rate both in absolute terms and relative to the growth of many other companies in the current environment. Consider, for example, that the first \"Magnificent 7\" company to report, Tesla, Inc. (TSLA), grew at just one-quarter of the rate Alphabet did during the most recent quarter. Alphabet did not only report compelling sales growth, but it also outperformed expectations, beating estimates by a little more than 1%. The company also outperformed earnings per share estimates, beating them by 2.5%. The earnings per share growth rate, relative to the previous year's fourth quarter, was very impressive, at close to 60%. When a company beats estimates on both lines and shows compelling revenue growth and excellent earnings per share growth, one could imagine that the share price reaction would be positive. In Alphabet's case, however, the market reaction wasn't positive -- at the time of writing, shares are down 4% to 5% in after-hours trading. This seems like an overreaction to me, but might be explained by the \"sell the news\" phenomenon -- when many market participants have expected positive news, shares can decline even when this positive news materializes. The steep share price gains over the last year could also help explain the post-earnings selloff, as some investors could be taking profits following the recent run higher by Alphabet's shares. After all, shares have risen by a hefty 58% over the last year, and by almost 10% in 2024 alone. Let's start with Alphabet's business growth, which has been compelling during the fourth quarter. The company saw gains across most of its divisions, with Google Search, YouTube, Google Cloud, and Google subscriptions, platforms, and devices all growing by double-digits compared to the previous year's fourth quarter. Among these units, Google Cloud saw the best relative growth rate, at 26%, but it should be noted that its absolute size is considerably smaller compared to Google Search, for example. Growing at a high relative rate when a business unit is generating around $10 billion in sales is easier compared to when a business unit is generating $40+ billion in sales. It would thus not be surprising if Google Cloud's revenue growth rate declines in the future. But at least for now, it remains a major growth driver, although Alphabet would have generated a nice business growth rate without Google Cloud, too. The only business unit that saw its sales decline was Google Network, where sales headed lower by 2%. That's not a great result at all, but not a disaster, either -- luckily, the decline was benign, and most investors do not see Google Network as a huge value creator anyway -- at least compared to other Alphabet units. While many companies are reporting weak top line growth or even sales declines, momentum seems to be on Alphabet's side -- the company continues to see its revenue growth accelerate. While revenue growth was rather low in the first quarter of 2023, at just 3%, the company's growth rate has risen consistently since then: Revenues grew by 7% in Q2 and by 11% in Q3 before hitting an even better 14% during the most recent quarter. With momentum being on Alphabet's side, and with the comparison to 2023's Q1 being pretty easy (as revenues grew just 3% back then), we might see a very compelling revenue growth rate during the current quarter, Q1 of 2024, as well. YouTube has generated some controversy due to its anti-AdBlock measures in the recent past, but that has not hurt its performance, it seems. The revenue growth rate of 16% suggests that users aren't moving away from the platform, thus the anti-AdBlock measures seem to be a good move business-wise. While Alphabet's business growth was strong, the margin performance was even better and arguably more important. The company continued to see its operating margin widen thanks to several contributing factors. First, operating leverage helps increase margins when a company is growing, all else equal. R&D expenses, for example, don't scale up when revenues and gross profits rise, thus these operating expenses shrink, relative to gross profits, thereby allowing for rising margins. Second, Alphabet has become more focused on profitability over time. Cost-cutting efforts and headcount reductions made Alphabet leaner and meaner, which had a positive impact on margins. The headcount is down around 8,000 over the last year, and yet, Alphabet is generating substantially higher sales -- which is a nice feat. Alphabet's operating margin expanded by 300 base points over the last year, allowing for operating profit growth to come in well ahead of revenue growth. Alphabet has a big net cash position of $111 billion. While its cash didn't generate a lot of returns when interest rates were near zero, things have changed in the recent past. Higher interest rates allowed Alphabet to grow its interest income from $660 million during 2022's fourth quarter to $1.1 billion during 2023's fourth quarter, which had a nice impact on company-wide net profits. When it comes to the company's earnings per share growth rate, an additional factor was at play. Strong cash flows and a large cash pile allow Alphabet to buy back shares at a substantial pace, which has resulted in a declining share count. This means that each remaining share's portion of the pie is growing, which is why earnings per share grew faster than the company's overall net income, at 57% versus 52%. Alphabet has a strong market position, and an excellent balance sheet, the company is growing at a nice pace despite a macro environment that isn't easy, and last but not least, management's focus on keeping costs under control results in appealing margin growth. With Q1 comparables being rather easy and with revenue growth momentum on Alphabet's side, I believe that near-term results could be quite positive. That being said, Alphabet is more expensive than it used to be in the recent past, which helps explain the underwhelming share price reaction to the company's strong results. Based on current earnings per share estimates for this year, Alphabet is trading at 23x net profits right now -- or 22x net profits when we account for the post-earnings, after-hours share price decline. One year ago, Alphabet was trading at less than 20x net profits, and a couple of months ago, the valuation was considerably lower as well. I do not believe that a 22x to 23x earnings multiple is excessive -- it is not. But buying a high-quality company at 18x net profits is even better than buying it at 22x net profits, thus I do believe that Alphabet isn't as great a buy as it was last year. Overall, I remain bullish on Google's shares and am very happy with my position, but I am not quite as bullish as I was last year when shares were trading at an even lower valuation, i.e., at a more substantial discount to fair value. Is This an Income Stream Which Induces Fear? The primary goal of the Cash Flow Kingdom Income Portfolio is to produce an overall yield in the 7% - 10% range. We accomplish this by combining several different income streams to form an attractive, steady portfolio payout. The portfolio's price can fluctuate, but the income stream remains consistent. Start your free two-week trial today! This article was written by Jonathan Weber holds an engineering degree and has been active in the stock market and as a freelance analyst for many years. He has been sharing his research on Seeking Alpha since 2014. Jonathan’s primary focus is on value and income stocks but he covers growth occasionally. He is a contributing author for the investing group Cash Flow Club where along with Darren McCammon, they focus on company cash flows and their access to capital. Core features include: access to the leader’s personal income portfolio targeting 6%+ yield, community chat, the “Best Opportunities” List, coverage of energy midstream, commercial mREITs, BDCs, and shipping sectors,, and transparency on performance. Learn More. Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}