{
    "title": "What's Going On With Google Stock Thursday? - Alphabet (NASDAQ:GOOGL)",
    "date": "1/25/2024",
    "url": "https://www.benzinga.com/news/24/01/36787939/whats-going-on-with-google-stock-thursday",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Google parent Alphabet Inc’s GOOG GOOGL stock is up on Thursday. It resolved a patent lawsuit on Wednesday involving AI technology, with the claim amounting to an extraordinary $1.67 billion. Singular Computing, established by Massachusetts computer scientist Joseph Bates, initiated the lawsuit. The company accused Google of misusing its computer-processing solutions. Google has also partnered with Hugging Face, a startup specializing in AI software, to host its platform on Google’s cloud computing network. This collaboration will allow Hugging Face to offer its platform through Google Cloud, significantly expanding developers’ access to the startup’s AI tools. The Hugging Face partnership will likely accelerate innovation by enabling more developers to create AI applications using Hugging Face’s resources and Google Cloud’s computing capabilities and specialized hardware, Bloomberg reports. This agreement bolsters Google’s relationship with the open-source AI community, a sector increasingly competitive with significant tech companies in developing cost-effective AI models. Hugging Face, a New York-based company founded in 2016, has gained popularity for sharing open-source AI models. Through this partnership, developers using Hugging Face will benefit from the technological resources of Google Cloud. Hugging Face CEO Clement Delangue highlighted the partnership’s potential to enhance the capabilities of both Hugging Face users and Google Cloud customers. Google’s involvement in Hugging Face’s recent funding round, valued at $4.5 billion, further solidifies its collaborative efforts in the AI field. In 2023, Google committed close to $2 billion to AI startup Anthropic after reports of Amazon.Com Inc AMZN decided to earmark $4 billion. Google already integrated its Bard artificial intelligence chatbot with several popular products, including Gmail, YouTube, and Google Docs. Big tech companies, including Amazon, Microsoft Corp MSFT, and Google, remain aggressively invested in their AI ambitions. Analysts projected $1 trillion in AI-driven opportunities for companies like Nvidia Corp NVDA as they wholeheartedly splurge on AI technology. Price Action: GOOG shares are trading higher by 1.66% at $152.85 on the last check Thursday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo: Courtesy Jonny Gios via Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}