{
    "title": "Alphabet Layoffs Good for Investors",
    "date": "1/23/2024",
    "url": "https://247wallst.com/business/2024/01/23/alphabet-layoffs-good-for-investors/",
    "text": "One thing that helped mega tech company stocks recover from a dip over a year ago was layoffs. Some companies, including Meta Platforms Inc. (NASDAQ: META), cut well over 10,000 jobs. Alphabet Inc. (NASDAQ: GOOGL) did the same in more than one wave. With Wall Street’s concern about the high cost of some of its divisions, Alphabet has cut again. Alphabet’s X Lab was created to identify and exploit technologies that had not been on the parent company’s radar. When it was formed almost 14 years ago, Google founders Larry Page and Sergey Brin said they founded X Lab to consider “far-out, sci-fi sounding technologies that could one day make the world a radically better place.” It looked at several hundred projects. Few, if any, matured into significant business opportunities. Alphabet will go outside its walls to fund any projects X worked on that have promise. According to The Information, “X is looking to spin out more projects as independent companies after spinning a cybersecurity related project last year, an Alphabet spokesperson said.” Alphabet did not say how many people it let go, but it means more focus on the public corporation’s core businesses, both at Google and YouTube. Investors had grown tired of expensive experiments across the big tech landscape. They did not like the multibillion-dollar investment Mark Zuckerberg’s Meta made in the Metaverse. They did not like Amazon’s aggressive move into consumer electronics. Alphabet also had pet projects like the Pixel smartphone. Why would Alphabet management believe it could compete with market leaders Samsung and Apple? (Apple could buy these 25 huge companies right now with cash.) In the past year, Alphabet’s stock has gone from less than $100 per share to $147. One way to keep up that momentum is to show that management wants to stick to what it knows best. That is, and always has been, digital advertising, no matter what else the company has tried. Sponsored: Want to Retire Early? Here’s a Great First Step Want retirement to come a few years earlier than you’d planned? Or are you ready to retire now, but want an extra set of eyes on your finances? Now you can speak with up to 3 financial experts in your area for FREE. By simply clicking here you can begin to match with financial professionals who can help you build your plan to retire early. And the best part? The first conversation with them is free. Click here to match with up to 3 financial pros who would be excited to help you make financial decisions. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}