{
    "title": "Google CEO warns of future job cuts",
    "date": "1/24/2024",
    "url": "https://www.techerati.com/news-hub/google-ceo-warns-of-future-job-cuts/",
    "text": "  Written by Rebecca Uffindell Wed 24 Jan 2024 CEO of Google and Alphabet, Sundar Pichai, has warned staff more job cuts will come in addition to recent layoffs. In a staff memo, Pichai stated certain roles may be affected as company divisions undergo ongoing changes. “We have ambitious goals and will be investing in our big priorities … The reality is that to create the capacity for this investment, we have to make tough choices,” said Pichai in a memo seen by The Verge. Pichai added these role eliminations are not at the scale of last year’s reductions and will not touch every team. As of September 30 last year, the company had a workforce of 182,000, as reported in its latest quarterly results. Pichai said the layoffs were about ‘removing layers to simplify execution and drive velocity in some areas’. “Many of these changes are already announced, though to be upfront, some teams will continue to make specific resource allocation decisions throughout the year where needed, and some roles may be impacted,” added Pichai. Earlier this month, Google cut 1,000 jobs across its hardware, voice-assistance, and engineering teams to invest in the company’s biggest priorities and future opportunities. On 12 January, the Alphabet Workers Union labelled the Google layoffs as both ‘unnecessary’ and ‘counterproductive’. The Alphabet Workers Union said they will not stop fighting until their jobs are safe. Last year, Google said it would lay off 12,000 employees, around 6% of its workforce. Google attributed the layoffs to overexpansion as tech companies experienced heightened levels of demand during the COVID-19 pandemic. Pichai said Google ‘hired for a different economic reality’ than the one experienced by the company. Several major technology companies are also facing layoffs. Earlier this month, Amazon said it will lay off hundreds of its employees from its Prime Video and studio units with plans to cut 500 employees from its live-streaming platform, Twitch. This move followed Amazon’s earlier rounds of layoffs. In March, the company announced 9,000 job cuts on top of the 18,000 employees laid off in January 2023. In March, Meta, the parent company of Facebook, Instagram, and WhatsApp, cut more than 20,000 jobs. In 2022, Twitter employees prepared themselves for substantial layoffs. Around 2,000 staff, or 25% of the workforce, were expected to be dismissed as part of an extensive overhaul. Sign up for your weekly tech briefings!  Written by Rebecca Uffindell Wed 24 Jan 2024 March 26, 2024 July 27, 2023 March 27, 2024 March 11, 2024 March 25, 2024 March 26, 2024   EMEA report from JLL predicts strong data centre growth i... National Grid CEO forecasts energy surge driven by AI and... PIMCO launches £257M European data centre fund Pulsant opens new £4.5M data centre hall in Manchester Budget cuts threaten EU’s green and digital transit... Techerati brings you the latest business technology news for AI, big data, cloud, cybersecurity, data centres, and more. © CloserStill Media Ltd 2014-2024, All Rights Reserved "
}