{
    "title": "Google lays off hundreds joining other tech companies",
    "date": "1/11/2024",
    "url": "https://apnews.com/article/google-layoffs-alphabet-amazon-tech-1de7e1a6b806a3252cfbb25fc4c5b2e3",
    "text": "Copyright 2024 The Associated Press. All Rights Reserved. Easter 2024 FILE - A Google sign hangs over an entrance to the company’s new building, Sept. 6, 2023, in New York. Google has laid off hundreds of employees working on its hardware, voice assistance and engineering teams as part of cost-cutting measures. (AP Photo/Peter Morgan, File) Google has laid off hundreds of employees working on its hardware, voice assistance and engineering teams as part of cost-cutting measures. The cuts come as Google looks towards “responsibly investing in our company’s biggest priorities and the significant opportunities ahead,” the company said in a statement. “Some teams are continuing to make these kinds of organizational changes, which include some role eliminations globally,” it said. Google earlier said it was eliminating a few hundred roles, with most of the impact on its augmented reality hardware team. The cuts follow pledges by executives of Google and its parent company Alphabet to reduce costs. A year ago, Google said it would lay off 12,000 employees or around 6% of its workforce. In a post on X — previously known as Twitter — the Alphabet Workers Union described the job cuts as “another round of needless layoffs.” “Our members and teammates work hard every day to build great products for our users, and the company cannot continue to fire our coworkers while making billions every quarter,” the union wrote. “We won’t stop fighting until our jobs are safe!” Google is not the only technology company cutting back. In the past year, Meta -- the parent company of Facebook -- has slashed more than 20,000 jobs to reassure investors. Meta’s stock price gained about 178% in 2023. Spotify said in December that it was axing 17% of its global workforce, the music streaming service’s third round of layoffs in 2023 as it moved to slash costs and improve its profitability.  Earlier this week, Amazon laid off hundreds of employees in its Prime Video and studios units. It also will lay off about 500 employees who work on its livestreaming platform Twitch. Amazon has cut thousands of jobs after a hiring surge during the pandemic. In March, Amazon announced that it planned to lay off 9,000 employees, on top of 18,000 employees it said that it would lay off in January 2023. Google is currently locked in a fierce rivalry with Microsoft as both firms strive to lead in the artificial intelligence domain. Microsoft has stepped up its artificial intelligence offerings to rival Google’s. In September, Microsoft introduced a Copilot feature that incorporates artificial intelligence into products like search engine Bing, browser Edge as well as Windows for its corporate customers. Copyright 2024 The Associated Press. All Rights Reserved. "
}