{
    "title": null,
    "date": "2/2/2024",
    "url": "https://finance.yahoo.com/video/google-amazon-apple-meta-microsoft-203022305.html",
    "text": "Several major companies, including five of the Magnificent Seven — Alphabet (GOOG, GOOGL), Amazon (AMZN), Apple (AAPL), Meta Platforms (META), Microsoft (MSFT) – reported quarterly earnings this week. Yahoo Finance spoke to executives, experts, and analysts across the industry to break down everything investors need to know, including the winners and losers from this week's results. Yahoo Finance Markets Reporter Josh Schafer broke down the big earnings week ahead and what to expect from these mega-cap tech companies. Schafer said, \"Really, you're only missing Nvidia in terms of massive tech companies to report this week. And really I think the story here is understanding how big this is going to be for the overall market.\" GM (00:00:14) General Motors (GM) reported better-than-expected fourth-quarter results. General Motors CFO Paul Jacobson discussed the results, EV adoption, and the company's growth plans. Jacobson said, \"It was another year of overcoming a lot of challenges. As we think about 2024, it really is a year of execution. For us, we've got the roadmap. We talked about 200,000 to 300,000 EVs being produced this year.\" Alphabet (00:00:36) Alphabet reported better-than-expected revenue and profit, but ad revenue came in weaker than analyst estimates of $65.94 billion. Baird Technology Desk Sector Strategist Ted Mortonson provided insight into the results and the impacts of AI on Google and other tech companies. Mortonson said, \"People are really focused on this move to generative AI and that seems to be a very big focus longer term for The Street, where Google has had basically a monopoly on search. With generative AI, you've got different players at least trying to dethrone them in some way.\" Microsoft (00:00:52) Microsoft's fiscal second-quarter earnings beat estimates, but Wall Street supposedly expected more from AI-driven revenue streams. Brent Bracelin, Piper Sandler Equity Research Analyst on Cloud, discussed the results and outlook for future revenues as generative AI turns roughly one-year-old in its adoption by tech giants. Bracelin said, \"Generative AI is one-year-old. We're one year into this new AI cycle of Microsoft. They disclosed their AI business actually doubled sequentially. It's now a $4.4 billion run rate business in year one.\" Starbucks (00:01:10) Starbucks (SBUX) released its latest quarterly earnings with results missing revenue expectations despite growing over 8% year-over-year. In addition, the company is cutting its original full-year guidance for 2024. Starbucks CFO Rachel Ruggeri discussed the latest earnings report, what the company plans to change, and ongoing headwinds for the company. Ruggeri said, \"We had a strong quarter in Q1, and it was really driven by our most loyal customers remaining engaged across the globe. And so as we think about going forward ... what we're really focused on is continuing to drive customers into our rewards program.\" Boeing (00:01:29) Boeing (BA) narrowed its fourth-quarter losses as outlined in its latest earnings results, but is withholding 2024 guidance amid questions surrounding the manufacturing of its 737 Max 9 jet series. Melius Research Managing Director of Aerospace, Defense & Space Robert Spingarn broke down the implications for Boeing. Spingarn said, \"The fact that there's no guide here isn't really a suspension so far as I can tell ... The FAA has asked for a freeze on the 737, arguably the most important product they do. And I think they're just being smart and not trying to get ahead of the regulator.\" Novo Nordisk (00:01:47) Novo Nordisk (NVO) reported a 36% surge in sales thanks to high demand for weight loss drugs Wegovy and Ozempic. Novo Nordisk CFO Karsten Munk Knudsen discussed the company’s results and what it has in store in the coming months. Knudsen said, \"We are really happy and very proud about the results we delivered this morning. Being able to grow the company by 36% is historic in our context and in an industrial context.\" Qualcomm (00:02:08) Qualcomm (QCOM) posted its first-quarter earnings results, revealing a quarterly revenue of $9.94 billion, $6.69 billion of which came from its handsets division, a 16% increase year-over-year. Qualcomm Chief Financial Officer and Chief Operating Officer Akash Palkhiwala discussed the chipmaker's performance, the current transition to AI-based tech, and China's economic environment. Palkhiwala said, \"When people buy a new phone, they're buying a more expensive phone. And so we are seeing this tremendous make shift towards more expensive devices, towards more expensive chips. And that shows up in our revenue growth.\" Meta (00:02:21) Meta Platforms outpaced Wall Street estimates for its fourth-quarter earnings, posting $40.1 billion in revenue and earnings of $5.33 per share. Seaport Global Analyst Aaron Kessler discussed Meta's earnings and its guidance around pivots into AI. Kessler said, \"Obviously investors are going to like that showing continued expense discipline on their part. And so I think investors are really more focused on the guidance and the dividend for Meta.\" Amazon (00:02:36) Amazon reported its fourth-quarter earnings, beating Wall Street estimates with $170 billion in revenue versus an expected $166.2 billion. Wedbush Securities Managing Director Scott Devitt broke down the results and the performance of the online retailer's various segments and business properties. Devitt said, \"At $13.2 billion, which is what they did in the quarter, you have a trajectory that's leading the company towards kind of a 10% bogey in 2025 now, which is not something that investors were expecting.\" Apple (00:02:50) Apple's first-quarter earnings results blew past Wall Street estimates, posting over $119.5 billion in revenue and adjusted earnings per share of $2.18. However, net sales across Apple's categories and devices fell below expectations, particularly in its services and performance in China. Manhattan Venture Partners Head of Research Santosh Rao discussed Apple's sales miss and how Apple will proceed in generative AI investments. Rao said, \"The number is a miss overall, but I think it's not a major disaster because it's all about the future here going forward, how they get the generative AI into their whole mix and all that. So there are a lot of other levers that they can pull, but at this point it is definitely a disappointment that two areas that we were concerned about did disappoint.\" Related Quotes "
}