{
    "title": null,
    "date": "2/13/2024",
    "url": "https://investorplace.com/market360/2024/02/goog-stock-glow-up-why-alphabets-ai-move-is-sparking-major-buzz/",
    "text": " Alphabet's latest moves to monetize its generative AI technology is a major positive Advertisement Source: achinthamb / Shutterstock.com Alphabet (NASDAQ:GOOG,NASDAQ:GOOGL) stock has experienced choppy price action since the tech giant’s earnings release last month, but my GOOG stock outlook calls for increased bullishness. I’m referring to the latest news about Gemini, Alphabet’s advanced AI language model, first unveiled in December. At first, you may think this latest news is nothing major. The market’s perception of this company’s potential has shifted. This news boosts confidence in gen AI’s potential impact on the tech giant’s performance. This may make investors even more bullish on Alphabet’s AI capabilities. On Feb. 8, Alphabet CEO Sundar Pichai made two major announcements regarding Google’s generative AI platform. First, Pichai announced Google has renamed its Bard chatbot to Gemini, in order to align it with the branding of the aforementioned LLM. Second, and more important for the GOOG stock outlook, Pichai also announced the launch of new subscription-based AI applications. These include Gemini Advanced, a service targeted at both consumers and businesses, as well as the re-branding of existing applications for the commercial market, to reflect the integration of the company’s Gemini AI technology. Admittedly, this news so far has not had a dramatic impact on GOOG’s stock price. Shares surged the day after the news, but later retreated to prior levels. However, to say that this development is “small potatoes” could prove mistaken in hindsight. Why? The impact may not be immediate (i.e. this quarter). However, in the quarters ahead, the launch of these new/revamped applications, along with Alphabet’s other Gemini integration efforts, could have both a material impact on the company’s bottom line, and the market’s perception of the stock. In recent coverage of GOOG stock, I have discussed how both AI and non-AI catalysts could go a long way in enabling Alphabet to not just meet, but beat, growth forecasts for the current year. Consider this latest news as a further indication of this happening. Analyst consensus currently calls for Alphabet to report revenue of $342.4 billion, and $6.76 per share in earnings, during 2024. However, the high end of sell-side forecasts call for revenue modestly above this figure (around $351 billion), and earnings 11% (to $7.51 per share) above this forecast. It’s clear what this may mean for the GOOG stock forecast. Earnings beats in the coming quarters could send it surging in a big way, for two reasons. First, higher-than-expected earnings may lead to a re-rating in tandem with raised expectations. Second, and possibly of greater impact to GOOG’s stock price performance, is the potential for greater AI success to result in a significant re-rating in the stock’s valuation. As I have pointed out many times before, Alphabet sports a lower valuation than its “Magnificent Seven” peers. Even a partial bridging of the valuation gap could generate big gains. The market may act indifferently about the Gemini news, but this could really work to your advantage. If these catalysts lead to earnings growth for Alphabet, the “re-rate rally” thesis could happen. Earnings of $7 to $7.50 per share, plus a move to a high-20s forward multiple, could help GOOG hit $200 per share far sooner than expected. Such a move would represent a 35.7% move higher from current price levels. If Gemini, plus efforts to integrate AI into its search advertising and cloud computing segments, enables the company to sustain double-digit sales growth, and 15%-20% earnings growth, many more years of strong returns may be to follow. As the GOOG stock forecast gets rosier, feel free to make shares a buy at current prices. GOOG stock earns a B rating in Portfolio Grader. On the date of publication, neither Louis Navellier nor the InvestorPlace Research Staff member primarily responsible for this article held (either directly or indirectly) any positions in the securities mentioned in this article. Artificial Intelligence, Cloud, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/02/goog-stock-glow-up-why-alphabets-ai-move-is-sparking-major-buzz/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Stocks to Buy Hot Stocks Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}