{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36948285/alphabet-is-reportedly-eyeing-external-funding-for-gfiber-internet-expansion",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW In a recent development, Alphabet Inc GOOGL GOOG is reportedly seeking external investment for its GFiber internet business. What Happened: Alphabet aims to accelerate the growth of GFiber, a provider of Wi-Fi and internet services in certain U.S. regions. GFiber, a subsidiary of Google’s parent company, competes with major internet service providers such as Comcast Corporation CMCSA, Verizon Communications Inc. VZ, and AT&T Inc T, Reuters reported. Since its inception in Kansas in 2012, GFiber has expanded its services to 15 states and tripled its customer base in the last six years. The company also inked agreements in 2023 to extend its services to over 25 additional cities. See Also: Marjorie Taylor Greene Opposes Biden’s Kids Sit Next To Parents For Free On Planes Measure: He Is ‘Pandering For Votes’ “This next step of raising external capital will enable them (GFiber) to scale their technical leadership, expand their reach, and provide better internet access to more communities,” stated Ruth Porat, Alphabet’s president and chief investment officer. Alphabet has not revealed the amount of funds GFiber is seeking or the valuation it is targeting. GFiber has already engaged an investment bank to begin the process of selling equity in the company, with the ultimate goal of becoming independent from Alphabet. GFiber CEO Dinni Jain said in a statement: “We are now ready to scale this much faster.” GFiber is part of Alphabet’s ‘Other Bets’, a collection of businesses at an earlier stage of research or commercialization. These include health company Verily and self-driving car business Waymo, both of which have raised money from outside investors. Why It Matters: Alphabet’s move to seek external funding for GFiber comes in the wake of several significant developments. In 2022, GFiber announced a landmark expansion to multiple cities. The following year, GFiber rolled out a 20Gbps internet service, significantly boosting its internet speed. In January, Alphabet collaborated with the Chilean government to establish the first undersea cable connecting South America with the Asia Pacific region. These developments highlight Alphabet’s commitment to expanding GFiber’s reach and improving internet access across the globe. Read Next: Trumped-up Charges? Poll Reveals What Most Americans Think Of Cases Against Embattled Ex-president Image Via Unsplash Engineered by\n        Benzinga Neuro, Edited by\n        \n\n              Kaustubh Bagalkote The GPT-4-based Benzinga Neuro content generation system exploits the\n        extensive Benzinga Ecosystem, including native data, APIs, and more to\n        create comprehensive and timely stories for you.\n        Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}