{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.tradingview.com/news/investorplace:503a95f96094b:0-why-are-stocks-down-today/",
    "text": "The stock market is seeing red across the board on Tuesday, the first day of trading this week. Why are stocks down today? Well, investors appear to be showing a bit of anxiety ahead of Nvidia’s NVDA fourth-quarter earnings report due Wednesday. Indeed, the chipmaker is down more than 4% today despite relatively optimistic expectations for the tech giant. Nvidia has proven to be one of the biggest market movers this year. One of the loftiest beneficiaries of the ongoing artificial intelligence (AI) craze, NVDA stock is up 44% so far this year. Recently, Nvidia even overtook the likes of Amazon AMZN and Alphabet GOOG in terms of market capitalization, albeit briefly. Nvidia’s surge in valuation has drawn comparisons to meme stocks and cryptocurrencies. “With technology now trading at close to 30x forward estimates, that seems to be a ceiling for the tech sector. Makes it pretty hard for additional PE multiple expansion,” said CFRA Research Chief Investment Strategist Sam Stovall. “What investors have to wait on is for earnings to come in better-than-anticipated so that the 2024 and 2025 estimates end up being improved.” Why Are Stocks Down Today? The S&P 500 and Nasdaq Composite are both in the red today, down 0.6% and 0.9%, respectively. Meanwhile, the Russell 2000 — which tracks small-cap stocks — is down 1.4% as of this writing. Today’s dip serves as something of a follow-up to last week’s losses, spurred by concerning economic data. Indeed, last week’s January Consumer Price Index (CPI) report showed that inflation was proving more stubborn than investors had hoped, igniting fears that the Federal Reserve may hold off cutting rates until the second half of the year. Predictably, investors responded to the economic data bearishly, with the S&P losing about 0.3% on the week and the Nasdaq shedding around 1%. This may be fueling today’s selloff, following Monday’s President’s Day holiday and stock market closure. That said, indices are still enjoying a fairly strong year almost two months in. The S&P is up almost 5% year-to-date (YTD) while the Nasdaq is up almost 6%. On the date of publication, Shrey Dua did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. With degrees in economics and journalism, Shrey Dua leverages his ample experience in media and reporting to contribute well-informed articles covering everything from financial regulation and the electric vehicle industry to the housing market and monetary policy. Shrey’s articles have featured in the likes of Morning Brew, Real Clear Markets, the Downline Podcast, and more. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}