{
    "title": "Meta stuns Wall Street with its first dividend. Amazon and Alphabet may be \nnext.",
    "date": "2/1/2024",
    "url": "https://www.marketwatch.com/story/meta-stuns-wall-street-with-its-first-dividend-amazon-and-alphabet-could-be-next-b8b2349e",
    "text": "Meta Platforms Inc. surprised Wall Street on Thursday with its first-ever dividend, a move that’s likely Silicon Valley’s most monumental dividend decision since Apple Inc. reinstated its payout over a decade ago — and one that could light a fire under other tech giants. With Meta’s \n        META,\n        -1.68%\n       plans to pay a 50 cents-a-share quarterly dividend beginning in March, the company will join Apple \n        AAPL,\n        -1.06%\n       and Microsoft Corp. \n        MSFT,\n        -0.17%\n       among Big Tech’s dividend payers. Chief Executive Mark Zuckerberg’s willingness to make this move could lead investors to clamor for similar moves by Alphabet Inc. \n        GOOG,\n        +0.21%\nGOOGL,\n        +0.04%\n       and Amazon.com Inc. \n        AMZN,\n        +0.31%,\n       two tech holdouts that are older than Meta. Meta’s dividend plans could get the stock noticed even more on Wall Street, including by the committee choosing components for the Dow Jones Industrial Average \n        DJIA.\n       While it’s no longer required for Dow candidates to issue dividends, paying one could certainly help Meta’s resume. Currently within the Dow, only Salesforce.com Inc. \n        CRM,\n        -0.07%\n       and Boeing Co. \n        BA,\n        +0.54%\n       do not pay dividends; Boeing’s was suspended in 2020, along with its share-buyback program. Ultimately, decisions about new Dow entrants are at the will of the index committee, but the communications services sector, of which Meta and Amazon are part, is underweighted in the Dow relative to the S&P 500 \n        SPX. Read more: Why you can count on the Dow making changes in February Investors are celebrating the news already, with Meta shares surging nearly 15% in after-hours trading after Thursday afternoon’s earnings report, which brought the dividend news as well as more evidence that Meta’s “Year of Efficiency” has paid off. During Meta’s call with Wall Street analysts, the company was only asked about the dividend once. Chief Financial Officer Susan Li said that the dividend gives the company a more balanced capital-return program and some added flexibility. Share repurchases will remain the biggest component of Meta’s capital-return program. The dividend “doesn’t change the way we determine the total amount of capital we return,” Li said. “And we expect that share repurchases will continue to be the primary way that we return capital to shareholders.” During the call, Meta executives talked about the company’s opportunities in artificial intelligence and its expectations for hefty spending on data-center infrastructure buildouts in 2024. While Meta’s mature approach to shareholder returns could get it more respect by some investors, it could make others nervous about the flip side of what being a dividend payer means to a tech powerhouse — that your glory, go-go days of being a plucky, fast-growing company are over. Meta has truly become a grown-up company — and investors will have to accept both sides of that. The company says the leaked data set seems to be from 2019 or earlier. Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. Visit a quote page and your recently viewed tickers will be displayed here. "
}