{
    "title": "Google CEO Sundar Pichai Admits Gemini AI Errors 'Completely Unacceptable:' \n'No AI Is Perfect... We Got It Wrong'",
    "date": "2/27/2024",
    "url": "https://www.tradingview.com/news/benzinga:b2d9c52c2094b:0-google-ceo-sundar-pichai-admits-gemini-ai-errors-completely-unacceptable-no-ai-is-perfect-we-got-it-wrong/",
    "text": "Alphabet Inc.'s GOOG GOOGL Google CEO Sundar Pichai addressed the recent uproar over the company’s Gemini AI chatbot, which has faced criticism for generating historically inaccurate images and text. What Happened: Acknowledging the issue for the first time since the Gemini controversy broke out last week, Pichai said that it is \"completely inacceptable\" in an internal memo reported by Semafor. Gemini AI had been generating racially diverse images of Nazi-era German soldiers, and US Founding Fathers even misrepresented Google’s own co-founders. This led to Google temporarily disabling the AI’s ability to generate images. In the memo, Pichai stated that the company has been “working around the clock” to address the problematic responses in Gemini. However, he did not confirm that the problem had been completely resolved. See Also: AI Reportedly Fails Voters With Wrong, Harmful Answers On US Elections: ‘Chatbots Not Ready for Primetime’ \"No AI is perfect, especially at this emerging stage of the industry's development, but we know the bar is high for us and we will keep at it for however long it takes.\" Pichai also emphasized that Google’s mission to organize the world’s information and make it universally accessible and useful remains \"sacrosanct.\" He assured that the company will be driving a clear set of actions, including structural changes, updated product guidelines, improved launch processes, and technical recommendations to prevent such issues in the future. Why It Matters: The controversy began when Gemini AI was found to be generating irrelevant or inaccurate images, including those of Google’s co-founders Larry Page and Sergey Brin. Following this, Google halted Gemini AI’s image generation feature after it inaccurately represented historical figures. The issue drew criticism from tech billionaires like Elon Musk, who revealed that Google was taking immediate action to address the concerns of racial and gender bias in Gemini AI. The controversy has raised questions about the responsible use of AI, with former Reddit CEO Yishan Wong suggesting that the issue is bigger than just being \"woke.\" Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Jim Cramer Says Alphabet Should Follow Apple’s Lead And Cut Ineffective Projects: ‘Time Google...Start Focusing On Actually Making Some Money’ Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: World Economic Forum on Flickr © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}