{
    "title": "Snap's shares plummet over 32% amidst market concerns",
    "date": "2/8/2024",
    "url": "https://www.afaqs.com/news/digital/snap-inc-faces-investors-backlash-as-ad-revenue-falls-compared-to-meta-and-alphabet",
    "text": "Sign up for afaqs! Newsletters Sign up for afaqs! Newsletters Share Via: Investors are criticising it against tech giants Meta and Alphabet. According to Reuters, Snap, the parent company of Snapchat, saw a significant decrease in its shares on February 7, 2024 of more than 32%. Concerns over Snap's capacity to sustain its market momentum are raised by the company's declining stock value as well as its difficulty in competing for advertising money against major players in the market like Meta and Alphabet. In the highly competitive advertising market, Snap's fourth-quarter revenue of $1.36 billion fell short of the projected $1.38 billion, posing a serious blow for the company. In contrast to Snap, Meta witnessed a 25% increase in advertising sales during the quarter. Alphabet's Google ad business climbed by 11%, while YouTube ad sales increased by 16% during the same period. Susannah Streeter, head of money and markets at Hargreaves Lansdown, emphasised the worries regarding Snap's management, saying that the company's recent underwhelming results had created a \"crisis of confidence.\" Market backlash to Snap's performance is deteriorating due to the company's decision to fire 10% of its workforce. This action is intended to \"invest incrementally\" in its growth over time. Mark Shmulik, a Bernstein analyst, notes that despite these layoffs, the company's cost per employee is still high when compared to industry norms, and the growth of its ad income is moving slowly. The market response signals a crisis for Snap, with its shares heading for the worst day since July 2022. Stay updated with newsletter Follow us on : Copyright © 2024 afaqs!. All pages of the Website are subject to our terms and conditions and privacy policy. You must not reproduce, duplicate, copy, sell, resell or exploit any material on the Website for any commercial purposes. "
}