{
    "title": null,
    "date": "2/16/2024",
    "url": "https://finbold.com/wall-street-sets-google-stock-price-for-next-12-months/",
    "text": "Alphabet (NASDAQ: GOOGL) has seen fierce competition in the domain of AI, as it seems that it is slowly falling behind in the race to become the industry leader, as OpenAI’s ChatGPT continues to outdo Google Gemini (formerly known as Bard). Alphabet, Google’s parent company, witnessed a decrease in its share value on February 15. This decline followed reports indicating that OpenAI is developing a web search product poised to directly challenge Google’s market position. At the final bell on February 15, GOOGL closed at $143.94, marking a -2.17% decrease. However, this minor loss adds to a -2.69% downside observed over the previous five trading sessions, highlighting the stock’s recent downward trend. Currently, GOOGL is trading within the upper range of its 52-week span. However, compared to the S&P 500 Index, which is approaching a new peak, GOOGL is trailing the market slightly. There is notable support at $137.27, identified from a trend line observed in the weekly timeframe. On the other hand, a resistance zone spanning from $143.47 to $146.52 is evident. This resistance zone is established by converging multiple trend lines and significant moving averages in the daily timeframe. However, the current performance and potential future intense competition don’t seem to scare analysts from TipRanks, as they are optimistic about GOOGL stock and award it with a ‘strong buy.’ Of 37 experts, 29 opted towards ‘buy,’ 8 advised ‘hold,’ and none to ‘sell.’ Furthermore, the average price target is set at $164.56, which is an upside of 15.26% from the current price level. Their colleagues from TradingView share the same kind of optimism and award it with a ‘buy’ rating. Of 61 experts, 40 went for the ‘buy’ ranking, 8 advised a ‘buy,’ and 13 to ‘hold.’ The price target is also similar at $164.24, representing a 15.04% upside. The current underperformance of GOOGL stock underscores apprehensions regarding the potential influence of competing artificial intelligence services on Google’s supremacy within the search sector. However, analysts assert that the perceived risk to Alphabet from an OpenAI search product remains relatively minimal. According to Colin Sebastian, an analyst at Baird, crafting a credible contender in the search arena poses significant challenges, with Google having effectively repelled numerous competitors over time due to the excellence of its search outcomes. Sebastian further highlighted that alternative search engines would probably need to surpass Google’s performance to genuinely alter user habits, which even OpenAI might find daunting. While the goal of surpassing Google as a search engine might look far-fetched, OpenAI continues to move boundaries when it comes to generative AI, as it recently introduced Sora, a text-to-video model. Buy stocks now with eToro – trusted and advanced investment platform Disclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk. Best Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals. 0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees. Copy top-performing traders in real time, automatically. eToro USA is registered with FINRA for securities trading. By subscribing you agree with Finbold\nT&C’s\n& Privacy Policy Or copy link Copyright © 2024 Finbold.com. All rights reserved. Use of this site constitutes acceptance of our Terms of Service. WARNING: The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. This site is not intended for use in jurisdictions in which the trading or investments described are prohibited and should only be used by such persons and in such ways as are legally permitted. Your investment may not qualify for investor protection in your country or state of residence, so please conduct your own due diligence. This website is free for you to use but we may receive commission from the companies we feature on this site. "
}