{
    "title": "Google Subsidiaries: The List Of Companies Owned By Google [Alphabet]",
    "date": "2/4/2024",
    "url": "https://fourweekmba.com/google-subsidiaries/",
    "text": "The Leading Source of Insights On Business Model Strategy & Tech Business Models The Leading Source of Insights On Business Model Strategy & Tech Business Models Google’s business model (now Alphabet) started as a search engine to navigate the web, and over the years, it acquired other companies like YouTube and Android. It placed other bets on what the company defines as “moonshots.” Among the other bets are companies like Verily, Nest, Access, and Waymo. Table of Contents AdMob is a mobile advertising company that was founded in 2006 by Omar Hamoui whilst a business student at the Wharton School. The company was initially headquartered in Mountain View, California, but later moved to San Mateo. AdMob started as a platform that enabled mobile app developers to monetize their apps with advertisements. Google acquired Admob in 2009 for $750 million after outbidding rival Apple. Four years later, the company updated the Admob platform with technology from AdSense that would better assist app developers with earning ad revenue. Mandiant is a cybersecurity firm that was founded as Red Cliff Consulting in 2004 by Kevin Mandia. Mandia is the creator of OpenIOC (Open Indicators of Compromise), a scheme for the description of multiple characteristics that identify threats, evidence of compromise, and the methods of security hackers. The company rose to prominence in early 2013 after it documented evidence of Chinese cybercriminals attacking at least 141 American and other English-speaking organizations. Later that year, Mandiant was acquired by FireEye (formerly McAfee Enterprises and now Trellix) for more than $1 billion. FireEye then sold the company to Symphony Technology Group in June 2021, with Google then acquiring it in March 2022 for $5.4 billion. Ultimately, various assets were incorporated into the Google Cloud division in September of that year. Looker (Looker Data Sciences) is a computer software company that was founded in Santa Cruz, California, by Ben Porterfield and Lloyd Tabb. Looker initially offered a product that enabled teams with only a basic understanding of SQL to explore, save, and download data. Google announced that it would be acquiring Looker for $2.6 billion in June 2019. At the time, Google’s cloud computing division was a distant third to powerhouses Amazon and Microsoft in terms of revenue. However, Google Cloud’s BigQuery tool for large database management had performed well and the acquisition was seen as a way for the company to double down on analytics. Kaggle is an online community for data scientists, machine learning engineers, and other enthusiasts where it is possible to participate in science competitions, collaborate on open-source projects, and access a wide range of datasets. Kaggle was founded in 2010 by Australian data scientist Anthony Goldbloom and software developer Ben Hamner. The community was launched with an inaugural machine learning competition, with subsequent competitions used to improve gesture recognition for Microsoft Kinect and further research into HIV and traffic forecasting, among many other initiatives. In March 2017, Google Chief Scientist Fei-Fei Li announced that Kaggle and its community of  800,000 users would be joining Google Cloud. Sidewalk Labs is an urban planning and infrastructure company whose mission is to address issues such as energy consumption, traffic congestion, and the high cost of living. Sidewalk Labs was founded by Daniel Doctoroff in 2015. Doctoroff is an American businessman and urban planner who once served as the CEO of Bloomberg L.P. and Deputy Mayor under New York City Mayor Michael Bloomberg. After Doctoroff stepped down due to poor health in late 2021, Sidewalk Labs was folded into Google. The company’s core products were subsequently incorporated into Google’s urban sustainability efforts, with Alphabet also spinning out Sidewalk’s Canopy Buildings project as an independent company. Calico Life Sciences LLC is a Google subsidiary involved in health research and development, biotechnology, and life sciences. In Google’s 2013 Founders Letter, Larry Page described the company’s core focus as “health, well-being, and longevity.” Calico was founded as a Google project in 2013 by Bill Maris, an entrepreneur and venture capitalist who also served as the company’s VP of Special Projects. The current CEO of Calico is Arthur D. Levinson who is also the Chairman of Apple Inc. CapitalG is Alphabet’s independent growth fund. Founded as Google Capital in 2013, the firm was only made public in 2014 and was renamed after the Alphabet restructure in 2016. CapitalG was founded by David Lawee (a former Google VP of Corporate Development and its first VP of Marketing). Lawee was also joined by partners Gene Frantz, Derek Zanutto, Jesse Wedler, and former Google Director of Sales & Business Operations Laela Sturdy. The company’s investment focus is on emerging, long-term technology trends that are poised to drive disruption in their respective industries. Some of CapitalG’s notable investments include SurveyMonkey, Credit Karma, Glassdoor, Duolingo, Snap Inc., Airbnb, Stripe, Robinhood, Lyft, and NEXT insurance. DeepMind is an AI research laboratory based in London that was founded by Demis Hassabis, Shane Legg, and Mustafa Suleyman. The company started with the development of neural networks that learned to play early video games and then were able to beat human players at more complex games such as Go. Google acquired DeepMind in 2014 for an estimated $400 million, with Hassabis noting at the time that the deal would “allow us to turbo-charge our mission to harness the power of machine learning tools to tackle some of society’s toughest problems and help make our everyday lives more productive and enjoyable.” Google Fiber is a subsidiary that provides broadband internet and IPTV to homes in the United States via fiber-to-the-premises. The service was first introduced to residents of Kansas City, Kansas, as an experimental project in 2011 to provide ultra-fast internet access. However, in December 2012 at The New York Times’ Dealbook Conference, Google Executive Chairman Eric Schmidt noted that Google Fiber had become a viable business model. This was no doubt facilitated by Netflix naming it the most consistently fast ISP in America with an average speed of 2.55 megabits per second. Google Fiber is now available in a selection of cities across Alabama, Arizona, California, Colorado, Florida, Georgia, Illinois, Iowa, Nebraska, North Carolina, Tennessee, Texas, Utah, and Washington. Wing is a Google subsidiary associated with drone delivery and unmanned air traffic management systems. The company started life as a Google X project and now designs, manufactures, and deploys lightweight delivery drones. Aircraft are autonomous in the sense that they use advanced vision to understand their environment. They can also plan their own routes, check for system errors, and respond to delivery requests on demand. Wing was the first drone delivery company to receive certification from the Federal Aviation Administration. The certification enabled the company to operate as an airline and has since performed over 300,000 deliveries across the US, Australia, and Finland. Verily Life Sciences (formerly Google Life Sciences) is a research organization that was founded in 2015 as a subsidiary of Alphabet Inc. Google Life Sciences was a division of Google X until Sergey Brin announced that it would transition to an independent subsidiary. Verily aims to apply technology and science to improve healthcare outcomes for people around the world. The company has a core focus on innovative solutions that tackle difficult health problems related to chronic and infectious diseases. Some of the Verily’s notable projects include smart contact lenses for glucose monitoring, wearable devices for tracking tremors in Parkinson’s disease patients, and the development of a COVID-19 testing program. GV Management Company is a venture capital firm based in Silicon Valley that was formerly known as Google Ventures. GV was founded in 2009 as the venture capital arm of Google but, like Verily, became an independent entity under Alphabet in 2015 GV provides seed, venture, and growth stage funding to tech companies in a variety of industries that includes healthcare, AI, software, hardware, life sciences, transportation, agriculture, and cyber security. Its investment portfolio includes companies such as GitLab, Verve, Stripe, Bowery, Dapper Labs, Determined AI, and Nimble. Intrinsic is an Alphabet subsidiary that was established in 2019 to develop software and robotics technologies for advanced manufacturing. Intrinsic aims to make industrial robots more accessible, flexible, and useful with software that simplifies the programming and operation of associated systems. The technology behind Intrinsic Innovation was developed at X for five years before it became an independent Alphabet company. Today, Intrinsic is focused on identifying partners in the electronics, healthcare, and automotive industries that are already using industrial robotics. The company is currently headed by CEO Wendy Tan White and employs some of the world’s leading robotics experts. These include CTO Torsten Kroeger, innovator Rainer Bischoff, and reinforcement learning luminary Stefan Schaal. ITA Software is a travel industry software company that was founded in 1996 by a group of MIT computer scientists. The company’s first product was a software platform called QPX which provides airlines and travel agencies with real-time pricing and availability information for flights, hotels, and car rentals. In July 2010, Google announced its intentions to acquire the Massachusetts-based company for $700 million. The intention behind the deal was to “create a new, easier way for users to find better flight information online, which should encourage more users to make their flight purchases online.” Jigsaw is a technology incubator and think tank that was created by Eric Schmidt in 2010. The company’s mission is to use technology to address some of the most pressing global security challenges, such as those related to cyber-attacks, online censorship, and political extremism. The company’s projects include developing tools to detect and prevent online harassment, combat disinformation and propaganda, and improve digital security for vulnerable populations such as journalists and human rights activists. Other projects include a 2016 collaboration with the Wikimedia Foundation to better understand harassment on Wikipedia using machine learning. Jigsaw also worked with The Washington Post in 2017 to launch a community-driven repository of analogies that help explain complex tech jargon to the layperson. Who Owns Google How Does Google Make Money Google Business Model Google Other Bets Google Cloud Business How Big Is Google? Google Traffic Acquisition Costs YouTube Business Model Google vs. Bing Google Profits Google Revenue Breakdown Google Advertising Revenue Apple vs. Google Google Employees Number Google Revenue Per Employee YouTube Ad Revenue Main Free Guides: Read next:   Copyright © 2024  FourWeekMBA Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}