{
    "title": "NVIDIA market value surpasses Google-parent Alphabet, Amazon in days",
    "date": "2/15/2024",
    "url": "https://interestingengineering.com/culture/nvidia-ai-power-excels-alphabet-amazons",
    "text": "The AI chipmaker is the fourth most valuable company in the world. Wikimedia Commons By subscribing, you agree to our Terms of Use and Policies You may unsubscribe at any time. NVIDIA is on fire! No, not literally. But it’s definitely turning up the heat in stock markets. After surpassing Amazon’s value recently, now the world’s biggest AI chip maker has overtaken Google’s parent company Alphabet. It’s become the third most valuable company in the United States and the fourth most valuable in the world. NVIDIA’s shares went up 2.5% on Wednesday, making the company worth about $1.83 trillion, more than Alphabet’s $1.82 trillion, reported Bloomberg. Microsoft, Apple, and Saudi Aramco are ahead in the first, second, and third positions, respectively. Alphabet has assumed fifth place after NVIDIA’s surge. Microsoft has a valuation of $3 trillion, followed by Apple at $2.8 trillion, and then Saudi Aramco at $2 trillion. NVIDIA’s rise has been unstoppable this year, with their stock climbing about 49%, adding a whopping $602 billion in value, with a commanding grip on approximately 80% of the high-end AI chip market. This surge is mainly because everyone wants their AI chips, which power data centers for complicated tasks needed in AI applications. Compared to NVIDIA’s skyrocketing success, other big tech companies seem slow. NVIDIA is set to report its earnings on February 21, and analysts are expecting another strong performance. Wall Street sees continued high demand for NVIDIA’s H100 accelerators, especially from big customers like Microsoft and Meta Platforms. Based in Santa Clara, California, NVIDIA has become a beacon of innovation and progress, riding the wave in pursuit of integrating AI into diverse products and services. The ascendancy of NVIDIA is not an isolated incident but rather a culmination of its role in meeting the demand for AI-centric solutions. However, Nvidia’s remarkable trajectory is not without its challenges. The surging demand for its top-of-the-line chips has led to shortages, exacerbating the need for customers and AI developers. The Biden administration, in the country’s AI arms war with China, has introduced strict sanctions on the US chipmakers from exporting them to the Dragon nation. In August 2022, China’s AI startups faced a setback when NVIDIA’s chip exports were banned. Nvidia later introduced chips with reduced performance to bypass the restrictions, offering a brief reprieve. However, this relief was short-lived. The Biden administration last year announced new measures to limit Beijing’s military ambitions, including further restrictions on NVIDIA’s AI chip shipments to China. The new rules will affect Nvidia’s A800 and H800 chips, specifically designed for shipment to China. While the chip bans were aimed at China’s military usage, the impact is felt strongly by the country’s startups relying on advancements in AI technology. Many rushed to stockpile NVIDIA’s A100 and H100 chips before the bans took effect, spending millions of dollars due to inflated costs. The optimism surrounding AI extends beyond NVIDIA and spreads through the entire technology sector. Companies like Microsoft and Meta Platforms have also witnessed remarkable rallies, scaling unprecedented heights riding on the promise of AI-driven innovations, reported Reuters. Jake Dollarhide, the Chief Executive Officer of Longbow Asset Management, cautions against the repercussions of failing to meet the lofty expectations set by the market around NVIDIA, which will be unveiled on Wednesday, reported Reuters. The stakes are undeniably high, with the prospect of a single quarterly report dictating the trajectory of NVIDIA’s fortunes in the near term. "
}