{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) Shares Purchased by Oak Ridge Investments LLC",
    "date": "3/27/2024",
    "url": "https://www.defenseworld.net/2024/03/27/alphabet-inc-nasdaqgoogl-shares-purchased-by-oak-ridge-investments-llc.html",
    "text": "Posted by Defense World Staff on Mar 27th, 2024 Oak Ridge Investments LLC boosted its position in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 1.1% in the fourth quarter, HoldingsChannel.com reports. The firm owned 121,963 shares of the information services provider’s stock after purchasing an additional 1,319 shares during the quarter. Alphabet comprises approximately  2.0% of Oak Ridge Investments LLC’s investment portfolio, making the stock its 9th biggest holding. Oak Ridge Investments LLC’s holdings in Alphabet were worth $17,037,000 as of its most recent SEC filing. A number of other institutional investors have also recently added to or reduced their stakes in GOOGL. DE Burlo Group Inc. increased its holdings in shares of  Alphabet by 520.0% in the second quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider’s stock valued at $11,551,000 after buying an additional 80,934 shares in the last quarter.  West Tower Group LLC bought a new position in shares of  Alphabet in the second quarter valued at $88,000.  Ballast Advisors LLC raised its stake in  Alphabet by 9.6% during the 3rd quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider’s stock valued at $2,061,000 after purchasing an additional 1,385 shares during the period.  Quantum Financial Advisors LLC lifted its holdings in shares of  Alphabet by 8.0% in the third quarter. Quantum Financial Advisors LLC now owns 7,623 shares of the information services provider’s stock valued at $998,000 after purchasing an additional 564 shares in the last quarter.  Finally, Acadian Asset Management LLC lifted its holdings in shares of  Alphabet by 2.4% in the third quarter. Acadian Asset Management LLC now owns 4,416,533 shares of the information services provider’s stock valued at $577,908,000 after purchasing an additional 104,366 shares in the last quarter. 40.03% of the stock is currently owned by institutional investors and hedge funds. In related news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction dated Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total value of $3,347,550.00. Following the completion of the sale, the chief executive officer now owns 2,310,191 shares in the company, valued at $343,710,216.98. The transaction was disclosed in a filing with the SEC, which can be accessed through this link. In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction dated Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the completion of the transaction, the chief executive officer now owns 2,310,191 shares in the company, valued at $343,710,216.98. The sale was disclosed in a filing with the SEC, which can be accessed through the SEC website. Also, Director John L. Hennessy sold 200 shares of the firm’s stock in a transaction dated Wednesday, January 10th. The stock was sold at an average price of $143.49, for a total transaction of $28,698.00. Following the transaction, the director now owns 6,784 shares of the company’s stock, valued at approximately $973,436.16. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 279,659 shares of company stock worth $39,460,310. Company insiders own  0.88% of the company’s stock. Shares of NASDAQ:GOOGL opened at $150.67 on Wednesday. The company has a market cap of $1.87 trillion, a P/E ratio of 25.98, a P/E/G ratio of 1.39 and a beta of 1.04. The stock’s 50-day moving average is $143.17 and its 200-day moving average is $137.93. Alphabet Inc. has a 52-week low of $99.74 and a 52-week high of $153.78. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The company had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. During the same period last year, the business posted $1.05 earnings per share.  Equities research analysts predict that  Alphabet Inc. will post 6.77 earnings per share for the current year. GOOGL has been the subject of a number of research analyst reports. JMP Securities increased their target price on Alphabet from $150.00 to $160.00 and gave the company a “market outperform” rating in a report on Wednesday, January 31st. Wedbush increased their target price on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a report on Friday, March 22nd. Wolfe Research increased their target price on Alphabet from $170.00 to $180.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. StockNews.com upgraded Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Finally, KeyCorp increased their price objective on Alphabet from $153.00 to $165.00 and gave the stock an “overweight” rating in a report on Monday, January 29th. Five equities research analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have assigned  a strong buy rating to the company. According to MarketBeat.com, the company presently has a consensus rating of “Moderate Buy” and a consensus price target of $155.48. View Our Latest Research Report on GOOGL (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. JPMorgan Chase & Co. (NYSE:JPM) Shares Sold by B & T Capital Management DBA Alpha Capital Management Cambridge Advisors Inc. Has $1.39 Million Position in Alphabet Inc. (NASDAQ:GOOGL) "
}