{
    "title": "Google Is 'Down, But Not Out' — Closing The GenAI Gap With Microsoft And \nOpenAI, Potential Dividend Move",
    "date": "3/4/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/03/37459165/google-is-down-but-not-out-closing-the-genai-gap-with-microsoft-and-openai-potentia",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW From its artificial intelligence (AI) product Gemini being stuck in controversy, to its co-founder Sergey Brin admitting to a Gemini product flaw, to analysts calling for its CEO Sundar Pichai to step down — Alphabet Inc GOOG GOOGL has faced extreme market volatility recently. Google stock is down 3% over the past five trading days, and down 2% YTD after a +52% past year. Related: Google’s AI Controversy, Apple’s Shift In Focus, And Musk’s Legal Battle Against OpenAI: This Week In AIGoogle Co-Founder Sergey Brin Admits To Rushing ‘Messed Up’ Gemini Image Generator Without Proper TestingAnalysts Are Calling For Google CEO Sundar Pichai To Step Down Despite Company’s Massive Growth Under His Leadership — Here’s Why The Google Analyst: JPMorgan analyst Doug Anmuth maintained an ‘Overweight’ rating on Google stock. His price target is $165 a share. Anmuth suggests “Google is down, but not out.” The Google Thesis: Google stock’s recent underperformance, amplified by investor frustration surrounding Gemini issues, is seen by Anmuth as a manifestation of uncertainties in a Gen AI world. Challenges include: Anmuth acknowledges the scrutiny over Google’s leadership and culture, but remains optimistic about Google’s ability to navigate these challenges. He believes that Google will not only recover Gemini, but also close the Gen AI gap with competitors such as Microsoft Inc MSFT and OpenAI. The recent hiccups in Gemini, specifically in text and image responses, have put the spotlight on Google’s execution, leadership, and culture. Despite this, Pichai assures major improvements in Gemini, with necessary changes in product guidelines, launch processes, testing, and technology. Also Read: Perplexity AI Vs. ChatGPT Vs. Google Gemini: Which AI Chatbot Is The Best For You? Revenue-wise, Google Search has shown consistent acceleration, with concerns arising about Google’s share of search and total advertising dollars. Meta and Amazon.com Inc AMZN advertising growth outpacing Google suggests a potential shift in the online ad market dynamics. Google’s ongoing re-engineering of the cost structure enters its second year, focusing on further margin expansion without anticipating a significant headcount reduction. The company aims to grow revenue faster than expenses, emphasizing rationalization and reprioritization rather than large-scale layoffs. Looking ahead, JPMorgan anticipates Google’s commitment to capital returns. There are expectations of a share buyback announcement, following a decade of substantial stock repurchases. Notably, Anmuth suggests that Google could initiate a dividend. This would align with recent moves by Meta Platforms, Booking Holdings Inc BKNG, and others. While the prospect of a dividend is viewed as a potential catalyst to attract a broader investor base, Anmuth underscores that its impact would be more significant if accompanied by overall improvements in Google’s business performance. As the industry waits for Google Cloud Next on April 9-11, the focus is on how Google will address these challenges and showcase its resilience in the evolving tech landscape. GOOG Price Action: Alphabet/Google stock was at $138.08/share at the close of trading day on March 1. Image: © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}