{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) Shares Sold by Dixon Mitchell Investment \nCounsel Inc.",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/alphabet-inc-nasdaqgoogl-shares-sold-by-dixon-mitchell-investment-counsel-inc.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 Dixon Mitchell Investment Counsel Inc. cut its stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 0.8% in the fourth quarter, according to the company in its most recent filing with the Securities and Exchange Commission. The institutional investor  owned 748,334 shares of the information services provider’s stock after selling 5,912 shares during the period. Alphabet comprises approximately  5.6% of Dixon Mitchell Investment Counsel Inc.’s holdings, making the stock its 2nd largest holding. Dixon Mitchell Investment Counsel Inc.’s holdings in Alphabet were worth $104,535,000 as of its most recent SEC filing. Other hedge funds and other institutional investors have also recently bought and sold shares of the company. Vanguard Group Inc. increased its stake in shares of  Alphabet by 1,919.4% in the 3rd quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock valued at $45,628,484,000 after buying an additional 453,413,389 shares during the period.  State Street Corp lifted its holdings in shares of  Alphabet by 1,900.6% in the third quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock valued at $20,770,809,000 after purchasing an additional 206,300,042 shares in the last quarter.  Moneta Group Investment Advisors LLC raised its holdings in  Alphabet by 111,197.8% during the fourth quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock worth $15,036,178,000 after acquiring an additional 170,267,122 shares in the last quarter.  Price T Rowe Associates Inc. MD raised its holdings in  Alphabet by 1,759.2% during the third quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock worth $11,106,502,000 after acquiring an additional 109,870,525 shares in the last quarter.  Finally, Norges Bank bought a new stake in  Alphabet during the fourth quarter worth about $8,335,063,000. 40.03% of the stock is owned by institutional investors and hedge funds. In other Alphabet news, SVP Prabhakar Raghavan sold 16,088 shares of the stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the transaction, the senior vice president now directly owns 52,440 shares in the company, valued at $7,294,404. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this hyperlink. In other news, SVP Prabhakar Raghavan sold 16,088 shares of the firm’s stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.10, for a total value of $2,237,840.80. Following the transaction, the senior vice president now owns 52,440 shares in the company, valued at $7,294,404. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, Director John L. Hennessy sold 200 shares of the firm’s stock in a transaction on Wednesday, January 10th. The stock was sold at an average price of $143.49, for a total value of $28,698.00. Following the completion of the sale, the director now directly owns 6,784 shares of the company’s stock, valued at approximately $973,436.16. The disclosure for this sale can be found here. Over the last three months, insiders have sold 251,138 shares of company stock worth $35,427,655. Insiders own  0.88% of the company’s stock. A number of equities analysts have weighed in on the company. Redburn Atlantic boosted their price target on Alphabet from $150.00 to $165.00 and gave the stock a “buy” rating in a research report on Wednesday, January 31st. Wedbush boosted their price target on Alphabet from $160.00 to $175.00 and gave the stock an “outperform” rating in a research report on Friday, March 22nd. Barclays decreased their target price on Alphabet from $180.00 to $173.00 and set an “overweight” rating on the stock in a research report on Wednesday, January 31st. BMO Capital Markets upped their target price on Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a research report on Wednesday, January 31st. Finally, Wells Fargo & Company upped their target price on Alphabet from $141.00 to $144.00 and gave the company an “equal weight” rating in a research report on Monday, March 18th. Five investment analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have assigned  a strong buy rating to the company. Based on data from MarketBeat, the stock presently has a consensus rating of “Moderate Buy” and an average target price of $155.48. Check Out Our Latest Stock Report on Alphabet GOOGL opened at $150.93 on Friday. The firm has a market cap of $1.88 trillion, a P/E ratio of 26.02, a PEG ratio of 1.39 and a beta of 1.04. The firm has a 50-day moving average of $143.52 and a 200 day moving average of $138.12. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. Alphabet Inc. has a fifty-two week low of $99.78 and a fifty-two week high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last released its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating the consensus estimate of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The business had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. During the same period in the prior year, the firm earned $1.05 earnings per share.  On average, research analysts expect that  Alphabet Inc. will post 6.77 EPS for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Kingswood Wealth Advisors LLC Trims Stock Holdings in The Kroger Co. (NYSE:KR) Alphabet Inc. (NASDAQ:GOOGL) Shares Sold by Family Legacy Inc. "
}