{
    "title": null,
    "date": "3/6/2024",
    "url": "https://finance.yahoo.com/news/alphabet-inc-goog-ceo-sundar-045341272.html",
    "text": "Alphabet Inc (NASDAQ:GOOG), the parent company of Google, is a global technology leader focused on improving the ways people connect with information. The company's business encompasses a wide array of products and services, including search, advertising, operating systems and platforms, enterprise, and hardware products.According to a recent SEC Filing, the CEO of Alphabet Inc, Sundar Pichai, sold 22,500 shares of the company on March 6, 2024. The transaction was executed at an average price of $132.7 per share, resulting in a total value of $2,985,750.Over the past year, the insider has sold a total of 135,000 shares of Alphabet Inc and has not made any share purchases. The insider transaction history for Alphabet Inc reveals a pattern of 56 insider sells and zero insider buys over the same timeframe. The market capitalization of Alphabet Inc stood at $1,640.206 billion on the day of the insider's recent sale. The stock's price-earnings ratio was recorded at 22.85, which is above the industry median of 21.33 but below the company's historical median price-earnings ratio. Alphabet Inc's shares were trading at $132.7, with a GuruFocus Value of $148.99, indicating a price-to-GF-Value ratio of 0.89. This suggests that the stock is modestly undervalued according to the GF Value, which is determined by historical trading multiples, a GuruFocus adjustment factor based on past returns and growth, and future business performance estimates from Morningstar analysts. This article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein. This article first appeared on GuruFocus. Related Quotes "
}