{
    "title": "Alphabet Stock Has 24% Upside, According to 1 Wall Street Analyst",
    "date": "3/5/2024",
    "url": "https://finance.yahoo.com/news/alphabet-stock-24-upside-according-103300331.html",
    "text": "The past year has made a couple of things crystal clear. First, just because a company is big doesn't mean it can't get bigger. Second, those businesses at the cutting edge of artificial intelligence (AI) could have much further to run -- but it won't necessarily be in a straight line. On March 4, analysts at JPMorgan reaffirmed their overweight (buy) rating on Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) stock while maintaining a $165 price target. The company is already one of the largest in terms of market cap, yet this suggests a potential upside of roughly 24% over the coming year as of market close on Monday. The past couple of weeks have shined an unkind glare on Alphabet. The company introduced image generation capabilities last month for its Gemini generative AI app. Some of the images it created were historically inaccurate, causing a backlash among users. The company quickly took the feature offline to address the issue, but not before the damage was done, sparking a sell-off that wiped $131 billion off its market value. JPMorgan analysts believe the sell-off is overdone. While acknowledging investor frustration, which has \"boiled over around the recent Gemini issues,\" the analysts believe the setback is temporary. They posit that not only will the company get Gemini \"back on track,\" but suggest Alphabet will \"close the generative AI gap with Microsoft.\" Furthermore, the analysts suggest that Alphabet will realize additional cost savings and greater capital returns, and potentially implement a dividend, following the lead of Meta Platforms, which announced plans to initiate a dividend just last month. Despite the palpable excitement, generative AI is still in its infancy, and Google's faux pas won't be the last. These AI algorithms are only as good as their programming, and the potential for errors is clear. That said, Alphabet is blazing new ground in AI and stumbles are to be expected. And at 23 times earnings, the stock is selling at a notable discount compared to 28 for the S&P 500. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, JPMorgan Chase, Meta Platforms, and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Alphabet Stock Has 24% Upside, According to 1 Wall Street Analyst was originally published by The Motley Fool Related Quotes "
}