{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.theinformation.com/articles/alphabet-needs-its-own-mark-zuckerberg",
    "text": "Exclusive: Microsoft and OpenAI Plot $100 Billion Stargate AI SupercomputerSave 25% and learn more Join us at future in-person and virtual events. Search, find and engage with others who are serious about tech and business. Follow and be a part of discussions about tech, finance and media. Premium advertising opportunities for brands Team access to our exclusive tech news Journalists who break and shape the news, in your inbox Catch up on conversations with global leaders in tech, media and finance Explore our recent partner collaborations Join us at future in-person and virtual events. Search, find and engage with others who are serious about tech and business. Follow and be a part of discussions about tech, finance and media. Premium advertising opportunities for brands Team access to our exclusive tech news Journalists who break and shape the news, in your inbox Catch up on conversations with global leaders in tech, media and finance Explore our recent partner collaborations Mark Zuckerberg may be few people’s conception of the ideal CEO. Some might balk at his strategic thinking, particularly around burning tens of billions on far-off metaverse technology, or might complain about Meta Platforms’ lack of fiscal discipline before its business slowed in 2022. Others might cite Meta’s ineffectual response to complaints about its platform broadcasting misinformation and content dangerous to kids. Even so, as a spokesperson for his company, Zuckerberg is outstanding. On calls with investors, he’s among the most articulate executives in business. When the release of Apple’s Vision Pro headset drew a barrage of upbeat commentary, Zuckerberg hit back with a smart video response and interviews arguing that Meta's Quest headset was the better device. Even testifying before Congress, where his early appearances were a little wooden, he’s become more confident and poised. Thanks to Zuckerberg, you know who’s in charge of Meta—and what its strategy is. The same cannot be said for Alphabet, whose CEO, Sundar Pichai, has been virtually invisible this past week, as the company has been reeling from criticism over historically inaccurate responses generated by its Gemini chatbot. Yes, he issued a staff memo that said all the right things. But other than that, it’s as though the top ranks of Google are asleep.  "
}