{
    "title": "Alphabet Stock Up 73% From Early 2023; Profits Soaring",
    "date": "3/19/2024",
    "url": "https://www.investors.com/news/technology/stocks-showing-rising-market-leadership-alphabet-cl-a-earns-81-rs-rating/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Even giants stumble sometimes. Google-parent Alphabet (GOOGL) got caught in the market downturn the first quarter of last year and reported a drop in earnings growth on a minuscule sales gain. Then it blasted off, posting rising earnings and sales growth, including 42% profit surges the past two quarters. On Tuesday, the Relative Strength (RS) Rating for Alphabet stock climbed to 81, up from 75, passing a milestone. With annual revenue topping $300 billion, it's surprising to see that Alphabet stock has soared 73% since January 2023. Companies that large don't usually grow that fast, unless of course they are one of the Magnificent Seven. The upgraded 81 RS Rating places Alphabet stock in the top 19% of all stocks for price performance this past year. History shows that the best-performing stocks typically have an 80 or better RS Rating in the early stages of their moves. Looking For The Best Stocks To Buy And Watch? Start Here Alphabet stock is trying to complete a consolidation with a 153.78 entry. See if the search giant can break out in volume at least 40% above average. Tuesday afternoon Alphabet was down fractionally. However, it has closed higher seven of the last nine trading sessions. In terms of fundamentals, Mountain View, Calif.-based Alphabet has posted four quarters of rising earnings growth. Sales gains have also moved higher over the same time frame. Last quarter it reported 42% higher EPS to $1.61 per share on a 13% rise in revenue to $86.3 billion. The prior three quarters it recorded EPS growth of -11%, 17% and 42%. Sales rose 3%, 7% and then 11%. Among its other ratings Alphabet has a terrific 98 Earnings Per Share Rating out of 99, a 95 Composite Rating and an A SMR Rating on an A-to-E scale with A tops. The A rating reflects its strong fundamentals. One yellow flag is its C- Accumulation/Distribution Rating. That shows that mutual funds, insurance funds and the like sold slightly more shares than they bought over the past 13 weeks. Look for that rating to improve to C or better. On Monday reports emerged that Google is in talks with fellow Magnificent Seven company Apple for the iPhone maker to license Alphabet's Gemini artificial intelligence training module for use in its iPhones. Alphabet stock holds the No. 5 rank among its peers in the 75-stock Internet-Content industry group. Facebook parent Meta Platforms (META) and LegalZoom (LZ) are also among the top 5 ranked in the group. The group as a whole has a strong No. 18 rank on IBD's list of 197 industry groups. IBD's unique RS Rating measures market leadership by using a 1 (worst) to 99 (best) score that shows how a stock's price action over the last 52 weeks matches up against the rest of the market. Please follow James DeTar on X, formerly known as Twitter, @JimDeTar RELATED: Get Full Access To IBD Stock Lists And Ratings Magnificent Seven Stocks: Latest Market News And Market Cap Weighting Is Google Stock A Buy Now? Which Stocks Are Showing Improved Technical Action? Ready To Grow Your Investing Skills? Join An IBD Meetup Group! 3/29/2024\nBuying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the... 3/29/2024\nBuying a stock is easy, but purchasing the right stock... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}