{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/alphabet-inc-nasdaqgoogl-position-lowered-by-washington-trust-co.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 WASHINGTON TRUST Co lowered its stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 0.3% during the 4th quarter, according to its most recent disclosure with the Securities & Exchange Commission. The firm owned 459,739 shares of the information services provider’s stock after selling 1,236 shares during the quarter. Alphabet comprises  2.5% of WASHINGTON TRUST Co’s portfolio, making the stock its 8th biggest holding. WASHINGTON TRUST Co’s holdings in Alphabet were worth $64,221,000 as of its most recent filing with the Securities & Exchange Commission. Several other institutional investors have also recently made changes to their positions in the stock. Vanguard Group Inc. raised its stake in  Alphabet by 0.3% during the 3rd quarter. Vanguard Group Inc. now owns 487,435,495 shares of the information services provider’s stock valued at $63,785,809,000 after purchasing an additional 1,302,104 shares during the period.  FMR LLC raised its stake in  Alphabet by 5.6% during the 3rd quarter. FMR LLC now owns 227,317,469 shares of the information services provider’s stock valued at $29,746,764,000 after purchasing an additional 12,070,681 shares during the period.  State Street Corp raised its stake in  Alphabet by 0.8% during the 2nd quarter. State Street Corp now owns 218,540,033 shares of the information services provider’s stock valued at $26,159,242,000 after purchasing an additional 1,666,205 shares during the period.  Moneta Group Investment Advisors LLC raised its stake in  Alphabet by 111,197.8% during the 4th quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock valued at $15,036,178,000 after purchasing an additional 170,267,122 shares during the period.  Finally, Geode Capital Management LLC raised its stake in  Alphabet by 1.3% during the 1st quarter. Geode Capital Management LLC now owns 118,576,618 shares of the information services provider’s stock valued at $12,271,705,000 after purchasing an additional 1,499,107 shares during the period. Institutional investors own  40.03% of the company’s stock. Shares of NASDAQ GOOGL opened at $150.93 on Friday. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. The stock has a market capitalization of $1.88 trillion, a P/E ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet Inc. has a 1-year low of $99.78 and a 1-year high of $153.78. The business has a fifty day moving average price of $143.67 and a 200 day moving average price of $138.21. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. The firm had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same period in the prior year, the business posted $1.05 EPS.  Equities research analysts expect that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. Several equities analysts have weighed in on GOOGL shares. Rosenblatt Securities cut their price target on Alphabet from $174.00 to $172.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. Wedbush raised their price target on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a report on Friday, March 22nd. Roth Mkm cut their price target on Alphabet from $166.00 to $164.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. Wolfe Research lifted their target price on Alphabet from $170.00 to $180.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. Finally, Susquehanna lifted their target price on Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a report on Wednesday, January 31st. Five analysts have rated the stock with a hold rating, twenty-six have issued  a buy rating and two have given a strong buy rating to the company’s stock. Based on data from MarketBeat, Alphabet  has an average rating of “Moderate Buy” and a consensus price target of $155.48. View Our Latest Stock Analysis on GOOGL In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction dated Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total value of $3,152,475.00. Following the completion of the sale, the chief executive officer now directly owns 2,422,691 shares in the company, valued at $339,443,236.01. The transaction was disclosed in a document filed with the SEC, which is available at this link. In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction dated Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total value of $3,152,475.00. Following the completion of the sale, the chief executive officer now directly owns 2,422,691 shares in the company, valued at $339,443,236.01. The transaction was disclosed in a document filed with the SEC, which is available at this link. Also, Director Frances Arnold sold 230 shares of the stock in a transaction dated Tuesday, January 30th. The shares were sold at an average price of $154.06, for a total value of $35,433.80. Following the completion of the sale, the director now owns 15,104 shares of the company’s stock, valued at $2,326,922.24. The disclosure for this sale can be found here. Over the last ninety days, insiders sold 263,312 shares of company stock worth $37,268,315. 0.88% of the stock is owned by insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Elk River Wealth Management LLC Purchases 345 Shares of Alphabet Inc. (NASDAQ:GOOGL) "
}