{
    "title": "Jessup Wealth Management Inc Purchases 2536 Shares of Alphabet Inc. \n(NASDAQ:GOOGL)",
    "date": "3/26/2024",
    "url": "https://www.defenseworld.net/2024/03/26/jessup-wealth-management-inc-purchases-2536-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 26th, 2024 Jessup Wealth Management Inc lifted its holdings in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 3.5% in the 4th quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The firm owned 75,001 shares of the information services provider’s stock after buying an additional 2,536 shares during the period. Alphabet makes up  about  5.2% of Jessup Wealth Management Inc’s investment portfolio, making the stock its 4th largest holding. Jessup Wealth Management Inc’s holdings in Alphabet were worth $10,477,000 as of its most recent SEC filing. A number of other institutional investors and hedge funds have also added to or reduced their stakes in GOOGL. Bornite Capital Management LP acquired a new stake in shares of  Alphabet in the 1st quarter worth approximately $16,688,000.  Markel Corp lifted its position in  Alphabet by 17.0% in the first quarter. Markel Corp now owns 15,500 shares of the information services provider’s stock worth $43,110,000 after purchasing an additional 2,250 shares during the period.  United Bank increased its position in shares of  Alphabet by 5.9% during the 1st quarter. United Bank now owns 2,033 shares of the information services provider’s stock valued at $5,654,000 after purchasing an additional 113 shares during the period.  Mirae Asset Global Investments Co. Ltd. raised its stake in shares of  Alphabet by 23.4% in the 1st quarter. Mirae Asset Global Investments Co. Ltd. now owns 323,918 shares of the information services provider’s stock worth $900,929,000 after buying an additional 61,427 shares in the last quarter.  Finally, Dakota Wealth Management lifted its holdings in shares of  Alphabet by 20.4% in the first quarter. Dakota Wealth Management now owns 9,279 shares of the information services provider’s stock valued at $25,806,000 after buying an additional 1,570 shares during the period. 35.08% of the stock is owned by institutional investors. In other news, CFO Ruth Porat sold 48,077 shares of the company’s stock in a transaction dated Friday, March 8th. The shares were sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the completion of the transaction, the chief financial officer now owns 1,777,106 shares of the company’s stock, valued at $243,854,485.32. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this link. In other Alphabet news, Director John L. Hennessy sold 200 shares of the business’s stock in a transaction on Wednesday, January 10th. The shares were sold at an average price of $143.49, for a total value of $28,698.00. Following the sale, the director now owns 6,784 shares of the company’s stock, valued at approximately $973,436.16. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this link. Also, CFO Ruth Porat sold 48,077 shares of the company’s stock in a transaction dated Friday, March 8th. The shares were sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the completion of the sale, the chief financial officer now directly owns 1,777,106 shares in the company, valued at approximately $243,854,485.32. The disclosure for this sale can be found here. Over the last three months, insiders sold 279,659 shares of company stock valued at $39,460,310. 0.88% of the stock is owned by company insiders. Shares of GOOGL opened at $150.07 on Tuesday. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a one year low of $99.74 and a one year high of $153.78. The company’s fifty day moving average price is $143.02 and its 200 day moving average price is $137.83. The company has a market capitalization of $1.87 trillion, a PE ratio of 25.87, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping the consensus estimate of $1.60 by $0.04. The business had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same quarter in the previous year, the firm earned $1.05 EPS.  As a group, analysts expect that  Alphabet Inc. will post 6.77 earnings per share for the current year. Several equities research analysts have commented on GOOGL shares. BMO Capital Markets boosted their price target on shares of Alphabet from $170.00 to $178.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. StockNews.com upgraded shares of Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Susquehanna increased their price objective on Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a research report on Wednesday, January 31st. Roth Mkm cut their target price on Alphabet from $166.00 to $164.00 and set a “buy” rating on the stock in a research report on Wednesday, January 31st. Finally, Needham & Company LLC  reiterated a “buy” rating and issued a $160.00 price target on shares of Alphabet in a research report on Wednesday, January 31st. Five analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have given a strong buy rating to the company. According to data from MarketBeat.com, the company  has an average rating of “Moderate Buy” and an average target price of $155.48. Get Our Latest Stock Report on Alphabet (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. AMETEK, Inc. (NYSE:AME) VP Thomas M. Montgomery Sells 6,891 Shares Alphabet Inc. (NASDAQ:GOOGL) Stake Lowered by JTC Employer Solutions Trustee Ltd "
}