{
    "title": "Google Layoffs 2024: What to Know About the Latest Ad Sales Job Cuts",
    "date": "1/17/2024",
    "url": "https://investorplace.com/2024/01/google-layoffs-2024-what-to-know-about-the-latest-ad-sales-job-cuts/",
    "text": " Google layoffs are affecting its ad sales team Advertisement Source: Benny Marty / Shutterstock.com Google layoffs are on the way as Alphabet (NASDAQ:GOOGL, NASDAQ:GOOG) is cutting jobs at the company’s ad sales division. According to a leaked memo, hundreds of employees from the Google ad sales team are facing layoffs. Reports claim that the job cuts are the result of the company switching to artificial intelligence (AI) tools to handle its ad business. These layoffs are majorly affecting Google’s Large Customer Sales team. This is the division that is responsible for handling ad sales for the tech company’s largest advertising customers. Google’s Performance Max is likely the AI tool behind the layoffs, as it can remix ads for users in a fraction of the time that humans can. Google spokesperson Chris Pappas said the following about the layoffs to The Verge. “Every year we go through a rigorous process to structure our team to provide the best service to our Ads customers […] We map customers to the right specialist teams and sales channels to meet their service needs. As part of this, a few hundred roles globally are being eliminated and impacted employees will be able to apply for open roles or elsewhere at Google.” These aren’t the first batch of layoffs that Google has announced in 2024. The company has already made smaller cuts at several of its other divisions. It could also be a sign that the tech company is going to continue to reduce its headcount throughout the year. These job cuts come just after the start of the new year. Companies often make cuts at this time to align operating costs. This also comes alongside concerns about inflation and interest rates this year. GOOGL stock is down 2% as of Wednesday morning. Investors on the lookout for all of the latest stock market stories today are in luck! We have all of the biggest market stories that traders will want to read about on Wednesday! A few examples include what’s happening with Archer Aviation (NYSE:ACHR), Nio (NYSE:NIO) and SolarEdge Technologies (NASDAQ:SEDG) stock today. You can catch up on these stories by checking out the links below! On the date of publication, William White did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Technology, Artificial Intelligence, Software Blue-Chip Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/google-layoffs-2024-what-to-know-about-the-latest-ad-sales-job-cuts/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}