{
    "title": "Amazon Stock: FTC Will Probe AI Deals By AMZN, Microsoft, Alphabet",
    "date": "1/25/2024",
    "url": "https://www.investors.com/news/technology/amazon-stock-ai-deals-by-amzn-microsoft-alphabet-under-ftc-review/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     The Federal Trade Commission said Thursday it will investigate a series of investments into generative artificial intelligence startups by tech giants Microsoft (MSFT), Amazon (AMZN) and Alphabet (GOOGL). Amazon stock, as well as shares for Microsoft and Google, edged higher despite the news. The agency said it sent inquiries to each of the three companies, as well as AI startups OpenAI and Anthropic. OpenAI is the creator of the viral ChatGPT artificial intelligence chatbot. Anthropic created the rival Claude bot. Microsoft has invested $10 billion into OpenAI early last year. Both Amazon and Alphabet have invested in Anthropic. The FTC cited concerns that the AI-related investments and partnerships affect competition in an important technology trend. \"As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity,\" FTC Chair Lina Khan said in a statement. \"Our study will shed light on whether investments and partnerships pursued by dominant companies risk distorting innovation and undermining fair competition.\" Each of the tech giants have spent significantly to build relationships with AI startups. Investments from Microsoft, Google and Amazon accounted for two-thirds of the $27 billion that AI-focused startups raised in 2023, according to PitchBook data reported by the Financial Times last month. Microsoft's deal with OpenAI has helped bolster its reputation as a major player in AI. Meanwhile, Amazon's investment into Anthropic in September, worth up to $4 billion, has helped boost Amazon's stock. Analysts said the move signaled Amazon's \"urgency\" in deploying AI products within its cloud-computing division. The FTC announcement underscores the regulatory scrutiny of the tie-ups between tech giants and buzzy AI startups. The European Union disclosed earlier this month that it is considering whether it can launch a review of Microsoft's OpenAI investment under its merger regulations, the Wall Street Journal reported. Amazon stock, Google and Microsoft are part of the Magnificent Seven group of stocks that powered last year's market rally. Investor reaction to the FTC's announcement was muted Thursday. In recent action on the stock market today, Amazon stock is up a fraction at 157.24. Microsoft stock is up a fraction at 403.49 and Alphabet shares are trading 1.9% higher at 153.20 in recent action. Google and Microsoft are both scheduled to report quarterly earnings next Tuesday, while Amazon will report earnings on Feb. 1. YOU MAY ALSO LIKE: Is Microsoft Stock A Buy As Software Giant Touts Artificial Intelligence? Looking For The Next Big Stock Market Winners? Start With These 3 Steps Learn How To Time The Market With IBD's ETF Market Strategy Best Growth Stocks To Buy And Watch: See Updates To IBD Stock Lists AI Stocks: Tech Giants, Cloud Titans, Chipmakers Battle For An Edge 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}