{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.investopedia.com/google-stock-in-focus-as-ceo-announces-additional-job-cuts-key-technical-levels-to-monitor-8431204",
    "text": " Justin Sullivan / Getty Images Shares in Google parent Alphabet (GOOGL) will be in focus this morning after CEO Sundar Pichai told employees in a Wednesday internal memo that the company plans to cut more jobs in 2024 as it ramps up its investments in high priority areas, such as artificial intelligence (AI). “The reality is that to create the capacity for this investment, we have to make tough choices,” Pichai told staff, according to reports. For some teams that means eliminating roles, which includes “removing layers to simplify execution and drive velocity,” he added. The announcement of further layoffs this year comes after the tech giant slashed hundreds of positions earlier this month across its advertising, engineering, and hardware divisions. However, the Google chief said the headcount reductions in 2024 won’t be on the same scale as last year, which saw the company let go of 12,000 permanent team members or around 6% of its workforce. GOOGL shares have traded mostly sideways since breaking above a symmetrical triangle in late December. Moreover, trading volumes have remained below average in the first half of January, indicating a lack of decisiveness among market participants. Key support and resistance areas to watch include a short-term trendline currently sitting near $138, which also forms part of the triangle’s lower trendline, and the stock’s all time high around $150. GOOGL was up 0.8% at $144.02 in pre-market trading Thursday about 90 minutes before the opening bell. The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own the above security. "
}