{
    "title": "Google Lays Off Hundreds, Including Fitbit Co-Founders, In Fresh Round Of \nLayoffs",
    "date": "1/11/2024",
    "url": "https://news.abplive.com/technology/google-lays-off-hundreds-of-employees-including-fitbit-co-founders-in-fresh-round-of-layoffs-alphabet-layoff-plans-1655845",
    "text": "In a fresh round of mass layoffs, Google has laid off hundreds of employees including the co-founders of Fitbit. The exit of the co-founders of Fitbit might mark its end. As per a statement from the company to 9to5Google, the tech giant is laying off employees in Devices and Services teams (responsible for making products like Nest, and Fitbit) and in the Augmented Reality (AR) team. According to a Bloomberg report, employees working in the voice-based Google Assistant and at the augmented reality hardware team were the worst hit in these layoffs. A spokesperson from Google told news agency Reuters, \"Throughout second-half of 2023, a number of our teams made changes to become more efficient and work better, and to align their resources to their biggest product priorities. Some teams are continuing to make these kinds of organisational changes, which include some role eliminations globally.\" The Pixel team of the tech giant appears to be the least affected. In the past, the Devices and Services teams, Augmented Reality team and Pixel team, used to exist as separate teams. They used to work separately on aspects like hardware engineering, design, user interface and software. The hardware division of the company was like a mini-company in itself that worked on smartphones, smart homes and wearables. However, as per 9to5Google, it seems that the company is reorganising things by switching to a more functional organisational model which involves a single team rather than multiple to work on the hardware front to make products like Pixel, Nest and Fitbit. ALSO READ | Intel To Lay Off 235 Employees In 5th Round Of Job Cuts This Year As per the 9to5Google report, it is likely that there will be a single person responsible for all the hardware Google is working on. ALSO READ | Microsoft To Lay Off More Employees From Support, Sales, Customer Service Teams: Report In January 2023, Alphabet (Google's parent company) announced plans to cut 12,000 jobs, equivalent to 6 per cent of its global workforce. In September 2023, it had 182,381 employees globally. "
}