{
    "title": "Should Investors Buy the Dip in Alphabet or Microsoft Stock After Earnings?",
    "date": "1/31/2024",
    "url": "https://finance.yahoo.com/news/investors-buy-dip-alphabet-microsoft-220700133.html",
    "text": "This week’s earnings lineup is headlined by quarterly results from big tech giants with Alphabet GOOGL and Microsoft MSFT already reporting after market hours on Tuesday. Despite exceeding their top and bottom line expectations Alphabet shares were down over -7% today while Microsoft’s stock dipped -2%. Still, over the last year, Alphabet and Microsoft's stock have soared +41% and +60% respectively and investors may be wondering if today's selloff is a buying opportunity. Image Source: Zacks Investment Research Alphabet Q4 Review The drop in Alphabet’s stock comes as the market soured on the company’s underwhelming ad revenue despite fourth quarter earnings of $1.64 per share beating estimates by 2% and soaring 64% from $1.05 a share in the comparative quarter. Image Source: Zacks Investment Research Quarterly sales of $72.32 billion came in 2% better than expected as well and spiked 14% from $63.12 billion a year ago. Notably, ad revenue of $65.51 billion slightly surpassed the Zacks Consensus of $65.44 billion although some analysts had loftier expectations as Alphabet bids to keep its position as the leader in total digital advertising revenue in the United States ahead of Meta Platforms META and Amazon AMZN. With that being said, Alphabet’s ad revenue did rise 11% from $59.04 billion in the prior-year quarter. Rounding out fiscal 2023, Alphabet’s annual earnings were up 27% to $5.80 per share although total sales were down -9% to $256.51 billion versus $282.83 billion in 2022. Image Source: Zacks Investment Research Microsoft Q2 Review Reporting its fiscal second quarter results, Microsoft’s Q2 earnings of $2.93 per share pleasantly surpassed expectations by 6% and climbed 26% from $2.32 a share in the prior-year quarter. Second quarter sales of $62.02 billion topped estimates by more than 1% and jumped 17% from a year ago. Image Source: Zacks Investment Research Microsoft attributed the strong quarter to Azure and other Intelligent Cloud Segment services which expanded 20% YoY to $25.88 billion and topped estimates of $25.27 billion by 2%. The company highlighted that it has now moved to applying AI at scale with Microsoft having 53,000 Azure AI customers. However, Wall Street wasn’t blown away by Microsoft’s sales guidance for the third quarter which played a role in today’s dip. Microsoft projects Q3 revenue to be in the range of $60-$61 billion and this does fall in line with the current Zacks Consensus of $60.56 billion. Image Source: Zacks Investment Research Current Valuations With Alphabet and Microsoft forecasted to have double-digit percentage growth on their top and bottom lines in fiscal 2024, checking their current valuations may give better insight on if now is a good time to buy their stocks. Given their earnings potential checking Alphabet and Microsoft’s P/E valuation is formidable. Alphabet’s stock certainly looks more attractive in this regard trading at 22.6X forward earnings which is near the S&P 500’s 20.8X while Microsoft's 36.6X is at a higher but not overly stretched premium to the broader market. Image Source: Zacks Investment Research Takeaway Considering the strong rally in Alphabet and Microsoft’s stock over the last year the trend of earnings estimate revisions in the following weeks will play a large role in the possibility of more upside. For now, both tech giants land a Zacks Rank #3 (Hold) as their reasonable P/E valuations do support the notion that long-term investors could still be rewarded from current levels. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Meta Platforms, Inc. (META) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}