{
    "title": "Opinion: A leaked memo from Google CEO Sundar Pichai comes amid employee \ndiscontent. No CEO wants this for ...",
    "date": "1/29/2024",
    "url": "https://www.thestar.com.my/tech/tech-news/2024/01/29/opinion-a-leaked-memo-from-google-ceo-sundar-pichai-comes-amid-employee-discontent-no-ceo-wants-this-for-their-company",
    "text": "Monday, 29 Jan 2024 A viral LinkedIn post from a disillusioned Googler sheds light on the prevalent cynicism within the company. The employee criticises Google’s leadership for lacking vision and describes an environment where executives are indecisive about priorities, resulting in a pervasive sense of nihilism among employees. — AP In a rare glimpse into Google's internal roadmap for 2024, a leaked memo from CEO Sundar Pichai has revealed the company’s seven goals for the year. While the list includes familiar objectives such as advancing artificial intelligence and growing as a company, it comes at a time when Google is facing internal turmoil, marked by recent layoffs and a sense of disillusionment among employees. Pichai's memo outlined the following key goals for Google in 2024: Deliver the world's most advanced, safe, and responsible AI. Improve knowledge, learning, creativity, and productivity. Build the most helpful personal computing platforms and devices. Enable organisations and developers to innovate on Google Cloud. Provide the world's most trusted products and platforms. Build a Google that's extraordinary for Googlers and the world. Improve company velocity, efficiency, and productivity, and deliver durable cost savings. However, the leak comes amid a wave of layoffs at Google, with Pichai signalling that more job cuts are on the horizon. The dissonance between the company’s goals and the reality of ongoing layoffs has sparked discontent among Google employees. Number 6 in the list seems to have missed the mark. It sounds like Pichai and his senior leadership would like to have their corporate cake and it eat it too. Employees are becoming cynical A viral LinkedIn post from a disillusioned Googler sheds light on the prevalent cynicism within the company. The employee criticises Google’s leadership for lacking vision and describes an environment where executives are indecisive about priorities, resulting in a pervasive sense of nihilism among employees. This sentiment aligns with the ongoing layoffs, leaving many feeling uncertain about their future within the company. This level of cynicism is more than just dissatisfaction; it’s indicative of burnout, a phenomenon that has become increasingly prevalent in the corporate world, particularly in the wake of the Covid-19 pandemic. I've written about this before, highlighting how the negative impact of mass layoffs on both the terminated individuals and the remaining workforce are hugely detrimental. Layoffs are associated with heightened stress, financial strain, and, shockingly, an increased risk of death for those affected. The ripple effects of mass layoffs Beyond the immediate impact on terminated employees, layoffs create a ripple effect of fear and uncertainty among the remaining workforce. This phenomenon, known as “layoff contagion”, can significantly impact productivity, morale, and overall company culture. The fear of being the next in line for layoffs can result in a decline in employee well-being and commitment. The LinkedIn post from the disillusioned Googler resonates with the research of Stanford's Professor Jeffrey Pfeffer, who has long argued against the efficacy of mass layoffs. Layoffs not only lead to negative outcomes for the affected individuals but can also contribute to a company-wide morale crisis, hindering long-term innovation and competitiveness. Pfeffer emphasizes that mass layoffs are not just an internal company matter; they have broader societal implications. Increased unemployment correlates with higher social problems, crime rates, domestic violence, and addiction. Therefore, organisations and policymakers need to consider the far-reaching consequences of job loss and implement measures to mitigate the negative effects on individuals, the remaining workforce, and society as a whole. Google's leaked goals for 2024, juxtaposed with the ongoing layoffs and employee cynicism, paint a picture of a company at a critical juncture. The prevalent sense of burnout and disillusionment highlights the urgent need for organisations to prioritise employee well-being, foster a positive work culture, and consider the long-term implications of their decisions on both individuals and society. It's not a question of whether Google will emerge from this unscathed, but rather the extent of the damage it will endure. – Inc./Tribune News Service Related stories: Almost one in 10 Gen Zers are more likely to use TikTok than Google as a search engineGoogle engineer found dead near her blood-spattered husband at California home, cops sayGoogle CEO warns of more layoffsGoogle CEO tells employees to expect more job cuts this year - The VergeGoogle lays off hundreds of employees in advertising sales teamGoogle lays off hundreds in hardware, assistant, engineering Google engineer found dead near her blood-spattered husband at California home, cops sayGoogle CEO warns of more layoffsGoogle CEO tells employees to expect more job cuts this year - The VergeGoogle lays off hundreds of employees in advertising sales teamGoogle lays off hundreds in hardware, assistant, engineering Google CEO warns of more layoffsGoogle CEO tells employees to expect more job cuts this year - The VergeGoogle lays off hundreds of employees in advertising sales teamGoogle lays off hundreds in hardware, assistant, engineering Google CEO tells employees to expect more job cuts this year - The VergeGoogle lays off hundreds of employees in advertising sales teamGoogle lays off hundreds in hardware, assistant, engineering Google lays off hundreds of employees in advertising sales teamGoogle lays off hundreds in hardware, assistant, engineering Google lays off hundreds in hardware, assistant, engineering Topic:  Report it to us. Thank you for your report!  Copyright © 1995-\n            \n\n Star Media Group Berhad [197101000523 (10894-D)] Best viewed on Chrome browsers.  We would love to keep you posted on the latest promotion. Kindly fill the form below We hope you enjoy this feature! "
}