{
    "title": "More Layoffs: Google Parent Company's 'X Lab' To Undergo Job Cuts – Read \nWhat The Chief Told Staff",
    "date": "1/24/2024",
    "url": "https://www.news18.com/tech/google-parent-companys-x-lab-to-undergo-job-cuts-read-what-the-chief-told-staff-8751136.html",
    "text": "Curated By:  Shaurya Sharma News18.com Last Updated: January 23, 2024, 11:23 IST California, USA Google's parent company Alphabet is restricting its X Lab. The year 2024 has kicked off with a slew of job cuts impacting the tech industry, as multiple tech giants, including Google, Amazon, YouTube, and more, have announced significant layoffs. Now, it has become evident that this trend is likely to continue as Google moves ahead with additional employee layoffs. But notably, this round of layoffs affects Google’s parent company, Alphabet’s lab known as ‘X – the moonshot factory.’ This is being labeled as an effort to secure external funding for the company’s various ventures. As reported by Bloomberg, “Alphabet Inc.’s lab for pioneering technology is laying off dozens of employees” as it aims to land outside investors. The report says that this division, X (not to be confused with X, formerly known as Twitter), has increased its discussions surrounding getting funding from venture capitalists and other investors, based on what sources who don’t want to be named have told Bloomberg. This is reportedly due to internal structure changes that the lab is currently undergoing. It aims to push out projects as independent startups, aiming to accomplish this move with the help of parent company Alphabet and outside investors, as seen in an internal email accessed by Bloomberg. Here’s What The Lab’s Chief Told Employees “We’re expanding our approach to focus on spinning out more projects as independent companies funded through market-based capital,” Astro Teller, the lab’s lead, mentioned in the email. “We’ll do this by opening our scope to collaborate with a broader base of industry and financial partners, and by continuing to emphasize lean teams and capital efficiency.” He added in the email to staff: “This approach will give us more opportunity to focus on what Xers do best: inventing breakthrough technologies to help solve some of the world’s most pressing challenges.” What Does the X Lab Do? The lab is the brainchild of Google founders Larry Page and Sergey Brin and aims to address significant issues affecting the world, such as climate change and Internet access. However, it has reportedly struggled to facilitate the transition of major projects out of the lab. “X is a diverse group of inventors and entrepreneurs who build and launch technologies that aim to improve the lives of millions, even billions, of people,” the lab notes while describing itself. This move comes after Google laid off hundreds of employees across multiple teams, including its Voice Assistant unit and hundreds in its hardware team responsible for Pixel, Nest, and Fitbit. Additionally, it let go of employees in its augmented reality team and its central engineering team. "
}