{
    "title": "Alphabet's Moonshot X Lab initiates layoffs, shifts to external investors \nfor funding",
    "date": "1/22/2024",
    "url": "https://www.editorji.com/business-news/alphabet-s-moonshot-x-lab-initiates-layoffs-shifts-to-external-investors-for-funding-1705994289310",
    "text": "'Undeclared emergency, scared of Kejriwal': This is what INDIA bloc members said during rally IPL 2024: MI vs RR preview - Form guide, head-to-head record, team news, weather report, probable XI Randeep Hooda shades American filmmaking, cites 'Oppenheimer' as propaganda driven movie Son Ye Jin drops new wedding pics with Hyun Bin on second wedding anniversary, check out Sunrisers Hyderabad's Wanindu Hasaranga ruled out of IPL 2024 Calling spouse 'bhoot, 'pishach' does not tantamount to cruelty: Patna HC INDIA bloc rally: Rahul Gandhi accuses BJP of 'match-fixing' in 2024 Lok Sabha election What is 'Click here' trend on X that BJP, Congress, others are using to spar? As a component of this restructuring initiative, X is laying off numerous employees, with a primary focus on those in support roles. Alphabet has not officially commented on the layoffs. Editorji News Desk Alphabet Inc.'s Moonshot X Lab, renowned for its innovative projects, is undergoing a significant transformation that includes layoffs as it turns to external investors for financial support. The division, known as X, has been engaging in discussions with venture capitalists and other investors to secure funding for its ventures. This shift is part of a broader restructuring plan aimed at enabling X's projects to emerge as independent startups with support from Alphabet and external backers. Astro Teller, the leader of the lab, shared details of the changes with staff in an email, stating, \"We're expanding our approach to focus on spinning out more projects as independent companies funded through market-based capital.\" Teller emphasized collaboration with a broader base of industry and financial partners, underscoring the need for lean teams and capital efficiency. As part of this restructuring, X is letting go of dozens of employees, primarily those in support roles. The layoffs have not been officially addressed by Alphabet. X, spearheaded by Google co-founders Larry Page and Sergey Brin, has been recognized for its ambitious projects, ranging from self-driving cars to high-altitude balloons providing internet connectivity to remote areas. However, the lab has faced challenges in translating these speculative ventures into profitable businesses, leading to the necessity for a strategic shift. Alphabet's CFO, Ruth Porat, who is taking on the role of president and chief investment officer, will now oversee divisions that include X, aiming to instill greater financial discipline. The move to seek external funding and the subsequent layoffs reflect a dynamic shift in X's strategy to navigate industry-wide challenges, particularly in the realm of innovation. In addition to exploring venture capital, X has sought funding from family offices, sovereign wealth funds, private equity firms, and strategic investors aligned with the industries targeted by its moonshot projects. Amid layoffs and budget cuts in Silicon Valley's innovation labs, X's restructuring underscores a proactive approach to address the evolving landscape. \"This approach will give us more opportunity to focus on what Xers do best: inventing breakthrough technologies to help solve some of the world's most pressing challenges,\" noted Teller in the staff communication. \"Because the world needs moonshots more now than ever.\"Also Watch: Google layoffs: Unhappy over mass layoffs, Google employees plan protests ADVERTISEMENT Alphabet's Moonshot X Lab initiates layoffs, shifts to external investors for funding Kotak AMC's Nilesh Shah speaks out against repetitive KYC demands Home loan from HDFC Bank gets costlier after gradual increase in repo-rate linked interest rate Cocoa prices soar nearly 140%, crosses $10,000 per metric ton Mumbai's Bandra-Worli Sea Link toll rates to increase by 18% from April 1 India registers record 1.68 lakh new companies in FY24 ADVERTISEMENT Byju's shareholders raise no objection to board's resolution, miffed investors skip meeting: Sources RBI suspends Rs 2,000 note exchange/deposit facility on April 1 General Electric set to layoff 1,000 LM Wind Power employees Domestic airline Akasa Air begins international operations Banks, Insurance firms to remain open on Mar 30, 31. Here's all you need to know about what's operational Ahead of IPO plans, Swiggy records $200 million loss: Report TCS initiates fresher hiring drive for FY25, candidates to send applications till this date... Minuscule rise in cost of essential medicines amid pharma industry's push for 10% hike Gold, Silver Price Today March 29, 2024: Check Latest Rates in Mumbai, Delhi, Chennai, Bengaluru Gold, Silver Price Today March 28, 2024: Check Latest Rates in Mumbai, Delhi, Chennai, Bengaluru Editorji is a popular short video news and information platform based in India. It was founded in 2018 by Vikram Chandra, one of India’s leading journalists, and has risen to prominence in the digital news space in a relatively short span of time. The platform is primarily designed for mobile devices, with applications available for Android and iOS.  +91 11 4035 6666 / info@editorji.com 3rd floor, Plot B, Khasara no 360, Sultanpur, New Delhi, Delhi 110030 Send Feedback Contact Us "
}