{
    "title": "61.5 Billion Reasons Alphabet Stock Is a Buy Again for 2024",
    "date": "2/5/2024",
    "url": "https://www.fool.com/investing/2024/02/05/615-billion-reasons-alphabet-stock-is-a-buy-again/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Alphabet's (GOOGL 0.04%) (GOOG 0.21%) Google Search is totally back to kick off 2024. But as investors' collective focus pivoted to profitable growth during the bear market, this is where the company stood out. Total operating income profit margins dialed in at 27.5% in Q4 2023, up from 24% a year ago. With profits rising again, Alphabet went to work last year doling out more shareholder returns. And those returns comprise the 61.5 billion reasons Alphabet is still a buy and hold in my book for 2024. Alphabet revealed in its Q4 2023 financial filings that it shelled out a whopping $61.5 billion worth of share buybacks last year. That was a near-4% increase from 2022. Not bad for a bear market. Granted, Alphabet also doled out employee stock-based compensation of $22.5 billion last year. Nevertheless, the buybacks still more than offset that amount and effectively reduced the total share count along the way. Investors were rewarded with a net 3.3% decrease in average shares outstanding in 2023 (a lower share count boosts earnings per share for remaining shareholders). Paired with those profit margin increases, the lowered share count is what helped Alphabet report a massive 56% year-over-year increase in earnings per share in Q4 2023. Of course, of the world's largest tech companies that also repurchase stock as part of their shareholder return policy, Apple reigns supreme. (Amazon is excluded here, as it has no current stock buyback program.)  Data by YCharts. However, what's impressive about Alphabet's shareholder returns is that it was also able to pull this off, all the while shelling out massive amounts of cash to upgrade its data centers and global infrastructure for a new era of artificial intelligence and accelerated computing. Purchases of property and equipment (or capex) totaled $32.3 billion last year. By comparison, Apple's capex was about one-third of Alphabet's. That speaks volumes about Apple's efficiency in designing and selling top consumer products, but let's not take too much away from Alphabet. It's a totally different business model, one where constant data center upgrades to support its internet-based business are a necessity. And in spite of all the capex spending and $61.5 billion in stock buybacks, Alphabet didn't even make a dent in its massive cash hoard. At the end of the year, it had cash and short-term equivalents of $111 billion, plus long-term investments of $31 billion. That's relatively unchanged from the cash and equivalents of $114 billion, and long-term investments of $30.5 billion, at the end of 2022. In other words, Alphabet still has plenty of room to return even more cash to its shareholders in the years to come. Alphabet's various businesses continue to make more changes to focus on shareholder value creation as 2024 gets rolling. Google Cloud is only just now hitting the 10% operating profit margin threshold, so it has space to run higher. And the Google Other Bets segment (X Labs, which houses start-ups like Waymo) also said it will be bringing in outside investors starting this year to unlock more potential. If profit margins increase again this year, I expect another ramp-up in Alphabet's stock buybacks. This, paired with all that cash on the balance sheet, is a top reason I'm content to keep holding my shares for the long haul. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Nicholas Rossolillo has positions in Alphabet, Amazon, Apple, Meta Platforms, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}