{
    "title": null,
    "date": "2/16/2024",
    "url": "https://www.benzinga.com/news/24/02/37176289/google-4xed-employee-offer-to-save-from-poaching-attempt-says-top-ai-startups-founder",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Alphabet Inc.'s GOOG GOOGL Google reportedly quadrupled a salary offer that one of its employees received from a top AI startup as the Sundar Pichai-led company looks to safeguard its crown jewel. What Happened: Amid increasing competition threatening Google Search, Perplexity AI founder and CEO Aravind Srinivas revealed that his poaching attempt resulted in a Googler's salary being quadrupled. Google has been witnessing increasing competition in web search from leading AI startups like the Microsoft Corp.-backed MSFT OpenAI, Perplexity AI, and, more recently, The Browser Company with its Arc Search app. See Also: ‘Not That Interested In Killer Robots:’ Instead, OpenAI CEO Sam Altman Is Worried ‘Subtle Misalignments’ Could Make AI Dangerous But creating a rival to Google Search requires not just money but top talent as well. That's what Perplexity's Srinivas tried to solve by trying to poach a Googler but failed to do so. \"There was this one amazing candidate that I tried to recruit from Google. He … works on the search team,\" Srinivas explained on the Big Technology Podcast. \"The moment he told them that he's gonna join us, they quadrupled his offer. I've never seen someone say that ‘my offer 4x-ed'.\" This might come as a bigger surprise considering that Google has been undertaking massive layoffs, following the cost-cutting trend in the rest of the tech industry. In January alone, Google laid off over 1,000 employees mysteriously across core engineering and Google Assistant teams, among others. Interestingly enough, Srinivasan says that he was told that Google laid off employees who had \"very high compensation,\" so quadrupling the salary offer of Google employees being poached suggests that he was more valuable to the company despite its cost-cutting strategy attempts. Why It Matters: According to the latest data from StatCounter, Google Search has a 91.47% market share in global web search, while Microsoft's Bing has a minuscule share of 3.42%. Perplexity AI's recently launched app hasn't even registered yet, and it might not, given it has a different approach altogether for its AI-powered web searches. With that said, this is much bigger than a David versus Goliath fight. It remains to be seen if Perplexity AI manages to overcome the massive hurdle that Google's vast cash reserves pose, but its AI prowess could just prove to be the leveler that it needs in this fight. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: If You Invested $1000 In Nvidia When Masayoshi Son’s Softbank Sold Its $3.3 Billion Stake In 2019, Here’s How Much You’d Have Photo courtesy: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}