{
    "title": null,
    "date": "2/20/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37205524/as-wall-street-braces-for-major-beat-and-raise-special-from-nvidia-again-tech-analy",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Ahead of the much-awaited earnings report from Nvidia Corp. NVDA, an analyst at Wedbush on Monday delved into the key aspects of the earnings report that could have implications for the AI revolution that is getting entrenched. Will Nvidia Confirm AI Party? After big tech stalwarts Microsoft Corp. MSFT, Meta Platforms, Inc. META, and Amazon, Inc. AMZN all signaled accelerating capex for AI buildouts on their earnings call, now it is the turn of Nvidia to fill in the biggest piece of AI puzzle to cement expectations that AI monetization well and truly underway, said analyst Daniel Ives in a note. “All the Street watching is now hearing from the Godfather of AI Jensen [Huang] and Nvidia this Wednesday after the bell with earnings and of course, importantly, its guidance,” the analyst said. “When Nvidia holds its conference call this week, you will be able to hear a pin drop on trading floors across Wall Street when Jensen gets the microphone.” The AI revolution starts with Nvidia, the analyst said, adding that the “AI party is just getting started.”  While Wall Street is looking forward to another “major beat-and-raise” special from Nvidia, the most important thing to look for is the pace of data-center AI-driven spending, the analyst said. See Also: Best Artificial Intelligence Stocks Better Times Ahead: Peak AI spending is still ahead, said Ives, reasoning that “many enterprises head down the AI use-case path over the next few years.” “We are expecting more good news from the Godfather of AI this week,” he said. Bearish investors may fret over the valuations of Nvidia, Microsoft, Palantir Technologies, Inc. PLTR, MongoDB, Inc. MDB, and other AI pure plays but there is still value in these stocks, the analyst suggested. “We believe investors that have missed the biggest transformational tech stocks the last decade including Amazon, Netflix, Meta, Apple, and Alphabet among many others have dogmatically stuck with the forward PE valuation approach on these unique tech stories,” he said. “We believe 60%-70% of enterprises will ultimately head down the AI use case path as we estimate a $1 trillion of incremental AI spend over the next decade,” Ives. The analyst noted that right now the frenzy is around enterprise use of generative AI. The consumer piece is also on the horizon being led by Alphabet, Inc. GOOGL GOOG, Meta, Amazon, Microsoft, and others, he said. “In a nutshell, Nvidia’s earnings are key for the tech world and broader markets. We are laser-focused on what the trajectory of GPU orders and demand flow looks like from enterprises,” Ives said. Nvidia ended Friday’s session down 0.06% to $726.13, according to Benzinga Pro data. The stock has gained about 46.62% for the year-to-date period. Read Next: Nvidia Stock Could Face Potential Pullback After Earnings Report, Warns Bank Of America Analyst © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}