{
    "title": "Google's 2024 Leap Day Doodle: A Frog's Guide To Celebrating The Day That \nAlmost Never Hops Around - Alph",
    "date": "2/29/2024",
    "url": "https://www.benzinga.com/news/24/02/37389103/googles-2024-leap-day-doodle-a-frogs-guide-to-celebrating-the-day-that-almost-never-hops-around",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW In celebration of Leap Day on Feb. 29, 2024, Alphabet Inc.'s GOOG GOOGL Google has unveiled a special doodle. The doodle, featuring a frog and the number 29, is a part of the tech giant’s Leap Year festivities. What Happened: Google’s Leap Day doodle depicted a frog leaping over a pond with the number 29. The doodle is accompanied by a message on Google’s site, “Ribbiting news, it’s Leap Day! Leap Day, February 29th, only occurs about every four years, to keep our calendars in alignment with the Earth and sun… Enjoy this bonus day of February — Happy Leap Day!” Google also took the opportunity to share some interesting facts and a retrospective of its first-ever doodle, the inaugural doodle series, and the Bastille Day doodle from 2000. The company had previously marked Leap Day with a doodle in February 2020. See Also: Elon Musk Got So Annoyed By People Sending Him Starbucks Latte Tweets, He Deleted His Account In The Early Days Leap Day, which only occurs every four years on February 29, is observed in various solar calendars, including the Gregorian calendar. It is added to years divisible by 4, such as 2024, 2028, and 2032, to keep our calendars in sync with the Earth’s orbit around the Sun. Why It Matters: Globally, Leap Day is celebrated with unique customs, folklore, and superstitions. Individuals born on this day are often referred to as “leaplings.” As explained by the National Air and Space Museum, a calendar year is typically 365 days long, loosely defining the number of days it takes the Earth to complete one orbit around the Sun. However, it actually takes Earth 365.242190 days to orbit the Sun. This extra time must be accounted for to prevent the seasons from drifting. If not accounted for, over a period of about 700 years, summers in the northern hemisphere would begin to occur in December. Every four years, an extra day is added to the calendar, such as February 29, also known as Leap Day. This additional 24 hours ensures the calendar stays in sync with the Earth's movement around the sun. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: If You Invested $1000 In Google When Maps Was Launched 18 Years Ago, Here’s How Much You’d Have Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Google © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}