{
    "title": "Google Stock Falls Amid Fresh OpenAI Report, Gemini Model Upgrade",
    "date": "2/15/2024",
    "url": "https://www.investors.com/news/technology/google-stock-falls-amid-fresh-openai-report-gemini-model-upgrade/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Shares in Google parent Alphabet (GOOGL) fell on Thursday as investors digested the latest artificial intelligence news. In a possible problem for Google stock, rival OpenAI could be planning to launch its own web search tool. Meanwhile, Google announced the availability of Gemini 1.5, an improved AI training model. According to a Google blog, Gemini 1.5 has \"dramatically\" enhanced performance.  Google said it will release Gemini 1.5 Pro, one version of the training model, for early testing. \"This is an exciting time for AI. New advances in the field have the potential to make AI more helpful for billions of people over the coming years. Since introducing Gemini 1.0 (in December 2023), we've been testing, refining and enhancing its capabilities,\" said Demis Hassabis, CEO of Google's DeepMind, its AI research lab, in the blog. Meanwhile, The Information reported that AI startup OpenAI is working on a web search product that would more directly compete with Google. OpenAI's technology has been integrated into Microsoft's (MSFT) Bing search engine. Microsoft is the biggest investor in OpenAI. Also, Microsoft gained little U.S. market share in internet searches in 2023 despite the new OpenAI alliance. Microsoft's Bing still holds less than 8% of the U.S. market, with Google at nearly 88%. On the stock market today, GOOGL stock fell 2.2% to close at 142.77. With the loss, Google stock neared its 50-day moving average. Investors should look for a bounce off the 50-day line. If that happens, GOOGL stock may be actionable again. Follow Reinhardt Krause on X, formerly called Twitter, @reinhardtk_tech for updates on artificial intelligence, cybersecurity and cloud computing. YOU MAY ALSO LIKE: Super Micro Computer Extends Dizzying Climb On Bullish Report IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Learn How To Time The Market With IBD's ETF Market Strategy Get Free IBD Newsletters: Market Prep | Tech Report | How To Invest 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}