{
    "title": "Google: Consider Buying Before It Goes Into FOMO Mode",
    "date": "2/4/2024",
    "url": "https://seekingalpha.com/article/4667337-google-consider-buying-before-it-goes-into-fomo-mode",
    "text": "Kenneth Cheung/iStock Unreleased via Getty Images Kenneth Cheung/iStock Unreleased via Getty Images Google (NASDAQ:GOOGL) (NASDAQ:GOOG) has underperformed the S&P 500 (SPX) (SPY) since my previous update in October 2023 as I upgraded it to a Strong Buy. As a result, it seems like the market isn't convinced that Google's AI efforts could provide a significant near-term lift in its revenue growth compared to its peers. Moreover, the mention of \"reengineering its cost base\" hasn't garnered the same effect as Amazon's (AMZN) stock's recent outperformance since its lows in October 2023. As a result, I find it intriguing that the market is still looking for more clarity from Google, notwithstanding its AI leadership. Communications sector (XLC) peer Meta Platforms (META) stock has powered to a new high, reaching the $486 level this week, discernibly overvalued, as FOMO investors rushed in. As a result, what are we missing? GOOGL has been left out of the recent market optimism, such that it's the only Magnificent 7 still trading at a significant discount relative to its peers. Mag 7 Fair valuations. Data source: Morningstar The updated Morningstar valuations show that GOOGL is valued at a 17% discount below its fair valuation. Based on GOOGL's forward EBITDA multiple of 12.1x, it's below META's revalued multiple of 13x. In other words, I assessed the market likely reallocated exposure following META's earnings, assessing that the social media leader was relatively undervalued. However, while Meta has made big strides in its AI investments and is gaining traction moving ahead, Google is assessed to have a more well-diversified business model. Google Search accounted for 55.6% of its revenue in Q4. When adding the other advertising properties, ad revenue comprises about 76% of its fourth-quarter revenue base. In contrast, Meta's advertising segment accounted for nearly 98% of its Q4 revenue, suggesting the market could have placed too much optimism on the current advertising cyclicality. Does it make sense? Google's fourth-quarter earnings release suggests that the recent advertising upswing could have peaked in the current cycle. With US economic growth expected to decelerate in 2024, it's crucial to assess higher execution risks on advertising cyclicality. Observant investors should also have noticed the 2% decrease in Google Network revenue, markedly below the corporate average, as revenue increased by 13.5% YoY. Given Google's broad advertising exposure, I believe it could offer an early warning for investors to brace for a potentially more pronounced ad revenue slowdown this year. Google Bears could point out its disappointing earnings scorecard as a key reason for this week's pullback. While justified, it's also critical to note that GOOGL headed into its ER with relative optimism as it re-tested its all-time highs last week. Hence, a shakeout post-earnings as investors reallocated their exposure shouldn't be regarded too pessimistically. I believe investors have not given enough credit to Google's attempt and momentum to diversify its ad-driven growth pillars. Management articulated in its earnings call that it experienced a robust growth cadence in subscriptions. Furthermore, Google Cloud has also reached a full year of operating profitability, benefiting from its increased scale and monetization efforts. While Microsoft has likely advanced ahead of Google in monetizing its AI investments earlier, Google is still a behemoth when it comes to AI. CFO Ruth Porat emphasized that Google will continue to invest in AI to maintain its market leadership as it works to optimize its cost base further to re-direct its efforts. Hence, I find it bewildering that the market saw META's decision to pay a cash dividend as a significant boost to revaluing its shares above GOOGL's multiple. With Meta's less diversified business model, the company is assessed to be at a higher risk of an ad cycle downswing, as we experienced in 2022. Therefore, Google's more diversified revenue base suggests the implied undervaluation hasn't been fully appreciated by the market, indicating a dip-buying opportunity. GOOGL price chart (weekly, medium-term) (TradingView) GOOGL price chart (weekly, medium-term) (TradingView) As seen above, I didn't assess a bull trap at its recent all-time high re-test, suggesting the pullback should be well-supported. Also, GOOGL finished remarkably above the week's lows, indicating dip-buying sentiments returned. GOOGL's bear trap (false downside breakdown) in October 2023 has underpinned the recent upside, as my previous thesis played out. As a result, I gleaned the recent sell-off as another opportunity for dip-buyers to buy into an undervalued Mag 7 leader, as the FOMO surge has yet to reach GOOGL investors. Rating: Maintain Strong Buy. Important note: Investors are reminded to do their due diligence and not rely on the information provided as financial advice. Please always apply independent thinking and note that the rating is not intended to time a specific entry/exit at the point of writing unless otherwise specified. I Want To Hear From You Have constructive commentary to improve our thesis? Spotted a critical gap in our view? Saw something important that we didn't? Agree or disagree? Comment below with the aim of helping everyone in the community to learn better! Sign up now for a Risk-Free 14-Day free trial!  This article was written by JR Research is an opportunistic investor. He focuses on identifying growth investing opportunities that present the most attractive risk/reward upside potential. His approach combines sharp price action analysis with fundamentals investing. He tends to avoid overhyped and overvalued stocks while capitalizing on battered stocks with significant upside recovery possibilities. He runs the investing group Ultimate Growth Investing  which specializes in identifying high-potential opportunities across various sectors. He focuses on ideas that has strong growth potential and well-beaten contrarian plays, with an 18 to 24 month outlook for the thesis to play out. The group is designed for investors seeking to capitalize on growth stocks with robust fundamentals, buying momentum, and turnaround plays at highly attractive valuations. He identifies attractive risk/reward opportunities supported by robust price action to potentially generate alpha well above the S&P 500. Learn more Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL, AMZN, META either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}