{
    "title": "Google upgrades AI product for advertisers with Gemini models",
    "date": "2/23/2024",
    "url": "https://www.mvariety.com/business/google-upgrades-ai-product-for-advertisers-with-gemini-models/article_84f6b142-d20f-11ee-86eb-e3d35e8b5c0d.html",
    "text": "  FILE PHOTO: Figurines with computers and smartphones are seen in front of the words \"Artificial Intelligence AI\" in this illustration taken, February 19, 2024. (Reuters) — Alphabet's Google said on Thursday it will integrate its Gemini artificial intelligence models into an existing product for advertisers, bringing its advanced AI capabilities to more of the tech giant's customers. The integration is part of an ongoing effort by Google to infuse generative AI, which can produce conversational text and realistic images, into more parts of its services. On Wednesday, Google said it would bring Gemini to enterprise tools that it offers businesses. Google said Gemini will improve a product called Performance Max, which automatically finds the best placements for a brand's ads across Google services including email, search and YouTube. In November, Google introduced AI tools in Performance Max to create images and text for ads, such as descriptions for a brand's products. With Gemini, brands will now be able to generate longer headlines for ads to capture a consumer's attention, with headlines of up to 90 characters versus 30 characters previously. Google said its image generation tool for advertisers will also be improved with its AI model called Imagen 2. That will give brands the new capability of creating images that include people. For example, a florist could generate a photo of a person arranging a bouquet of flowers in seconds, said Brendon Kraham, vice president of search and commerce global ad solutions at Google. The tool will include safety measures to prevent brands from creating any images of known people, including celebrities and other public figures, or images that depict violence or illegal activities, Google said. As generative AI has exploded across the tech industry, it has heightened fears that the content could be used to mislead people or result in deepfakes of real people. Photos created by AI will be watermarked to identify them as synthetic images, Google said. (This is not a scientific poll.) Click below to view our latest e-Edition. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}