{
    "title": "Google CEO Says Gemini AI’s ‘Unacceptable’ Responses Offended Users And \nShowed Bias",
    "date": "2/28/2024",
    "url": "https://www.forbes.com/sites/siladityaray/2024/02/28/google-ceo-says-gemini-ais-unacceptable-responses-offended-users-and-showed-bias/",
    "text": "Google CEO Sundar Pichai addressed the controversy around its Gemini AI service generating misleading and historically inaccurate images Tuesday, in an internal note saying the issue was “completely unacceptable,” a week after the company paused its ability to generate images of people. Google CEO Sundar Pichai called Gemini's missteps \"unacceptable\" in an internal note. In an internal note first reported by Semafor, Pichai wrote he was aware that some of Gemini’s responses “have offended our users and shown bias” and added: “To be clear, that’s completely unacceptable and we got it wrong.” Pichai said teams are “working around the clock to address these issues” and the company has seen a “substantial improvement,” without going into further detail. The CEO’s note then promised a “clear set of actions” to resolve the issue, including structural changes, refreshed product guidelines, technical recommendations, better evaluations and red-teaming (a process of simulating harmful behavior to spot vulnerabilities). Pichai’s note also signaled that the company will move forward with its AI roadmap and “build on the product and technical announcements” made in the past few weeks. Addressing concerns of bias in Gemini’s AI model, Pichai wrote: “We’ve always sought to give users helpful, accurate, and unbiased information in our products. That’s why people trust them. This has to be our approach for all our products, including our emerging AI products.” 3.58%. That is how much Google’s stock value has fallen since the end of last week as the company scrambled to deal with the fallout. The selloff shaved $90 billion off the company’s market cap Monday before the stock mounted a slight recovery over the next few days to end at $140.10 per share. Google widely launched Gemini earlier this month, replacing its former AI-powered chatbot Bard. Built on the company’s latest AI models, Gemini was touted as a competitor to Microsoft and OpenAI’s offerings like CoPilot, ChatGPT and DALL-E and other generative AI tools like Midjourney and Stability AI’s Stable Diffusion. The controversy around Gemini’s image generation tool emerged last week after users found they were able to generate historically inaccurate images like Black vikings, racially diverse Nazi soldiers and a female pope. Billionaire Elon Musk, who is building xAI as a competitor to Gemini, attacked Google’s service, calling it “woke” and “racist.” Other outlets like the Verge pointed out Gemini’s inaccuracies, noting that a prompt for a “US senator from the 1800s” generated images of a Black woman, even though the first Black woman was elected to the U.S. Senate in 1992. Google halted the service from generating images of people after the controversy spiraled and said the company would “further tune” Gemini to offer more accurate historical contexts. Google’s Gemini Controversy Explained: AI Model Criticized By Musk And Others Over Alleged Bias (Forbes) Google’s Gemini Headaches Spur $90 Billion Selloff (Forbes)  "
}