{
    "title": null,
    "date": "2/2/2024",
    "url": "https://www.sportsbusinessjournal.com/Articles/2024/02/02/big-tech-earnings",
    "text": "SBJ Tech breaks down the companies' fourth quarter earnings, with a focus on their impact in the sports technology and media ecosystem. Tech giants released their Q4 2023 reports this week, with the likes of Alphabet, Amazon, Apple, and Microsoft providing the latest slivers of insight into their businesses. The updates added some color to the massive layoffs of the last year (which continued into this year) as they all peered toward their future innovations with their own AI models. Microsoft CEO Satya Nadella said “we've moved from talking about AI to applying AI at scale” in the company’s release on Tuesday. Said Alphabet CEO Sundar Pichai very similarly: “As we enter the Gemini (Google’s latest AI model) era, the best is yet to come.” Apple CEO Tim Cook also hinted that Apple might have an AI announcement sometime this year. Cook said that Apple continues to “spend a tremendous amount of time and effort” on AI, adding even more fuel to this large-scale AI race. Here are some highlights from those reports and where intersections arise with those tech companies and the sports industry. Alphabet saw a revenue of $86 billion in Q4 2023, a 13% year-over-year increase. That figure pushed total revenue for the company to over $307 billion for 2023. More than half of Q4 revenue came from Google Search ($48 billion). Alphabet also notched a 13% increase in revenue from Google Services, which encapsulates earnings from all lynchpin products like Android, Chrome, Google Maps, Google Play, Search and YouTube. Included as well are subscriber-based products like NFL Sunday Ticket. 2023 was Google’s first year with the rights from the NFL to put Sunday Ticket on YouTube TV and YouTube Primetime. Perhaps the biggest takeaway resonating, though, was the sheer amount doled out following layoffs last year. Alphabet spent $2.1 billion on severance pay in 2023. That news comes off the heels of another layoff push in January, part of a larger-scale industry layoff. Google is set to make a big impact on all businesses and its partners in Q3 2024 when it phases out support for third-party cookies. That’s been a frequent topic of SBJ coverage, through the importance of trusted data partners with fan information and the need for first-party data connection with fanbases. Amazon\nAmazon brought in $170 billion in Q4 2023 net sales, which was up 14%. That brought the total net sales for FY 2023 to $574.8 billion.\nThursday Night Football on Prime Video grabbed a year-over-year increase of 24% for the second season of production. The company says it experienced a 14% growth for the second-consecutive season of viewers in the 18-to-34-year-old demographic. The high watermark of the season (and series) was the Nov. 30 matchup between the Seattle Seahawks and Dallas Cowboys, which registered 15.3 million viewers.\nPrime Video global sports rights additions include part of NASCAR’s new seven-year media rights deal, as well as its inclusion in the NWSL’s package of broadcasts for the next four seasons and the Premier Boxing Championship. They also produced the sports documentaries “Kelce” about longtime Philadelphia Eagles center Jason Kelce and “Bye Bye Barry,” which focuses on the career of Hall of Fame running back Barry Sanders.\n\nApple\nApple’s Q4 2023 deliver $119.6 billion, up 2% year-over-year. The earnings release came just before the Apple Vision Pro’s debut on Friday.\nEarlier in the week, the company shared that more than 600 apps would be available the day of the Apple Vision Pro’s release. That includes a slew of sports offerings, like the NBA app with a multi-view feature allowing users to watch five games at once. MLB also debuted their app where users can view three-dimensional data visualizations, such as a virtual strike zone that's synchronized with game action to complement the traditional broadcast. There’s also PGA Tour Vision, utilizing shot tracking and 3D modeling created in collaboration with Quintar, one of SBJ’s 10 Most Innovative Sports Tech Companies in 2022. Its cofounders, Sankar Jayaram and Jeff Jonas, were Power Player: Fan Experience Tech honorees.\nLast year was Apple’s first season with MLS Season Pass, which can also be viewed through Apple Vision Pro (among many compatible apps from cable providers and sports broadcasters). Amazon brought in $170 billion in Q4 2023 net sales, which was up 14%. That brought the total net sales for FY 2023 to $574.8 billion. Thursday Night Football on Prime Video grabbed a year-over-year increase of 24% for the second season of production. The company says it experienced a 14% growth for the second-consecutive season of viewers in the 18-to-34-year-old demographic. The high watermark of the season (and series) was the Nov. 30 matchup between the Seattle Seahawks and Dallas Cowboys, which registered 15.3 million viewers. Prime Video global sports rights additions include part of NASCAR’s new seven-year media rights deal, as well as its inclusion in the NWSL’s package of broadcasts for the next four seasons and the Premier Boxing Championship. They also produced the sports documentaries “Kelce” about longtime Philadelphia Eagles center Jason Kelce and “Bye Bye Barry,” which focuses on the career of Hall of Fame running back Barry Sanders. Apple\nApple’s Q4 2023 deliver $119.6 billion, up 2% year-over-year. The earnings release came just before the Apple Vision Pro’s debut on Friday.\nEarlier in the week, the company shared that more than 600 apps would be available the day of the Apple Vision Pro’s release. That includes a slew of sports offerings, like the NBA app with a multi-view feature allowing users to watch five games at once. MLB also debuted their app where users can view three-dimensional data visualizations, such as a virtual strike zone that's synchronized with game action to complement the traditional broadcast. There’s also PGA Tour Vision, utilizing shot tracking and 3D modeling created in collaboration with Quintar, one of SBJ’s 10 Most Innovative Sports Tech Companies in 2022. Its cofounders, Sankar Jayaram and Jeff Jonas, were Power Player: Fan Experience Tech honorees.\nLast year was Apple’s first season with MLS Season Pass, which can also be viewed through Apple Vision Pro (among many compatible apps from cable providers and sports broadcasters). Apple’s Q4 2023 deliver $119.6 billion, up 2% year-over-year. The earnings release came just before the Apple Vision Pro’s debut on Friday. Earlier in the week, the company shared that more than 600 apps would be available the day of the Apple Vision Pro’s release. That includes a slew of sports offerings, like the NBA app with a multi-view feature allowing users to watch five games at once. MLB also debuted their app where users can view three-dimensional data visualizations, such as a virtual strike zone that's synchronized with game action to complement the traditional broadcast. There’s also PGA Tour Vision, utilizing shot tracking and 3D modeling created in collaboration with Quintar, one of SBJ’s 10 Most Innovative Sports Tech Companies in 2022. Its cofounders, Sankar Jayaram and Jeff Jonas, were Power Player: Fan Experience Tech honorees. Last year was Apple’s first season with MLS Season Pass, which can also be viewed through Apple Vision Pro (among many compatible apps from cable providers and sports broadcasters). Revenue was up 18% year-over-year in Q4 2023 for Microsoft, with a total of $62 billion. The company added that server products and cloud services revenue also increased 22%, an uptick sparked by its cloud computing platform Azure and other cloud services. Azure automates some of the content in the NBA App, which Microsoft helped the league redevelop in 2022. Microsoft completed the acquisition of Activision Blizzard during the quarter, which was followed by the layoff of reportedly 1,900 people in the Activision Blizzard esports staff as well as Xbox last month. Microsoft recently named Johanna Faries as the new president of Blizzard Entertainment. Faries shifts into the role from as general manager of the Call of Duty franchise. Before that, she spent nearly 12 years in the NFL league office in several roles. Start your morning with Buzzcast with Austin Karp: Basketball ownership issues in the Twin Cities; the new Orioles ownership group has a big day in Baltimore; Steve Cohen takes a stake in Fox; and “Good Morning Football” signs off from its NYC studios. Shareable URL copied to clipboard! https://www.sportsbusinessjournal.com/Articles/2024/02/02/big-tech-earnings Sorry, something went wrong with the copy but here is the link for you. https://www.sportsbusinessjournal.com/Articles/2024/02/02/big-tech-earnings Register for a free SBJ account to unlock one extra article per month.  © 2024 Leaders Group. All rights reserved.The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Leaders Group. © 2024 Leaders Group. All rights reserved. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Leaders Group. Already a subscriber? Click below to sign in. Upgrade your subscription to get all the news you need: Adding SBJ weekly content will give you the comprehensive view of sports business with: Already a subscriber? Click below to sign in. Upgrade your subscription to get all the news you need: Adding SBJ daily content will give you the comprehensive view of sports business with: "
}