{
    "title": "Meta Stock, Magnificent Seven Member Alphabet Are Mutual Fund Favorites",
    "date": "2/14/2024",
    "url": "https://www.investors.com/research/meta-stock-magnificent-seven-member-alphbaet-are-mutual-fund-favorites/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Meta stock — along with Magnificent Seven member Alphabet (GOOGL) and Dow Jones stock Travelers (TRV) — headline Wednesday's IBD Screen Of The Day, a column that focuses on top ideas in the IBD Stock Screener. Wednesday's stocks to buy and watch come from the Stocks Funds Are Buying screen. This screen identifies stocks in which big mutual funds are increasing their positions. Meta Platforms (META) is far extended from its 312.87 cup-with-handle entry following an early-October breakout move, according to IBD MarketSmith chart analysis. Shares of Meta stock rallied 1.8% midday Wednesday. On Feb. 2, Meta stock soared more than 20%. And it is holding those gains, sitting just 4% away from its 52-week high. Meanwhile, the relative strength line continues to hold tight after hitting new highs. Meta stock is on IBD Leaderboard. In its latest quarterly report, Meta reported better-than-expected earnings for the fourth quarter and announced plans for its first-ever dividend. The company said it earned $5.33 per share on sales of $40.1 billion for the December-ending quarter. Analysts projected the company would post earnings of $4.82 per share on $39.1 billion in sales, according to FactSet. Sales for the quarter increased 25% year over year, while earnings increased 203%. Further, Meta said it is initiating a dividend of 50 cents per share of common stock, payable on March 26 to shareholders on record as of Feb. 22. Magnificent Seven stock Alphabet dropped 0.5% midday Tuesday, at the top of the buy range past a 139.42 buy point in a cup with handle. Meta stock is also in the Magnificent Seven. Alphabet shares are pausing after their recent rebound from the key 50-day moving average line. Since a Dec. 20 breakout, the 50-day line has acted as a support level for the tech giant. On Jan. 31, the Google parent reported fourth-quarter earnings and revenue that topped analyst estimates. But Google stock tumbled 7.5% as the core advertising business slightly missed views amid worries over how the rise of generative artificial intelligence will impact internet search. Outside of Meta stock, Dow Jones stock Travelers hit a new high Wednesday at 218.11, further above a 194.51 buy point in a cup base. The 5% buy area ran up to 204.24. On Jan. 19, the insurance giant delivered earnings of $7.01 per share, a 106% jump and well above views for $5.07. Revenue rose 13% to $10.93 billion, also topping the $9.99 billion target. The earnings upturn snapped a six-quarter losing streak, although revenue growth had shown modest acceleration over those quarters. Follow Scott Lehtonen on Twitter at @IBD_SLehtonen for more on the best stocks to buy and watch and the stock market. YOU MAY ALSO LIKE: Magnificent Seven Stocks To Buy And Watch Yes, Nvidia Is One. But These Aren't The Mag 7 You Expect. Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}