{
    "title": "Did you know: This is the highest-paid tech CEO in the US",
    "date": "3/11/2024",
    "url": "https://www.androidauthority.com/highest-paid-tech-ceo-3423633/",
    "text": "Affiliate links on Android Authority may earn us a commission. Learn more. It’s no secret that C-suite compensation has wildly outpaced wage growth for the rest of us working folks, but only one company can take the crown of the highest-paid tech CEO in the US. Based on market cap, you’d expect it to be Microsoft or Apple, but neither Satya Nadella nor Tim Cook breaks the top five. The highest-paid tech CEO in the US is Alphabet/Google’s Sundar Pichai, who in 2022 earned more in an hour than most of us earn in a full calendar year. Sundar Pichai’s total compensation package for 2022 totaled nearly $226 million. To put that in perspective, it would take the average US worker (making $53,500 a year) roughly 4,200 years to make the same amount Sundar Pichai made in a single year. Even within Alphabet, it’s more than 8oo times the average worker’s salary. To make matters worse, the SEC filings revealing his compensation went public shortly after he announced layoffs of more than 12,000 workers in January 2023. Pichai wrote that he “take[s] full responsibility for the decisions that led us here” in a message to employees, while also pocketing huge bonuses. In all fairness, most of Pichai’s compensation came in the form of stock, which was valued at $218 million of the $226 million he earned in 2022. This stock will vest over three years, so the actual value will depend on how Alphabet/Google stock performs. He only receives these bonuses every three years, which can lead to huge fluctuations in earnings. His 2023 earnings haven’t been revealed yet, but his actual salary is more in the range of $6-8 million, not including perks and bonuses. According to the same SEC filings, the difference between Pichai’s compensation and the average Alphabet employee was an outlier in 2022 because of these bonuses. In the report, the company writes that “our 2020 pay ratio was 27:1; our 2021 pay ratio was 21:1; and our 2022 pay ratio is 808:1…” Conveniently left out is the 2019 ratio, which was 1,085:1. Pichai’s total compensation that year totaled more than $280 million with stock options. While Sundar Pichai is by far the highest-paid CEO in the tech world, there are plenty of other executives making bank. Here’s a quick rundown of the top 11 from 2022: Perhaps the most surprising thing here is how low Tim Cook and Satya Nadella are, considering how large their companies are by market cap. Looking a bit deeper though, Tim Cook’s equity earnings are not given on a three-year basis, so his earnings don’t fluctuate nearly as much as Pichai’s. That’s a cool $100 million every single year. Granted, Tim Cook took a massive reduction in his earnings in 2023 based on his own request. The stated goal was to bring his total compensation to around $49 million, although his final compensation in 2023 was closer to $63 million. Satya Nadella’s figure also fluctuates far less without these bonuses, and he actually took home less in 2023 than he did in 2022 due to Microsoft missing performance goals. Still, the company’s SEC filings reveal that the pay ratio is roughly 250:1 when compared to the average Microsoft employee. Or at least, the ones who are left after more than 10,000 workers were laid off in 2023 and now again in 2024. A few other oddities are Peloton CEO Barry McCarthy, whose compensation in 2022 included stock options worth $167 million. Considering Peloton stock has continued to plummet for more than two years now, his actual earnings are likely to be much lower. Oracle’s Safra Catz is the only female CEO on the list, leading Oracle to new heights since becoming the sole CEO in 2019. Like Pichai, her earnings in 2022 were bolstered by $130 million in stock options, which she did not receive in other years. Her earnings in 2023 were just over $5 million. Despite being the CEO, Catz was actually out-earned in 2022 by Founder and CTO Larry Ellison, who took home roughly $150 million when including stock options. He’s also Oracle’s largest stockholder, with around 40% of the company’s common stock. That makes him the fifth richest person in the world, with a net worth of roughly $142 billion. Netflix is another strange case, with Reed Hastings and Ted Sarandos sharing the CEO title until 2023, when Greg Peters swapped in for Hastings. The company still has a co-CEO situation today, which is uncommon but not unheard of in the business world, with a total CEO compensation that totals well over $100 million. "
}