{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.foxbusiness.com/markets/googles-gemini-debacle-make-break-moment-analyst",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy FOX Business correspondent Kelly O'Grady breaks down bias accusations on 'Varney & Co.' The bungled rollout of Google's new artificial intelligence tool Gemini could end up being either a curse or a blessing for the Alphabet-owned tech giant, according to an analyst who owns the stock. Seeking Alpha analyst Steven Fiorillo wrote in an assessment published Wednesday that Gemini will either be Google's \"destruction or its resurrection\" after a series of public failures by the model led the company to pull the plug on some features and vow to fix it. Google's reputation is at stake in its efforts to fix Gemini, according to an analyst's report published Wednesday. (Marlena Sloss/Bloomberg via Getty Images / Getty Images) Fiorillo expressed his disappointment in the botched launch and argued it was completely avoidable before predicting, \"This will either lead to Google's destruction as trust from the end user is lost or lead to its resurrection as GOOGL utilizes this moment to crush its competition.\" GOOGLE GEMINI USING ‘INVISIBLE’ COMMANDS TO DEFINE ‘TOXICITY’ AND SHAPE THE ONLINE WORLD: DIGITAL EXPERT Fiorillo called it \"negligent\" for Google to release Gemini without assuring its accuracy, and voiced concerns over instances where the chatbot provided incorrect answers and generated inaccurate depictions of both current and historical events. Google is scrambling to work out Gemini's bugs after the AI tool provided incorrect answers and showed bias against White people in its initial rollout. (Jonathan Raa/NurPhoto via Getty Images / Getty Images) Google halted Gemini's image generation feature nearly two weeks ago after users on social media flagged that it was creating inaccurate historical images that sometimes replaced White people with images of Black, Native American and Asian people. GOOGLE CO-FOUNDER SAYS COMPANY ‘DEFINITELY MESSED UP’ ON GEMINI'S IMAGE GENERATION Google CEO Sundar Pichai told employees last week that the company is working \"around the clock\" to fix Gemini's bias, calling the images generated by the model \"completely unacceptable.\" Alphabet, Inc. The company reportedly plans to relaunch Gemini AI's ability to generate images of people in the next few weeks, and Fiorillo said Google's reputation could hinge on how that goes. \"All eyes will be on GOOGL as the ball is in their court,\" he wrote. \"GOOGL will either rise like a phoenix from the ashes or allow its competitors to capitalize on this moment and control the narrative about how the results from GOOGL can't be trusted.\" GET FOX BUSINESS ON THE GO BY CLICKING HERE Still, Fiorillo is bullish on the company, adding, \"I believe Google won't take this lying down, internal changes will be made, and it will dominate AI-enabled search.\" Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}