{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/twelve-points-wealth-management-llc-grows-stock-holdings-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Twelve Points Wealth Management LLC increased its stake in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 4.4% during the fourth quarter, HoldingsChannel.com reports. The institutional investor  owned 6,202 shares of the information services provider’s stock after acquiring an additional 262 shares during the period. Twelve Points Wealth Management LLC’s holdings in Alphabet were worth $866,000 as of its most recent filing with the Securities & Exchange Commission. A number of other hedge funds and other institutional investors have also recently made changes to their positions in the stock. Spreng Capital Management Inc. grew its stake in  Alphabet by 4.0% in the 1st quarter. Spreng Capital Management Inc. now owns 131 shares of the information services provider’s stock worth $364,000 after acquiring an additional 5 shares during the period.  West Family Investments Inc. grew its stake in shares of  Alphabet by 0.3% during the 1st quarter. West Family Investments Inc. now owns 1,754 shares of the information services provider’s stock valued at $4,878,000 after buying an additional 6 shares during the period.  Maple Capital Management Inc. grew its stake in shares of  Alphabet by 2.1% during the 1st quarter. Maple Capital Management Inc. now owns 296 shares of the information services provider’s stock valued at $823,000 after buying an additional 6 shares during the period.  Private Advisory Group LLC boosted its position in  Alphabet by 1.8% during the 1st quarter. Private Advisory Group LLC now owns 401 shares of the information services provider’s stock worth $1,115,000 after purchasing an additional 7 shares during the period.  Finally, Weik Capital Management boosted its position in  Alphabet by 0.5% during the 1st quarter. Weik Capital Management now owns 1,533 shares of the information services provider’s stock worth $4,264,000 after purchasing an additional 8 shares during the period. Hedge funds and other institutional investors own  35.08% of the company’s stock. GOOGL has been the subject of a number of research reports. Redburn Atlantic upped their price target on shares of Alphabet from $150.00 to $165.00 and gave the stock a “buy” rating in a research report on Wednesday, January 31st. Wells Fargo & Company upped their price target on shares of Alphabet from $141.00 to $144.00 and gave the stock an “equal weight” rating in a research report on Monday, March 18th. KeyCorp upped their price target on shares of Alphabet from $153.00 to $165.00 and gave the stock an “overweight” rating in a research report on Monday, January 29th. JMP Securities upped their price target on shares of Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a research report on Wednesday, January 31st. Finally, Wedbush boosted their price objective on shares of Alphabet from $160.00 to $175.00 and gave the stock an “outperform” rating in a report on Friday. Five equities research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have assigned  a strong buy rating to the stock. According to data from MarketBeat, the company presently has an average rating of “Moderate Buy” and an average price target of $155.48. Get Our Latest Stock Analysis on GOOGL In related news, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction that occurred on Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total value of $3,347,550.00. Following the completion of the transaction, the chief executive officer now owns 2,310,191 shares of the company’s stock, valued at approximately $343,710,216.98. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available at the SEC website. In related news, insider John Kent Walker sold 28,281 shares of the firm’s stock in a transaction that occurred on Thursday, December 28th. The shares were sold at an average price of $141.40, for a total value of $3,998,933.40. Following the completion of the transaction, the insider now owns 25,002 shares of the company’s stock, valued at approximately $3,535,282.80. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available at the SEC website. Also, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction on Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the sale, the chief executive officer now directly owns 2,310,191 shares of the company’s stock, valued at approximately $343,710,216.98. The disclosure for this sale can be found here. Over the last 90 days, insiders have sold 279,659 shares of company stock worth $39,460,310. 0.88% of the stock is owned by insiders. NASDAQ GOOGL opened at $150.77 on Friday. Alphabet Inc. has a 12 month low of $99.74 and a 12 month high of $153.78. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. The firm has a market capitalization of $1.87 trillion, a PE ratio of 25.99, a P/E/G ratio of 1.39 and a beta of 1.04. The company’s 50 day simple moving average is $143.02 and its 200 day simple moving average is $137.79. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. The business had revenue of $86.31 billion for the quarter, compared to analyst estimates of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter last year, the business earned $1.05 earnings per share.  As a group, equities research analysts forecast that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Morgan Stanley (NYSE:MS) Shares Sold by CX Institutional Whitaker Myers Wealth Managers LTD. Makes New Investment in Alphabet Inc. (NASDAQ:GOOGL) "
}