{
    "title": "Alphabet Stock Remains in Focus Amid AI-Related Developments—Key Price \nLevel to Watch",
    "date": "3/19/2024",
    "url": "https://www.investopedia.com/alphabet-stock-remains-in-focus-amid-ai-related-developments-key-price-level-to-watch-8610884",
    "text": "Google Parent Has Deepened Partnership With Nvidia and Reportedly is in Talks with Apple on AI Licensing Deal Shares in Google parent Alphabet (GOOGL) remain in the spotlight Tuesday, one day after surging on a report that the company is in talks with Apple (AAPL) to license Google's Gemini suite of artificial intelligence tools for future iPhone operating systems. Adding to the mix, AI bellwether Nvidia (NVDA) announced late Monday at its flagship GPU Technology Conference that it’s deepening its existing partnership with Google Cloud to provide machine leaning developers with the technology to scale and manage generative artificial intelligence (AI) applications. The enhanced collaboration between the two companies will combine Nvidia’s next generation Grace Blackwell platform, DGX Cloud service, and its AI for enterprise solution DGX H100 with Google Cloud. The tech giants will also expand their partnership on Gemma AI models, with Google utilizing Nvidia’s NIM technology to provide an open platform for developers to train and deploy large language models (LLMs) with tools and frameworks of their choice. In addition, the collaboration will add support for Google’s machine learning framework JAX on Nvidia graphics processing units (GPUs) and its Vertex AI instances powered by Nvidia H100 and Tensor Core GPUs. “Excited to deepen our partnership with NVIDIA and bring the breakthrough capabilities of the Blackwell GPU to our teams and Cloud customers,” Alphabet CEO Sundar Pichai posted on X, formally known as Twitter, after the announcement. Taking a look at the weekly chart, the Alphabet share price has carved out a broad cup and handle pattern over the past 27 months, with the cup portion of the pattern bottoming out around the 200-day moving average and the handle of the formation finding support from the 50-day moving average. Monday’s rally places the price just below the pattern’s top trendline and intraday record high set in January this year at $153.78. If the stock breaks to the upside, look for a longer-term measured move to around $216.50. Calculate this by measuring the range of the widest portion of the pattern’s cup and adding that amount to the breakout point. Google shares were down 1% at $146.18 in premarket trading at around 7:50 a.m. ET Tuesday, tracking a broader downturn for tech stocks. The stock has gained about 45% over the past year. The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own any of the above securities. Nvidia. \"Google Cloud and Nvidia Expand Partnership to Scale AI Development.\" X. \"Sundar Pichai.\" "
}