{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) is Thompson Investment Management Inc.'s 2nd \nLargest Position",
    "date": "3/27/2024",
    "url": "https://www.defenseworld.net/2024/03/27/alphabet-inc-nasdaqgoogl-is-thompson-investment-management-inc-s-2nd-largest-position.html",
    "text": "Posted by Defense World Staff on Mar 27th, 2024 Thompson Investment Management Inc. lowered its position in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 3.1% in the fourth quarter, Holdings Channel reports. The firm owned 182,495 shares of the information services provider’s stock after selling 5,771 shares during the period. Alphabet makes up  about  4.1% of Thompson Investment Management Inc.’s investment portfolio, making the stock its 2nd biggest position. Thompson Investment Management Inc.’s holdings in Alphabet were worth $25,493,000 at the end of the most recent reporting period. Other institutional investors also recently made changes to their positions in the company. Vanguard Group Inc. grew its stake in shares of  Alphabet by 1,919.4% in the third quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock worth $45,628,484,000 after purchasing an additional 453,413,389 shares in the last quarter.  State Street Corp lifted its holdings in shares of  Alphabet by 1,900.6% in the third quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock valued at $20,770,809,000 after buying an additional 206,300,042 shares during the period.  Moneta Group Investment Advisors LLC lifted its holdings in shares of  Alphabet by 111,197.8% in the fourth quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock valued at $15,036,178,000 after buying an additional 170,267,122 shares during the period.  Price T Rowe Associates Inc. MD lifted its holdings in shares of  Alphabet by 1,759.2% in the third quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock valued at $11,106,502,000 after buying an additional 109,870,525 shares during the period.  Finally, Norges Bank acquired a new stake in shares of  Alphabet in the fourth quarter valued at $8,335,063,000. 40.03% of the stock is owned by institutional investors and hedge funds. GOOGL opened at $150.67 on Wednesday. The firm has a market capitalization of $1.87 trillion, a P/E ratio of 25.98, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. The stock’s 50 day moving average price is $143.17 and its two-hundred day moving average price is $137.93. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a 12-month low of $99.74 and a 12-month high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last released its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. The firm had revenue of $86.31 billion for the quarter, compared to analyst estimates of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same quarter last year, the firm posted $1.05 EPS.  On average, equities analysts forecast that  Alphabet Inc. will post 6.77 earnings per share for the current year. Several brokerages have recently weighed in on GOOGL. KeyCorp upped their price objective on Alphabet from $153.00 to $165.00 and gave the company an “overweight” rating in a report on Monday, January 29th. BMO Capital Markets upped their target price on Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. StockNews.com raised Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. Citigroup upped their target price on Alphabet from $153.00 to $168.00 and gave the company a “buy” rating in a report on Wednesday, January 31st. Finally, Wedbush upped their target price on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a report on Friday, March 22nd. Five investment analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have issued  a strong buy rating to the company’s stock. According to MarketBeat.com, the company  has a consensus rating of “Moderate Buy” and a consensus price target of $155.48. Read Our Latest Research Report on Alphabet In other Alphabet news, Director John L. Hennessy sold 200 shares of the firm’s stock in a transaction that occurred on Wednesday, January 10th. The stock was sold at an average price of $143.49, for a total value of $28,698.00. Following the completion of the sale, the director now owns 6,784 shares in the company, valued at approximately $973,436.16. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this hyperlink. In related news, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction that occurred on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the completion of the transaction, the chief executive officer now owns 2,310,191 shares in the company, valued at approximately $343,710,216.98. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through this link. Also, Director John L. Hennessy sold 200 shares of the firm’s stock in a transaction that occurred on Wednesday, January 10th. The stock was sold at an average price of $143.49, for a total value of $28,698.00. Following the transaction, the director now owns 6,784 shares of the company’s stock, valued at approximately $973,436.16. The disclosure for this sale can be found here. In the last quarter, insiders sold 279,659 shares of company stock worth $39,460,310. 0.88% of the stock is currently owned by company insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Cambridge Advisors Inc. Has $1.39 Million Position in Alphabet Inc. (NASDAQ:GOOGL) Cedar Mountain Advisors LLC Trims Stock Position in Alphabet Inc. (NASDAQ:GOOGL) "
}