{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/altfest-l-j-co-inc-sells-160-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Altfest L J & Co. Inc. reduced its position in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 2.1% in the 4th quarter, HoldingsChannel reports. The firm owned 7,457 shares of the information services provider’s stock after selling 160 shares during the period. Altfest L J & Co. Inc.’s holdings in Alphabet were worth $1,042,000 at the end of the most recent reporting period. Other institutional investors have also recently added to or reduced their stakes in the company. Live Oak Investment Partners bought a new position in  Alphabet during the 4th quarter valued at about $26,000.  VitalStone Financial LLC lifted its holdings in  Alphabet by 1,900.0% during the 2nd quarter. VitalStone Financial LLC now owns 280 shares of the information services provider’s stock valued at $34,000 after purchasing an additional 266 shares during the last quarter.  Sanctuary Wealth Management L.L.C. bought a new position in shares of  Alphabet in the fourth quarter worth about $34,000.  Turim 21 Investimentos Ltda. bought a new position in shares of  Alphabet in the third quarter worth about $38,000.  Finally, Meritage Group LP raised its stake in shares of  Alphabet by 1,061.5% in the third quarter. Meritage Group LP now owns 302 shares of the information services provider’s stock worth $40,000 after acquiring an additional 276 shares during the last quarter. 40.03% of the stock is owned by institutional investors. Alphabet stock opened at $150.93 on Friday. The stock has a market capitalization of $1.88 trillion, a PE ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet Inc. has a twelve month low of $99.78 and a twelve month high of $153.78. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The company has a 50 day moving average of $143.67 and a 200-day moving average of $138.21. Alphabet (NASDAQ:GOOGL – Get Free Report) last released its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, beating the consensus estimate of $1.60 by $0.04. The company had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter in the prior year, the company earned $1.05 earnings per share.  On average, equities research analysts anticipate that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. In related news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction on Wednesday, March 6th. The shares were sold at an average price of $132.70, for a total transaction of $2,985,750.00. Following the completion of the transaction, the chief executive officer now owns 2,332,691 shares in the company, valued at $309,548,095.70. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. In related news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction on Wednesday, March 6th. The shares were sold at an average price of $132.70, for a total transaction of $2,985,750.00. Following the completion of the transaction, the chief executive officer now owns 2,332,691 shares in the company, valued at $309,548,095.70. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, CAO Amie Thuener O’toole sold 682 shares of the stock in a transaction on Monday, March 4th. The stock was sold at an average price of $136.49, for a total transaction of $93,086.18. Following the transaction, the chief accounting officer now owns 28,602 shares of the company’s stock, valued at approximately $3,903,886.98. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 263,312 shares of company stock worth $37,268,315. 0.88% of the stock is owned by insiders. GOOGL has been the subject of a number of research analyst reports. Mizuho boosted their target price on shares of Alphabet from $155.00 to $170.00 and gave the stock a “buy” rating in a research note on Wednesday, January 17th. Roth Mkm dropped their target price on shares of Alphabet from $166.00 to $164.00 and set a “buy” rating for the company in a research note on Wednesday, January 31st. Wolfe Research boosted their target price on shares of Alphabet from $170.00 to $180.00 and gave the stock an “outperform” rating in a research note on Wednesday, January 31st. StockNews.com raised shares of Alphabet from a “buy” rating to a “strong-buy” rating in a research note on Wednesday, December 20th. Finally, KeyCorp boosted their price target on shares of Alphabet from $153.00 to $165.00 and gave the stock an “overweight” rating in a research note on Monday, January 29th. Five equities research analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have assigned  a strong buy rating to the company. According to data from MarketBeat, Alphabet  has an average rating of “Moderate Buy” and an average target price of $155.48. Get Our Latest Report on GOOGL (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 1,264 Shares in Kenvue Inc. (NYSE:KVUE) Bought by Planned Solutions Inc. Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by Parisi Gray Wealth Management "
}