{
    "title": null,
    "date": "3/13/2024",
    "url": "https://www.tradingview.com/news/benzinga:b2ed59750094b:0-is-google-gemini-ai-sneaky-mind-control-1-writer-says-it-tries-to-nudge-our-thinking/",
    "text": "Alphabet Inc GOOG GOOGL subsidiary Google has been under siege in recent weeks after several reports found the company's new artificial intelligence system, Gemini, to lack quality and consistency. The rushed launch of Gemini, propelled by fears of lagging behind in the AI race, has caused the company to now take a more conservative approach to its AI products. Recently, Google suspended its image generating software indefinitely and on Tuesday, it announced that its chatbot would not generate any answers related to the many high-profile elections occurring this year around the world. Gemini’s Beleaguered Launch: Google launched Gemini in December of last year, initially as the engine behind Bard, its AI chatbot, which is in direct competition with OpenAI's ChatGPT, which is offered within Microsoft Corp MSFT products. Soon after, Google launched a Gemini-backed image generation platform, in the same vein as MidJourney or OpenAI's DALL-E. Late last month, the company faced a storm of criticism after it became publicly known the image service was generating racially inaccurate depictions of Nazi soldiers, who were portrayed as Black or Asian by default. The engine also generated historically inaccurate representations of the Pope, whom it cast as female. George Washington, as well as other founding fathers, were depicted as Black. The debacle was so large that CEO Sundar Pichai as well as co-founder Sergey Brin admitted the launch was rushed and irresponsible, leading to the suspension of the services \"for a few weeks.\" While the image generator service remains offline, it's the company's text-generation services that has sparked the latest wave of criticism. On Tuesday, Google told TechCrunch that it will be limiting its chatbot from generating answers related to this year's upcoming elections around the globe. Google ‘Working To Improve Our Protections’ In Key Election Year: The 2024 presidential election in the U.S. isn't the only election this year set to trace the path of history for years to come. 2024 is building up to be the most important election year of recent decades around the globe, with 64% of countries heading to the polls. India, the European Union, Russia, Ukraine, Indonesia, Mexico, Iran and the U.K. are just some of the territories picking new leadership this year. The limitation set by Google includes any country where an election will be taking place. The update is already live in the U.S., where users have been redirected by Gemini to Google Search to find answers on the topic. The company appears to be responding to the recent backlash with extreme caution. In a blog post describing the newly imposed limitation in India, Google said that it takes its \"responsibility for providing high-quality information for these types of queries seriously,\" and is \"continuously working to improve our protections.\" Also read: Neither Sundar Pichai Nor Sergey Brin—This Ex-Employee Warned Google 5 Years Ago That AI Was Coming For Their Search Engine According to a recent report, Gemini can carry biases that are more deeply entrenched than what most users would normally recognize. Do AI Programs Have Implicit Bias? Writing for The Atlantic, writer Fred Bauer set out to research the biases that the AI carries when answering common prompts. While Gemini explains that the opinions it expressed are \"neutral\" and not aligned to any ideology or political sphere, many of its answers appear to reflect the particular biases of the programmers behind the software. The program would, for instance, deny requests to generate taglines for an advertising campaign convincing people to eat more meat, while it gladly generated taglines for a campaign exhorting a vegetable diet. \"Gemini's dietary vision just happened to reflect the food norms of certain elite American cultural progressives: conflicted about meat but wild about plant-based eating,\" writes Bauer. AI software “seems designed to nudge our thinking,” he said. Echoing the comments of 20th century Canadian philosopher and media theorist Marshall McLuhan, who wrote that \"we shape our tools and thereafter our tools shape us,\" Bauer presented the concern that AI services like Gemini have the ability to shape our thoughts and opinions to a larger extent than what most users of the platform would think. \"Gemini and other AI bots may function as the engineers of our mindscapes. Programmed by the hacker wizards of Silicon Valley, AI may become a vehicle for programming us—with profound implications for democratic citizenship,\" said Bauer. Now read: Is Microsoft Turning Into ‘IT For OpenAI’? Insiders Say Tech Giant’s AI Strategy Is Overly Reliant On ChatGPT Parent’s Partnership On Tuesday, billionaire entrepreneur Elon Musk shared a similar concern, writing on X, formerly known as Twitter, that \"people should be very concerned about the biases being programmed into AI.\" Shutterstock image. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}