{
    "title": "Cresta Advisors Ltd. Sells 530 Shares of Alphabet Inc. (NASDAQ:GOOGL)",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/cresta-advisors-ltd-sells-530-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 Cresta Advisors Ltd. cut its holdings in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 4.1% in the 4th quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The fund owned 12,385 shares of the information services provider’s stock after selling 530 shares during the period. Alphabet comprises approximately  1.2% of Cresta Advisors Ltd.’s investment portfolio, making the stock its 20th biggest position. Cresta Advisors Ltd.’s holdings in Alphabet were worth $1,730,000 at the end of the most recent quarter. Several other institutional investors and hedge funds have also recently added to or reduced their stakes in the business. Spreng Capital Management Inc. lifted its stake in  Alphabet by 4.0% in the first quarter. Spreng Capital Management Inc. now owns 131 shares of the information services provider’s stock valued at $364,000 after buying an additional 5 shares during the period.  West Family Investments Inc. lifted its stake in  Alphabet by 0.3% in the first quarter. West Family Investments Inc. now owns 1,754 shares of the information services provider’s stock valued at $4,878,000 after buying an additional 6 shares during the period.  Maple Capital Management Inc. lifted its stake in  Alphabet by 2.1% in the first quarter. Maple Capital Management Inc. now owns 296 shares of the information services provider’s stock valued at $823,000 after buying an additional 6 shares during the period.  Private Advisory Group LLC lifted its stake in  Alphabet by 1.8% in the first quarter. Private Advisory Group LLC now owns 401 shares of the information services provider’s stock valued at $1,115,000 after buying an additional 7 shares during the period.  Finally, Weik Capital Management lifted its stake in  Alphabet by 0.5% in the first quarter. Weik Capital Management now owns 1,533 shares of the information services provider’s stock valued at $4,264,000 after buying an additional 8 shares during the period. 40.03% of the stock is currently owned by institutional investors. Several brokerages have issued reports on GOOGL. Wells Fargo & Company boosted their price target on Alphabet from $141.00 to $144.00 and gave the company an “equal weight” rating in a research note on Monday, March 18th. JMP Securities boosted their price objective on Alphabet from $150.00 to $160.00 and gave the company a “market outperform” rating in a report on Wednesday, January 31st. StockNews.com upgraded Alphabet from a “buy” rating to a “strong-buy” rating in a report on Wednesday, December 20th. BMO Capital Markets boosted their price objective on Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Finally, Susquehanna boosted their price objective on Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a report on Wednesday, January 31st. Five analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have given a strong buy rating to the stock. According to data from MarketBeat, Alphabet currently has an average rating of “Moderate Buy” and an average target price of $155.48. Get Our Latest Research Report on Alphabet GOOGL stock opened at $150.93 on Friday. The stock’s fifty day simple moving average is $143.52 and its two-hundred day simple moving average is $138.12. The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a 1-year low of $99.78 and a 1-year high of $153.78. The stock has a market cap of $1.88 trillion, a P/E ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $70.77 billion. During the same quarter in the previous year, the firm earned $1.05 earnings per share.  Analysts expect that  Alphabet Inc. will post 6.77 EPS for the current year. In other news, SVP Prabhakar Raghavan sold 16,088 shares of the company’s stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the transaction, the senior vice president now owns 52,440 shares of the company’s stock, valued at approximately $7,294,404. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this link. In other news, SVP Prabhakar Raghavan sold 16,088 shares of the company’s stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the transaction, the senior vice president now owns 52,440 shares of the company’s stock, valued at approximately $7,294,404. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this link. Also, CAO Amie Thuener O’toole sold 425 shares of the company’s stock in a transaction on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the transaction, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. Over the last quarter, insiders have sold 251,138 shares of company stock valued at $35,427,655. Insiders own  0.88% of the company’s stock. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Gemmer Asset Management LLC Acquires 96 Shares of JPMorgan Chase & Co. (NYSE:JPM) Monarch Capital Management Inc. Sells 270 Shares of Alphabet Inc. (NASDAQ:GOOGL) "
}