{
    "title": "Strategic Wealth Investment Group LLC Has $5.79 Million Stock Position in \nAlphabet Inc. (NASDAQ:GOOGL)",
    "date": "3/26/2024",
    "url": "https://www.defenseworld.net/2024/03/26/strategic-wealth-investment-group-llc-has-5-79-million-stock-position-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 26th, 2024 Strategic Wealth Investment Group LLC grew its position in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 1.6% in the 4th quarter, according to its most recent filing with the Securities & Exchange Commission. The firm owned 41,427 shares of the information services provider’s stock after buying an additional 655 shares during the period. Strategic Wealth Investment Group LLC’s holdings in Alphabet were worth $5,787,000 at the end of the most recent quarter. Several other institutional investors and hedge funds also recently made changes to their positions in GOOGL. Vanguard Group Inc. grew its holdings in shares of  Alphabet by 1,919.4% in the 3rd quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock valued at $45,628,484,000 after buying an additional 453,413,389 shares during the period.  State Street Corp boosted its stake in  Alphabet by 1,900.6% in the 3rd quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock worth $20,770,809,000 after purchasing an additional 206,300,042 shares during the period.  Moneta Group Investment Advisors LLC boosted its stake in  Alphabet by 111,197.8% in the 4th quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock worth $15,036,178,000 after purchasing an additional 170,267,122 shares during the period.  Price T Rowe Associates Inc. MD boosted its stake in  Alphabet by 1,759.2% in the 3rd quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock worth $11,106,502,000 after purchasing an additional 109,870,525 shares during the period.  Finally, Norges Bank acquired a new position in  Alphabet in the 4th quarter worth $8,335,063,000. Institutional investors and hedge funds own  35.08% of the company’s stock. A number of brokerages recently weighed in on GOOGL. Mizuho upped their target price on shares of Alphabet from $155.00 to $170.00 and gave the stock a “buy” rating in a research note on Wednesday, January 17th. Redburn Atlantic boosted their price target on shares of Alphabet from $150.00 to $165.00 and gave the stock a “buy” rating in a research report on Wednesday, January 31st. KeyCorp boosted their price target on shares of Alphabet from $153.00 to $165.00 and gave the stock an “overweight” rating in a research report on Monday, January 29th. Susquehanna boosted their price target on shares of Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a research report on Wednesday, January 31st. Finally, StockNews.com raised shares of Alphabet from a “buy” rating to a “strong-buy” rating in a research report on Wednesday, December 20th. Five research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have assigned  a strong buy rating to the company. According to data from MarketBeat, the stock currently has a consensus rating of “Moderate Buy” and an average target price of $155.48. Get Our Latest Report on GOOGL Shares of NASDAQ:GOOGL opened at $150.07 on Tuesday. The company’s 50 day moving average price is $143.02 and its two-hundred day moving average price is $137.83. Alphabet Inc. has a 12-month low of $99.74 and a 12-month high of $153.78. The firm has a market cap of $1.87 trillion, a PE ratio of 25.87, a PEG ratio of 1.39 and a beta of 1.04. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating the consensus estimate of $1.60 by $0.04. The business had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter in the prior year, the firm earned $1.05 EPS.  Equities research analysts predict that  Alphabet Inc. will post 6.77 earnings per share for the current year. In related news, CAO Amie Thuener O’toole sold 425 shares of the stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the transaction, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The sale was disclosed in a legal filing with the SEC, which is available through the SEC website. In other news, CAO Amie Thuener O’toole sold 425 shares of the firm’s stock in a transaction on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total transaction of $59,334.25. Following the completion of the transaction, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at $3,805,628.99. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this hyperlink. Also, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction on Wednesday, March 6th. The shares were sold at an average price of $132.70, for a total transaction of $2,985,750.00. Following the transaction, the chief executive officer now directly owns 2,332,691 shares of the company’s stock, valued at approximately $309,548,095.70. The disclosure for this sale can be found here. Insiders sold a total of 279,659 shares of company stock valued at $39,460,310 in the last quarter. Insiders own  0.88% of the company’s stock. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.    Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Jessup Wealth Management Inc Purchases 2,536 Shares of Alphabet Inc. (NASDAQ:GOOGL) Amazon.com, Inc. (NASDAQ:AMZN) is Ziegler Capital Management LLC’s 4th Largest Position "
}