{
    "title": "Alphabet/Google: Set To Deliver Incremental Value Through World-Class AI \n(GOOG,GOOGL)",
    "date": "3/22/2024",
    "url": "https://seekingalpha.com/article/4679921-alphabet-google-set-to-deliver-large-incremental-value-through-world-class-ai",
    "text": "Michael M. Santiago Michael M. Santiago The following segment was excerpted from this fund letter. Shares in Alphabet returned 58% last year, essentially double the return of the Index. Business performance was solid. Google Search and YouTube advertising continued to grow last year, with YouTube subscriptions growing nicely and enjoying a bump last fall as the NFL made the platform the exclusive home of NFL Sunday Ticket in the US in a deal signed through 2030. In the first quarter of 2023, Google Cloud achieved profitability for the first time. It stayed in the black over the balance of the year, as revenues grew to an annualized run-rate of over $33 billion. In Other Bets, Waymo's driverless fleet surpassed seven million fully autonomous miles driven while safety issues forced a key competitor out of the market. We expect Alphabet's revenues and earnings per share to be up high-single digits in 2023. Since our initial investment over twelve years ago, Alphabet has only become more of an internet powerhouse. From its origins in Search, the company has expanded into a vast ecosystem of complementary products across YouTube, Gmail, Workspace, Android, Cloud and more. These are preeminent assets that boast some of the largest user-bases globally. Investors have been pondering the potential impact of Large Language Models (à la ChatGPT) on Google Search. The direst fears-that Microsoft's Bing, augmented by OpenAI's chatbot, would quickly turn the tables on Google-have already proven dramatically overblown. Search market share has not changed to any significant degree. Google Search remains a trusted source of information and links to source material, while the world has learned to regard the answers of AI chatbots with skepticism. That said, LLMs and other forms of Generative AI have grown in popularity and usage over the course of 2023 because they are already useful for some tasks and becoming useful for more tasks with each passing day. We can see how they could evolve to become a very significant way for people to interact with their personal devices and with the internet. This presents both risk and opportunity for Alphabet. If the company does not evolve to incorporate the latest AI in Search, YouTube, Cloud, Assistant, and their other assets, then they could lose share to rivals that fully embrace this new paradigm. On the other hand, Alphabet has an opportunity to use the latest AI technology to unify and significantly enhance the usefulness of their entire suite of products. Alphabet is not starting from zero here-in fact, far from it. The company has been building world-class capabilities in artificial intelligence for over a decade. It built two of the leading AI research organizations in the world, Google Brain and DeepMind, and in April of 2023 merged them in order to accelerate the development of a new state-of-the- art model. This model, Gemini, saw a limited release at the end of 2023 and should see full availability in 2024. It is too early to say where exactly Gemini will land vis-a-vis ChatGPT, but we laud the company for understanding the importance of the opportunity and marshaling its forces quickly. We consider Alphabet very well-positioned to deliver large incremental value by bringing world-class AI to a world-class set of products. Even as Alphabet makes significant investments in AI, we appreciate that management has committed to growing profits in line with or faster than revenue. Historically profligate, Alphabet has ample headroom to both grow revenue and find efficiencies in its core businesses, and we find the stock's valuation quite reasonable relative to its financial prospects. Disclosures Please consider the investment objectives, risks and charges and expenses of Sequoia Fund Inc. (the \"Fund\") carefully before investing. The Fund's prospectus and summary prospectus contain this and other information about the Fund and are available at Home - Sequoia Fund or by calling 1-800-686-6884. Please read the prospectus and summary prospectus carefully before investing. Shares of the Fund are distributed by Foreside Financial Services, LLC (Member FINRA). Sequoia Fund, Inc. - December 31, 2023 Top Ten Holdings* Intercontinental Exchange, Inc. 7.0% Constellation Software, Inc. 6.4% Charles Schwab Corp. 6.3% Alphabet, Inc. 6.3% UnitedHealth Group, Inc. 6.1% Universal Music Group 5.9% Rolls Royce Holdings 5.8% Liberty Media Corp. - Formula One 5.4% SAP 5.0% Eurofins Scientific SE 5.0% * The Fund's holdings are subject to change and are not recommendations to buy or sell any security. The percentages are of total net assets. An investment in the Fund is not a deposit of a bank and is not insured or guaranteed by the Federal Deposit Insurance Corporation or any other government agency. Shares of the Fund may be offered only to persons in the United States and by way of a prospectus. Annual Fund Operating Expenses (expenses that you pay each year as a percentage of the value of your investment): Management Fees 1.00% Other Expenses 0.09% Total Annual Fund Operating Expenses** 1.09% Expense Reimbursement by the Adviser** (0.09%) Net Annual Fund Operating Expenses** 1.00% ** It is the intention of Ruane, Cunniff & Goldfarb L.P. (the \"Adviser\") to ensure the Fund does not pay in excess of 1.00% in Net Annual Fund Operating Expenses. This reimbursement is a provision of the Adviser's investment advisory contract with the Fund and the reimbursement will be in effect only so long as that investment advisory contract is in effect. The expense ratio presented is from the Fund's prospectus dated May 1, 2023. For the year ended December 31, 2023, the Fund's annual operating expenses and investment advisory fee, net of such reimbursement, were 1.00% and 0.89%, respectively. The Fund is non-diversified, meaning that it invests its assets in a smaller number of companies than many other funds. As a result, an investment in the Fund has the risk that changes in the value of a single security may have a significant effect, either negative or positive, on the Fund's net asset value per share. The S&P 500 Index is an unmanaged capitalization-weighted index of the common stocks of 500 major US corporations. The Index does not incur expenses. It is not possible to invest directly in the Index. Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}