{
    "title": "GOOGL: GOOGL Earnings Spotlight: Buy or Watch Moves?",
    "date": "1/29/2024",
    "url": "https://stocknews.com/news/googl-meta-yelp-tzoo-googl-earnings-spotlight-buy-or-watch-moves/",
    "text": "Login \n        Join Login \n                                            Join GOOGL – As Alphabet (GOOGL) ventures into establishing new data centers and forging pivotal alliances, could these strategic initiatives translate into significant benefits, prompting investors to weigh the option of loading up on its shares, especially with earnings on the horizon? Let’s find out… Jan 29, 2024 Alphabet Inc. (GOOGL) is slated to announce its fiscal 2023 fourth-quarter earnings on January 30. Analysts expect a 12.1% year-over-year revenue upswing to $85.23 billion and a notable 52.3% increase in EPS to $1.60. GOOGL continues to maintain its supremacy in the global online search market, boasting over 90% market share, as reported by Similarweb. Its Bard AI chatbot and Gemini AI model are emerging as formidable competitors to ChatGPT. Simultaneously, it is demonstrating sustained growth through new data center openings and collaborations. On January 18, GOOGL unveiled injecting $1 billion into a new data center in Waltham Cross, Hertfordshire. The visionary investment is expected to elevate GOOGL’s growth trajectory by fortifying its technological infrastructure, fostering AI innovation, and ensuring dependable digital services for Google Cloud clients globally. Additionally, on January 17, Google Cloud and Samsung Electronics Co., Ltd forged a multi-year alliance, unveiling plans to integrate Google Cloud’s avant-garde generative artificial intelligence (AI) technology into Samsung smartphones worldwide. By expanding the reach of its AI technology through one of the world’s leading smartphone manufacturers, Google Cloud can tap into a vast user base, driving increased adoption and usage of its AI services. The heightened market presence is poised to result in additional revenue streams for GOOGL, contributing to the company’s overall growth. Shares of GOOGL have gained 17.7% over the past six months and 56.1% over the past year to close the last trading session at $152.19. Here are the fundamental aspects of GOOGL that could influence its price performance in the near term: Strong Financials 3 STOCKS TO DOUBLE THIS YEAR During the fiscal 2023 third quarter that ended September 20, 2023, GOOGL’s revenues rose 11% year-over-year to $76.69 billion. Its income from operations grew 24.6% from the year-ago value to $21.34 billion. Furthermore, the company’s net income and EPS increased 41.5% and 46.2% from the prior year’s period to $19.69 billion and $1.55, respectively. Solid Historical Growth Over the past three years, GOOGL’s revenue and EBITDA increased at CAGRs of 20.1% and 26%, respectively. Its net income and EPS grew at respective CAGRs of 23.2% and 26.3% over the same time frame. In addition, the company’s levered free cash flow rose at a CAGR of 36% during the period. Optimistic Analyst Estimates The consensus revenue estimate of $305.82 billion for the fiscal year that ended December 2023 indicates an 8.1% year-over-year increase. Likewise, the consensus EPS estimate of $5.75 for the same period exhibits a 26.1% rise from the prior year. Moreover, the company surpassed its consensus revenue and EPS estimates in three of four trailing quarters. Furthermore, analysts predict GOOGL’s revenue and EPS to grow 11.3% and 16.2% year-over-year to $340.38 billion and $6.68, respectively, for the fiscal year ending December 2024. Robust Profitability The stock’s trailing-12-month gross profit margin of 56.12% is 14.6% higher than the 48.96% industry average. Its trailing-12-month EBITDA margin of 32.33% is 67.9% higher than the 19.26% industry average. Moreover, the stock’s trailing-12-month net income margin of 22.46% is 535.8% higher than the 3.53% industry average. POWR Ratings Exhibit Solid Prospects GOOGL’s sound outlook is apparent in its POWR Ratings. The stock has an overall rating of B, which translates to Buy in our proprietary rating system. The POWR Ratings are calculated by taking into account 118 different factors, with each factor weighted to an optimal degree. Our proprietary rating system also evaluates each stock based on eight distinct categories. GOOGL has a B grade for Sentiment, aligning with optimistic estimates from analysts. It also has a B grade for Quality, which corresponds to its higher-than-industry profitability measures. The stock is ranked #3 out of 53 stocks in the B-rated Internet industry. Click here to access GOOGL’s Growth, Value, Momentum, and Stability ratings. Bottom Line GOOGL’s indisputable command in the global search arena is being complemented by its investments in new data centers and pivotal alliances. This positions the company for extended market influence and diverse revenue streams. Moreover, given the company’s compelling financial performance in the most recent quarter, its solid profitability, and its optimistic financial projections, investing in GOOGL seems prudent. How Does Alphabet Inc. (GOOGL) Stack Up Against Its Peers? While GOOGL has an overall grade of B, equating to a Buy rating, you may check out these other A-rated (Strong Buy) or B-rated (Buy) stocks within the Internet industry: Meta Platforms, Inc. (META), Yelp Inc. (YELP), and Travelzoo (TZOO). To explore more Internet stocks, click here. What To Do Next? 43 year investment veteran, Steve Reitmeister, has just released his 2024 market outlook along with trading plan and top 11 picks for the year ahead. 2024 Stock Market Outlook > Want More Great Investing Ideas? 3 Stocks to DOUBLE This Year Updated: 2024 Stock Market Outlook > 10 Stocks to SELL NOW! GOOGL shares rose $0.41 (+0.27%) in premarket trading Monday. Year-to-date, GOOGL has gained 8.94%, versus a 2.55% rise in the benchmark S&P 500 index during the same period. Aanchal's passion for financial markets drives her work as an investment analyst and journalist. She earned her bachelor's degree in finance and is pursuing the CFA program.\r\n\r\nShe is proficient at assessing the long-term prospects of stocks with her fundamental analysis skills. Her goal is to help investors build portfolios with sustainable returns. More... Copyright © 2024. Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions.Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use, please see disclaimer. "
}