{
    "title": "Alphabet, Amazon, Microsoft under Lina Khan, FTC scrutiny for AI deals",
    "date": "1/25/2024",
    "url": "https://seekingalpha.com/news/4058657-alphabet-amazon-microsoft-under-lina-khan-ftc-scrutiny-for-ai-deals",
    "text": "da-kuk Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL), Amazon (NASDAQ:AMZN) and Microsoft (NASDAQ:MSFT) are under scrutiny by the U.S. Federal Trade Commission after the agency said it has opened an in-depth inquiry into the tech giant's deals with artificial intelligence start ups. The inquiry, announced on Thursday, will look at the tech trio — which have a collective market cap of more than $6.5 trillion — and \"scrutinize\" the respective corporate partnerships and investments with Anthropic and OpenAI. “History shows that new technologies can create new markets and healthy competition. As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity,\" said FTC Chair Lina Khan in a statement. “Our study will shed light on whether investments and partnerships pursued by dominant companies risk distorting innovation and undermining fair competition.\" Amazon and Alphabet, the parent company of Google, have invested directly into Anthropic, while Microsoft has backed OpenAI, the maker of ChatGPT. The inquiry will look at the following details: \"Partnerships between independent companies like Microsoft and OpenAI, as well as among many others, are promoting competition and accelerating innovation,\" Microsoft vice president Rima Alaily told Seeking Alpha. \"We look forward to providing the FTC with the information it needs to complete its study.” “We hope the FTC’s study will shine a bright light on companies that don’t offer the openness of Google Cloud or have a long history of locking-in customers – and who are bringing that same approach to AI services,” a Google spokesperson told Seeking Alpha. Amazon declined to comment. The FTC said its inquiry will allow the agency to have a better understanding of the investments and partnerships made between the generative AI companies and cloud service companies. Google's recently unveiled AI-focused processors, the TPU v5e, will be used by Anthropic as the Mountain View, California-based tech giant seeks to boost its cloud computing unit amid increased competition. Anthropic said the TPUs will be used to power the startup's large language model known as Claude. In September, Amazon (AMZN) said it would invest up to $4B in San Francisco-based Anthropic, and take a minority stake in the company as the two parties collaborate to advance generative AI. As part of that deal, Amazon Web Services became Anthropic’s main cloud provider for mission critical workloads, including safety research and future foundation model development. The AI-focused startup added that it intends to run the \"majority of its workloads\" on AWS. Microsoft has integrated OpenAI technology into a number of its products since last January's multi-billion dollar investment, including its Bing search engine and Edge web browser. The companies have 45 days from the date the order is received to respond. (This story has been updated to include Microsoft and Google's response.) "
}