{
    "title": "Google's parent posts double-digit revenue growth in 4th quarter, but ad \nsales rise at slower pace",
    "date": "1/30/2024",
    "url": "https://finance.yahoo.com/news/googles-parent-posts-double-digit-213107594.html",
    "text": "SAN FRANCISCO (AP) — Google’s corporate parent returned to double-digit revenue growth during last year’s final quarter, signaling the internet powerhouse has regained its footing even as it grapples with regulatory and competitive threats to its digital empire. The results announced Tuesday by Alphabet Inc. marked the third consecutive quarter of escalating revenue growth for the Mountain View, California, company, with most of the sales coming through Google’s dominance of search and online advertising. The rebound followed an unprecedented drop in Google’s ad revenue coming out of the pandemic following nearly 20 years of uninterrupted growth. Even so, Google's ad sales growth lagged the increases in other areas, such as cloud computing and subscriptions to YouTube. That raised concerns that advertisers still are worried about the direction of the economy amid still high interest rates, a U.S. presidential election and wars in Ukraine and the Middle East, causing Alphabet's shares to fall nearly 7% in extended trading, despite fourth-quarter results that exceeded analysts' projections. “Alphabet’s disappointing ad revenue numbers suggest that corporations worldwide are still uncertain about the pace of interest rate cuts from global central banks, thus keeping some powder dry while waiting for more clues before opening up their wallets,\" said Investing.com analyst Thomas Monteiro. What's more, Google’s search engine and ad network are under attack in the courts, where regulators have been leveling allegations of abusive tactics that they contend are stifling innovation and competition. One case, brought by the U.S. Justice Department, went to trial last autumn and will move to closing arguments in May. Google also recently lost in an antitrust trial that may undercut the commissions that it brings in from its Play Store for apps running on its Android software for smartphones. Meanwhile, long-time rival Microsoft has been making inroads in artificial intelligence that have helped re-establish the nearly 50-year-old software maker as the world’s most valuable company, while Google has been scrambling to roll out its own versions of a technology that is expected to transform the world. Google reaffirmed its plans to soon unleash even more advanced AI-powered services through its Gemini project. For now, though, Google is thriving. Alphabet’s revenue for the October-December period climbed 13% from the previous year to $86.31 billion. It marked Alphabet’s first quarter of double-digit revenue growth since the April-June 2022 period, at the tail end of the pandemic. Google posted a year-over-year 11% increase in fourth-quarter ad sales, with the marketing network that operates outside its search engine showing weakness. Alphabet earned $20.69 billion, or $1.64 per share, in its most recent quarter, a 52% increase from the same time in the previous year. The robust gain came despite a $1.2 billion charge taken to account for more than 1,000 layoffs that the company has made since the start of this year, and its plans to pare its office space as more employees spend part or all of their time working remotely. “We remain committed to our work to durably re-engineer our cost base as we invest to support our growth opportunities,” said Ruth Porat, Alphabet's chief investment officer. During a conference call, Porat said Alphabet anticipates doling out $700 million to cover the severance payments to all the employees who lose their jobs from January through March. Alphabet ended December with about 182,500 employees, only slightly more than at the end of September. The workforce is down substantially from the end of 2022 when Alphabet employed more than 190,000 people. With investors apparently still unsatisfied with the fourth-quarter performance, Monteiro predicted Alphabet “will have to keep improving margins, even by stepping on the gas for further layoffs.” Related Quotes "
}