{
    "title": null,
    "date": "1/18/2024",
    "url": "https://siliconangle.com/2024/01/18/google-ceo-sundar-pichai-warns-job-cuts-will-necessary-achieve-ambitious-goals-year/",
    "text": "UPDATED 19:22 EST / JANUARY 18 2024 by \nMike Wheatley Google LLC has already made a number of layoffs in 2024 and there are likely to be more on the way this year, as the company refocuses its investments on areas such as artificial intelligence. In a memo on the company’s 2024 priorities that was sent to employees Wednesday night and later leaked to The Verge, Google Chief Executive Sundar Pichai (pictured) stressed that the company has “ambitious goals” and will be investing in its “big priorities” this year. The company will share details on its AI goals later this week, and also publish its objectives and key results for 2024. “The reality is that to create the capacity for this investment, we have to make tough choices,” Pichai told employees. He explained that some teams will be required to eliminate roles, in order to “simplify execution and drive velocity.” The CEO’s comments suggest that Google will likely continue its cost-cutting efforts that began in January 2023, when the company revealed it would be eliminating 12,000 jobs, or about 6% of its overall workforce. Since the turn of the year, the company has gone even further, eliminating several hundred roles in its Fitbit, Nest and Pixel hardware units, and hundreds more in its advertising business. Despite these measures, some of Google’s investors have called for even more job cuts. Sir Christopher Hohn, who is the head of The Children’s Investment Fund, said last year that he hoped the company would go further and ax up to 30,000 workers, reducing its headcount to 150,000. According to Pichai, a number of teams will be required to make difficult “resource allocation decisions.” The layoffs aren’t expected to be as severe as last year’s reductions, and will not touch every team, he added. Last year’s layoffs had the desired effect, with shares of Google’s parent company Alphabet Inc. rising 58% from the year prior, driven by excitement around generative AI. In the third quarter, Google managed to return to double-digit revenue growth, thanks in part to a rebound in the digital advertising market. All told, Alphabet posted a net profit of $53.1 billion in the nine months ending Sept. 30, up from $46.34 billion in the same period of 2022. Revenue for the nine months hit $221.1 billion, up from $206.78 billion. However, the company’s total costs and expenditures also increased, rising to $160 billion from $150 billion the year before. Google has introduced various other cost-cutting measures besides the layoffs. For instance, the company froze employees’ wages, cut back on spending on employees’ hardware, and consolidated some of its real estate holdings in the U.S., asking some staff to share desks. Although Google is publicly citing the need to invest in AI as one of the reasons for its job cuts, it may also be that the company is replacing some of those workers with AI, where possible. According to a report in The Information last month, Google has created various AI chatbots and systems within its advertising business that can help to provide customers with sales guidance and assist with asset creation, among other things. These tasks were previously always performed by humans, but AI has shown it’s more than capable of replacing them, the report said. THANK YOU Blockchain-focused cryptography startup Zama raises $73M to protect data in use Bipartisan bill could see TikTok banned in US if it doesn’t split with China OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions Taalas raises $50M to develop chips optimized for specific AI models Claroty secures $100M to enhance cyber-physical system security Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research Blockchain-focused cryptography startup Zama raises $73M to protect data in use SECURITY - BY MIKE WHEATLEY . 3 HOURS AGO Bipartisan bill could see TikTok banned in US if it doesn’t split with China POLICY - BY JAMES FARRELL . 6 HOURS AGO OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions AI - BY MIKE WHEATLEY . 8 HOURS AGO Taalas raises $50M to develop chips optimized for specific AI models AI - BY MARIA DEUTSCHER . 9 HOURS AGO Claroty secures $100M to enhance cyber-physical system security SECURITY - BY DUNCAN RILEY . 9 HOURS AGO Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research AI - BY MARIA DEUTSCHER . 10 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}