{
    "title": "Nvidia market cap hits $2 trillion",
    "date": "2/23/2024",
    "url": "https://fortune.com/2024/02/23/forget-beating-amazon-and-google-now-nvidia-is-part-of-the-2-trillion-club-magnificent-7/",
    "text": "There’s a new member of the $2 trillion club on Wall Street. The market cap of Nvidia has crossed the line after an explosive day on Wall Street on Thursday and further stock gains on Friday morning. As of 10:30 a.m. ET, the company boasted a market cap of $2.01 trillion. That puts it ahead of Amazon, Alphabet, and Meta, and well ahead of Tesla. Two members of the Magnificent Seven still surpass it: Microsoft, which boasts a market cap of $3.07 trillion, and Apple, which sits at $2.84 trillion. The achievement comes just over a week after Nvidia became the third most valuable U.S. company, leapfrogging the venerable Google. In the past two months, Nvidia has seen its market capitalization increase by basically the entire worth of Tesla. The company’s shares are up 68% year to date as demand for its chips by makers of artificial intelligence continues to surge. Nvidia is the top-performing component of the Nasdaq 100 Index this year, just as it was over 2023, when shares more than tripled. Fortunes shift fast at that level, though. Last year, Apple was the king of the hill, becoming the first company to hit $3 trillion in market cap and having a half-billion dollar lead over Microsoft. Microsoft just cleared $1 trillion approximately five years ago, but the AI rush has benefited that company as well. The first company to ever be worth $1 trillion was PetroChina, which reached the valuation briefly on its first day of trading, following its 2007 IPO. But that peak coincided with a Chinese stock-market bubble, and PetroChina’s shares have lost nearly $800 billion in value since then. For Nvidia, though, there’s certainly room for additional growth. Revenue is expected to climb by 120% in fiscal 2024, with another 60% jump expected next year. Earlier this month, UBS lifted its target to $850 from $580, and also increased its estimates for earnings per share. And Mizuho Securities raised its target to $825 from $625. In early trading Friday, the stock stood at just under $806. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}