{
    "title": "Nvidia replaces Alphabet as Wall St's third most valuable company",
    "date": "2/14/2024",
    "url": "https://www.channelnewsasia.com/business/nvidia-replaces-alphabet-wall-sts-third-most-valuable-company-4123451",
    "text": "Business Business This audio is AI-generated. :Nvidia eclipsed Google-parent Alphabet as the third most valuable U.S. company on Wednesday, just after overtaking Amazon and as investors looked to the dominant AI chipmaker's upcoming quarterly report. The Santa Clara, California company's stock rose 2.46 per cent, putting its value at $1.825 trillion, while Alphabet's stock climbed 0.55 per cent, leaving it with a value of $1.821 trillion. Nvidia has been a top beneficiary of technology companies' race to build AI into their products and services, and the latest gain in its stock came a day after it ended a session with a market capitalization above Amazon's for the first time in two decades. Amazon's market capitalization was $1.776 trillion after its stock rose 1.39 per cent on Wednesday. Nvidia controls about 80 per cent of the high-end AI chip market, a position that has boosted its stock price 47 per cent this year after it more than tripled in 2023. Customers face shortages of Nvidia's top-of-the-line components while AI developers face months-long waiting lists to use its processors through cloud-computing providers. Technology-related companies, including Microsoft and Meta Platforms, have also rallied to record highs on AI optimism. Nvidia's quarterly report next Wednesday will be among Wall Street's most closely watched of the week. Analysts expect another blowout quarter and outlook, and anything less could deflate Wall Street's AI rally, some investor warned. \"The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 per cent in one after-hours session,\" said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa. Susquehanna analyst Christopher Rolland on Wednesday increased his price target for Nvidia's stock to $850 from $625, saying he expects strong quarterly results and guidance. Nvidia shares were last at $739. An early leader in the AI race, Microsoft in January overtook Apple to become the world's most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world's third most valuable publicly-listed company, according to LSEG. Analysts, on average, see Nvidia's January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400 per cent to $11.38 billion. Nvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.  This service is not intended for persons residing in the E.U. By clicking subscribe, I agree to receive news updates and promotional material from Mediacorp and Mediacorp's partners. Copyright© Mediacorp 2024. Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with CNA to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us "
}