{
    "title": "Why Alphabet Should Pay Investors a Dividend",
    "date": "2/29/2024",
    "url": "https://www.fool.com/investing/2024/02/29/why-alphabet-should-pay-investors-a-dividend/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More In a surprise move, Facebook parent Meta Platforms (META -1.68%) announced earlier this month that it was initiating a dividend. The move gives the tech company yet another way to return excess cash to shareholders. And as far as excess cash goes, it has tons of it. The social network specialist ended 2023 with $65 billion of cash, cash equivalents, and marketable securities on its balance sheet -- and that's after spending more than $20 billion repurchasing its stock during the year. It's able to do this because the company is a cash machine, generating $43 billion of free cash flow during the full year. For Meta Platforms, initiating a dividend made perfect sense. And it makes sense for one more major tech company, too: Alphabet (GOOG 0.21%) (GOOGL 0.04%). Unlike Meta, however, the Google parent hasn't yet opted to initiate a dividend. But that doesn't mean it won't in the future. Here are a few quick and simple reasons Alphabet should initiate a dividend. The main reason the world's king of online search and advertising should be paying a dividend is simple: It's an absolute cash cow. If you thought Meta's war chest of cash was massive, wait until you see Alphabet's. The company wrapped up 2023 with an incredible $111 billion of cash, cash equivalents, and marketable securities on its balance sheet. Free cash flow during the year was $69 billion. And let's remember that free cash flow is essentially excess cash flow; it's the cash flow left over after both regular operations and capital expenditures are accounted for. In short, there's plenty of cash to go around for a dividend. Fortunately, Alphabet has been a great steward of its excess cash. It's been repurchasing its shares in droves. The company repurchased $62 billion worth of its stock in 2023. This means it spent about 90% of its free cash flow on repurchases. But share repurchases only make sense when the stock is undervalued. Fortunately, it does appear undervalued today. But if the stock rises too much, then stock buybacks risk destroying shareholder value. For this reason, it often makes sense to approach capital return programs with a mixture of stock buybacks and dividends. After all, it's difficult even for management to know exactly when shares are cheap enough to merit stock repurchases. By returning capital to shareholders in more than one way, management mitigates some of the risks of potentially overpaying for its own stock. With this said, share repurchases continue to make sense. Given the stock's current conservative valuation, the bulk of Alphabet's excess cash flows should be allocated to buybacks. Only a small percentage of its free cash flow should be allocated toward a dividend if it were to pay one. Another reason Alphabet looks more than ready to pay a dividend is its earnings momentum. The company's net income rose 23% in 2023 to nearly $74 billion. Even more, analysts anticipate Alphabet's earnings per share to increase at an average annualized rate of nearly 19% for the next five years. With so much cash, such strong cash flow, and strong earnings momentum, there's no reason Alphabet can't pay a small dividend. While nothing is guaranteed, it wouldn't be surprising to see the search giant initiate a dividend at some point over the next 12 months. Its cash is just piling up too fast. Alphabet, it's time to follow Meta's lead and join the dividend club. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Daniel Sparks has no position in any of the stocks mentioned. His clients may own shares of the companies mentioned. The Motley Fool has positions in and recommends Alphabet and Meta Platforms. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}