{
    "title": "Who Owns YouTube?",
    "date": "2/4/2024",
    "url": "https://fourweekmba.com/who-owns-youtube/",
    "text": "The Leading Source of Insights On Business Model Strategy & Tech Business Models The Leading Source of Insights On Business Model Strategy & Tech Business Models Acquired by Google, in 2006, for $1.65 billion, YouTube is now worth many times over. In 2023, YouTube generated over $31 billion in revenue from advertising alone. YouTube is part of Google (now named Alphabet), and as such, it is owned by Google’s Alphabet shareholders and is one of the fastest-growing segments for the company. Table of Contents In a video dated October 10, 2006, Steve Chen and Chad Hurley officialized the news of the acquisition of YouTube, from Google, for $1.65 billion. The third co-founder, Jawed Karim, was already out. And yet the three co-founders all became multi-millionaires, making probably $300 million each for Chen and Hurley and around $66 million for Karim. At the time, Google was trying to launch its video service called Google Video. Yet, Google, while already a tech giant back then, could not figure out how to make Google Video as successful as YouTube. YouTube was indeed a rocket ship, and what concerned them most, the Google’s founders, Brin and Page, was that YouTube was also used as a search engine for video. With video becoming a dominant format for the Internet by 2006, Google was quite concerned about being unable to keep up with YouTube’s growing quickly. YouTube, on his side, was executed exceptionally well, backed by some of the prominent Silicon Valley VCs. Indeed, Sequoia backed YouTube through Roelof Botha. Botha was CFO at PayPal before he joined Sequoia. He was a PayPal Mafia member. The YouTube co-founders, looking for money to finance the operations that, since that point, had been running on Chen’s credit cards, turned to Botha, which they knew from PayPal. Indeed, YouTube’s co-founders were former PayPal team members. After PayPal had been acquired by eBay, Chen, Hurley, and Karim left to start their own company, which would later become YouTube. By November 2005, Google, through Larry Page, had already started to seriously look into acquiring YouTube: Thus, by February 7, 2006, the acquisition of YouTube by Google gets on the CEO’s desk as a priority. In an initial consideration, Google is considering an offer for YouTube of $50 million. We were in February 2006, YouTube was burning cash, it wasn’t generating revenues, and yet Google would eventually offer much more to secure it. However, by February 2006, Google kept looking into ways to partner up, without buying YouTube. In fact, when Google first proposed the deal to YouTube, things didn’t move forward, as YouTube’s founding team was looking for “the myspace deal.” In fact, at the time, back in July 2005, News Corp., the company – at the time – owned by the business shark Rupert Murdoch, had acquired MySpace for $580 million in cash, setting an incredible precedent. For Google’s executive team, that was way too expensive. In fact, at the time, Google thought it could still figure out videos with its Google Video. Yet, as months went by, Google Video didn’t gain as much traction as the executive team thought. And as Yahoo showed up, things got way more interesting. Google’s executive team was an incredible deal-maker, driven by its co-founder’s Page and Brin. Meaning they knew when the timing was right to close a deal before a competitor like Yahoo stole it. Eventually, the deal was closed at $1.65 billion, and YouTube became part of Google. Thus, if we take YouTube alone, the company might be worth over $300 billion in revenue, which is astonishing and would represent an over 150x potential return for Google on this acquisition. However, for one thing, it’s very hard to spin off the value of YouTube without Google’s advertising machine. In fact, a key thing to understand, integrating YouTube wasn’t an easy fit, and while Google has managed to pull this off, this could have gone wrong in many possible ways. Had YouTube continued without Google, the question is whether the company would have survived, given the many copyright issues it faced back then. Indeed, YouTube had severe copyright issues, which Google had to solve early on. In addition, Google has also successfully transitioned YouTube from a video search engine to a discovery video platform (more similar to TikTok than Google). Today YouTube is definitely one of the most successful media platforms on the Internet and the only one able to successfully beat TikTok at its own game! Today YouTube has become a successful advertising machine. YouTube is one of the most popular sites on earth, with over 33 billion visits in March 2023. YouTtub is very popular worldwide, even though over 20% of its traffic comes fro the US. The most interesting aspect of YouTube is its popularity among young cohorts. People between 18-34 as the ones that most use the platform. Who owns Google? YouTube Competitors Digital Advertising Industry Google Business Model Who Owns OpenAI Who Owns Airbnb Who Owns Google Who Owns Facebook Who Owns Apple Who Owns Amazon Who Owns Microsoft Who Owns Tesla Who Owns PayPal Who Owns Netflix Who Owns TikTok Who Owns YouTube Who Owns Twitter Who Owns Spotify Who Owns Nvidia Who Owns Uber Who Owns Shopify Who Owns Roblox Who Owns Twitch Who Owns Zoom Who Owns Activision Who Owns Pixar Who Owns Salesforce Who Owns Slack Who Owns Snapchat Who Owns Coinbase Read More:   Copyright © 2024  FourWeekMBA Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}