{
    "title": "Google 2024 Outlook: Antitrust Risks Still Outweigh Strong Q4 (NASDAQ:GOOG)",
    "date": "2/5/2024",
    "url": "https://seekingalpha.com/article/4667536-google-2024-outlook-antitrust-risks-still-outweigh-strong-q4",
    "text": "Justin Sullivan/Getty Images News  Justin Sullivan/Getty Images News Despite Alphabet Inc. aka Google (NASDAQ:GOOGL) (NASDAQ:GOOG) posting solid Q4 earnings (minus the slight miss on ad revenue), I still believe the search giant is a strong sell. The company's operating performance, while I’ll admit was fairly strong in this recent earnings report, unfortunately does not mitigate my underlying concerns. Google vs. SPY Performance (Seeking Alpha/TradingView) Google vs. SPY Performance (Seeking Alpha/TradingView) Notably, since Q3 earnings, Google continues to underperform compared to the S&P 500 (SP500). The looming antitrust case kicked off against by the U.S. justice department is still existential and introduces a layer of uncertainty. The company's legal setback against Epic Games (which I think is not getting enough attention) could be indicative of a broader pattern of legal vulnerability. In my opinion, the stock is a sell. The legal risk here could be large and could have large implications to the business model. These implications (I believe) outweigh any operational strength in Q4. Alphabet, the parent company of Google, did end 2023 with strong financial performance. In Q4, the company reported revenues reaching an impressive $86.31 billion, marking a 13% year-over-year increase. This growth is significantly underpinned by strength in Google Cloud and still strong revenue from Ads, with strength in services across pivotal areas like Search and YouTube (more on this deep dive below and why these earnings show). Strong earnings have (so far) dispelled concerns (including from me) on Google Search getting hurt by increased competition from the likes of ChatGPT and Microsoft Bing (I’ve written about both of these concerns before, both with the bull case on Bing and the bear case on Google). However, I still believe this strong financial footing and technological advancement are shadowed by persistent antitrust concerns. The major case (the US Department of Justice case started in 2023) will likely wrap up arguments in May of this year (more on the deep dive of this below). For the bulls, Q4 earnings showcased a strong set of revenue metrics. Alphabet surpassed Wall Street's revenue and EPS estimates, reporting a robust $86.31 billion in revenue and an EPS of $1.64. The real blemish in the quarter was Alphabet's ad revenue total, which totaled $65.5 billion but analysts expected $66 billion. What’s key about this ad revenue is that Google has a powerful algorithm that helps match ads to the best users of YouTube, Google Search and more. This platform hasn’t been disrupted yet due to any pending antitrust lawsuits, but it is the heart of the lawsuit. If Ad sales missed estimates even before the ad placement algorithm could be disrupted due to a lawsuit, how will this affect the ad business model in the future? As a final earnings note (and notably), the drive to keep pace in the AI race is straining Alphabet's resources. The company experienced a significant cash decline, with its cash position dropping nearly $10 billion from the previous quarter to its lowest level since FY 2018. This was compounded by a substantial surge in Q4 CapEx to $11 billion, mainly invested in technical infrastructure to support its ambitious AI initiatives​​. I believe the ongoing lawsuit, United States v. Google LLC, is a crucial event, shaping not just the company's trajectory, but potentially setting a new precedent in antitrust law. Last year the Department of Justice accused Google of monopolizing the digital advertising technology market, an accusation that Google has robustly denied. The lawsuit, initiated in January 2023, has seen increasing support, with eighteen states joining the suit, signaling bipartisan concern over Google's market practices​​​​. At the heart of the trial is whether Google's dominance and business practices, particularly its default search agreements with major tech players like Apple, constitute illegal monopolization. These agreements are alleged to stifle competition by making Google the default search engine across a wide array of devices and platforms, a move that critics argue has entrenched its market dominance, but helps feed their key ad service engine (as I mentioned before). Google's dominance is represented by their search market share, which has consistently hovered between 83% and 91% since 2015. The agreements have been instrumental for Google, aiding in the continuous improvement of its search products through data accumulation. The court's decision, expected after the closing arguments (anticipated in May 2024), will be a landmark in shaping the future of antitrust law, and the future of Alphabet. Even as Alphabet’s CEO, Sundar Pichai mentioned on the Q4 earnings call, quality of ad serves is imperative to the success of Google Search’s advertising business. This quality is, in part, built on these search agreements that Google has with browser providers like Apple’s Safari. tremendous confidence in the quality driven both our work, be it search quality, ads quality, our improvements on search, our improvements on ads RPM, all -- 2 foundational pillars are extraordinary focus on ads quality so that we deliver the actual ROI to advertisers and improve the experience for users and all underpinned by rigor and technical excellence -Pichai Q4 2023 Earnings Call. In essence, while investors (and management) have now known for over a year about the antitrust risk, it appears (through Pichai’s comments) that the core ad revenue model is still dependent on this technology that is in dispute. His company’s “technical excellence” that he is praising here is at risk. I’m concerned he is pushing this as a strength in their business. Precedent (which matters in court cases) is not helpful here for the search giant. Google recently lost a court case over anticompetitive concerns in the Google play store and whether game developers (in this case Epic Games) had the right to not have to pay revenue sharing agreements to Google. In other words, a platform Google owns (Google Play Store) was ruled to have monopolistic practices and the courts ordered that Google had to allow others to use the venue and not pay a revenue sharing split to Google. Google’s AdWords (now called Google Ads) could have a similar fate. I think It would be difficult at this point to attempt to quantify exactly what the revenue impact could be with a negative anti-trust ruling, but I believe any investor should have some degree of margin of safety before entering a stock. In this case, Alphabet’s forward P/E ratio is still at 20.95 times forward earnings over the next 12 months. While this P/E ratio has come down from my last strong sell thesis back in December (forward P/E of 23.09 back then), this forward P/E ratio is still higher than the sector average 36.13%. In fact, compared to December, the search giant's P/E ratio is now farther ahead of the sector average than it was in December (33% higher in December vs. 36.13% higher today). Why should a company that missed their last search ad revenue sales estimate, combined with strong legal risk that has gotten worse since December with the loss to Epic games, have an even higher than sector premium multiple? In my opinion, the stock should trade at a sector average P/E ratio until investors can be assured that the company’s business model will be strong with or without the synergies of Google’s large ecosystem. If the stock re-rated to a sector average forward P/E of 15.39 (compared to 20.95 currently) this would represent 26.54% downside in the company’s stock. Amidst the challenges from antitrust lawsuits, Alphabet Inc. (Google's parent company) does continue to exhibit strong profitability that could potentially mitigate the impact of regulatory headwinds. The company’s ongoing investments in AI could help provide revenue diversification in the long run, but this has yet to prove itself out. As I wrote about in December, their leading large language model, or LLM (Gemini), is still lagging behind GPT4 through Microsoft/OpenAI. There is no guarantee that they will be able to catch up (and with it diversify their business model away from ad sales which is facing the antitrust risk). All the while, AI investment spend here is continuing to jump as per the Q4 capex note. Google could follow an open-source route like Meta Platforms (META) to accelerate development, or focus on model fine tuning and training - like IBM (IBM) does - and therefore worry less about their own LLM. However, management hasn’t taken this approach, meaning their business model continues to face concentrated revenue risk from their lawsuit. While Alphabet's strong performance and strategic investments in AI showcase the search giant's desire to change, the overshadowing antitrust trial, alongside its recent mixed financial signals (missed ad sales) present significant challenges. The outcome of the antitrust case and its implications on Alphabet's business model are pivotal and warrant extreme caution (in my opinion) when making an investment. Investors have tons of other opportunities to play the explosion of AI demand from enterprises and consumers. In this space, I am inclined to believe strong innovation is something you have to pay up for (hence the investing framework GARP). At this point, I think Google stock is a sell. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Noah Cox (account author) is the Managing partner of Noahs' Arc Capital Management. His views in this article are not necessarily reflective of the firms. Nothing contained in this note is intended as investment advice. It is solely for informational purposes. Invest at your own risk. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}