{
    "title": "Meta stuns Wall Street with its first dividend. Amazon and Alphabet could \nbe next.",
    "date": "2/1/2024",
    "url": "https://www.morningstar.com/news/marketwatch/20240201968/meta-stuns-wall-street-with-its-first-dividend-amazon-and-alphabet-could-be-next",
    "text": "By Therese Poletti Meta's dividend move could get the stock noticed even further - for better or worse Meta Platforms Inc. surprised Wall Street on Thursday with its first-ever dividend, a move that's likely Silicon Valley's most monumental dividend decision since Apple Inc. reinstated its payout over a decade ago - and one that could light a fire under other tech giants. With Meta's (META) plans to pay a 50 cents-a-share quarterly dividend beginning in March, the company will join Apple (AAPL) and Microsoft Corp. (MSFT) among Big Tech's dividend payers. Chief Executive Mark Zuckerberg's willingness to make this move could lead investors to clamor for similar moves by Alphabet Inc. (GOOG) (GOOGL) and Amazon.com Inc. (AMZN), two tech holdouts that are older than Meta. Meta's dividend plans could get the stock noticed even more on Wall Street, including by the committee choosing components for the Dow Jones Industrial Average DJIA. While it's no longer required for Dow candidates to issue dividends, paying one could certainly help Meta's resume. Currently within the Dow, only Salesforce.com Inc. (CRM) and Boeing Co. (BA) do not pay dividends; Boeing's was suspended in 2020, along with its share-buyback program. Ultimately, decisions about new Dow entrants are at the will of the index committee, but the communications services sector, of which Meta and Amazon are part, is underweighted in the Dow relative to the S&P 500 SPX. Read more: Why you can count on the Dow making changes in February Investors are celebrating the news already, with Meta shares surging nearly 15% in after-hours trading after Thursday afternoon's earnings report, which brought the dividend news as well as more evidence that Meta's \"Year of Efficiency\" has paid off. During Meta's call with Wall Street analysts, the company was only asked about the dividend once. Chief Financial Officer Susan Li said that the dividend gives the company a more balanced capital-return program and some added flexibility. Share repurchases will remain the biggest component of Meta's capital-return program. The dividend \"doesn't change the way we determine the total amount of capital we return,\" Li said. \"And we expect that share repurchases will continue to be the primary way that we return capital to shareholders.\" During the call, Meta executives talked about the company's opportunities in artificial intelligence and its expectations for hefty spending on data-center infrastructure buildouts in 2024. While Meta's mature approach to shareholder returns could get it more respect by some investors, it could make others nervous about the flip side of what being a dividend payer means to a tech powerhouse - that your glory, go-go days of being a plucky, fast-growing company are over. Meta has truly become a grown-up company - and investors will have to accept both sides of that. -Therese Poletti This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 02-01-24 1841ET Transparency is how we protect the integrity of our work and keep\n\t\t\t\t\t\tempowering investors to achieve their goals and dreams. And we have\n\t\t\t\t\t\tunwavering standards for how we keep that integrity intact, from our\n\t\t\t\t\t\tresearch and data to our policies on content and your personal data. We’d like to share more about how we work and what drives our day-to-day business. We sell different types of products and services to both investment professionals\n\t\t\t\t\t\t\t\t\t\t\tand individual investors. These products and services are usually sold through\n\t\t\t\t\t\t\t\t\t\t\tlicense agreements or subscriptions. Our investment management business generates\n\t\t\t\t\t\t\t\t\t\t\tasset-based fees, which are calculated as a percentage of assets under management.\n\t\t\t\t\t\t\t\t\t\t\tWe also sell both admissions and sponsorship packages for our investment conferences\n\t\t\t\t\t\t\t\t\t\t\tand advertising on our websites and newsletters.  How we use your information depends on the product and service that you use and your relationship with us. We may use it to: To learn more about how we handle and protect your data, visit our privacy center. Maintaining independence and editorial freedom is essential to our mission of\n\t\t\t\t\t\t\t\t\t\t\tempowering investor success. We provide a platform for our authors to report on\n\t\t\t\t\t\t\t\t\t\t\tinvestments fairly, accurately, and from the investor’s point of view. We also\n\t\t\t\t\t\t\t\t\t\t\trespect individual opinions––they represent the unvarnished thinking of our people\n\t\t\t\t\t\t\t\t\t\t\tand exacting analysis of our research processes. Our authors can publish views that\n\t\t\t\t\t\t\t\t\t\t\twe may or may not agree with, but they show their work, distinguish facts from\n\t\t\t\t\t\t\t\t\t\t\topinions, and make sure their analysis is clear and in no way misleading or deceptive. To further protect the integrity of our editorial content, we keep a strict separation\n\t\t\t\t\t\t\t\t\t\t\tbetween our sales teams and authors to remove any pressure or influence on our analyses\n\t\t\t\t\t\t\t\t\t\t\tand research. Read our editorial policy to learn more about our process. © Copyright 2024 Morningstar, Inc. All rights reserved.\n\t\t\t\t\tDow Jones Industrial Average, S&P 500, Nasdaq, and Morningstar Index (Market Barometer) quotes are real-time. "
}