{
    "title": "S&P 500 Gains and Losses Today: Alphabet Shares Slide Amid AI Controversy",
    "date": "2/26/2024",
    "url": "https://www.investopedia.com/s-and-p-500-gains-and-losses-today-alphabet-shares-slide-amid-ai-controversy-8600648",
    "text": " Michael Bromberg is a finance editor with a decade of experience. He is an expert at elucidating complex financial topics in clear, concise language. Michael received a Bachelor of Arts in literature from the University of Wisconsin-Madison and a master's in linguistics from the Universidad de Antioquia in Medellin, Colombia. Investopedia Major U.S. equities indexes moved lower on Monday, cooling down from the tech-fueled rally that helped lift the S&P 500 and the Dow to record closes on Friday. The subdued market performance kicked off a trading week that will feature the release of the Federal Reserve's preferred inflation gauge and earnings reports from numerous companies. The S&P 500 slipped 0.4%, marking a slight retreat from the all-time closing high posted by the benchmark index on Friday. The Dow fell 0.2%, while the Nasdaq lost 0.1%. Shares of Insulet (PODD), which produces wearable insulin management devices, posted the heaviest declines on the S&P 500, tumbling 8.4%. Monday's losses added to Friday's 6% drop recorded after Insulet guided for lower-than-expected revenue growth in 2024. Piper Sandler analysts also trimmed their price target on the stock to $230 from $250. Shares of Google parent Alphabet (GOOGL) slid 4.4% amid controversy related to the tech giant's \"Gemini\" artificial intelligence (AI) system. The company halted an image-generating feature after it received criticism about inaccurate racial portrayals of historical figures, causing analysts to question the reliability of Google's AI capabilities. Newmont Corp. (NEM) shares fell 4.0% after Argus downgraded the stock to Hold from Buy. Although demand for gold is likely to remain robust, analysts believe prices for the precious metal may not climb much from their current levels. The expected ceiling on gold prices could restrain growth for Newmont, which is the world's largest gold miner. Palo Alto Networks (PANW) was Monday's top gainer in the S&P 500. Shares soared 7.3%, recovering a portion of the steep losses posted last week when the cybersecurity firm released lackluster revenue guidance. The positive reversal came after Palo Alto announced plans to partner with Nvidia (NVDA) and other companies to provide private 5G security solutions. Shares of Domino's Pizza (DPZ) jumped 5.9% after the delivery chain reported better-than-expected profits for the fourth quarter, boosted by strong same-store sales growth at its U.S. business. Domino's also announced that it was boosting its quarterly dividend and adding $1 billion to its existing stock buyback authorization. Financial information provider Fidelity National Information Services (FIS) also enhanced its share repurchase program, authorizing an additional $500 million. Despite the company missing fourth-quarter revenue and profit estimates, the increased buyback plan helped its shares advance 4.7%. "
}