{
    "title": "Alphabet on the hunt for GFiber investors – report",
    "date": "2/7/2024",
    "url": "https://www.lightreading.com/finance/alphabet-on-the-hunt-for-gfiber-investors-report",
    "text": "GFiber (formerly Google Fiber) has hired a bank to start selling equity in the company to help fuel expansion. A future goal is for GFiber to run independently of Alphabet, Reuters reports. February 7, 2024 Alphabet is seeking outside investors for GFiber (formerly Google Fiber) as the unit looks to expand services to additional US cities, Reuters reported this week. GFiber has hired a bank to start selling equity in the company, and a future goal is for GFiber to run independently from Alphabet, Reuters added. GFiber confirmed that it is seeking outside investors, but is not providing further comment. GFiber is currently tucked into \"other bets\" at Alphabet that also include units such as Verily and Waymo. Other bets pull down revenues of $657 million in Q4 2023, up from $226 million in the year-ago period. Other bets also posted a Q4 operating loss of $863 million, narrowed from a year-ago loss of $1.23 billion. Alphabet has not said how much it is looking to raise or the valuation it's seeking. It's also not clear if raising financing from asset-backed securities (ABS) – an option that Frontier Communications has undertaken and Altice USA and Lumen have considered – will fit into GFiber's funding game plan. \"This next step of raising external capital will enable them [GFiber] to scale their technical leadership, expand their reach, and provide better internet access to more communities,\" Alphabet President and CEO Ruth Porat, told Reuters. GFiber told Reuters that the company has tripled its subscriber base in the past six years (no subscriber number provided) and signed deals in 2023 that pave the way for expansions into more than 25 additional cities. Already in expansion mode After a temporary pause on new buildouts and a scaling back of some original commitments in 2016, GFiber reentered expansion mode in August 2020, setting its sights on cities in several states, including Arizona, Colorado, Nebraska, Nevada and Idaho. GFiber followed that with agreements to build in several markets, including Lakewood, Westminster and Wheat Ridge, Colorado; Logan, Utah; Council Bluffs, Iowa; and Pocatello, Idaho. \"We are now ready to scale this much faster,\" GFiber CEO Dinni Jain said in a statement to Reuters. GFiber announced this week that it will launch services in Nevada after the Clark County Commission, which covers much of the Las Vegas metro area, approved a franchise agreement with the fiber operator. That move will pit GFiber against Cox Communications, the market's incumbent cable operator. \"We're already working on engineering planning in Clark County, and construction will get underway towards the end of this year with the goal of serving our first customers by mid-2025,\" GFiber West Regional General Manager Ashley Church said in a blog post. Google Fiber currently markets 1-Gig, 2-Gig, 5-Gig, and 8-Gig speeds and offers speeds up to 20 Gbit/s in certain markets. Jeff Baumgartner Senior Editor, Light Reading Jeff Baumgartner is a Senior Editor for Light Reading and is responsible for the day-to-day news coverage and analysis of the cable and video sectors. Follow him on X and LinkedIn. Baumgartner also served as Site Editor for Light Reading Cable from 2007-2013. In between his two stints at Light Reading, he led tech coverage for Multichannel News and was a regular contributor to Broadcasting + Cable. Baumgartner was named to the 2018 class of the Cable TV Pioneers. You May Also Like Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Mar 29, 2024 Rethinking AIOPs — It's All About the Data SCTE® LiveLearning for Professionals Webinar™ Series: Fiddling with Fixed Wireless SCTE® LiveLearning for Professionals Webinar™ Series: Cable and 5G: The Odd Couple? SCTE® LiveLearning for Professionals Webinar™ Series: Delivering the DAA Difference Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG. "
}