{
    "title": null,
    "date": "2/20/2024",
    "url": "https://etftrends.com/financial-literacy-channel/mag-7-stocks-are-in-different-sectors/",
    "text": "Even if you have not heard of the Magnificent Seven stocks as a group, you likely know the companies. The Magnificent Seven comprises Apple (AAPL), Microsoft (MSFT), Amazon.com (AMZN), Nvidia (NVDA), Meta Platforms (META), Tesla (TSLA), and Alphabet (GOOG/GOOGL). I asked my 13-year-old son to help me take a deeper dive into what some of these companies provide. Apple makes iPhones, iPods, iPads, and Mac computers. Tesla makes electric vehicles that benefit the environment. Alphabet owns YouTube and Google, a search engine platform. Microsoft owns Xbox, Minecraft, Skype, LinkedIn, and the creator of Call of Duty.  As my colleague Roxanna Islam wrote, “it makes sense that investors like big tech. They can get exposure to innovation and technological advances while staying relatively safe due to these companies’ scale.” However, there is a catch. The largest information technology ETF is the Vanguard Information Technology ETF (VGT). The $64 billion VGT’s largest holdings include AAPL, MSFT, and NVDIA out of the Magnificent Seven, but the next largest positions are Adobe, Advanced Micro Devices, Broadcom, and salesforce.com. The Technology Select Sector SPDR ETF (XLK) is not far behind, with $62 billion in assets. XLK has the same top seven holdings as VGT. Software is the largest industry representing 39% of the portfolio, followed by semiconductors & semiconductor equipment (28%), and technology, hardware, storage and peripherals (21%).  Alphabet is in the communication services sector, according to index providers S&P Dow Jones Indices and MSCI. The largest communications services sector ETF is the Communications Services Select Sector SPDR (XLC). The $18 billion sector ETF owns a combined 21% stake in GOOG and GOOGL. The top position in the ETF is META at 29%. Other positions include Electronic Arts, Netflix, Walt Disney and Verizon Communications. Interactive Media & Services companies make up more than half of XLC assets (52%). This is followed by entertainment (21%), media (15%) and diversified telecommunications services (8%). The Consumer Discretionary Select Sector SPDR (XLY) has a 26% stake in Amazon. Tesla is the next largest position at 14%. Other top-10 holdings in the $20 billion ETF include Chipotle Mexican Grill, McDonalds, Nike, and Starbucks. Broadline retail is the largest industry with 26% of assets followed by hotels, restaurants & leisure (24%). Specialty retail and automobiles are also well represented. Companies that are highly profitable due to technological advancements are not necessarily in the same sector ETF. You must look at an ETF’s holdings to understand what you own. Eli Rosenbluth contributed to this article. For more news, information, and analysis, visit the Financial Literacy Channel. "
}