{
    "title": "Don't Give Up: GOOG Stock Is Still a Buy Right Now",
    "date": "2/27/2024",
    "url": "https://www.tradingview.com/news/investorplace:12103e079094b:0-don-t-give-up-goog-stock-is-still-a-buy-right-now/",
    "text": "Since the start of the month, Alphabet GOOG shares have encountered resistance. GOOG stock has been fluctuating between $140 and $150 per share recently. Market-related factors are at play, along with factors tied to Google and YouTube. Mainly, though concerns are in relation to the generative AI growth trend and its significance for the tech giant’s future. Because of some recent developments, concerns are rising that generative AI serves not as a growth catalyst, but as a risk for Alphabet’s future growth and profitability. However, even as some setbacks and possible competitive threats have emerged, it is far too soon to jump to this conclusion. With this in mind, read on, as I explain why. GOOG Stock: Topping Out as ‘AI Mania’ Cools and Gemini Setbacks Emerge Alphabet is not the only AI stock trading sideways right now. Enthusiasm for AI stocks across the board, from other “Magnificent Seven” components to more speculative AI plays, has cooled off. The latest wave of “AI mania” has receded. Once again, the market is questioning how quickly big tech will commercialize this technology. That said, it doesn’t help that there have been more negative than positive company-specific headlines regarding GOOG stock over the past few weeks. For instance, back on Feb. 20, analysts at IT research firm Gartner issued a report arguing why, because of the rise of gen AI chatbots, traditional search engines volumes could fall by 25% by 2026. As Google is the dominant name in traditional search, it’s of course most threatened by this potentially-emerging trend. That’s not all. Not too long after the Gartner report, another negative news item emerged. On Feb. 22, Reuters reported that there have been widely publicized reports of inaccuracies in the images and chatbot answers generated by Alphabet’s recently unveiled Gemini AI platform. This news item hasn’t had a tremendous impact on GOOG’s price performance. Investors may now be questioning whether Alphabet/Google is truly playing “AI catch up.” Make No Mistake, Alphabet’s AI Potential Hasn’t Gone Away The above negative headlines follow yet another sownside discussed in my prior article on GOOG stock. That would be news that ChatGPT developer OpenAI plans to launch its own search engine. While also at worst a minor threat to Alphabet, if enough of these negatives play out, it’s easy to see how the company and its shares could be felled by enough leaks in its competitive moat. Yet while a few investors may cash out of GOOG, on the view that Gemini setbacks and competitive threats mean bad news for the future, once again, I’ll say that it is far too early to jump to this conclusion. Make no mistake. These headwinds notwithstanding, it’s not as if Alphabet’s AI catalyst has completely gone away. The company is quickly addressing the Gemini inaccuracy issue. While the controversy is making a lot of noise online, remember that even ChatGPT has been called out for providing users inaccurate information on numerous occasions. After fine-tuning Gemini, Alphabet is well-positioned to continue integrating this technology company-wide. This, in turn, will sustain its competitive edge, not to mention enhance the monetization of Google Search, YouTube, Google Cloud, and other segments. Bottom Line: Not Quite Time to Throw in the Towel, but be Patient It’s not quite time to throw in the towel with GOOG. After recent setbacks, the company could reveal some positive surprises later this year. These could completely shatter the argument that gen AI hurts more than helps Alphabet. Subscription revenue from Gemini, plus AI-related improvement to ad monetization, could begin having an impact on quarterly results. Much like prior attempts to challenge Google’s search market dominance, efforts from OpenAI and others to get into this space may prove easier said-than-done. Hence, Alphabet still stands to meet/beat sell-side earnings growth forecasts. These call for double-digit annualized earnings growth between now and 2026. While you may need to be patient, as the market continues to digest near-term macro and company-specific challenges, the potential for GOOG stock to soar, on increased earnings and a market re-rating, is still in the cards. GOOG stock earns a B rating in Portfolio Grader. On the date of publication, neither Louis Navellier nor the InvestorPlace Research Staff member primarily responsible for this article held (either directly or indirectly) any positions in the securities mentioned in this article. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}