{
    "title": "Can the Cheapest \"Magnificent Seven\" Stock Turn $100,000 Into $1 Million?",
    "date": "3/19/2024",
    "url": "https://www.fool.com/investing/2024/03/19/cheapest-magnificent-seven-stock-1-million/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Since the start of 2023, the market has been on an absolute tear. The S&P 500 and the Nasdaq Composite have soared 34% and 54%, respectively, during that time (as of March 18). But it hasn't been a broad-based rally. In fact, the so-called \"Magnificent Seven\" stocks, which include some of the world's most dominant and influential enterprises, are carrying most of the weight. And their market caps are reaching new heights. This doesn't mean these stocks are off limits. Investors should take a closer look at Alphabet (GOOG 0.21%) (GOOGL 0.04%) in particular. Trading at a forward price-to-earnings (P/E) ratio of just 21.8, this tech giant is the cheapest of all the Magnificent Seven stocks based on this popular metric. Compared to a valuation multiple that use sales in the denominator, for example, the forward P/E ratio can be superior because it prioritizes and emphasizes net income. After all, producing a positive bottom line is a wonderful indicator of a company's ability to be fiscally responsible. Moreover, by looking at forward estimates, we can also incorporate Wall Street's outlook into our analysis. With that being said, it's time to consider adding Alphabet to your portfolio. It could turn $100,000 into a cool $1 million over the next 20 years. Alphabet has been under pressure recently because Wall Street thinks the business is falling behind its peers in the artificial intelligence (AI) wars, especially as it relates to Gemini's image-generation tool. Moreover, I believe there are still fears about Alphabet's lucrative cash cow, Google Search, being disrupted by the advent of AI capabilities. Perhaps this helps explain why shares are cheaper than the other Magnificent Seven stocks. However, there's no reason to panic. Investors would do much better if they spent less time trying to predict or quickly react to the latest news update, and focused more of their attention on the big-picture factors that matter to a company's long-term success. No matter how you look at it, Alphabet is still a dominant enterprise. Google Search raked in $175 billion of revenue in 2023, up 7.7% year over year. According to StatCounter, it has a jaw-dropping 92% of the global market, despite all of the hype surrounding ChatGPT and its integration with Microsoft's Bing. Given the tremendous amount of data Alphabet is able to collect (Google is by far the world's most popular website, with 163 billion visitors in the month of January), the company can continue to effectively target internet users better than any other platform out there. This means Alphabet will benefit from strong demand and ad-pricing power. There is really no clear evidence that Alphabet's crown jewel is under threat. The company's wide economic moat, which is supported primarily by a network effect, will continue to protect it as new tech innovations arise. In just the last 13 years, Alphabet's stock has risen by almost 900%. If shares were to climb tenfold in the next two decades, it would translate to an annualized gain of 12.2%. I believe that's a totally reasonable outcome. Investors could get some added upside should the valuation expand over time. Even if the multiple ends up not being a major factor, the business itself has solid growth prospects. The amount of internet data and number of users continues to grow with each passing year. This creates the foundation for Google Search to organize and serve up that info. Alphabet also owns YouTube, the leading video streaming service provider. It not only has an estimated 2.5 billion users across the globe, but it commands the most TV viewing time of any other streaming platform out there. As more time is spent watching streamed content, more and more ad dollars will flow this way. There's also Google Cloud, which has about 11% worldwide market share in the cloud computing industry. Revenue was up 26% in Q4, faster than the business overall. And given the huge runway for IT spending to shift to off-premises, there's ample opportunity for sales gains to continue. These key drivers should result in strong revenue and earnings growth for Alphabet over the long term, leading to impressive stock returns. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Neil Patel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}