{
    "title": "Google Bets Big on Monzo, Values The UK Fintech at $5 Billion",
    "date": "3/5/2024",
    "url": "https://www.tradingview.com/news/financemagnates:5e3116d10094b:0-google-bets-big-on-monzo-values-the-uk-fintech-at-5-billion/",
    "text": "Monzo has announced a €397 million ($400 million) funding round led by CapitalG, Google’s independent growth fund. The UK's largest digital bank, with over 9 million customers, is currently valued at $5 billion. Monzo Raises €397 Million to Fuel Expansion Plans The round also saw participation from global tech investors, such as GV (Google Ventures), HSG (HongShan Capital), and existing backers (Passion Capital and Tencent). The funding round values Monzo at a post-money valuation of $5 billion, a significant increase from its previous $4.5 billion valuation in late 2021. The new capital will accelerate Monzo's expansion plans following a year of record growth that saw the company achieve profitability, attract millions of new customers, and launch a range of new products. According to TS Anil, the CEO of Monzo, the funding will provide \"rocket fuel\" to pursue the company's ambitions \"harder and faster\", with the goal of building Monzo into \"the one app that sits at the center of our customers' financial lives.\" Monzo hits $5 billion valuation on $430 million funding round https://t.co/5PoVZhT2cW Monzo has experienced rapid growth in recent years, with over 9 million retail customers and 400,000 business customers. In 2023 alone, the bank added 2 million new customers and saw substantial revenue growth driven by its diversification strategy. The company reported profitability in March 2023 and launched several new products and features, including Instant Access Savings, Monzo Investments, Cashback, Mortgage Tracker, and the industry-first Call Status fraud prevention tool. Investor Confidence in Monzo's Innovation Gene Frantz, the General Partner at CapitalG, expressed confidence in Monzo's innovative and customer-centric approach. \"In an industry long rife with stagnation and uninspired customer service, Monzo has emerged as the innovative, customer-centric bank consumers have long craved,\" he commented. Frantz highlighted Monzo's combination of banking and technology, and CapitalG's \"excitement\" to support the company's journey in providing \"unique and inspiring digital experiences\" to customers in the UK and beyond. Closing this funding round, worth hundreds of millions of dollars, confirms reports that Finance Magnates informed about two weeks ago. It also stands as an exception to the trend in the European fintech scene, which has recently faced significant challenges in securing financing. Fintech Funding Plummets in Europe The recent KPMG Pulse of Fintech report highlights significant challenges the fintech industry faces, with a sharp decline in global investments in 2023. The sector saw its funding decrease to $113.7 billion from $196.3 billion the year before, marking the lowest number of deals since 2017, totaling 4,547. Africa, like everywhere else, saw VC winters set in hard in 2023. However, in the #Fintech space, while equity funding was down by 43% vs. 2022, debt funding increased by 34% to $647M. 💳🌍 Read the latest findings and stories in this week's newsletter: https://t.co/tlcRSXgkSP pic.twitter.com/mQ8eYbxsM5 However, the latter half of 2023 witnessed a slight uptick in investment, rising from $55.5 billion to $58.2 billion. Six major deals drove this increase, each exceeding the $1 billion threshold, indicating some resilience within the fintech space. Additionally, Innovate Finance's analysis presents a contrasting scenario in the United Arab Emirates where fintech funding soared 92%. This showcases that despite the overall downturn, certain regions and transactions, like the anticipated funding round for Monzo, demonstrate the fintech sector's capacity for significant deals and growth amidst a generally contracting market. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}