{
    "title": "The Odds Now Favor Going Long Alphabet (GOOGL) Stock",
    "date": "3/27/2024",
    "url": "https://www.aol.com/odds-now-favor-going-long-150933057.html",
    "text": "Advertisement For premium support please call: An ultra-volatile and bearish market of late may seem like a game of craps. But when it comes to Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL), today’s bet on a more resilient “Lucky 7” looks like a winning investment strategy off and on the price chart for GOOGL stock investors. Let me explain. Wall Street wisdom says that one day doesn’t make a trend. The thoughtful words are intended to keep investors from hastily jumping on board a seductive-looking move, which ultimately favors turning into the equivalent of a one-hit wonder on the music charts … never to be heard from again. And on the heels of Friday’s price action, the warning might seem more than a bit appropriate. InvestorPlace - Stock Market News, Stock Advice & Trading Tips For its part, the S&P 500 was up 3.35%. Microsoft (NYSE:MSFT), the world’s largest publicly traded company tacked on 4.65%. And GOOGL stock rallied an even stronger 5.13%. The determined-looking wagers occurred within a market correction, which recently turned into a full-fledged, confirmed bear market. Prompting the bid, a favorable trifecta of hopeful U.S.-China trade war negotiations, dovish Fed talk and better-than-expected jobs report found investors quickly and aggressively placing bets on green. 10 Oversold Stocks Due for a Bounce So have investors forgotten about the recently confirmed bear market, those pearls of wisdom from Wall Street and opted to throw caution to the wind? This strategist doesn’t see it that way. Well, at least in Alphabet shares. My view is the price action now looks like an opportune time to bet on a more secure and less-chancy, Lucky 7 situation on the GOOGL stock chart. Back in October and early into Alphabet’s correction, I was cautious and even bearish on shares. A forecast calling for a challenge of $973 – $1000 in the company’s Class C GOOG stock proved prescient with this month’s low of $970.11 slightly piercing the support zone. I also guardedly warned of an even steeper correction. Multiple tests of this technical area suggested another challenge could prove to be the straw that would break the proverbial camel’s back. But that hasn’t proved the case for GOOG or GOOGL stock. And in fact, I’m bullish after last week’s promising price action. As Alphabet’s weekly view shows, GOOGL’s 24% correction has established a bullishly supportive stochastics set-up as shares made a seventh test of lateral price support and the 38% retracement level. Now and following Friday’s close, confirmation of a two-week candlestick reversal pattern has turned Alphabet’s technical challenge into a bullish-looking ‘Lucky 7’ proposition, rather than resembling a losing game of craps. For investors agreeable with what’s been presented, GOOGL stock is currently in position to be purchased. Shares of Alphabet are only 1.3% above an idealized entry price of $1064.23 and the prior week’s candlestick high. 7 Best Fidelity Funds for 2019 My recommendation is this type of entry in GOOGL should be accompanied by an initial stop-loss just below the pattern low. That amounts to exposure of less than 10% in Alphabet stock. This keeps potential losses contained and manageable just in case an odds-on favorite Lucky 7 wager takes an unexpected turn into a game of craps … that’s not worth playing. Disclosure: Investment accounts under Christopher Tyler’s management do not currently own positions in any securities mentioned in this article. The information offered is based upon Christopher Tyler’s observations and strictly intended for educational purposes only; the use of which is the responsibility of the individual. . For additional options-based strategies and related musings, follow Chris on Twitter @Options_CAT and StockTwits. 2 Toxic Pot Stocks You Should Avoid 7 Stocks to Buy Down 20% in December 5 Chinese Stocks to Avoid Now (But Buy Later) 3 Big Gainers That Easily Could Be the Best Stocks to Buy Compare Brokers The post The Odds Now Favor Going Long Alphabet (GOOGL) Stock appeared first on InvestorPlace. Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}