{
    "title": "The Real Reason Why Google Is Lagging: The Bing Reality (NASDAQ:GOOGL)",
    "date": "3/26/2024",
    "url": "https://seekingalpha.com/article/4680469-the-real-reason-why-google-is-lagging-the-bing-reality",
    "text": "Justin Sullivan/Getty Images News  Justin Sullivan/Getty Images News While the stock remains a solid performer in its own right, it is impossible to ignore that Alphabet Inc. aka Google (NASDAQ:GOOGL) has underwhelmed relative to mega-cap peers. Meta Platforms (META) in particular, a stock that many have long coupled together with GOOGL due to their online advertising focus, has delivered far superior shareholder returns over the past year. While some may attempt to justify the Google underperformance by scrutinizing the numbers, I am of the view that the stock is suffering from a generative AI overhang that may be difficult to overcome. I reiterate my strong buy rating as I expect operational execution and share repurchases to eventually right the ship. While GOOGL has been a strong performer over the past year, it is only up 10% over the last 6 months, greatly lagging the violent rally seen among tech peers. Data by YCharts I last covered GOOGL in December where I explained why it was one of my top picks for 2024. The stock is up since then, and I see more upside ahead as there is still multiple expansion potential at play here (though I am less optimistic than before). In its most recent quarter, GOOGL continued to show accelerating top line growth, with revenues growing 13% YoY to $86.3 billion (up from 11% in the third quarter). That acceleration in growth appears to be due to an improvement in the macro environment as well as beginning to lap easier comparable. I expect this trend to play out over the coming quarters as well. The company also showed operating leverage, with operating income rising 30.2% to $23.7 billion. While GOOGL did not have the same publicized “year of efficiency” as that seen at Meta Platforms, it has (like many other tech peers) committed to delivering on operating leverage. 2023 Q4 Presentation 2023 Q4 Presentation Google Services (the advertising and subscription businesses) revenue jumped by 12.5%, but the real star was in Google Cloud, which saw revenue growth accelerate sequentially to 25.7% (growth was 22.5% in the prior quarter). I understand that this growth rate does not look so impressive considering that Microsoft (MSFT) delivered 30% YoY growth in Azure, but I am still pleased to see GOOGL showing improving growth rates in spite of a continued tough macro environment. GOOGL also delivered profitability gains at Google Cloud, with operating income jumping to $864 million. 2023 Q4 Presentation 2023 Q4 Presentation GOOGL ended the quarter with $110.9 billion of cash and $31 billion of non-marketable securities versus $13.3 billion of long term debt. The company repurchased $15.4 billion of stock in the quarter, surpassing GAAP net income as the company has been able to balance aggressive investments in generative AI related CapEx with returning capital to shareholders. Looking to the next quarter, consensus estimates call for the company to deliver 12.8% YoY revenue growth to $78.7 billion and around 20% YoY growth to $1.50 in EPS. As noted earlier, the strong top-line growth in part stems from lapping easier comparable. On the conference call, management emphasized that their profitability gains in 2023 are not one-time and they are committed to maintaining “healthy profitability while we continue to invest to support long-term growth.” This is a common silver lining seen from the tech crash, namely that these management teams have shown a greater attention to profitability. The question is, is it enough to offset the ongoing narrative shift (which I now discuss below)? Like other cloud players, GOOGL expects CapEx to increase in 2024 due to investments in generative AI - it bears reminding that the company is not just a potential victim of generative AI. While Wall Street appears quite concerned about the potential impact that generative AI may have on the search revenues, the company’s YouTube operations stand to benefit for many of the same reasons that Meta Platforms has done so well. As YouTube CEO Neal Mohan stated in his 2024 letter, generative AI will help increase the demand for online advertising in part due to making it easier to produce high quality advertisements. Yet the stock does not reflect such optimism, recently trading hands at around 22x this year’s earnings. Seeking Alpha Seeking Alpha That multiple looks cheap considering that consensus estimates call for 9% to 10% top-line growth for many years to come. Seeking Alpha Seeking Alpha I again value the stock on a sum-of-the-parts basis. Google Cloud growth has accelerated to 25% this quarter. Assuming 40% long term net margins and a 1.5x price to earnings growth ratio (‘PEG ratio’), I could see this segment valued at 15x sales, or $44 per share. I value the Other Bets segment at $0. Net cash is worth $7.70 per share. That leaves around $93 per share for the core advertising business. This segment generated $95.8 billion in operating income in 2023. Applying a 21% tax rate, that amounts to $75.7 billion in net income, or $6 per share. The current stock price is valuing the advertising business at just 16x earnings. The issue facing the stock is that Wall Street appears afraid that at some point in the future, growth rates might fall off a cliff due to a shift in how users search for content. Bing search, ChatGPT or other generative AI engines might take market share from GOOGL. Looking back, I can anecdotally say that I had to learn how to use Google search in my school’s computer classes - it is possible that future generations might instead use another search engine. It is not clear if GOOGL can directly alter that view - the mere fear of generative AI disruption may hold down multiples. Tobacco stocks have faced a similar valuation issue though they are exhibiting tangible evidence of secular decline. META was able to move past iOS and TikTok concerns apparently through showing an acceleration in top-line growth and aggressive cost cuts. GOOGL has not shown indication that aggressive cost cutting is on the way (and they may have missed the opportune moment to do so) and it may be difficult to show a meaningful acceleration in top-line growth given the size of the company. This means that there is the risk that GOOGL continues to trade at low implied valuations for its advertising businesses indefinitely. I emphasize that even if Wall Street's fears end up proven unsubstantiated, the stock might still trade at lower valuations due to the impact of forward-looking sentiment on multiples. That might not be so bad for shareholders, as the company maintains a net cash balance sheet and ongoing share repurchases can take advantage of low valuations. However, those hoping for a quick META-catchup trade might be disappointed given the presumed difficulty in getting rid of the valuation overhang. In my above model, I assumed $0 value for the Other Bets segment. This segment lost $4.1 billion in operating income in 2023. But even at $0, I may be understating the value of this segment. Management noted that Waymo, their autonomous business unit, has completed 1 million rides. With one of the biggest competitors in General Motors’ Cruise (GM) being forced to slow down operations due to a series of accidents, investors may be underestimating the value of this unit. Waymo Waymo GOOGL has historically invested in various “moonshot” projects in this segment. X Development X Development I wouldn’t rule out GOOGL eventually hitting a home run from one or several of these projects, but none of those rewards are being priced in today. If generative AI ends up disrupting search, then I expect it to take time before it negatively impacts the fundamental results. This is because I am doubtful that current generations will make a meaningful shift away from Google search (how does one convince adults to take another computer class?), and GOOGL still remains a beneficiary of increasing adoption of the internet. Even if we assume that newer generations might use Google search less than now, GOOGL might still be able to show long term secular growth in its advertising business. Over the near term, I continue to expect GOOGL to show faster earnings growth than top-line growth due to operating leverage. Even so, I am lowering my estimates for Google stock. I no longer use a 23x earnings multiple for the advertising business. I now use an 18x earnings multiple, which would value that segment at around $108 per share. That places the fair value estimate at around $160 per share. I note that this low number may be deceiving because I expect Google Cloud to grow revenues at 25% and the advertising business to grow earnings at around 18% over the next few years. That means that at $160 per share, the stock might be priced to deliver 20% annual returns, which is arguably too high of a risk premium given the strong balance sheet. What are other key risks? Generative AI is not the only threat to the search business. As detailed above, I actually view it to be an overblown concern given the slow possible impact on the financial results. The biggest concern might be that GOOGL is unable to get rid of the valuation overhang, but share repurchases can make investing worthwhile. Instead, in my view the bigger threat to the search business is a potential push into search by Apple (AAPL). GOOGL pays a hefty fee to AAPL to be made the default search engine. But if AAPL were to break away from this arrangement and unveil its own search engine, then I am of the view that it would be highly successful in winning market share (based on their history of expanding their ecosystem). GOOGL might be able to save on costs under such a scenario, but the narrative would be damaging to the valuation multiple and the stock might even trade down to 12x to 15x earnings. This risk is also not quite in GOOGL’s control as it is anyone’s guess if AAPL will ever consider such a move. For now though, this risk looks overblown given that AAPL is apparently looking to further its relationship with GOOGL through use of its generative AI models. The mere fear of technological disruption may hold back the stock indefinitely. That may be crashing the party for investors hoping for a quick re-rating upwards, as the stock might continue to languish in spite of strong fundamental results. That said, the current valuation remains highly attractive and management continues to execute on aggressive share repurchases. While I remain highly bullish on the stock, I must adjust the investment thesis to incorporate this valuation overhang risk. I reiterate my strong buy rating for Alphabet Inc. stock, as the market continues to place too high of a risk premium on the advertising business, but investors may need to be patient with this one. After a historic valuation reset, the growth investing landscape has changed. Get my best research at your fingertips today. Get access to Best of Breed Growth Stocks:  This article was written by Julian Lin is a financial analyst. He finds undervalued companies with secular growth that appreciate over time. His approach is to look for companies with strong balance sheets and management teams in sectors with long growth runways. Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL, META either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. I am long all positions in the Best of Breed Growth Stocks Portfolio. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}