{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/procyon-advisors-llc-acquires-10378-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Procyon Advisors LLC grew its holdings in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 10.0% during the fourth quarter, according to its most recent 13F filing with the SEC. The institutional investor  owned 114,417 shares of the information services provider’s stock after buying an additional 10,378 shares during the period. Alphabet makes up   1.4% of Procyon Advisors LLC’s investment portfolio, making the stock its 13th largest holding. Procyon Advisors LLC’s holdings in Alphabet were worth $15,983,000 as of its most recent SEC filing. A number of other institutional investors and hedge funds have also recently modified their holdings of GOOGL. DC Investments Management LLC bought a new position in shares of  Alphabet in the 1st quarter worth $114,000.  Bridgefront Capital LLC bought a new position in shares of  Alphabet in the 1st quarter worth $225,000.  Worth Asset Management LLC bought a new position in shares of  Alphabet in the 1st quarter worth $206,000.  Eudaimonia Advisors LLC lifted its holdings in shares of  Alphabet by 15.1% in the 1st quarter. Eudaimonia Advisors LLC now owns 99 shares of the information services provider’s stock worth $275,000 after purchasing an additional 13 shares in the last quarter.  Finally, Aspire Capital Advisors LLC bought a new position in shares of  Alphabet in the 1st quarter worth $281,000. 40.03% of the stock is currently owned by institutional investors. A number of equities analysts recently issued reports on GOOGL shares. Royal Bank of Canada  reiterated an “outperform” rating and issued a $155.00 target price on shares of Alphabet in a report on Wednesday, January 31st. Needham & Company LLC  restated a “buy” rating and set a $160.00 price objective on shares of Alphabet in a research note on Wednesday, January 31st. Citigroup raised their price objective on Alphabet from $153.00 to $168.00 and gave the company a “buy” rating in a research note on Wednesday, January 31st. JMP Securities raised their price objective on Alphabet from $150.00 to $160.00 and gave the company a “market outperform” rating in a research note on Wednesday, January 31st. Finally, Truist Financial dropped their price objective on Alphabet from $160.00 to $158.00 and set a “buy” rating on the stock in a research note on Wednesday, January 31st. Five investment analysts have rated the stock with a hold rating, twenty-six have issued  a buy rating and two have given a strong buy rating to the stock. Based on data from MarketBeat, the stock currently has a consensus rating of “Moderate Buy” and a consensus price target of $155.48. Get Our Latest Analysis on Alphabet In other news, CAO Amie Thuener O’toole sold 425 shares of Alphabet stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares in the company, valued at approximately $3,805,628.99. The sale was disclosed in a filing with the SEC, which is accessible through this hyperlink. In other news, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction dated Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total transaction of $3,152,475.00. Following the completion of the sale, the chief executive officer now owns 2,422,691 shares in the company, valued at approximately $339,443,236.01. The sale was disclosed in a filing with the SEC, which is accessible through this hyperlink. Also, CAO Amie Thuener O’toole sold 425 shares of Alphabet stock in a transaction dated Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the sale, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. In the last 90 days, insiders sold 263,312 shares of company stock worth $37,268,315. 0.88% of the stock is currently owned by insiders. Shares of NASDAQ GOOGL opened at $150.93 on Friday. Alphabet Inc. has a 52 week low of $99.78 and a 52 week high of $153.78. The business has a 50-day simple moving average of $143.67 and a two-hundred day simple moving average of $138.21. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The company has a market cap of $1.88 trillion, a P/E ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. During the same quarter last year, the company earned $1.05 EPS.  Research analysts anticipate that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. LaFleur & Godfrey LLC Decreases Stock Position in Alphabet Inc. (NASDAQ:GOOGL) Alphabet Inc. (NASDAQ:GOOGL) Position Lowered by WASHINGTON TRUST Co "
}