{
    "title": "1483 Shares in Alphabet Inc. (NASDAQ:GOOGL) Acquired by O Connor Financial \nGroup LLC",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/1483-shares-in-alphabet-inc-nasdaqgoogl-acquired-by-o-connor-financial-group-llc.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 O Connor Financial Group LLC purchased a new stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) in the 4th quarter, according to its most recent filing with the SEC. The fund purchased 1,483 shares of the information services provider’s stock, valued at approximately $207,000. Other institutional investors also recently bought and sold shares of the company. Spreng Capital Management Inc. raised its stake in shares of  Alphabet by 4.0% in the 1st quarter. Spreng Capital Management Inc. now owns 131 shares of the information services provider’s stock valued at $364,000 after purchasing an additional 5 shares in the last quarter.  West Family Investments Inc. raised its stake in  Alphabet by 0.3% during the first quarter. West Family Investments Inc. now owns 1,754 shares of the information services provider’s stock worth $4,878,000 after acquiring an additional 6 shares during the period.  Maple Capital Management Inc. raised its stake in  Alphabet by 2.1% during the first quarter. Maple Capital Management Inc. now owns 296 shares of the information services provider’s stock worth $823,000 after acquiring an additional 6 shares during the period.  Private Advisory Group LLC raised its stake in  Alphabet by 1.8% during the first quarter. Private Advisory Group LLC now owns 401 shares of the information services provider’s stock worth $1,115,000 after acquiring an additional 7 shares during the period.  Finally, Weik Capital Management raised its stake in  Alphabet by 0.5% during the first quarter. Weik Capital Management now owns 1,533 shares of the information services provider’s stock worth $4,264,000 after acquiring an additional 8 shares during the period. 40.03% of the stock is currently owned by institutional investors and hedge funds. In related news, CAO Amie Thuener O’toole sold 425 shares of the company’s stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares in the company, valued at approximately $3,805,628.99. The sale was disclosed in a legal filing with the SEC, which can be accessed through this hyperlink. In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares in the company, valued at approximately $3,805,628.99. The transaction was disclosed in a legal filing with the SEC, which can be accessed through this link. Also, SVP Prabhakar Raghavan sold 16,088 shares of the stock in a transaction that occurred on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the completion of the sale, the senior vice president now owns 52,440 shares of the company’s stock, valued at approximately $7,294,404. The disclosure for this sale can be found here. In the last 90 days, insiders sold 251,138 shares of company stock worth $35,427,655. 0.88% of the stock is owned by corporate insiders. Several equities research analysts recently weighed in on GOOGL shares. Wells Fargo & Company increased their price objective on shares of Alphabet from $141.00 to $144.00 and gave the stock an “equal weight” rating in a research note on Monday, March 18th. Redburn Atlantic upped their target price on shares of Alphabet from $150.00 to $165.00 and gave the stock a “buy” rating in a research report on Wednesday, January 31st. Royal Bank of Canada  restated an “outperform” rating and issued a $155.00 target price on shares of Alphabet in a research report on Wednesday, January 31st. BMO Capital Markets upped their target price on shares of Alphabet from $170.00 to $178.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Finally, Needham & Company LLC  restated a “buy” rating and issued a $160.00 target price on shares of Alphabet in a research report on Wednesday, January 31st. Five equities research analysts have rated the stock with a hold rating, twenty-six have issued  a buy rating and two have issued  a strong buy rating to the stock. According to MarketBeat, the company presently has a consensus rating of “Moderate Buy” and an average target price of $155.48. View Our Latest Stock Analysis on GOOGL Shares of NASDAQ:GOOGL opened at $150.93 on Friday. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. The company has a market cap of $1.88 trillion, a PE ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet Inc. has a 52 week low of $99.78 and a 52 week high of $153.78. The firm has a 50 day simple moving average of $143.52 and a 200 day simple moving average of $138.12. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating the consensus estimate of $1.60 by $0.04. The business had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter in the prior year, the firm earned $1.05 EPS.  As a group, research analysts expect that  Alphabet Inc. will post 6.77 earnings per share for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Monarch Capital Management Inc. Sells 270 Shares of Alphabet Inc. (NASDAQ:GOOGL) Altfest L J & Co. Inc. Cuts Holdings in iShares U.S. Aerospace & Defense ETF (BATS:ITA) "
}