{
    "title": "Alphabet stock sinks 4% as Google parent is hit by disappointing holiday ad \nsales - overshadowing cloud boom a",
    "date": "1/30/2024",
    "url": "https://www.dailymail.co.uk/news/article-13025303/Alphabet-stock-Google-earnings-revenue.html",
    "text": "By Keith Griffith For Dailymail.com and Reuters Published:  21:28 BST, 30 January 2024   |  Updated:  22:33 BST, 30 January 2024   View  comments  Alphabet disappointed Wall Street on Tuesday as its holiday advertising sales came in below expectations and overshadowed the company's efforts in artificial intelligence and the cloud. Shares of the Google parent company fell more than 4 percent in after-hours trading, despite overall sales that beat expectations and rose 13 percent from one year ago. Amid mixed economic signals in the United States, Alphabet has faced tough competition for shrinking ad budgets from other online platforms such as Facebook, Instagram, TikTok and Amazon. Alphabet recorded ad revenue of $65.52 billion in the fourth quarter, compared with $59.04 billion a year earlier, less than the $66.06 billion analysts expected for the quarter. Google's customers have worked to streamline their cloud spending, impacting revenue growth. The company also has various startups as clients, which some investors fear keep a tight lid on spending. Alphabet disappointed Wall Street on Tuesday as holiday season advertising sales came in below expectations. CEO Sundar Pichai is seen above Shares of the Google parent company fell more than 4 percent in after-hours trading, despite overall sales that beat expectations and rose 13 percent from one year ago Alphabet reported a profit of $20.7 billion on revenue of $86.3 billion for the quarter ended December 31. Topline revenue beat estimates of $85.33 billion, according to LSEG data, and rose 13 percent from the same period one year ago. Alphabet credited artificial intelligence with helping boost profits in the quarter. 'We are pleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud,' said CEO Sundar Pichai in a statement. 'Each of these is already benefiting from our AI investments and innovation. As we enter the Gemini era, the best is yet to come,' he added, referring to the company's newly announced AI initiative. Google, which created foundational technology for today's AI boom, faces tough competition from the two players that have captured the business world's attention, ChatGPT's creator OpenAI and its financial backer Microsoft. Google, which created foundational technology for today's AI boom, faces tough competition in the space from OpenAI and Microsoft Google is bringing a powerful suite of models called Gemini to its ChatGPT rival, known as Bard. It also struck a deal to invest up to $2 billion in high-profile AI startup Anthropic as it courts customers from larger cloud rivals Microsoft and Amazon, and it is putting Gemini into advertisers' hands so their dollars keep flowing to Google's search business. Still, Alphabet faces formidable challenges. AI's advertising boost may remain far off, and ongoing geopolitical and economic uncertainty could discourage ad buyers. The US has already started probing AI investments including Alphabet's, as the government weighs regulations for the emerging sector. Google is also gearing up to appeal a major antitrust case it lost, and the company like others in technology has been cutting jobs. Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group "
}