{
    "title": "Alphabet Financial Report Outlook: Can Gemini Help Google Overtake in the \nAI Field?",
    "date": "1/24/2024",
    "url": "https://www.cmcmarkets.com/en-ca/analysis/alphabet-earnings",
    "text": " Trade on the go Download our apps CFD's app X Trade the way that suits you Trade CFDs Trade contracts for difference (CFDs) on over 12,000+ products including FX Pairs, Indices, Commodities, Shares, and Treasuries.  Written by Zhujun Li Market Analyst 24 Jan 2024, 21:00 Share this In the last quarter, the growth of Google's parent company, Alphabet, in the cloud business was significantly below market expectations, trailing behind Microsoft and Amazon. This briefly caused their stock price to dip to $120 after the financial report announcement. However, with a general improvement in risk sentiment in the fourth quarter, the company's stock price rose by 58.3% in 2023. As competition intensifies in the field of AI, Google launched the large-scale language model Gemini in early December, divided into three versions—Ultra, Pro, and Nano. On December 14, Gemini Pro's API was made freely available to the public, offering users a chance to experience the visual AI model for free, unlike the paid version of OpenAI's GPT-4. However, initial third-party test data suggests that Gemini Pro is currently on par with OpenAI's ChatGPT-3.5 but still lags behind GPT-4. Therefore, Google may have some way to go to establish a leading position in the AI field. Gemini Ultra is currently only available for internal employee use, with expectations for public release by March this year. However, Google's competitor OpenAI has announced plans to significantly upgrade its model, surpassing all existing AI products in the market. Even with the introduction of Gemini Ultra, Google may struggle to overcome its current lag. While Google's search system, YouTube, and Android ecosystem have brought in a robust user base, its competitors, Microsoft and Amazon, are actively collaborating with other companies in the cloud services sector. For example, Microsoft has invested in OpenAI, and Amazon has invested in Anthropic. Google's progress in self-developed projects has consistently lagged behind the other two. The good news is that even though Google might be lagging in the field of AI, it still maintains a leadership position in the search business, holding over 90% of the market share, while Microsoft's Bing Chat contributes only 1% to its search business growth. Cost reduction and efficiency improvement are likely to remain Google's primary strategies for this year. In January 2024, Google has already laid off another 1000 employees across various departments, intending to enhance company productivity and achieve cost control. As we properly enter 2024, the external environment faces downward economic trends and geopolitical instability, while internally, challenges include cancelling multiple product lines, employee layoffs, and negative feedback from users due to the cessation of product releases. As AI continues to evolve, considerations for the security of AI models may be something overlooked by the current capital markets. With the continuous improvement of large model functionalities, the high information collection capabilities demonstrated by AI models sharply contrast with the current global situation of anti-globalization, potentially impacting regional restrictions on user access. Release Date: After-market on January 30th Possible Revenue: $707.1 billion, YoY growth of 12.03% Earnings Per Share: $1.6, YoY growth of 52.38% Data Source: Zacks Research Disclaimer: CMC Markets is an order execution-only service. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination. Latest from CMC Apple Quarterly Earnings Apple's recent run of earnings calls have been mixed. Ahead of their next earning call on 1st February 2024, what could we expect from the $3tn market cap giant? 24 Jan 2024 Microsoft Q4 Earnings Preview Meta Q4 Earnings Preview Netflix Q4 earnings preview Related articles Apple Quarterly Earnings Apple's recent run of earnings calls have been mixed. Ahead of their next earning call on 1st February 2024, what could we expect from the $3tn market cap giant? 24 Jan 2024 Microsoft Q4 Earnings Preview Microsoft Earnings Preview: Can the growth of its cloud business help Microsoft maintain its position as the world's most valuable company? 23 Jan 2024 Meta Q4 Earnings Preview Meta Earnings Preview: Stable growth expected in advertising business but could the Metaverse continue to incur losses? 23 Jan 2024 Netflix Q4 earnings preview On the back of a crackdown with password sharing, how could Netflix fare in its Q4 earnings? 16 Jan 2024 Canada 1 866 884 2608 Lines are open 24/5 Contact Download our app Get greater control and flexibility for peak performance trading when you're on the go. CMC Markets Canada Inc. is a member of the Investment Industry Regulatory Organization of Canada and a member of the Canadian Investor Protection Fund. CFDs are distributed in Canada by CMC Markets Canada Inc. acting as principal. Trading CFDs involve a high degree of risk and investors should be prepared for the risk of losing their entire investment and further amounts. CFD trading is available in jurisdictions in which CMC Markets is registered or exempt from registration, and, in the province of Alberta is available to Accredited Investors only. CMC Markets is an execution only dealer and does not provide investment advice or recommendations regarding the purchase or sale of any CFD. For full details of our fees please refer to our rates schedule. CMC Markets is remunerated through the spread which is the difference between the bid and ask price. Commission and holding costs may also apply. CMC Markets Canada Inc. est membre de l'Organisme canadien de réglementation du commerce des valeurs mobilières et du Fonds canadien de protection des épargnants. Les CFD sont distribués au Canada par CMC Markets Canada Inc., en qualité de mandant. Le trading de CFD comporte un degré de risque élevé et les investisseurs doivent être préparés au risque de perdre la totalité de leur investissement et des montants supplémentaires. Le trading de CFD est disponible dans les juridictions dans lesquelles CMC Markets est enregistré ou dispensé d'enregistrement, et dans la province de l'Alberta, il est uniquement disponible pour les investisseurs qualifiés. CMC Markets est un courtier d'exécution uniquement et ne fournit aucun conseil en investissement ni aucune recommandation concernant l'achat ou la vente de CFD. Pour plus de détails sur nos frais, veuillez vous référer à notre grille tarifaire. CMC Markets est rémunéré selon l’écart qui correspond à la différence entre le prix offert et le prix demandé. Des frais de commission et de financement peuvent également s'appliquer. Apple, iPad, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android is a trademark of Google Inc. This website uses cookies to obtain information about your general internet usage. Removal of cookies may affect the operation of certain parts of this website. For more information about cookies and how to remove them, please read our cookie policy. * CMC Markets Canada Inc. is a subsidiary of CMC Markets plc, which is listed on the London Stock Exchange. © 2024 CMC Markets "
}