{
    "title": "Why Alphabet Stock Rallied Thursday Morning",
    "date": "1/25/2024",
    "url": "https://www.fool.com/investing/2024/01/25/why-alphabet-stock-rallied-thursday-morning/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Shares of Alphabet (GOOGL 0.04%) (GOOG 0.21%) turned higher Thursday, gaining as much as 2.9%. As of 2:37 p.m. ET, the stock was still up 1.8%. The catalyst that sent the tech giant higher was the settlement of a patent infringement lawsuit. On Wednesday, Google reached a settlement to end a $1.67 billion patent infringement lawsuit brought by Singular Computing. Singular founder Joseph Bates claimed in court filings that Google had misappropriated innovations he developed, integrating that technology into its artificial intelligence (AI) processors back in 2017. Google developed Tensor Processing Units (TPUs), which were specifically designed to accelerate machine learning and AI workloads and make the process more efficient. Google's attorneys maintained the company's innocence, noting that its scientists and engineers had never met with any of Singular's staff and had developed the technology independently. The company said that its solution was \"fundamentally different\" from that laid out in Singular's patents. Google integrated the technology into the TPUs that support a number of its flagship offerings, including Google Search, Gmail, and Google Translate, among others. Google spokesperson Jose Castaneda insisted it had not violated Singular's patents and was \"pleased to have resolved this matter.\" It's important to put the amount at stake in context. Alphabet closed out the third quarter with cash and marketable securities of nearly $120 billion, after generating nearly $23 billion from free cash flow during the quarter. It isn't as if the $1.67 billion would break the bank for the Google parent. That said, the company was probably eager to put this lawsuit behind it. AI is a growth industry that went viral last year after advancements in generative AI captivated the tech world. Alphabet was quick to join the fray, introducing a host of AI models for its cloud computing customers. Furthermore, whatever the amount the company settled for was likely far less than the $1.67 billion amount of the lawsuit. Now Alphabet can get back to business. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}