{
    "title": null,
    "date": "1/18/2024",
    "url": "https://hypebeast.com/2024/1/google-ceo-sundar-pichai-company-layoffs-memo",
    "text": "  Following a year of massive layoffs at Google, CEO Sundar Pichai has told employees that more jobs will be cut in the new year. Since January 10, Google has reportedly laid off another 1,000 employees across divisions. Those job losses add to the approximately 12,000 jobs the company cut around this same time last year. Pichai has now shared an internal memo to employees, telling them that more “role eliminations” will be taking place in the near future, according to The Verge, which viewed a copy of the memo.\n“We have ambitious goals and will be investing in our big priorities this year,” Pichai reportedly wrote. “The reality is that to create the capacity for this investment, we have to make tough choices.”\nBeyond cutting jobs, it seems that Google will be reconfiguring its team structure, seemingly in order to continue business as usual with a significantly downsized workforce. The company will be reorganizing multiple teams, including the “hardware, ad sales, search, shopping, maps, policy, core engineering and YouTube teams,” per The Verge.\nPichai noted that some of the “changes” have already been announced, perhaps referring to the 1,000-plus roles cut within the past week. He also said that certain teams would have to make “specific resource allocation decisions” as deemed necessary and that some roles would be affected.\n\n                                                \n                                                                                                    \n\n                                                            Read Full Article “We have ambitious goals and will be investing in our big priorities this year,” Pichai reportedly wrote. “The reality is that to create the capacity for this investment, we have to make tough choices.”\nBeyond cutting jobs, it seems that Google will be reconfiguring its team structure, seemingly in order to continue business as usual with a significantly downsized workforce. The company will be reorganizing multiple teams, including the “hardware, ad sales, search, shopping, maps, policy, core engineering and YouTube teams,” per The Verge.\nPichai noted that some of the “changes” have already been announced, perhaps referring to the 1,000-plus roles cut within the past week. He also said that certain teams would have to make “specific resource allocation decisions” as deemed necessary and that some roles would be affected.\n\n                                                \n                                                                                                    \n\n                                                            Read Full Article Beyond cutting jobs, it seems that Google will be reconfiguring its team structure, seemingly in order to continue business as usual with a significantly downsized workforce. The company will be reorganizing multiple teams, including the “hardware, ad sales, search, shopping, maps, policy, core engineering and YouTube teams,” per The Verge.\nPichai noted that some of the “changes” have already been announced, perhaps referring to the 1,000-plus roles cut within the past week. He also said that certain teams would have to make “specific resource allocation decisions” as deemed necessary and that some roles would be affected.\n\n                                                \n                                                                                                    \n\n                                                            Read Full Article Pichai noted that some of the “changes” have already been announced, perhaps referring to the 1,000-plus roles cut within the past week. He also said that certain teams would have to make “specific resource allocation decisions” as deemed necessary and that some roles would be affected.\n\n                                                \n                                                                                                    \n\n                                                            Read Full Article    "
}