{
    "title": "Google layoffs: Staff start fighting back as more jobs are cut",
    "date": "1/19/2024",
    "url": "https://www.businessinsider.com/google-employees-fight-back-layoffs-just-business-2024-1",
    "text": "       In 2012, Larry Page stressed how important it was that Google acted like a \"family.\" The search giant had become famous at the time for its perks such as snacks and massages. To Page, then Google's CEO, treating people well translated to \"better productivity.\" More than a decade later, Googlers can be forgiven for wondering where that family spirit has gone. Last January, the tech giant said it was to lay off about 12,000 employees — the equivalent of 6% of its workforce — in a bid to cut costs and focus on high-priority areas such as artificial intelligence. But the layoffs haven't stopped. CEO Sundar Pichai warned staffers this week that there were more to come in 2024 but said the \"role eliminations\" would not be at the same scale as last year's. Divisions from sales and advertising to product and YouTube are set to be affected. It's worth pointing out that Google is not alone in making such sweeping cuts. Many of its Big Tech peers, including Amazon and Meta, have culled thousands of roles to rein in wage bills that ballooned earlier in the pandemic. This, of course, does little to assuage the anger of Googlers who have been kicked out of the family home and the anxiety and frustration of those who remain. In response to this week's wave of cuts, Diane Hirsh Theriault, a Google software engineer, vented on LinkedIn about Google's leadership. In a lengthy tirade, she called out \"boring and glassy-eyed\" leaders for layoffs that seemed to be \"torching institutional knowledge\" and \"perfectly functional teams.\" \"Google really was a magical place, not very long ago. And for some reason, executives are cashing out their human capital at the very moment it seems to me like they really need it,\" she wrote. \"Who can be dawn-of-a-new-era-of-humanity creative in this environment of fear?\" Related stories On Thursday, meanwhile, the Alphabet Workers Union planned protests at five Google campuses across the US, from Mountain View, California, to New York, to \"push back against the bogus talking points that Google employs\" to rationalize decision-making, it said in a press release. We have lost nearly 15,000 coworkers to layoffs at Google over the past year. If you’re a Googler against layoffs, RSVP to join us Thursday and Friday at locations in person and online, across the country. RSVP at https://t.co/hiZPDomas5 pic.twitter.com/xcSw6QHnPG \"The truth is that these layoffs cause chaos in our workplace, leaving us with increased workloads and widespread anxiety over which team will be the next to disappear overnight,\" Stephen McMurtry, a senior software engineer and Alphabet Workers Union's communications chair, said in a statement. \"Our colleagues are rightfully outraged and more frustrated than ever as we watch Google prioritize 'efficiency' over the people responsible for the company's continued, incredible success,\" McMurtry added. Google said in a statement it was \"responsibly investing in our company's biggest priorities and the significant opportunities ahead,\" adding that organizational changes included \"some role eliminations globally.\" \"We're continuing to support any impacted employees as they look for new roles here at Google and beyond,\" Google said. Kenneth Smith, an engineering manager at Google who said he was notified by email on January 10 that his role was being eliminated, lamented the way in which he received the news. \"Call me old school, but I think that if you find yourself in a situation where you need to let someone go, you owe it to them to meet them face-to-face, look them in the eyes, and acknowledge their humanity,\" he wrote on LinkedIn. Though he acknowledged one director followed up with him after the news, he has \"harbored a lot of anger and frustration at Google's leadership\" over the way layoffs have been handled since January 2023, he added. On X, Gergely Orosz, a software engineer and tech commentator, criticized the way Smith had been laid off by Google after almost six years of service but added: \"This is what you can expect from any faceless corporation.\" Google successfully cementing their reputation as the place that after years of service, all you get is an email from the system that you're fired. Someone after 6 years:A year ago: it seemed it could be a one-off. The second time this happens to people, is it still, though? pic.twitter.com/pEgb3JOe12 \"It's just business. They can fire you any time (and will, if it's the business interest) and you do the same and leave any time (when it's your personal interest),\" Orosz wrote. \"Forget 'loyalty' or 'commitment' both ways.\" That's probably a pretty tough thing to accept for Google workers aggrieved by the layoffs. They spent years being lavished with perks and huge salaries at a company famed for its culture of creativity and community. They might soon have to accept that Google is no longer family. On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Read next Jump to "
}