{
    "title": "Stretched Valuations And Gemini PR Blunder Put Google At Risk (NASDAQ:GOOG)",
    "date": "2/27/2024",
    "url": "https://seekingalpha.com/article/4673948-stretched-valuations-and-gemini-pr-blunder-put-google-at-risk",
    "text": "DNY59/E+ via Getty Images  DNY59/E+ via Getty Images A year ago I argued that Google's stock (NASDAQ:GOOGL) was around 50% undervalued relative to the rest of the Nasdaq 100, due to its high free cash flow yield, and the stock has since rallied 50%. While the stock still trades at a discount to the Magnificent 7 and the Nasdaq 100 on a price to free cash flow basis, it is nonetheless unattractive at these levels, particularly when taking into account the rise in stock-based compensation. There is also a risk facing the brand from the recent embarrassing Gemini AI chatbot rollout, which appears to reflect a strong corporate ideology that is at odds with a large share of its users. I am therefore shifting from a 'Buy' rating to a 'Sell' rating on the stock. Google stands out as the most reasonably valued of the Magnificent 7 stocks on a price to free cash flow basis, with a trailing P/FCF ratio of 25x. However, this figure does not take into account the surge in stock-based compensation over recent years. Google paid out $22.5bn in stock-based compensation over the past 12 months, second only to Amazon, and while not directly a cash expense it still undermines shareholder returns by increasing share dilution. On an ex-SBC basis, Google now trades at a FCF multiple of 38x. 4-Quarter Rolling Sum, $bn (Bloomberg) 4-Quarter Rolling Sum, $bn (Bloomberg) Stock-based comp has risen 46% over the past two years as the company has used its high stock price as a means of attracting talent without paying out cash. When the stock price is high, management can offer large stock benefits with little share dilution, but as this article shows, when stock prices fall they have to issue more shares to maintain the same compensation. These rising costs contrast with the trend of slowing sales growth, which has fallen below 10% over the past year. As I argued in this article, large stocks tend to trade at a discount to smaller ones in terms of their valuation multiples due to expectations that as a company matures its growth rate slows. The chart below shows the correlation between the size of a company's free cash flow and its multiple of free cash flow. Google (the red dot), like the rest of the Magnificent 7 stocks, commands a high multiple even though it already generates huge amounts of earnings. Bloomberg Bloomberg As trend growth continues to converge to the rate of GDP growth, Google shareholders are likely to realise that they overpaid for the stock. For instance, with a price to FCF-ex SBC ratio of 38x, Google would have to grow at 7.4% annually indefinitely to generate returns of 10%, and this assumes that the company pays out all its remaining free cash flow to shareholders. Bloomberg Bloomberg Google has been buying back shares aggressively, which has attracted investors, but this has come at the expense of declining balance sheet cash, which has fallen 20% over the past two years. While Google's balance sheet is still in strong shape, the rise in SBC and decline in cash will make it difficult for management to continue reducing share count. The combination of high valuations and slowing growth leave the stock exposed to negative shocks, such as the recent embarrassment surrounding the rollout of its Gemini. As this article explains, the company's new AI chatbot has come under fire for being 'too woke' in its image and text responses, and it has attracted criticism from notable personalities including Elon Musk, who tweeted the following: Twitter Twitter Vivek Ramaswamy made similar comments regarding the company's political biases: Twitter Twitter The investment and technology communities have also had some harsh words to say about Gemini. Tech billionaire Paul Graham warned that Google may 'Budlight' its brand by leaking how different the company's political opinions are from their users, in reference to last year's boycott of Bud Light on political grounds. Twitter Twitter While a boycott of Google of any scale seems unlikely, the failures of Gemini may still give Google a reputation as being out of touch with their users. The stock has reacted negatively to the developments, closing at six weeks lows after the news that it will relaunch Gemini's image feature. The stock is resting on uptrend support from last year's lows, and a close below the Feb 2 low of $136.50 would suggest much further downside. Google Share Price, Weekly (Bloomberg) Google Share Price, Weekly (Bloomberg) The main risk to my negative view comes from potential exponential growth in Google Cloud revenues and profits. Total revenues for this part of the business now exceed those of Google Network and YouTube, growing by 26% y/y in Q4 to reach 10.6% of total revenues. Google Cloud is well-placed to benefit from continued growth in AI demand, which could potentially sustain Google's revenue growth. The segment managed to generate a consistent operating profit in every quarter last year for the first time which should also support margins. However, advertising revenues still dominate Google's profitability, and it would take sustained rapid growth for Cloud profits to catch up. After a strong rally off of last year's lows, Google's valuations have become expensive, particularly after taking into account rising stock-based compensation and slowing revenue growth. Recent price action shows that the stock is susceptible to negative shocks, such as the recent Gemini chatbot rollout, which has revealed a large ideological gap between its corporate culture and the views of its customer base. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}