{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.fool.com/investing/2024/02/06/heres-how-alphabet-ai-gemini-can-be-most-valuable/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Alphabet (GOOG 0.21%) (GOOGL 0.04%) has spent about eight years focusing on artificial intelligence (AI), a market forecast to soar in the double digits this decade. This technology may revolutionize everything from work to daily life, making it an area tech companies can't ignore. Late last year, Alphabet took a particularly big step forward in the area of AI. The technology giant introduced Gemini, its strongest AI model yet and one that could help the company progress across its businesses, from Google Search to cloud computing. In fact, Alphabet says it's integrating Gemini in all of its products and services. Gemini can indeed do a lot -- from powering features in the company's Pixel 8 Pro smartphone to offering developers a building platform. But, for Alphabet, Gemini and the company's overall AI work may be most valuable in one particular area. Image source: Getty Images. As mentioned above, Alphabet has more than one business. The company offers clients cloud computing services through Google Cloud and also sells hardware such as phones and watches. But Alphabet's biggest business of all -- and the one most people are probably familiar with -- is Google Search. Google holds a 91% share of the worldwide search market, leaving even its closest rival, Microsoft's Bing, in the dust with a share of less than 4%. This leadership isn't likely to end thanks to Alphabet's solid moat, or competitive advantage, which is its comfortable position in our daily routines. Proof of that is its entrance into our language -- when you don't know something, the common reflex is to say, \"I'll Google it.\" Now, let's get back to Gemini and where it could be most valuable for Alphabet -- and that's in the area of search. The company has made the smart decision to aggressively work to improve its search engine and not just ride those waves of success. Alphabet has started to experiment with Gemini in search, and the result is it's speeding up the company's Search Generative Experience (SGE). With Gemini on board, search latency has dropped 40% in the English language, and that means searches are considerably faster. The tech giant has been developing SGE as a search platform using generative AI -- so that when you search for something, you're immediately served a general overview of the particular topic, along with links to find more in-depth information and different perspectives. All of this offers you the opportunity to gain a broader knowledge of the topic you're interested in and discover a wider range of content related to it. Today, Alphabet generates most of its revenue through Google advertising, with businesses aiming to sell their products or services to users as they use the search engine. In the most recent quarter, Google advertising represented 75% of total revenue. AI, by making searches faster and better, will keep users loyal, ensuring advertisers will keep coming back. Gemini is also directly helping advertisers build better ad campaigns through an AI-powered chat experience. Of course, this new AI model also may help Alphabet score wins across its businesses and lift revenue in both its cloud and hardware segments. But considering the company's leadership in search and the ad revenue linked to that, search is where Gemini truly could make its mark, becoming a key element to drive future revenue growth. What does this mean for investors? Alphabet has a solid track record of earnings increases and has displayed dominance in the search business and growth in its other businesses over time.  GOOG Revenue (Annual) data by YCharts And even in difficult economic environments, such as the past two years, revenue has gained. At the same time, the shares trade for only 21x forward earnings estimates, down from 30 a year ago, a bargain considering the whole picture. And that's why today is a great time to buy Alphabet -- and benefit as Gemini makes the company's top business even better. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adria Cimino has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}