{
    "title": "Alphabet (GOOG) Thrived in 2023 Despite Competition Concerns",
    "date": "2/5/2024",
    "url": "https://www.insidermonkey.com/blog/alphabet-goog-thrived-in-2023-despite-competition-concerns-1253763/",
    "text": "Investment management company First Pacific Advisors recently released its “The FPA Crescent Fund” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, the fund gained 7.52% and 20.27% in the trailing twelve months. In 2023, Crescent experienced a decrease in its net risk exposure from 74.6% to 70.1%. This decline was mainly attributed to securities that had less favorable risk/reward profiles. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. The FPA Crescent Fund featured stocks such as Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On February 2, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $143.54 per share. The one-month return of Alphabet Inc. (NASDAQ:GOOG) was 2.14%, and its shares gained 38.73% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.777 trillion. The FPA Crescent Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: “Alphabet Inc. (NASDAQ:GOOG) continued going from strength to strength during 2023 despite concerns that competition may infringe on the company’s dominant position in Search. Thus far, Alphabet has continued to hold its own, and we look forward to seeing how the company incorporates further AI developments across the Alphabet ecosystem. Lastly, we are hopeful that the impending arrival of a new CFO will bring a renewed focus on efficiency – an area where we believe Alphabet has ample room for improvement.” Pixabay/Public Domain Alphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 163 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of third quarter which was 152 in the previous quarter. We discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared Light Street Capital’s top stock picks. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors. Suggested Articles: Disclosure: None. This article is originally published at Insider Monkey. NASDAQ:GOOGYahoo FinanceDaily Newsletter Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}