{
    "title": "Alphabet Inc Class C (GOOG) Stock: How Does it Score on Fundamental Metrics?",
    "date": "2/26/2024",
    "url": "https://www.investorsobserver.com/news/stock-update/alphabet-inc-class-c-goog-stock-how-does-it-score-on-fundamental-metrics-11",
    "text": "Alphabet Inc Class C (GOOG) receives a strong  valuation score of 79 from InvestorsObserver analysis. Our proprietary scoring system considers the overall health of the company by looking at the stock's price, earnings, and growth rate to determine if it represents a good value. GOOG holds a better value than 79% of stocks at its current price. Investors who are focused on long-term growth through buy-and-hold investing will find the Valuation Rank especially relevant when allocating their assets.\n\n\n\n\n\n GOOG gets a 79 Valuation Rank today.  Find out what this means to you and get the rest of the rankings on GOOG!\nSee Full GOOG Report\n\n\nMetrics Analysis\n\nGOOG has a trailing twelve month Price to Earnings  (PE) ratio of 28.48. The historical average of roughly 15 shows a poor value for GOOG stock as investors are paying higher share prices relative to the company's earnings. GOOG's high trailing PE ratio shows that the firm has been trading above its fair market value recently. Its trailing 12-month earnings per share (EPS) of 5.22 does not justify the stock's current price. However, trailing PE ratios do not factor in the company's projected growth rate, resulting in many newer firms having high PE ratios due to high growth potential enticing investors despite inadequate earnings.\n\n\n\n\nGOOG's 12-month-forward PE to Growth  (PEG) ratio of 1.33 is considered a poor value as the market is overvaluing GOOG in relation to the company's projected earnings growth due. GOOG's PEG comes from its forward price to earnings ratio being divided by its growth rate. A PEG ratio of 1 represents a perfect correlation between earnings growth and share price. Due to their incorporation of more fundamentals of a company's overall health and focusing on the future rather than the past, PEG ratios are one of the most used valuation metrics by analysts today.\n\nSummary\n\nGOOG's valuation metrics are weak at its current price due to a overvalued PEG ratio despite strong growth. GOOG's PE and PEG are worse than the market average resulting in a below average valuation score.\n\n Click Here to get the full Report on Alphabet Inc Class C (GOOG) stock. Alphabet Inc Class C (GOOG) receives a strong  valuation score of 79 from InvestorsObserver analysis. Our proprietary scoring system considers the overall health of the company by looking at the stock's price, earnings, and growth rate to determine if it represents a good value. GOOG holds a better value than 79% of stocks at its current price. Investors who are focused on long-term growth through buy-and-hold investing will find the Valuation Rank especially relevant when allocating their assets.\n\n\n\n\n\n GOOG gets a 79 Valuation Rank today.  Find out what this means to you and get the rest of the rankings on GOOG!\nSee Full GOOG Report\n\n\nMetrics Analysis\n\nGOOG has a trailing twelve month Price to Earnings  (PE) ratio of 28.48. The historical average of roughly 15 shows a poor value for GOOG stock as investors are paying higher share prices relative to the company's earnings. GOOG's high trailing PE ratio shows that the firm has been trading above its fair market value recently. Its trailing 12-month earnings per share (EPS) of 5.22 does not justify the stock's current price. However, trailing PE ratios do not factor in the company's projected growth rate, resulting in many newer firms having high PE ratios due to high growth potential enticing investors despite inadequate earnings.\n\n\n\n\nGOOG's 12-month-forward PE to Growth  (PEG) ratio of 1.33 is considered a poor value as the market is overvaluing GOOG in relation to the company's projected earnings growth due. GOOG's PEG comes from its forward price to earnings ratio being divided by its growth rate. A PEG ratio of 1 represents a perfect correlation between earnings growth and share price. Due to their incorporation of more fundamentals of a company's overall health and focusing on the future rather than the past, PEG ratios are one of the most used valuation metrics by analysts today.\n\nSummary\n\nGOOG's valuation metrics are weak at its current price due to a overvalued PEG ratio despite strong growth. GOOG's PE and PEG are worse than the market average resulting in a below average valuation score.\n\n Click Here to get the full Report on Alphabet Inc Class C (GOOG) stock. Subscribe to our daily morning update newsletter and never miss out on the need-to-know market news, movements, and more. Thank you for signing up! You're all set to receive the Morning Update newsletter Stock Price data may be delayed up to 15 minutes. Copyright © 2024. Portions of this content may be copyrighted by Fresh Brewed Media, Investors Observer, and/or O2 Media LLC. All Rights Reserved. Portions of this content protected by US Patent numbers 7,865,496, 7,856,390, and 7,716,116. Investing in stocks, bonds, option and other financial instruments involve risks and may not be suitable for everyone. Portfolio results are unaudited and based on varying investment expiration dates. Terms of Service | Privacy Policy "
}