{
    "title": "Is Alphabet's AI Misstep a Buy Signal for GOOG Investors?",
    "date": "2/29/2024",
    "url": "https://www.tradingview.com/news/investorplace:a7385d187094b:0-is-alphabet-s-ai-misstep-a-buy-signal-for-goog-investors/",
    "text": "Alphabet GOOGL stands out among the mega-cap tech stocks in several ways. The company’s high-margin business, and its substantial global reach, are truly remarkable. Playing a role in most individuals’ every day lives, Alphabet’s core search business is integral to how the western world operates. That’s something that few companies can claim. In the world of AI, Alphabet may certainly seem like a laggard. This lack of perspective or perceived growth is one reason why GOOG stock currently trades at a relatively attractive forward price-earnings ratio of around 21-times. But there may be more than meets the eye to this quasi-legacy tech company. Here’s what to make of Alphabet’s recent announcement, and where this stock could be headed from here. AI Offers Spark Fear After pausing a controversial image generation feature, Alphabet’s stock tripped and fell 4.4%, leading to a $70 billion market value drop. Melius Research hinted that AI losses could reduce public confidence in Google’s skills and that competitors may gain from this. Because of the criticism thrown at its “Gemini” AI system, Google’s shares dropped below the 50-day moving average. In 2024, analysts predict that GOOGL’s performance won’t exceed 4.4%. Other analysts have put a spotlight on Google’s AI potential and many consider the sell-off to be overkill. Reitzes pointed out how rivals would raise eyebrows on Google’s dependability because of AI-driven features. Demis Hassabis, at the Mobile World Congress, revealed that Google is aware of the errors in its image generation. Alphabet is working hard to fix these early issues, and bring back the feature soon. GOOG Stock is Cheap for a Reason Alphabet, Google’s parent company, is fighting against some pretty stiff AI competition. This key factor has led Melius Research to deem GOOG stock “cheap for a reason.” Even with Google’s search moat, analysts are looking for disruption and reasons to invest in the stock. In January, Ronald Josey of Citi pointed out how undervalued Alphabet was compared to competitors like Microsoft, Amazon, and Meta Platforms. The market price of Alphabet is below its historical norm, trading at 20.7-times forward earnings. That’s cheap, no matter how you look at it. A company’s price-earnings ratio can help compare a valuation relative to earnings. However, these ratios can be murky, when factoring in one-time adjustments or early-stage growth prospects. While Alphabet’s AI ambitions may not justify valuation expansion to the degree its peers have seen, it’s also clear that the company’s valuation is pricing in less and less growth moving forward. I’m of the view that while Alphabet can certainly be considered one of the “old guard” in the mega-cap tech sector, it’s also a company that has plenty of levers to pull to generate cash flow growth. Thus, for now at least, the AI story could be on hold – maybe that’s a good thing for long-term investors. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}