{
    "title": "Google just can't seem to catch a break",
    "date": "2/23/2024",
    "url": "https://www.businessinsider.in/tech/news/google-just-cant-seem-to-catch-a-break/articleshow/107949048.cms",
    "text": "Liked the article? Share it with your friends... or copy link Google had a lot of AI to show off this month. The search giant announced a major upgrade to its AI model Gemini. It rolled out new open-source models called Gemma. And it introduced a new, $20 per month subscription to give users access to its top-end AI. Collectively, these announcements should have marked a milestone moment for the search giant, giving it plenty of ammunition to fire back at those who say its AI rollout has lagged the likes of OpenAI and Microsoft. Instead, Google's moment to prove critics wrong has been disrupted by a major AI blunder that it has been forced to make amends for. It simply cannot catch a break. Google's big problem came after Gemini users started to report problems this week with its image-generation feature. The model appeared to generate images of people of different ethnicities and genders, even if user prompts didn't specify them. One Gemini user, for instance, shared screenshots to X of the model's \"historically inaccurate\" response to the request: \"Can you generate images of the Founding Fathers?\" Another user said it was \"embarrassingly hard\" to get Gemini to acknowledge that white people exist.\" It's embarrassingly hard to get Google Gemini to acknowledge that white people exist pic.twitter.com/4lkhD7p5nR The problem with image generation has proven so controversial that Google stepped in on Thursday and paused the feature altogether, and said it was \"working to improve these kinds of depictions immediately.\" Naturally, the blunder was enough to drive the likes of Elon Musk into a pile-on of Google, as it fueled concerns that AI models like Gemini were becoming too \"woke.\" \"I'm glad that Google overplayed their hand with their AI image generation, as it made their insane racist, anti-civilizational programming clear to all,\" Musk wrote on X. Nathan Lambert, machine learning scientist at the Allen Institute for AI, noted in a Substack post on Thursday that the backlash was the result of Google \"too strongly adding bias corrections to their model.\" For Google, the moment is one that casts a shadow over real advances it has made in AI to keep it neck-and-neck with competitors. Gemini 1.5, which was upgraded this month, is now able to process much larger prompts from users thanks to an expanded \"context window\" of 1 million tokens. In simple terms, that means the model analyzes up to 1 million bits of data at any given time. OpenAI's GPT-4 is 128,000. This month's Google One AI premium subscription launch also gives the search giant a full package to compete with similar products, such as Microsoft's AI-enabled Copilot tool devised for its Office suite. These offerings haven't stopped the criticism from pouring in, however. In part, it's because the Gemini image generation blunder really is as bad as people say. It's also because Google has been perceived as playing catch-up in AI after being caught off guard by the launch of ChatGPT way back in November 2022. That's a strange place for Google to be in, especially as it's the company that released the seminal research paper in 2017 that kickstarted the whole generative AI movement. Google CEO Sundar Pichai has previously said he feels \"very comfortable\" about where the company is with its AI mission. This month's releases show why. His next task is getting the public comfortable too. Advertisement "
}