{
    "title": null,
    "date": "2/20/2024",
    "url": "https://markets.businessinsider.com/news/stocks/bill-ackman-gains-over-600m-on-handful-of-stock-bets-enters-top-earning-hedge-fund-managers-1033083515",
    "text": "Pershing Square Capital Management founder Bill Ackman earned a whopping $610 million in 2023, propelling him to No. 7 on Bloomberg's annual list of the highest-paid hedge fund founders. This position marks his highest-ever ranking. The investment team at Pershing Square, consisting of eight members, achieved a 26.7% gain last year on the heels of a very orthodox buy-and-hold strategy. Ackman barely moved his portfolio over the last three quarters, choosing to focus on a few shares in large companies — Pershing’s portfolio comprises only eight stocks. Ackman's portfolio slightly outpaced the S&P 500 Index, as tracked by the SPDR S&P 500 ETF Trust (NYSE:SPY). However, it fell short when compared to the more tech-oriented Nasdaq 100, which rallied 54%.  As of December 2023, Pershing Square’s portfolio was concentrated, with only eight stocks making up its composition. Remarkably, the top five holdings represented 80% of the total portfolio value, indicating a high level of conviction in these few bets. The portfolio’s standout holdings include Chipotle Mexican Grill (NYSE:CMG), Restaurant Brands International Inc. (NYSE:QSR), and Hilton Worldwide Holdings Inc. (NYSE:HLT), with portfolio percentages of 18.25%, 17.6%, and 16.2% respectively. These companies have shown robust returns in 2023, with Chipotle leading at a 65% return, followed by Restaurant Brands at 58%, and Hilton at 44%. Ackman’s Pershing Square touts significant gains primarily stemming from share-price increases in its publicly traded funds, alongside performance gains in private funds and fee income. Other high-earning hedge fund managers on the list include Millennium's Izzy Englander and Citadel's Ken Griffin. Both individuals topped the Bloomberg list with earnings of $2.8 billion and $2.6 billion, respectively. TCI Fund Management's Chris Hohn nearly reached the $1 billion mark in earnings with a portfolio of 10 U.S. stock holdings. Notably, two of these holdings — General Electric Co. (NYSE:GE) and Canadian National Railway (NYSE:CNI) — accounted for more than a quarter of his portfolio.  Now Read: Bill Ackman Breaks Wall Street Barriers, Launches Pershing Square Fund For Retail Investors Image: Bill Ackman. Collage created using photo by Center For Jewish History, NYC on Wikimedia and engin akyurt on Unsplash Indices Commodities Currencies Stocks "
}