{
    "title": "Will Nvidia Beat Amazon and Google in Joining Apple and Microsoft in the $2 \nTrillion Club?",
    "date": "2/15/2024",
    "url": "https://finance.yahoo.com/news/nvidia-beat-amazon-google-joining-093000105.html",
    "text": "Nvidia (NASDAQ: NVDA) delivered a sizzling return of nearly 240% last year. Believe it or not, the stock is on pace to generate gains that aren't too far behind that mark in 2024. Thanks to its share price soaring close to 50% so far this year, Nvidia now sports a market cap of nearly $1.83 trillion. Will the chipmaker beat Amazon (NASDAQ: AMZN) and Google parent Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) in joining Apple and Microsoft in the $2 trillion club? Microsoft currently stands at the top of the mountain with a market cap of over $3 trillion. Apple isn't too far behind, with its market cap of more than $2.8 trillion. For now, these are the only stocks with market caps above $2 trillion. Nvidia only needs to rise another 10% or so to join Apple and Microsoft in the $2 trillion club. However, Alphabet and Amazon are nipping at Nvidia's heels with market caps of $1.82 trillion and $1.77 trillion, respectively. It's a neck-and-neck race at this point. The momentum is certainly on Nvidia's side, though. Its stock performance trounced both Alphabet and Amazon in 2023 and has continued to do so thus far this year. The primary potential catalyst that could push Nvidia's market cap above the $2 trillion threshold is the strong demand for its graphics processing units (GPUs). Surging interest in generative AI is providing an ongoing tailwind for GPU demand. But Alphabet and Amazon also benefit from the generative AI boom. The two companies provide cloud services with a variety of tools to help customers build generative AI apps. Wall Street appears to be most confident about Amazon's prospects of joining the $2 trillion club soon. The average 12-month price target for Amazon reflects an upside potential of 21%. Of the 47 analysts surveyed by LSEG in February, 43 rated the stock as a buy or strong buy. Analysts are also upbeat about Alphabet. The consensus price target for the stock is 12% above the current share price. Thirty-eight of the 43 analysts surveyed by LSEG this month rate Alphabet as a buy or strong buy. What about Nvidia? There's still some enthusiasm about the chip stock on Wall Street. However, the overall mood isn't nearly as positive compared to the sentiment for Amazon and Alphabet. The average 12-month price target for Nvidia is 7% below the current share price. While 21 of the 38 analysts surveyed by LSEG in February rate Nvidia as a buy or strong buy, another 15 recommend holding the stock. One analyst rates the stock as an underperform. One analyst recommends that investors sell their Nvidia shares. This is a big swing from January, when all but five analysts rated Nvidia as a buy or a strong buy. It's probably fair to say that many on Wall Street now think that Nvidia's share price has gotten ahead of itself, even with the company's tremendous growth prospects. I'm confident that the market caps of Amazon, Alphabet, and Nvidia will top $2 trillion over time. Which stock will join the $2 trillion club first? My hunch is that it will indeed be Nvidia. Yes, the limited availability of GPUs due to strong demand is motivating customers to look to other AI chipmakers, such as AMD and to develop their own chips. Nvidia's meteoric trajectory since early last year won't be sustainable indefinitely. However, it doesn't have to be for the stock to beat Amazon and Alphabet over the near term. All three stocks need close to the same percentage gain to hit $2 trillion. Nvidia has the strongest tailwind of the three right now. Perhaps just as important, though, is that the company is likely to report its next quarterly results a day or two before Amazon and Alphabet do. Positive news could push Nvidia over the threshold. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet, Amazon, Apple, and Microsoft. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Will Nvidia Beat Amazon and Google in Joining Apple and Microsoft in the $2 Trillion Club? was originally published by The Motley Fool Related Quotes "
}