{
    "title": "Google Stock: Why I Am Doubling Down Aggressively After Q4 (NASDAQ:GOOG)",
    "date": "2/4/2024",
    "url": "https://seekingalpha.com/article/4667385-google-i-am-doubling-down-aggressively-after-q4",
    "text": "da-kuk/E+ via Getty Images da-kuk/E+ via Getty Images Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) continued to deliver strong business results in the fourth-quarter, driven by continual momentum in its digital advertising segment, Google Search. Alphabet beat estimates on both the top and the bottom line on Tuesday and continued to buy back a ton of its outstanding shares during the fourth-quarter. I also believe we are going to see the announcement of a new, potentially record-breaking, stock buyback authorization in the next two quarters. Strong business execution, Search strength and Cloud momentum all translate into a strong buy recommendation. I previously rated Google stock as a strong buy due to returning advertising spending on the company's main digital marketing platforms, Google Search and YouTube. Google continued to be a highly free cash flow-profitable enterprise in Q4'23 and the free cash flow return percentage for FY 2023 was impressive at 89%. My expectation here is for Google to announce a major stock buyback plan in the near future which could drive shares of the technology company to new highs. Google was able to top fourth-quarter top and bottom line predictions by a considerable margin this week. The technology company reported $1.64 in adjusted earnings, beating the consensus estimate by $0.04 per-share. Revenues beat the consensus estimate by more than $1.0B. Seeking Alpha Seeking Alpha At no point in the company's history did Google's advertising-focused business generate a higher amount of revenues than in the fourth quarter. Google reported Q4'23 revenues of $86.3B compared to $76.0B in Q4'22, showing a year over year growth rate of 13%. Google also achieved double-digit top line growth in FY 2023 (+10% Y/Y) and an unreal amount of operating income of $84.3B. The company's operating income soared 27% in FY 2023 due to cost-savings as well as growing demand for digital ad services. Google Google Google did especially well in Google Search, the company's main revenue and cash flow source, as well as YouTube ads which also saw a strong rebound in ad spending on its platform. YouTube ads, in my opinion, is an underrated ad revenue source for Google as it is relatively small in relation to Google's core business Search, but has double-digit growth momentum. YouTube ads achieved $9.2B in revenues in Q4'23 while Google Search delivered $48.0B. However, YouTube ad revenue growth of 16% out-performed Search growth which grew only 13%. Google Cloud also did reasonably well, growing to $9.2B in revenues (the same as YouTube ads), showing 26% year over year growth. In Q3'23, Google Cloud advanced its top line 23%, so Google saw a 3 PP revenue acceleration in the fourth-quarter, due to companies being more willing to spend money on Cloud services. This, in my opinion, has a lot to do with inflation falling towards 3% lately, removing a spending obstacle that hurt Google's Cloud operations last year when inflation was soaring. Google Google Inflation is likely going to be a top theme for digital advertising companies in FY 2024. As pressure comes off of marketers' budgets, I believe the current trends in advertising will support Google's current Search momentum in FY 2024 and beyond. As the leading Search-oriented digital marketing platform in the U.S., Google also faces favorable long term growth prospects in this core business. Digital ad spending is making a big comeback after last year's challenges, and according to eMarketer, U.S. digital ad spending is set to grow to $395B by FY 2027, implying an annual average growth rate of 11% annually. Google would be a major beneficiary of this spending comeback in the digital advertising industry and I can see free cash flow margin expansion related to a continual uptick in spending growth. Since Google generates the overwhelming majority of its revenues (and growth) from its Search business, healthy digital advertising spending trends are the biggest catalyst for an upside revaluation going forward, in my opinion. eMarketer eMarketer With inflation falling, marketers may even ramp up their spending in FY 2024: the U.S. economy just delivered a blowout jobs report, further supporting the prospects of a sustained rebound in the digital ad market. Google generated a ton of free cash flow in the fourth-quarter which of course gives the technology company a lot of firepower to buy back shares. For the fourth-quarter, Google disclosed $7.9B in free cash flow which, based off of revenues of $86.3B, calculates to a free cash flow margin of 9.1%. In total, Google generated a massive $69.5B in free cash flow in FY 2023, implying a free cash flow margin of 22.6%. With favorable ad trends on YouTube and Search also supporting Google, I am not concerned about the drop-off in the free cash flow margin in Q4'23. Google's fourth-quarter free cash flow dropped relative to prior quarters due to higher operating costs (severance payments related to lay-offs) and higher capital expenditures. Google announced that it will cut more than 12,000 jobs at the beginning of last year which has cost the company $3B in severance payments in 2023 alone. Another $700M are expected to hit Google's bottom line in Q1'24. Therefore, I expect a turnaround in Google's free cash flow as well as free cash flow margins in Q2'24. $millions Q4'22 Q1'23 Q2'23 Q3'23 Q4'23 Revenues $76,048 $69,787 $74,604 $76,693 $86,310 Net cash provided by operating activities $23,614 $23,509 $28,666 $30,656 $18,915 Less: purchases of property and equipment ($7,595) ($6,289) ($6,888) ($8,055) ($11,019) Free cash flow $16,019 $17,220 $21,778 $22,601 $7,896 Free cash flow margin 21.1% 24.7% 29.2% 29.5% 9.1% (Source: Author) In the fourth-quarter as well as in FY 2023, Google repurchased a ton of its shares. Google spent $15.4B of its money to buy back shares in Q4'23 and $61.5B in FY 2023. This translates to a free cash flow return percentage of 89% for FY 2023 meaning of every dollar generated in free cash flow, the company returned 89 cents to shareholders. In April 2023, Google's Board of Directors of Alphabet authorized a stock buyback of $70.0B of which $52.3B remained after Q3'23. Google repurchased $15.4B in stock in Q4, so the technology company has about $36.9B left in its authorization. At the current rate of buyback, Google could announce a new stock buyback within the next two quarters. Given that the company authorized two stock buyback plans of $70.0B each in FY 2022 and FY 2023, I believe we are looking at the announcement of at least another $70.0B stock buyback within the next six months, but this could be on the low side of things. I can see Google announce a much higher stock buyback authorization because of its accelerating business momentum, so investors may be able to directly benefit from the improving trajectory in Search especially. A $80-90B stock buyback would not be a crazy assumption and here's why. Google is expected to have $378B in revenues next year, assuming a 23% free cash flow margin, Google could be set to bring in $86-87B in free cash flow next year, meaning a $80-90B stock buyback is just about equal one year's worth of Google's FCF. An upsize in the stock buyback authorization would obviously be a bullish signal for Google's shares. I see a number of catalysts for Google's shares including Google's share price declined 7% the day after earnings, indicating that the market didn't appreciate the results for what they were. I found this baffling considering that Google's shares are not expensive based off of P/E and EPS estimates have reset sharply higher lately, indicating that investors have grown much more optimistic about Google's potential to grow its earnings in FY 2024 and beyond. Data by YCharts There is also a big difference between Google and Microsoft's (MSFT) price-to-earnings ratios that I believe is not justified. Google is currently trading at an 18.2X P/E ratio compared to 30.0X for Microsoft. Microsoft has been more highly valued due the potential for a rebound in the Personal Computing division as well as very strong Azure-related Cloud growth. However, Microsoft's Intelligent Cloud business saw only 20% top line growth in the last quarter compared to Google's 26% Cloud growth rate.... so I believe the big valuation gap between the two companies is not justified. Google could easily be valued at a 21-22X P/E ratio, in my opinion, given its broad upside momentum in Search, YouTube and Cloud as well as free cash flow strength... which would give Google a fair value of $164-171 per-share. Data by YCharts The main risk for Google, as I see it, is a downturn in the advertising market. Google remains heavily reliant on digital advertising spending as it generated ~78% of its revenues from its advertising services. Cloud is a good offset for a slowdown in advertising, but the segment is still quite small relative to Google's core services. Top line growth, EPS estimates and revenue momentum in YouTube ads are things that I consider worthy monitoring. The sell-off makes no sense to me and I am doubling down. Google had a very strong fourth-quarter that the market unfortunately did not appreciate: the technology company achieved record revenues which were driven in part by a continual rebound in the digital advertising market. Google benefited in both Search and YouTube from continual growth in demand for digital ads. Additionally, Google remained super profitable in Q4'23 and the company is set for a free cash flow rebound in the second-quarter as well, in my opinion. Considering how much free cash flow Google returned to shareholders in FY 2023 (89%), I consider Google deep value for long term investors. Google could also be close to announcing a record new stock buyback authorization in FY 2024 which I would consider to be a very bullish catalyst for the shares as well! This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}