{
    "title": "Alphabet faces 'clear and present danger' of falling short in AI",
    "date": "3/4/2024",
    "url": "https://cio.economictimes.indiatimes.com/news/artificial-intelligence/alphabet-faces-clear-and-present-danger-of-falling-short-in-ai/108193921",
    "text": "For a firm with the world’s biggest digital advertising business — its operations generated more than $100 billion in cash last year, with a record chunk of that going back to shareholders — the threat is simple: some other company may develop an AI-powered search engine that, as unlikely as it may seem now, makes Google obsolete. The only thing that matters to Alphabet Inc. investors is whether it can get artificial intelligence right.That was the message delivered this week as the company’s shares tumbled following news that Google’s flagship AI product was misfiring. The selloff erased $80 billion in market value in a single day, underscoring the importance investors now place on all things AI.For a firm with the world’s biggest digital advertising business — its operations generated more than $100 billion in cash last year, with a record chunk of that going back to shareholders — the threat is simple: some other company may develop an AI-powered search engine that, as unlikely as it may seem now, makes Google obsolete.\n\nAdvt\n\n\n\n\n\n“Alphabet falling behind in AI is a clear and present danger,” said Tom Graff, chief investment officer at Facet. “The downside is so significant for Alphabet that there’s really no way to price it in.”Shares fell 0.2% on Friday. The stock is negative this year, compared with a gain of about 15% for the Bloomberg Magnificent 7 Total Return Index.Such a scenario would imperil the nearly $200 billion in revenue Google is expected to generate from search this year — a business that Alphabet rides for the bulk of its profits.Alphabet has been among the most valuable companies in the world for most of the past decade, primarily because of the dominance of its web advertising business. But it’s been overtaken this year by Nvidia Corp. — whose rise has made it the poster child for the AI mania that has rearranged the stock market.While it still dominates search, and the company is hardly in existential danger, missteps in AI marked a stunning setback for a firm known for its technological prowess — raising the question of whether investors can count on Alphabet to stay at the front of the pack. More than a year after the debut of OpenAI’s ChatGPT, Alphabet is still struggling to prove that its technology can compete despite spending heavily in the field for years.As a result, the stock has been sensitive to any sign of strength or weakness on the AI front. The February slump recalled a similar event from last year, when concerns over the accuracy of its Bard chatbot spurred heavy selling, and in December, the well-received release of the company’s Gemini AI model prompted a relief rally.\n\nAdvt\n\n\n\n\n\nInvestors are so attuned to the risks of falling behind in AI that they’re turning a blind eye to a stock that is by far the cheapest of the biggest US technology companies at about 19 times profits projected over the next 12 months. Meanwhile, Alphabet’s outlook for revenue and profit growth over the coming year is in a league with Microsoft Corp. and far better than Apple’s, even though the stock trades at a big discount to both.Search is considered a primary use case for generative AI and chatbots, which means Alphabet’s dominant market share is at risk, while Microsoft — which has been incorporating AI features into Bing — has nowhere to go but up, and this factor has insulated Microsoft shares from its own controversies. \n\nAdvt\n\n\n\n\n\nSo far, Alphabet has maintained its dominance with about 91% of worldwide search share, compared with about 3.4% for Bing, according to Statista data.“Of course, it has a ‘moat’ in search, but this space is about to be disrupted,” wrote Melius Research analyst Ben Reitzes, who called Alphabet “cheap for a reason.” He added that Alphabet is outflanked by megacap peers in terms of factors like growth, recurring revenue, and margin optimization.Still, few who follow AI are counting out Alphabet. It has invested in the technology for years and boasts the kind of infrastructure and engineering talent that is seen as needed to put out a competing product.\n\nAdvt\n\n\n\n\n\nBernstein’s Mark Shmulik wrote that he felt compelled to defend Alphabet, even though he is among the 15% of analysts without a buy rating on the stock.“Ever since OpenAI launched ChatGPT in late 2022, Google’s response looks more like a body builder who’s been told his muscles are all show, picking fights and getting beat up,” he wrote. However, “at the point in time when Gen AI answers have gained consumer trust, Google should be best positioned to integrate these results alongside web query results thereby offering consumers the best of both worlds.”Getting to that point, however, could be lengthy and expensive. “They have the resources and capability to produce something credible, but we don’t know if it will be a major growth driver,” said Philip Lawlor, head of market research at Wilshire Indexes.“If you don’t have a credible product, then it becomes about survivability.” By commenting, you agree to the Prohibited Content Policy By commenting, you agree to the Prohibited Content Policy News See whats happening in Indian IT industry right now Exclusive Read and get insights from specially curated unique stories from editorial Leaders Speak Business leaders sharing their insights Events Explore and discuss challenges & trends in India's leading B2B events Awards Recognise work that not only stood out but was also purposeful Webinars Join leaders & experts for roundtables, conferences, panels and discussions Subscribe to our Daily Newsletter  By continuing you agree to our Privacy Policy & Terms & Conditions Advertise With Us We have various options to advertise with us including Events, Advertorials, Banners, Mailers, etc. Download ETCIO App Save your favourite articles with seamless reading experience Get updates on your preferred social platform Follow us for the latest news, insider access to events and more. About Us Contact Us Newsletters "
}