{
    "title": "Alphabet Inc. (GOOG) Advances While Market Declines: Some Information for \nInvestors",
    "date": "3/11/2024",
    "url": "https://finance.yahoo.com/news/alphabet-inc-goog-advances-while-214518725.html",
    "text": "The most recent trading session ended with Alphabet Inc. (GOOG) standing at $138.94, reflecting a +1.94% shift from the previouse trading day's closing. The stock outperformed the S&P 500, which registered a daily loss of 0.11%. At the same time, the Dow added 0.12%, and the tech-heavy Nasdaq lost 0.41%. Shares of the company witnessed a loss of 9.27% over the previous month, trailing the performance of the Computer and Technology sector with its gain of 1.42% and the S&P 500's gain of 2.7%. The investment community will be paying close attention to the earnings performance of Alphabet Inc. in its upcoming release. On that day, Alphabet Inc. is projected to report earnings of $1.49 per share, which would represent year-over-year growth of 27.35%. At the same time, our most recent consensus estimate is projecting a revenue of $65.95 billion, reflecting a 13.58% rise from the equivalent quarter last year. Looking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $6.77 per share and revenue of $286.48 billion. These totals would mark changes of +16.72% and +11.68%, respectively, from last year. Additionally, investors should keep an eye on any recent revisions to analyst forecasts for Alphabet Inc. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Our research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system. The Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the past month, there's been a 0.16% rise in the Zacks Consensus EPS estimate. Alphabet Inc. currently has a Zacks Rank of #3 (Hold). Looking at its valuation, Alphabet Inc. is holding a Forward P/E ratio of 20.12. This denotes a discount relative to the industry's average Forward P/E of 29.07. Investors should also note that GOOG has a PEG ratio of 1.26 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Internet - Services industry had an average PEG ratio of 2.25 as trading concluded yesterday. The Internet - Services industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 152, this industry ranks in the bottom 40% of all industries, numbering over 250. The Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Don't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}