{
    "title": "Alphabet (GOOGL) Adds Verification Feature in Google Wallet",
    "date": "3/27/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-adds-verification-feature-152400638.html",
    "text": "Alphabet’s GOOGL Google recently added a new “Verification settings” feature in Google Wallet for Android, enabling users to choose whether to verify their identity when using payment methods and passes.Notably, the new “Verification settings” feature leads to a \"Transit payments\" option that enables user identity verification before paying with a credit or debit card.Moreover, it also allows users to disable the default \"Verification required\" toggle on their default credit or debit card, allowing them to pay for transit without verification.Alphabet is expected to gain solid traction across Android users on the back of its latest move. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the Verification settings feature, Google now enables Google Wallet to import data from confirmation emails, automatically pulling movie tickets and travel boarding passes from Gmail accounts.Alphabet also announced Google Wallet updates to support open-loop payment systems, providing a dedicated page for recent activity and ride history, showing saved fare caps, connected payment methods and network-specific offerings.Additionally, the company has added 44 new banks and credit unions to Google Wallet’s list of over 3,000 banks and credit unions. The additions include local banks, credit unions, and prepaid debit cards.All the above-mentioned endeavors will likely aid Alphabet in capitalizing on growth opportunities present in the global digital wallet market. Per The Business Research Company report, the digital wallet market is expected to hit $47.7 billion in 2024 and reach $97.54 billion by 2033, witnessing a CAGR of 19.6% between 2024 and 2033.Moreover, growing Google Wallet efforts will further bolster its Android offerings. This, in turn, will boost its Google Services segment, which remains the key growth catalyst for the company. Its shares have rallied 49.1% in the past year compared with the Zacks Computer & Technology sector’s growth of 47.9%.The strengthening Google Services segment is expected to aid its overall financial performance in the near term.The Zacks Consensus Estimate for 2024 total revenues stands at $290.4 billion, indicating year-over-year growth of 13.2%. Growing Google Wallet efforts will aid Alphabet to compete well with some notable industry players like Microsoft MSFT and Apple AAPL, which are also making strong efforts to boost their presence in the booming digital wallet space.Microsoft is enjoying the growing momentum of its Edge Wallet with new feature updates.Microsoft’s Wallet app update to include the integration of a cryptocurrency wallet, providing real-time updates on cryptocurrency value fluctuations and logging transactions, remains noteworthy. The \"explore\" tab updates users on cryptocurrency news, while the \"assets\" tab displays NFTs.Meanwhile, Apple is riding on the success of its Wallet app on iPhone or Apple Watch, which securely stores various cards, IDs and other items, allowing users to carry more while minimizing their device's size. Currently, Alphabet carries a Zacks Rank #3 (Hold).A better-ranked stock in the broader technology sector is Badger Meter BMI, carrying a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Shares of Badger Meter have increased 32.7% in the past year. The long-term earnings growth rate for BMI is 12.27%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Badger Meter, Inc. (BMI) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}