{
    "title": null,
    "date": "3/25/2024",
    "url": "https://www.defenseworld.net/2024/03/25/helen-stephens-group-llc-invests-206000-in-alphabet-inc-nasdaqgoog.html",
    "text": "Posted by Defense World Staff on Mar 25th, 2024 Helen Stephens Group LLC acquired a new stake in  Alphabet Inc. (NASDAQ:GOOG – Free Report) during the fourth quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission. The institutional investor  acquired 1,460 shares of the information services provider’s stock, valued at approximately $206,000. A number of other large investors have also recently added to or reduced their stakes in GOOG. Tandem Wealth Advisors LLC acquired a new stake in  Alphabet in the 3rd quarter valued at about $25,000.  Bruce G. Allen Investments LLC acquired a new stake in  Alphabet in the 4th quarter valued at about $26,000.  HWG Holdings LP acquired a new stake in  Alphabet in the 2nd quarter valued at about $26,000.  Intrepid Capital Management Inc. acquired a new stake in  Alphabet in the 2nd quarter valued at about $31,000.  Finally, Buck Wealth Strategies LLC acquired a new stake in  Alphabet in the 3rd quarter valued at about $32,000. 27.26% of the stock is owned by institutional investors and hedge funds. Shares of GOOG stock opened at $151.77 on Monday. The firm’s 50-day simple moving average is $144.27 and its 200-day simple moving average is $139.09. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a 1-year low of $100.28 and a 1-year high of $155.20. The firm has a market cap of $1.89 trillion, a P/E ratio of 26.17, a PEG ratio of 1.40 and a beta of 1.05. Alphabet (NASDAQ:GOOG – Get Free Report) last released its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The business had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $85.28 billion. During the same period last year, the company earned $1.05 earnings per share. The company’s quarterly revenue was up 13.5% on a year-over-year basis.  As a group, equities analysts forecast that  Alphabet Inc. will post 6.77 EPS for the current year. In related news, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction that occurred on Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total value of $3,347,550.00. Following the sale, the chief executive officer now directly owns 2,310,191 shares of the company’s stock, valued at $343,710,216.98. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through this hyperlink. In related news, CAO Amie Thuener O’toole sold 425 shares of Alphabet stock in a transaction on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares in the company, valued at $3,805,628.99. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. Also, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the completion of the sale, the chief executive officer now owns 2,310,191 shares of the company’s stock, valued at approximately $343,710,216.98. The disclosure for this sale can be found here. Over the last three months, insiders have sold 279,659 shares of company stock valued at $39,460,310. Insiders own  12.99% of the company’s stock. A number of research analysts have issued reports on GOOG shares. Raymond James upped their target price on shares of Alphabet from $150.00 to $160.00 and gave the company an “outperform” rating in a report on Wednesday, January 24th. Susquehanna upped their target price on shares of Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a report on Wednesday, January 31st. Five analysts have rated the stock with a buy rating,  Based on data from MarketBeat, Alphabet currently has an average rating of “Buy” and a consensus target price of $146.33. Get Our Latest Analysis on GOOG (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.    Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Bangor Savings Bank Sells 97 Shares of The Home Depot, Inc. (NYSE:HD) "
}