{
    "title": "Prediction: Alphabet Stock Will Take Off Again... and Here's Why.",
    "date": "3/19/2024",
    "url": "https://www.fool.com/investing/2024/03/19/prediction-alphabet-stock-will-soar-heres-why/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More There is an answer for investors who fear they missed out on the big rally in technology stocks. After strong 2023 returns, Alphabet (GOOG 0.21%) (GOOGL 0.04%) stock has underperformed the tech-heavy Nasdaq Composite index so far this year. Shares of Google's parent company are up about 1% in 2024 while the index has returned nearly 7%. But with businesses including the leading online search engine, a growing YouTube social media platform, and one of the top three cloud computing platforms, Alphabet stock could be ready to take off again. Alphabet still gets most of its revenue from advertising, and an online advertising slowdown has soured investors on the company's stock. Google advertising revenue declined by more than 10% in fourth quarter of 2023 year over year. But Alphabet's cloud segment is growing and has increased its revenue share for the past several years. Google Cloud contributed nearly 11% of Alphabet's sales in 2023, compared to just 4.3% in 2018. Data Source: Statista Investors seem to think it is falling behind in the race to monetize artificial intelligence (AI) solutions, though. The company famously muddled the introduction of its Gemini AI model. But even if Alphabet is losing the sprint for a successful generative AI offering, it could be a winner in the AI marathon. That's because cloud users are integrating AI tools to modernize their businesses. The integration of AI will require more and more computing power. That's evident in the exploding revenue Nvidia has been reporting from sales of its H100 graphics processing units (GPUs). What's important for Alphabet, and specifically Google Cloud, is that AI is intensifying the adoption of cloud computing. Tim Potter, a principal at Deloitte Consulting, noted that \"Most AI solutions are either services offered directly by cloud hyperscalers or solutions built on top of a hyperscaler's cloud infrastructure.\" That's good news for leading cloud providers like Alphabet and should help to meaningfully drive its business going forward. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Howard Smith has positions in Alphabet and Nvidia. The Motley Fool has positions in and recommends Alphabet and Nvidia. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}