{
    "title": "European regulators crack down on Big Tech",
    "date": "3/22/2024",
    "url": "https://www.tradingview.com/news/reuters.com,2024:newsml_L2N3G00PZ:0-european-regulators-crack-down-on-big-tech/",
    "text": "European regulators have launched a series of probes against Big Tech. In the latest, Apple AAPL, Meta Platforms META and Alphabet's GOOG Google could receive hefty fines by the end of the year for alleged breaches including disparaging rival products on their platforms. Here are some of the actions taken by European watchdogs against big technology companies: EUROPEAN UNION Apple, Meta Platforms and Google are set to be investigated for potential violations of the European Union's Digital Markets Act (DMA) that could lead to fines of up to 10% of their global annual turnover, according to people with direct knowledge of the matter. The Commission declined to comment. Apple, Meta and Google did not immediately respond to requests for comment. In September 2023, the EU picked out 22 so-called \"gatekeeper\" services run by Alphabet, Amazon, Apple, Meta, Microsoft and TikTok-owner ByteDance, giving them six months to comply with the provisions of the DMA, legislation meant to make it easier for European users to move between competing services. Meta Platforms and ByteDance's TikTok both appealed against the \"gatekeeper\" status in November, with the latter losing a bid to suspend its designation in February. Brussels fined Apple AAPL 1.84 billion euros ($1.99 billion) on March 4, the iPhone maker's first ever EU antitrust penalty, following a 2019 complaint from Spotify SPOT. Apple criticised the EU decision, saying it would challenge it in court. An advisor to Europe's top court said on Jan. 11 the court should uphold Google's EU antitrust fine of 2.42 billion euros. The European Commission fined the company in 2017 for using its own price comparison shopping service to gain an unfair advantage over smaller European rivals. The European Commission is probing if Microsoft MSFT is preventing customers from relying on certain security software provided by its competitors, according to a document that regulators sent to at least one rival of the company in January, seen by Reuters. EU antitrust regulators said in the same month Microsoft's investment of more than $10 billion in ChatGPT maker OpenAI may be subject to EU merger rules, following a similar warning from the UK Competition and Markets Authority (CMA) last December. Last November, EU antitrust regulators asked Microsoft's rivals whether the U.S. software giant's proposal to unbundle its chat and video app Teams from its Office product was sufficient to address their concerns, after the European Commission launched an investigation into its Office and Teams tie-up in July 2023. BRITAIN Britain's media regulator last October asked the country's antitrust authority CMA to investigate Amazon and Microsoft's dominance of the UK cloud market, citing features that made it more difficult for businesses to switch or mix and match cloud providers. CMA will complete its investigation by April 2025. FRANCE France's competition watchdog on March 20 said it fined Google 250 million euros ($270.43 million) for breaches linked to EU intellectual property rules in its relationship with media publishers. The authority raided Nvidia's NVDA local offices last September, the Wall Street Journal reported. The watchdog had disclosed the raid but did not name the company beyond saying it was in the \"graphics cards sector\". Nvidia declined to comment. The antitrust authority in July 2023 said Apple may have violated regulations related to the utilisation of iPhone user data in advertising and could potentially misuse its dominant market position by imposing biased, unclear, and unfair conditions to handle user data. GERMANY Google has agreed to change its user data practices to end a German antitrust investigation aimed at curbing its data-driven market power, the German cartel office said on Oct. 5. Google's commitments would give users more choice on how their data was used across the company's platforms, the regulator said. ITALY Italy's competition watchdog fined British American Tobacco (BAT) BATS and Amazon in February a combined 7 million euros  ($7.57 million) over misleading advertising for heated tobacco products. Italy's antitrust agency said in May 2023 it had opened a probe into Apple for alleged abuse of its dominant position in the apps market. Last April, the watchdog took measures against Meta over an alleged abuse of its position in the country, in a probe involving the rights to music posted on the group's platforms. NETHERLANDS The Dutch competition regulator last October said it had rejected Apple's objections against fines of 50 million euros  ($54.09 million) it had given the company over failure to comply with regulations aimed at limiting the dominant position of Apple's App Store. Apple will appeal the decision in Dutch courts. ($1 = 0.9224 euros) Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}