{
    "title": null,
    "date": "3/6/2024",
    "url": "https://pjmedia.com/vodkapundit/2024/03/06/mea-culpa-google-is-even-more-evil-than-i-thought-n4927055",
    "text": "Let me start by telling you that I am perhaps unrivaled in my disgust for Google, parent company Alphabet, feckless CEO Sundar Pichai, and every single one of the company's products and services. I've gone so far as to switch to a paid search engine — Kagi — as part of my endless quest to remove myself forever from Google's revenue stream yet remain an internet user. That aside for a moment, I owe you an apology that I'll get to after this quick refresher on Google's latest self-own. My grudge against Google is deeply personal. Google — along with Facebook, another service I boycott — is on an endless quest to put PJ Media out of business and rob me of my income and the job I've loved for almost 20 years. So when Google faceplanted like no multibillion corporation has ever faceplanted before with last month's failed launch of its Gemini AI image generator, nobody pointed or laughed harder than I did. How bad was the launch? It made the Titanic look like the giant waterslide on a Carnival cruise ship. It was Jimmy Carter cruising to reelection. It made people decide that New Coke was way better than the original. Google Gemini faceplanted so hard, that instead of pointing derisively and letting loose with his patented \"Ha! Ha!\" Nelson Muntz reached down to help Google up off the pavement. And yet I did come partly to the company's defense — and not because my dark little heart grew three sizes that day or any mawkish garbage like that. \"Google CEO Sundar Pichai wasn't sitting at his computer in the days before the image function went live,\" I wrote two weeks ago, \"laughing, 'MUAHAHAHAHAHA! At last, I have perfected the No White Men algorithm!'\" Google Gemini, I concluded, wasn't doing anything more sinister than reflecting the Woke bias already garnishing every one of Google's crap sandwiches. Mea culpa. Mea maxima culpa. As it turns out, Google's Gemini team went to extra-special lengths to make the image generator as Woke as humanly possible, doing everything within their digital powers to lecture users, scold users, to erase white people — particularly white men — from history. Mike Solana at Pirate Wires detailed exactly what happened earlier this week, taking readers \"inside the DEI hivemind that led to Gemini's disaster.\" Here's the convoluted process that went on inside Gemini's black box before Google pulled the plug: A user makes a request for an image in the chat interface, which Gemini — once it realizes it’s being asked for a picture — sends on to a smaller LLM that exists specifically for rewriting prompts in keeping with the company’s thorough “diversity” mandates. This smaller LLM is trained with LoRA on synthetic data generated by another (third) LLM that uses Google’s full, pages-long diversity “preamble.” The second LLM then rephrases the question (say, “show me an auto mechanic” becomes “show me an Asian auto mechanic in overalls laughing, an African American female auto mechanic holding a wrench, a Native American auto mechanic with a hard hat” etc.), and sends it on to the diffusion model. Gemini's backend went through the same process no matter what the prompt was, which was why none of the Vikings were white, the Nazis were black women, etc. Solana said to a Google engineer that it looked to him that \"in a way [diversity] is the product.\" \"Yes,\" the engineer told him, “we spend probably half of our engineering hours on this.” Could I have been any more wrong about how and why Gemini failed? If there's any solace to be found, it's that several people smarter and better informed on AI than I am agreed with my initial assessment. If there's any good news to be found, it's this. AI is poised to destroy and replace search as Google defined it more than 20 years ago. Google's AI is so thoroughly corrupt that the company looks increasingly like a dinosaur surrounded by nimble little mammals — while a giant asteroid named AI hurtles toward the Earth. Recommended: There's Only One Terrifying Reason for a Woke Indoctrinated Military and This Is It P.S. Help PJ Media keep fighting Big Tech by becoming one of our VIP or VIP Gold supporters. You need independent news and analysis and we need to keep the lights on. You can join here and don't forget our massive 50% off SAVEAMERICA promo code. Steve launched VodkaPundit on a well-planned whim in 2002, and has been with PJ Media since its launch in 2005. He served as one of the hosts of PJTV, a pioneer in internet broadcasting. He also cohosts \"Right Angle\" with Bill Whittle and Scott Ott at BillWhittle.com. He lives with his wife and sons in the wooded hills of Monument, Colorado, where he enjoys the occasional adult beverage. Copyright PJMedia.com/Salem Media. All Rights Reserved. Terms under which this service is provided to you. "
}