{
    "title": "Apple, Meta and Alphabet under EU scrutiny",
    "date": "3/26/2024",
    "url": "https://www.computerweekly.com/news/366575455/Apple-Meta-and-Alphabet-under-EU-scrutiny",
    "text": "motortion - stock.adobe.com The European Commission (EC) has begun an investigation into three leading tech platform providers under the Digital Markets Act (DMA), looking at whether measures put in place by Alphabet, Apple and Meta fall short of effective compliance of their obligations under the law. The investigation will look at Alphabet’s rules on steering in Google Play and self-preferencing on Google Search; Apple’s rules on steering in the App Store and the choice screen for Safari; and Meta’s “pay or consent” model. Thierry Breton, commissioner for internal market at the European Commission, said: “We are not convinced that the solutions by Alphabet, Apple and Meta respect their obligations for a fairer and more open digital space for European citizens and businesses. Should our investigation conclude that there is a lack of full compliance with the DMA, gatekeepers could face heavy fines.” The Digital Markets Act, which became law on 7 March, defines a set of criteria for major online platforms – which it refers to as “gatekeepers” – to support interoperability with third parties and prohibit these service providers from giving preferential treatment to their own product offerings. The EC said it was concerned that Alphabet and Apple’s measures may not be fully compliant with the DMA as they impose various restrictions and limitations, which constrain software developers’ ability to freely communicate and promote offers, and directly conclude contracts, including by imposing various charges. Article 5(4) of the act requires gatekeepers to allow app developers to “steer” consumers to offers outside the gatekeepers’ app stores, free of charge. The commission said it has opened proceedings to assess whether the measures implemented by Alphabet and Apple in relation to their obligations pertaining to app stores are in breach of the DMA. Margrethe Vestager, executive vice-president in charge of competition policy at the European Commission, said: “We suspect that the suggested solutions put forward by the three companies do not fully comply with the DMA. We will now investigate the companies’ compliance with the DMA to ensure open and contestable digital markets in Europe.” The commission has also launched investigatory steps relating to Apple’s new fee structure for alternative app stores and Amazon’s ranking practices on its marketplace. It has ordered gatekeepers to retain certain documents to monitor the effective implementation and compliance with their obligations. With regards to Meta, the commission is looking into whether Facebook’s new “pay or consent” model for users in the European Union complies with Article 5(2) of the DMA, which requires gatekeepers to obtain consent from users when they intend to combine or cross-use their personal data across different core platform services. The EC said it was concerned that the binary choice imposed by Meta’s “pay or consent” model may not provide a real alternative in case users do not consent, thereby not achieving the objective of preventing the accumulation of personal data by gatekeepers. Alex Haffner, competition partner at UK law firm Fladgate, said: “The announcement of these probes is a very important development coming so soon after the DMA came into force. Ordinarily, you’d expect lawmakers to give a ground-breaking piece of legislation such as this a period of time to bed in before exercising any powers of oversight/review. “The fact that the commission has decided already to consider enforcement action demonstrates how seriously it is taking the new regime and also its absolute insistence on taking pre-emptive action to regulate big tech rather than waiting for complaints about their behaviour to filter in.” However, some industry experts believe the DMA will erode consumer protection, such as the security of apps in the Apple App Store. “Big tech companies often have a difficult reputation with the public, but it’s worth noting, for example, that Apple’s App Store is currently free from any malware. Indeed, large tech companies are generally good at ensuring their platforms are safe for their users,” said Sebastian Gierlinger, vice-president of developer experience at enterprise content management provider Storyblok. “However, the DMA may result in standards slipping substantially because existing security checks will not be possible for all side-channels. Smaller companies will also be able to more easily set up their own platforms – such as rival app stores – which is, of course, good, but it runs the risk of users not being fully protected because these startups do not have adequate resources,” he added. The OMB's new policy calls for federal agencies to be transparent about AI use and designate chief AI officers to coordinate ... Use cases for the still-developing metaverse are growing as the technologies that enable this next iteration of the internet ... Cybersecurity and cloud top the list of 2024's tech investment drivers, according to an Enterprise Strategy Group survey. But ... Threat actors used automated typosquatting attacks to lead victims to malicious python packages in yet another campaign targeting... As a company's cyber-risks evolve, so must its culture. Here are five tips for creating a cybersecurity culture that protects the... To meet the challenges of managing cyber-risk, organizations need to have a cyber-risk management plan in place. Look at five ... Green networking is achievable if network managers ensure devices and supporting systems are energy-efficient and comply with ... The cloud's effect on application management and licensing is expected to shift from end-user applications to SDN concepts. Say ... Black holes in the network disrupt connectivity and compromise data integrity. Network monitoring, team collaboration and routing... Nvidia and its partners are providing the tools and infrastructure to build and deploy AI applications that companies say could ... Data center advancements are rapidly occurring with storage demand. Some advancements, like an increase in temperatures, are ... The lift-and-shift approach moves an app and its data from one environment to another. Understanding the pros and cons can help a... The various types of database software come with advantages, limitations and optimal uses that prospective buyers should be aware... Fragmented data protection laws, technology disruptions, AI adoption, data governance and consumer trust are among the complex ... Any organization that wants to drive decision-making with data or use generative AI won't succeed without understanding how to ... All Rights Reserved, \nCopyright 2000 - 2024, TechTarget\n\n\nPrivacy Policy\n\n\n\nCookie Preferences \n\n\n\nCookie Preferences \n\n\n\nDo Not Sell or Share My Personal Information "
}