{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/alphabet-inc-nasdaqgoogl-shares-acquired-by-parisi-gray-wealth-management.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Parisi Gray Wealth Management increased its holdings in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 1.1% in the 4th quarter, Holdings Channel.com reports. The firm owned 35,579 shares of the information services provider’s stock after acquiring an additional 403 shares during the quarter. Alphabet comprises approximately  2.0% of Parisi Gray Wealth Management’s investment portfolio, making the stock its 10th largest holding. Parisi Gray Wealth Management’s holdings in Alphabet were worth $4,970,000 at the end of the most recent quarter. Several other institutional investors have also recently added to or reduced their stakes in GOOGL. Spreng Capital Management Inc. lifted its holdings in shares of  Alphabet by 4.0% in the 1st quarter. Spreng Capital Management Inc. now owns 131 shares of the information services provider’s stock worth $364,000 after purchasing an additional 5 shares during the last quarter.  West Family Investments Inc. raised its stake in  Alphabet by 0.3% during the 1st quarter. West Family Investments Inc. now owns 1,754 shares of the information services provider’s stock valued at $4,878,000 after acquiring an additional 6 shares in the last quarter.  Maple Capital Management Inc. raised its stake in  Alphabet by 2.1% during the 1st quarter. Maple Capital Management Inc. now owns 296 shares of the information services provider’s stock valued at $823,000 after acquiring an additional 6 shares in the last quarter.  Private Advisory Group LLC raised its stake in  Alphabet by 1.8% during the 1st quarter. Private Advisory Group LLC now owns 401 shares of the information services provider’s stock valued at $1,115,000 after acquiring an additional 7 shares in the last quarter.  Finally, Weik Capital Management raised its stake in  Alphabet by 0.5% during the 1st quarter. Weik Capital Management now owns 1,533 shares of the information services provider’s stock valued at $4,264,000 after acquiring an additional 8 shares in the last quarter. Hedge funds and other institutional investors own  40.03% of the company’s stock. In related news, CFO Ruth Porat sold 48,077 shares of Alphabet stock in a transaction on Friday, March 8th. The stock was sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the completion of the sale, the chief financial officer now owns 1,777,106 shares of the company’s stock, valued at $243,854,485.32. The transaction was disclosed in a legal filing with the SEC, which is available through the SEC website. In related news, CFO Ruth Porat sold 48,077 shares of Alphabet stock in a transaction on Friday, March 8th. The stock was sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the completion of the sale, the chief financial officer now owns 1,777,106 shares of the company’s stock, valued at $243,854,485.32. The transaction was disclosed in a legal filing with the SEC, which is available through the SEC website. Also, insider John Kent Walker sold 12,084 shares of the business’s stock in a transaction dated Wednesday, March 27th. The stock was sold at an average price of $151.19, for a total value of $1,826,979.96. Following the completion of the sale, the insider now directly owns 48,717 shares of the company’s stock, valued at approximately $7,365,523.23. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 263,312 shares of company stock valued at $37,268,315. Insiders own  0.88% of the company’s stock. Several brokerages have weighed in on GOOGL. Mizuho lifted their target price on Alphabet from $155.00 to $170.00 and gave the company a “buy” rating in a research note on Wednesday, January 17th. Wedbush lifted their target price on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a research note on Friday, March 22nd. Citigroup lifted their target price on Alphabet from $153.00 to $168.00 and gave the company a “buy” rating in a research note on Wednesday, January 31st. StockNews.com upgraded Alphabet from a “buy” rating to a “strong-buy” rating in a research report on Wednesday, December 20th. Finally, Wells Fargo & Company lifted their price target on Alphabet from $141.00 to $144.00 and gave the company an “equal weight” rating in a research report on Monday, March 18th. Five equities research analysts have rated the stock with a hold rating, twenty-six have issued  a buy rating and two have assigned  a strong buy rating to the stock. According to MarketBeat, Alphabet presently has an average rating of “Moderate Buy” and an average price target of $155.48. Get Our Latest Report on GOOGL Shares of GOOGL stock opened at $150.93 on Friday. Alphabet Inc. has a 1-year low of $99.78 and a 1-year high of $153.78. The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. The company has a market capitalization of $1.88 trillion, a price-to-earnings ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. The stock’s fifty day simple moving average is $143.67 and its 200-day simple moving average is $138.21. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. The business had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same quarter in the previous year, the company posted $1.05 earnings per share.  On average, sell-side analysts predict that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Alphabet Inc. (NASDAQ:GOOGL) Shares Purchased by West Wealth Group LLC Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by First National Corp MA ADV "
}