{
    "title": "Monarch Capital Management Inc. Sells 270 Shares of Alphabet Inc. \n(NASDAQ:GOOGL)",
    "date": "3/29/2024",
    "url": "https://www.defenseworld.net/2024/03/29/monarch-capital-management-inc-sells-270-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 29th, 2024 Monarch Capital Management Inc. trimmed its stake in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 2.2% during the 4th quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The fund owned 11,830 shares of the information services provider’s stock after selling 270 shares during the period. Monarch Capital Management Inc.’s holdings in Alphabet were worth $1,653,000 as of its most recent SEC filing. Several other institutional investors also recently modified their holdings of GOOGL. Live Oak Investment Partners bought a new position in  Alphabet during the fourth quarter valued at approximately $26,000.  VitalStone Financial LLC raised its holdings in  Alphabet by 1,900.0% in the second quarter. VitalStone Financial LLC now owns 280 shares of the information services provider’s stock worth $34,000 after purchasing an additional 266 shares in the last quarter.  Sanctuary Wealth Management L.L.C. bought a new position in shares of  Alphabet during the fourth quarter valued at $34,000.  Turim 21 Investimentos Ltda. bought a new position in shares of  Alphabet during the third quarter valued at $38,000.  Finally, Meritage Group LP increased its holdings in  Alphabet by 1,061.5% in the 3rd quarter. Meritage Group LP now owns 302 shares of the information services provider’s stock worth $40,000 after buying an additional 276 shares in the last quarter. 40.03% of the stock is currently owned by institutional investors. In other Alphabet news, SVP Prabhakar Raghavan sold 16,088 shares of the firm’s stock in a transaction that occurred on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total value of $2,237,840.80. Following the sale, the senior vice president now directly owns 52,440 shares of the company’s stock, valued at $7,294,404. The sale was disclosed in a filing with the SEC, which can be accessed through the SEC website. In other news, SVP Prabhakar Raghavan sold 16,088 shares of Alphabet stock in a transaction that occurred on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total value of $2,237,840.80. Following the sale, the senior vice president now directly owns 52,440 shares of the company’s stock, valued at $7,294,404. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, CAO Amie Thuener O’toole sold 425 shares of the business’s stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the transaction, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. Over the last ninety days, insiders sold 251,138 shares of company stock worth $35,427,655. 0.88% of the stock is owned by corporate insiders. Several research analysts have issued reports on the company. Needham & Company LLC  reissued a “buy” rating and issued a $160.00 target price on shares of Alphabet in a research report on Wednesday, January 31st. Truist Financial lowered their price target on Alphabet from $160.00 to $158.00 and set a “buy” rating on the stock in a report on Wednesday, January 31st. Wedbush lifted their price objective on Alphabet from $160.00 to $175.00 and gave the stock an “outperform” rating in a research note on Friday, March 22nd. Citigroup boosted their target price on Alphabet from $153.00 to $168.00 and gave the company a “buy” rating in a research report on Wednesday, January 31st. Finally, KeyCorp boosted their target price on Alphabet from $153.00 to $165.00 and gave the company an “overweight” rating in a research report on Monday, January 29th. Five analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have issued  a strong buy rating to the company. According to data from MarketBeat.com, the company presently has an average rating of “Moderate Buy” and an average target price of $155.48. View Our Latest Research Report on Alphabet Alphabet stock opened at $150.93 on Friday. The stock has a 50-day moving average of $143.52 and a two-hundred day moving average of $138.12. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. Alphabet Inc. has a one year low of $99.78 and a one year high of $153.78. The stock has a market cap of $1.88 trillion, a PE ratio of 26.02, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.60 by $0.04. The firm had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same period last year, the business posted $1.05 earnings per share.  On average, research analysts anticipate that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.    Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. San Luis Wealth Advisors LLC Makes New $204,000 Investment in JPMorgan Chase & Co. (NYSE:JPM) 1,483 Shares in Alphabet Inc. (NASDAQ:GOOGL) Acquired by O Connor Financial Group LLC "
}