{
    "title": "Microsoft's results came in above expectations, while Alphabet's fell short",
    "date": "1/26/2024",
    "url": "https://finimize.com/content/microsoft-2q24-earnings",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest 2 months ago  •  2 mins What’s going on here? Microsoft stole the show when it released results on Tuesday, leaving Alphabet lurking in the wings. What does this mean? Investors had already pulled Microsoft’s stock up by 10% this year before the world’s biggest firm announced its results, so they would’ve been hoping for evidence that their faith was well-placed. Well, they got it: Microsoft’s cloud business, Azure, made 30% more revenue last quarter than the same time last year, a little better than the 28% that markets expected. That overshadowed Alphabet: Google’s parent company saw its cloud business pick up by 26%, an improvement from the last quarter’s 22% but more than a whisper shy of Microsoft’s division. Why should I care? For markets: Dread in the clouds. Microsoft, Alphabet, and Amazon have all shared one gripe – and it’s not the world’s mounting skepticism about a future run by machines and screens. The cloud divisions in all three companies had been slowing down, with revenue at Microsoft’s branch increasing by half as much a couple of quarters ago compared to the last quarter of 2021. But these latest results will reassure investors about Microsoft’s prospects, at least, and Amazon’s upcoming announcement will paint a picture for the sector as a whole. For you personally: Tick tock, tech. The Magnificent Seven took over stock markets together last year, but that tight bond seems to be fraying a little. Tesla’s results were the financial equivalent of a failed parallel park, and while Microsoft’s stats look decent, investors seem to have an issue with Alphabet’s slower-than-expected cloud growth. Apple, Meta, and Amazon will chime in on Thursday, but Nvidia – last year’s stock market success story – is a master of suspense: the most important chipmaker in the world won’t clue investors in until later in February. alphabet amazon earnings information technology microsoft tech stocks us ai amazon exxon geopolitics Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}