{
    "title": "It's Not YouTube, It's Ad-Blockers: Why Are Your Videos Buffering Too Slow? \n- Alphabet (NASDAQ:GOOG), Alp",
    "date": "1/16/2024",
    "url": "https://www.benzinga.com/news/24/01/36636407/its-not-youtube-its-ad-blockers-why-are-your-videos-buffering-too-slow",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW YouTube has confirmed that the latest slowdown and buffering issues are not its fault and not a part of its crackdown on ad-blockers. What Happened: Following multiple user reports of Alphabet Inc.'s GOOG GOOGL YouTube slowing down and buffering too much, the Google subsidiary has stepped in to clear the air on the matter. \"Recent reports of users experiencing loading delays on YouTube are unrelated to our ad blocker detection efforts. Our help center offers troubleshooting tips for users experiencing issues,\" a YouTube spokesperson said in a statement to Benzinga. Essentially, a recent update of third-party ad-blocker extensions – AdBlock and AdBlock Plus – is what has caused this problem. See Also: Check Out These 12 Gadgets From CES 2024 You Can Buy Right Now User reports also reveal that they are using one of these two ad-blocking extensions. Another confirmation of this problem comes from the creator of a popular and open-source ad-blocker, uBlock Origin. If you had either of these ad-blockers installed and noticed degraded or slow performance on the YouTube website, you now know what was causing the problem. Note that this is a separate issue from YouTube's crackdown on ad-blockers, wherein the streaming giant had started displaying an anti-adblocker popup along with a countdown timer to users back in August 2023. The company subsequently confirmed this and encouraged users to subscribe to YouTube Premium to get rid of ads. YouTube Premium price starts at $13.99 per month. Why It Matters: Misinformation about YouTube's ad-blocker crackdown could encourage users to go for less reliable ad-blocker extensions, which poses its own security risks. A YouTube Premium subscription removes ads and allows you to play videos and music in the background on your smartphone. Subscribers can also download videos for offline playback, and creators get a percentage of the subscription fee as well. Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Apple’s Walled Garden Might Soon Open Gates For European iPhone And iPad Users To Sideload Apps Photo by Chubo – my masterpiece on Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}