{
    "title": "Google's AI Spin-Off Isomorphic Labs Strikes Big Pharma Deals, Paving the \nWay for Future of Drug Discover",
    "date": "1/8/2024",
    "url": "https://www.benzinga.com/news/24/01/36528778/googles-ai-spin-off-isomorphic-labs-strikes-big-pharma-deals-paving-the-way-for-future-of-drug-disco",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Isomorphic Labs, a London-based spin-out of Alphabet Inc GOOG GOOGL Google's AI R&D division DeepMind, has announced strategic partnerships with Eli Lilly And Co LLY and Novartis AG NVS. These alliances aim to leverage AI to discover new medications to treat diseases. The combined value of these deals is around $3 billion. Isomorphic will receive $45 million upfront from Eli Lilly, potentially earning up to $1.7 billion based on performance milestones, excluding royalties. Novartis will pay an upfront fee of $37.5 million, fund select research costs, and provide up to $1.2 billion in performance-based incentives over time, excluding royalties, TechCrunch reports. Also Read: Microsoft's New AI Tools Set to Transform Healthcare Data Management Isomorphic, established in 2021 under Alphabet, the parent company of DeepMind, utilizes DeepMind's AlphaFold 2 AI technology. This technology predicts human body protein structures, aiding in identifying new drug delivery pathways. As highlighted in a recent Nature journal article, AlphaFold's scale in generating accurate protein predictions is unmatched despite some limitations. Researchers have already used AlphaFold in designing a potential drug for hepatocellular carcinoma. DeepMind is also collaborating with the Drugs for Neglected Diseases initiative to develop therapeutics for Chagas disease and Leishmaniasis. The latest version of AlphaFold can predict structures for almost all molecules in the Protein Data Bank and accurately predict ligands, nucleic acids, and post-translational modifications. Isomorphic is applying this model to therapeutic drug design, characterizing molecular structures crucial for treating diseases. Amidst a £2.4 million loss in 2021, the pressure is on Isomorphic to become profitable as it expands operations, including opening a second office in Lausanne, Switzerland. In 2023, Google Cloud launched AI-powered search tools to consolidate data from clinical notes, scanned documents, and electronic health records into a single accessible location. GOOG Price Action: GOOG shares traded lower by 0.01% at $137.38 on premarket on the last check Monday. Also Read: Nvidia Partners with L&T for Advanced Medical Imaging, Eyes Quantum Computing with SandboxAQ Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}