{
    "title": "Google Bard Unveils Major AI Update. Google Stock Takes Flight.",
    "date": "1/19/2024",
    "url": "https://www.investors.com/research/ibd-stock-analysis/google-stock-finds-its-muse-as-google-bard-unleashes-new-ai-era/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Magnificent Seven stocks Nvidia (NVDA), Microsoft (MSFT), Amazon.com (AMZN) and Meta Platforms (META) continue to show strength as 2024 gets underway. Showing a New Year's resolution of strength and resilience, Google stock has soared back to the top of its buy range as parent Alphabet (GOOGL) unveils the biggest upgrade yet to its artificial intelligence assistant. Known as Gemini Ultra, the upgrade ushers in the next stage in the battle of AI-driven chatbots between Google Bard and Microsoft Copilot, which combines the power of Bing search with ChatGPT. Google Bard currently uses the midlevel Google Gemini Pro. Last month, Google announced that Gemini Ultra has begun to roll out in two stages. As Google's most sophisticated model, Gemini incorporates multimodal reasoning capabilities. It can run on everything from data centers to mobile devices. Starting in December, Bard has begun using a specifically tuned version of Gemini Pro in English for more advanced reasoning, planning, understanding and more. Early this year, Google plans to introduce Bard Advanced. This will give users access to Google's most advanced AI models and capabilities — starting with Gemini Ultra. How To Invest In Magnificent Seven Stocks Like Nvidia In 2024 Three Magnificent Seven members — Nvidia, Meta and Tesla (TSLA) — made the list of the best stocks of 2023. But while META and NVDA stock continue to hit record highs, Tesla stock has skidded below its 50-day and 200-day moving averages. Meanwhile, Google stock remains in buy range, alongside Microsoft. Amazon has now climbed just beyond its buy zone. Alphabet cleared a 139.42 buy point in a cup with handle on Dec. 20. Several days of heavy volume on the road to that breakout showed institutional demand. A 1.3 up/down volume ratio points to demand for Google stock. On Friday, Alphabet jumped nearly 2% to close right around the very top of its buy zone, which extends to 146.40. Volume rose as its relative strength line also perked up. With a swarm of earnings also on tap soon from Amazon, Meta and Apple (AAPL), Alphabet is scheduled to report its fourth-quarter and 2023 full-year performance on Jan. 30. Analysts forecast earnings growth of $5.75 per share, a 23% gain over the prior year. Microsoft also reports on Jan. 30. The Google Bard AI chatbot rival led this month's list of new buys by the best mutual funds. Top investors scooped up roughly $17.4 billion worth of Microsoft stock. The Q4 earnings season looms large for Alphabet, as well as fellow Magnificent Seven stocks Meta, Amazon, Apple and Microsoft. Investors may be tempted to ask Bard if Google stock is a buy with earnings due. But know that it's risky to buy any stock just before it reports. Before establising any new postions, investors can reduce risk by waiting to see how Alphabet reports and how Wall Street reacts. Follow Matthew Galgani on X (formerly Twitter) at @IBD_MGalgani. YOU MAY ALSO LIKE: Top Funds Kick Off 2024 With Huge Bet On MSFT Stock — And 1 Sector Google Stock Is Holding Up In A Rocky Market. Here's Why. How To Invest In Magnificent Seven Stocks Like Nvidia In 2024 Stock Market Forecast 2024: A Soft Landing May Not Bring The Gains You Expect Spot Buy Points And Sell Signals With MarketSmith Pattern Recognition 3/31/2024\nThe EV and hybrid sales trend will be key Q1 auto sales reports. GM, Toyota and traditional auto stocks are... 3/31/2024\nThe EV and hybrid sales trend will be key Q1... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}