{
    "title": "EU’s Vestager to meet Big Tech CEOs in the US next week",
    "date": "1/7/2024",
    "url": "https://borneobulletin.com.bn/eus-vestager-to-meet-big-tech-ceos-in-the-us-next-week/",
    "text": "CNA – European Union (EU) antitrust chief Margrethe Vestager will meet the chief executives of Apple, Alphabet, Broadcom and Nvidia in the United States next week, her communications adviser said on Friday. The meetings come a month after Vestager resumed her job following her failed bid to head the Luxembourg-based European Investment Bank, with antitrust experts expecting her to show a tougher line towards companies in both merger and competition investigations. Vestager will meet Apple chief executive officers (CEO) Tim Cook, Alphabet CEO Sundar Pichai and its chief legal officer Kent Walker, Broadcom CEO Hock Tan and Nvidia CEO Jensen Huang in San Francisco and Palo Alto on Thursday and Friday, her adviser Christina Holm Eiberg said. She will also meet OpenAI Chief Technology Officer Mira Murati and its Chief Strategy Officer Jason Kwon. The meetings will focus on European digital regulation and competition policy. The meeting with Cook comes as the iPhone maker last year offered to let rivals access its tap-and-go mobile payments systems used for mobile wallets in an effort to settle Vestager’s investigation and stave off a possible hefty fine. The European Commission is likely to seek feedback from rivals and customers this month although a final decision has not been made, people familiar with the matter told the media last month. Vestager’s meeting with Alphabet on January 11 is the same day an adviser to Europe’s top court is scheduled to offer a non-binding recommendation on whether judges should accept or reject Alphabet unit Google’s appeal against a EUR2.42-billion (USD2.6 billion) EU antitrust fine imposed for market abuse related to its shopping service. Borneo Bulletin is the leading English daily in the country. It was first published by Brunei Press. Today, Borneo Bulletin has become the foremost source of information on local and foreign affairs, and the region’s business news. © 2013 Borneo Bulletin Online - The Independent Newspaper in Brunei Darussalam, Sabah and Sarawak "
}