{
    "title": "History Says the Nasdaq Will Crush 2024. Here's 1 Artificial Intelligence \n(AI) Stock-Split Stock to Buy and Hold Forever.",
    "date": "1/14/2024",
    "url": "https://finance.yahoo.com/news/history-says-nasdaq-crush-2024-110500022.html",
    "text": "2022 was a tough year in the stock market. Concerns stemming from a challenged economy caused pronounced selling activity, sending stocks into a nosedive. The tech-heavy Nasdaq Composite dropped 33% in 2022 -- marking only the sixth time in over 50 years it's dropped by that level or more. In the midst of 2022's sell-off, Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) completed a 20-for-1 stock split. Analyzing stock-split stocks can be an interesting exercise as it may shed some light on companies that have experienced higher trading volumes and witnessed a surging share price. While stock splits do not inherently increase the value of a company, seasoned investors know that following a stock split, the company's shares typically tend to see increased demand -- given its perceived lower price -- that eventually pushes up the stock price. Since splitting in July 2022, Alphabet stock has returned about 28% -- much lower than its big tech counterparts such as Microsoft, Apple, Amazon, Meta, and Nvidia. I think a lot of this has to do with artificial intelligence (AI), and which companies are seen as emerging leaders. One could argue that Microsoft, Nvidia, and even Tesla garner the most attention when it comes to AI. Microsoft kicked off the AI race after a $10 billion investment in OpenAI, the developer behind ChatGPT. Meanwhile, demand for Nvidia's semiconductor chips, which are used to train generative AI models, is surging, and Tesla appears to be on the brink of commercially available autonomous driving. Given this level of competition, AI investors may have missed out on Alphabet's progress. In fact, billionaire hedge fund manager Bill Ackman thinks Alphabet's AI business is so overlooked that investors can buy it \"for free.\" I agree with Ackman's position and think Alphabet stock looks like a bargain. Let's dig into why 2024 could be a great time to buy some shares in this underappreciated AI leader. Since it was founded in 1971, the Nasdaq Composite has only generated negative returns 14 times. The only periods that the index had consecutive years of declining returns were in 1973 and 1974, as well as 2000, 2001, and 2002. These trends underscore the resiliency of the Nasdaq, given it tends to bounce back after a down year. However, while inflation is beginning to cool and many economists believe the Federal Reserve is finished with rate hikes, I wouldn't be surprised if the tumultuous market conditions from 2022 might still be lingering in the back of your mind -- causing some hesitation when it comes to tech stocks in particular. Over the last two decades, the Nasdaq has only dropped by 30% or more on three occasions -- 2002, 2008, and 2022. Interestingly, following the market crashes of 2002 and 2008, the Nasdaq went on to surge for consecutive years thereafter. From 2002 to 2007, the Nasdaq returned an average of 15.9% per year. And from 2009 to 2010, the index increased by an average of 30%. To be clear, the past performance of the Nasdaq doesn't guarantee future results. However, given the booming demand for AI, I think 2024 could be another robust year for tech stocks following the Nasdaq's 43% bounceback return last year. Over the last couple of years, the broader economy has been plagued with high inflation and borrowing costs, forcing companies of all sizes to reign in spending and operate on leaner budgets. These macroeconomic factors took their toll on many different sectors, and the technology landscape was particularly impacted as demand for expensive software applications started to wane. As it relates to Alphabet and its gigantic advertising business, marketers have become increasingly selective in how to allocate campaign dollars. It should come as no surprise that this put Alphabet at the center of an intense battle among competing social media platforms TikTok, Facebook, and Instagram. Nevertheless, Alphabet has invested significant capital into new products and services -- which are already helping the company return to growth. It's been integrating AI capabilities across its entire ecosystem, including areas such as Google Cloud, Google Search, video-sharing website YouTube, and productivity tools within Google Workspace. Additionally, the release of its ChatGPT competitor called Gemini could just be the catalyst the company needs to be considered a leader among AI developers. Yet despite all of these exciting gains, Alphabet stock isn't garnering a premium commensurate with its big-tech counterparts -- making the stock a tempting buy at its current valuation. The chart above illustrates the forward price-to-earnings (P/E) multiples for the \"Magnificent Seven\" stocks. At a forward P/E of 20.3, Alphabet stock is effectively tied for last place with Meta. Moreover, this is right in line with the S&P 500's forward P/E of 20.7 -- possibly signaling that investors don't expect Alphabet to outperform the broader markets. To me, Alphabet stock is absurdly undervalued. Despite cooling inflation and the possibility of Federal Reserve tapering interest rates this year, I suspect that many are wary over the company's growth prospects. More specifically, the company's rebound in advertising in 2023 is encouraging -- but keep in mind that revenue only increased 7% year over year through the first nine months of 2023. I think this is a short-sighted concern, especially with 2024 containing tailwinds that could boost digital advertising platforms. Furthermore, Alphabet is making notable strides in cloud computing -- a market largely dominated by Amazon and Microsoft right now. There's no doubt that Alphabet has a lot to prove. But keep in mind that the stock has returned over 5,300% to investors since its initial public offering in 2004. Even just a $1,000 investment 20 years ago would now be worth roughly $54,000. To me, this underscores Alphabet's strong performance over a long-term time horizon. While the company will likely continue fending off an increasing number of competitors, I think management is taking impressive actions to diversify Alphabet's products and services and building the foundation for long-term sustained growth. With the stock trading at such a bargain, now looks like an amazing opportunity to scoop up shares and hold on for the ride. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Alphabet wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of December 18, 2023  Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has a disclosure policy. History Says the Nasdaq Will Crush 2024. Here's 1 Artificial Intelligence (AI) Stock-Split Stock to Buy and Hold Forever. was originally published by The Motley Fool Related Quotes "
}