{
    "title": "Is Alphabet Stock a Buy?",
    "date": "1/15/2024",
    "url": "https://www.fool.com/investing/2024/01/15/is-alphabet-stock-a-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Investors in internet giant Alphabet (GOOGL 0.04%) went for a fun ride in 2023. Share prices soared by 58% last year, a tremendous feat for a company worth over a trillion dollars. Are you considering buying this \"Magnificent Seven\" stock today? It might feel silly after such a run. But don't be too quick to move on to something else. Alphabet could benefit from solid catalysts in its core business, and the financials paint an interesting picture of the stock's valuation. Is Alphabet stock a buy? The answers lie below. Alphabet is a lot of things. It sells cloud products, dabbles in artificial intelligence (AI), and creates software that people use worldwide. But at the end of the day, it's an advertising business. Its key websites, Google and YouTube, are routinely the top two most heavily trafficked sites in the world by a wide margin. It creates a massive audience, and selling ads is very lucrative. Of the company's $76.6 billion in total revenue in Q3, $59.6 billion, or 78%, came from ads. Despite intense discussion around AI and Alphabet's other projects, the business goes where its advertising business goes. The good news is Alphabet could be poised for an excellent year. According to a report by Forbes, industry-wide ad spending stabilized over the back half of 2023 and should accelerate in 2024. Several high-profile events (some unfortunate, some good) are already taking place, and more are expected to happen over the next 12 months. People seek information on geopolitical tensions and war in Ukraine and the Middle East. Meanwhile, there is a presidential election happening in America this year, and the 2024 Olympic Games are taking place this summer in Paris. Alphabet's pole position in search and video will likely translate to a boost in ads. Most stocks aren't cheap after rising over 50% in a year. However, Alphabet could be an exception. While 2023 was an exciting rally, most probably forgot the stock's run began when shares were already down 45% from their high. You can see that the stock's rise did push its valuation higher. Alphabet's price-to-earnings ratio (P/E) was once in the mid-teens, a bargain for one of Wall Street's most powerful corporations. You often hear how the broader market can be irrational -- well, this is a prime example. Today, at over 21 times estimated earnings, Wall Street has come to its senses a bit.  GOOGL PE Ratio (Forward) data by YCharts But even at this higher valuation, calling Alphabet expensive could be a stretch. Analysts believe the company could grow earnings by an average of nearly 18% annually over the long term. Using the PEG ratio, Alphabet's ratio of 1.2 is very reasonable, assuming the company achieves that growth. The risk to investors is that Alphabet falls short, and the market punishes the stock, ruining your investment returns. How likely is that? Alphabet is one of the world's best businesses when it comes to generating cash flow. Roughly $0.29 of every revenue dollar ends up as free cash flow. And because Alphabet is such a large company, that has added up to over $77 billion over the past year alone. Management is using its cash flow to gobble up the company's stock, repurchasing shares to help boost its earnings growth. That creates a floor that should help the company keep earnings growth going, reducing the chances the stock falls on its face. Alphabet has reduced its outstanding shares by 10% over the past five years. Ultimately, Alphabet is a stock you can justify buying whenever the valuation is reasonable or better. Given the potential ad business strength in 2024, solid valuation, and ongoing share repurchases, investors can confidently buy the stock today. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}