{
    "title": "Alphabet (GOOGL) to Boost Google TV Services With New Feature",
    "date": "1/17/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-boost-google-tv-152300792.html",
    "text": "Alphabet GOOGL is continuously bolstering its Google TV capabilities with new feature updates to capitalize on the growth opportunities present in the global smart streaming devices market. Per a Statista report, the global smart streaming devices market size is expected to witness a CAGR of 14.7% during the forecast period of 2023-2030.In this regard, the company announced the availability of a new audio switcher for Google TV in the upcoming months.This new feature, set to be present in Google TV's Quick Settings option, will enable users to switch between Bluetooth headphones and TV speakers without navigating to the full Settings menu.Alphabet is expected to gain solid traction across smart TV users on the back of its latest move. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the latest announcement, Google introduced a new \"Call notifications\" option on Google TV, enabling select apps to send calls to the TV and allowing users to toggle on and off this feature in the Settings app.Alphabet expanded its Google TV content portfolio by adding a slew of apps and services like ABC, Amazon’s AMZN Prime Video, Apple’s AAPL Apple TV+, AMC and Kocowa, among others.Also, the company extended its Google TV services to several other regions, including Brazil, France, Germany and Japan, among others.All the above-mentioned endeavors will strengthen the company’s Google TV offerings. This, in turn, is expected to aid the Google Services segment’s performance, which has been a key growth driver for the company. Alphabet shares have gained 56.1% in the past year compared with the Zacks Computer & Technology sector’s growth of 45.1%.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, indicating year-over-year growth of 15.6%. The estimate has been revised upward by 0.7% in the past 30 days. Alphabet’s growing efforts to boost its Google TV offerings will enable this Zacks Rank #3 (Hold) company to compete well against some notable industry players like Apple, Amazon and Roku ROKU, which are also making concerted efforts to gain a solid footing in the streaming devices market. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Notably, Apple revealed a selection of immersive original stories for Apple TV+ using Apple Immersive Video, which will be available in the Apple TV app on Apple Vision Pro on February 2.Further, Apple introduced the Zoom video conferencing app to its Apple TV 4K. The app, known as “Zoom for Home TV,” utilizes iOS' Continuity Camera feature for meetings, offering calendar integration and easy-to-access shortcuts for upcoming meetings on Apple TV.Meanwhile, Amazon is enjoying the growing momentum of its Fire TV line-up.Amazon partnered with Panasonic to combine Fire TV's personalized streaming experience and Alexa access with Panasonic's top-of-the-line smart TVs for global customers, boosting its smart streaming device offerings.Roku, on the other hand, is expanding its smart streaming device offerings with new feature updates for Roku TV.Roku introduced user-friendly features for Roku TV in its 'What to Watch' section, including 'Recommendations,' 'Save Lists' and 'Continue Watching.' These features aim to assist users in finding suitable TV shows and movies, offering personalized suggestions based on previous viewing, location, time and device. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Roku, Inc. (ROKU) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}