{
    "title": "Is Alphabet Stock a Buy for 2024?",
    "date": "1/6/2024",
    "url": "https://www.fool.com/investing/2024/01/06/is-alphabet-stock-a-buy-for-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Many tech stocks went up during 2023 thanks to the rise of artificial intelligence (AI). Among them was Alphabet (GOOG 0.21%) (GOOGL 0.04%), which uses AI across a number of products, including its ubiquitous Google search engine. Alphabet's fortunes switched from its stock hitting a 52-week low of $84.86 last January, to a 52-week high of $142.68 by the day after Christmas. So what's in store for 2024? Well, the new year is already shaping up to be an interesting one for the company. Alphabet faces some potentially major upheavals in 2024, and these factors can affect the decision to invest in Alphabet. So it's prudent to review these events to determine if Alphabet is a stock to buy in the new year. One key factor that could affect Alphabet shares is the company's decision to phase out third-party cookies from its popular Chrome web browser. These cookies are used by advertisers to target you with digital ads based on your activities on the internet, such as the websites you visited. This online tracking raised consumer privacy concerns. So Alphabet decided to move away from third-party cookies, which would eliminate the current targeting mechanism advertisers rely on. It's such a big deal, many in the advertising industry call this end to third-party cookies \"Chrome-ageddon\" because Chrome is the world's top-ranked web browser, commanding about a 64% market share. Apple's Safari browser is in second place, with a 20% share. Alphabet kicks off a months-long process of gradually phasing out third-party cookies in the first quarter of 2024. The company is transitioning Chrome to the Privacy Sandbox, a system Google developed. The Privacy Sandbox limits sharing information about your online activity with third parties. Instead, the data stays on the device you're using, and is accessed by websites or apps you visit to serve you ads targeted to your interests. In this way, Privacy Sandbox tries to balance consumer and advertiser needs. This also means Alphabet will possess oversight of the data collected from Chrome users, giving it a potent incentive for advertisers to continue spending their budgets with the company. A successful transition to Privacy Sandbox is important because advertising accounted for $59.6 billion of Alphabet's $76.7 billion in Q3 revenue. After Privacy Sandbox is in place, it could strengthen Alphabet's economic moat in the digital advertising industry. After all, advertisers would be hard-pressed to skip running ads on the company's globally popular products, such as Google and YouTube. However, Google's search engine supremacy drew the attention of the U.S. Justice Department, which brought an antitrust lawsuit against the company. The suit focuses on Alphabet's payments to companies, such as Apple, to make Google the default search engine on their platforms. The trial is ongoing, with closing arguments scheduled for May. The outcome could range from a fine to Alphabet being forced to restructure its business. Alphabet recently lost a separate antitrust lawsuit related to its Android mobile app store. But these sales accounted for only a portion of Google's other, non-advertising revenue, which brought in $8.3 billion in Q3, far less than the $44 billion Google's search engine advertising delivered. Yet the case against Google's search dominance may not bring grim tidings. Microsoft underwent a similar antitrust lawsuit in 1998 over payments to internet service providers to boost adoption of its Internet Explorer browser. The company reached a settlement. Since then, Microsoft's stock price has increased over the years. So if Alphabet can also achieve a settlement in its antitrust case, its business could remain prosperous in the long run. The company is doing well, as its Q3 revenue of $76.7 billion represents an 11% year-over-year increase. Alphabet's transition from third-party cookies and the antitrust lawsuit against Google may deliver a bumpy ride for its stock price in 2024. Yet over the long term, Alphabet remains a compelling growth investment. Its 11% year-over-year Q3 sales increase is complemented by strong financials. The company's Q3 assets totaled $396.7 billion, with $119.9 billion of that in cash, cash equivalents, and marketable securities. Contrast this with total liabilities of $123.5 billion. Moreover, Alphabet benefits from the booming global digital advertising industry, estimated to rise from 2023's $680 billion to $966 billion by 2028. The company also possesses other growth engines, including its cloud computing business, Google Cloud. Now, AI offers Alphabet another avenue of revenue expansion. The AI industry is forecasted to balloon 20-fold by 2030. So buying and holding Alphabet stock long term makes sense, since any price fluctuations in 2024 can pale compared to the company's revenue growth opportunities over the long run. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Robert Izquierdo has positions in Alphabet, Apple, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Apple, and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}