{
    "title": "Top Picks From Wall Street: 2 Magnificent Growth Stocks to Buy Now and Hold \nLong-Term",
    "date": "2/25/2024",
    "url": "https://www.fool.com/investing/2024/02/25/top-picks-from-wall-street-2-growth-stocks-to-buy/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More BMO Capital selected Alphabet (GOOGL 0.04%) (GOOG 0.21%) as a top pick in 2024, citing its long-standing leadership in artificial intelligence (AI). Analysts noted that its Google subsidiary has been integrating machine learning capabilities into its core products for more than two decades, giving the company a head start relative to many peers. Similarly, JPMorgan Chase selected Uber Technologies (UBER -1.43%) as a top pick in 2024, citing its strong market presence in ridesharing and food delivery. Analysts noted its success with new products like grocery and retail delivery and mentioned that recent increases in driver supply should improve efficiency by reducing the need for incentives. Here's what investors should know. Alphabet reported fourth-quarter results that beat expectations on the top and bottom lines. Revenue increased 13% year over year to $86.3 billion and GAAP earnings soared 56% to $1.64 per diluted share due to effective cost control and share repurchases. The stock still dropped following the report because advertising revenue narrowly missed expectations, but the investment thesis for Alphabet remains sound. Alphabet subsidiary Google is the largest ad tech company in the world. Its 39% market share last year was double that of its closest competitor, according to Statista. That dominance is due to its ownership of popular platforms like Google Search, YouTube, and Chrome, which let the company engage internet users and source data on a massive scale. Meanwhile, Google Cloud is the third-largest cloud infrastructure and platform services (CIPS) provider. The company still trails Amazon and Microsoft by a wide margin, but investments in product development and go-to-market capabilities are driving market share gains. Google accounted for 11% of CIPS spending in the fourth quarter, up from 10% one year earlier. Google is using artificial intelligence to create new monetization opportunities across both businesses. For instance, the company has added generative AI features to Google Search to improve the user experience and create organic advertising opportunities. It has also retooled Google Ads with generative AI that helps media buyers create campaigns and adapt content on the fly to better fit search queries. Innovations of that nature should help Google retain its leadership in digital advertising. Meanwhile, Google recently introduced Gemini, a multimodal model designed to compete with GPT-4, the brainpower behind the OpenAI application ChatGPT Plus. Google Cloud customers can use Gemini to develop custom generative AI applications that span several media types, including text, images, video, and code. Gemini could support further market share gains in cloud computing. Looking ahead, Wall Street expects Alphabet to grow sales at 10% annually over the next five years. That consensus estimate makes its present valuation of 5.9 times sales look reasonable. Investors should feel comfortable buying a small position in this growth stock today. Uber was one of the 10 best-performing stocks in the S&P 500 in 2023, and the company finished the year with a solid fourth-quarter report. Monthly active platform consumers rose 15% year over year to 150 million and trips rose 24% to 2.6 billion. In turn, revenue increased 15% to $9.9 billion on strong growth in mobility and delivery services, offset by a decline in freight sales. Meanwhile, GAAP net income more than doubled to reach $1.4 billion as the company reduced headcount and pulled back on stock-based compensation to boost profitability. Management says headcount discipline in the coming quarters will result in further margin expansion. Any improvements in profitability should help the company reinforce its leadership in ridesharing and food delivery by supporting continued investments in product development. Uber has introduced several products in recent years that have lifted engagement and created new monetization opportunities. Uber Connect offers same-day delivery and package returns, and Uber Direct is a delivery-as-a-service solution for businesses. The company has also branched into grocery and retail delivery, added advertising opportunities for businesses, and partnered with Alphabet subsidiary Waymo to integrate autonomous vehicles in Phoenix. Additionally, Uber has unlocked synergies between its mobility and delivery businesses by rolling them into a single app and using each service to promote the other. That strategy cuts customer acquisition costs in half, and it has deepened its user relationships. As of the fourth quarter, 34% of monthly consumers used multiple products, up from 21% three years earlier. Looking ahead, Wall Street expects Uber to grow sales at 14% annually over the next five years. That consensus estimate makes its current valuation of 4.4 times sales look reasonable. Long-term investors prepared to hold the stock for at least five years should consider buying a small position today. JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Amazon. The Motley Fool has positions in and recommends Alphabet, Amazon, JPMorgan Chase, Microsoft, and Uber Technologies. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}