{
    "title": "From Silicon Valley To Sandy Beaches: Google Cofounder Larry Page \nReportedly Makes Silent $32M Purchase O",
    "date": "2/3/2024",
    "url": "https://www.benzinga.com/news/24/02/36921680/from-silicon-valley-to-sandy-beaches-google-cofounder-larry-page-reportedly-makes-silent-32m-purchas",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Alphabet Inc. GOOG GOOGL Google co-founder, Larry Page, has added a $32 million private island in Puerto Rico to his collection. What Happened: The island, Cayo Norte, was purchased in 2018 through a limited liability company, US Virgin Island Properties, of which Page and his wife, Lucinda Southworth, are trustees. The island was bought in two sections, a larger one for $28.7 million and a smaller one for $3.4 million, reported Business Insider. Cayo Norte, known for its white sandy beaches, coral reefs, and as a refuge for endangered sea turtles, is the fifth island in Page’s collection, spanning the Caribbean and the South Pacific. The island was previously owned by local developer Dan Shelley, who acquired it in 2006 through SVI Investments. See Also: Google Layoffs: Tech Giant’s 2024 Severance Costs To Hit $700M By March, Outpacing 2023’s Average The sale was conducted so privately that several local land officials in Puerto Rico were unaware of the change in ownership. Page’s plans for the island remain unknown, with no applications for development filed since the ownership change. Page’s interest in Cayo Norte dates back to 2013, according to a deposition from a court case in 2016. Page’s net worth stands at $128 billion, and it remains to be seen whether he will preserve Cayo Norte in its natural state. Why It Matters: Page's acquisition of the Cayo Norte island comes amidst a trend of tech billionaires investing in private islands and large-scale properties. Meta Platforms Inc. CEO Mark Zuckerberg has been developing a $100 million compound on the Hawaiian island of Kauai since 2023. He has also initiated a project to raise cattle fed on macadamia nuts and beer on his Hawaiian ranch. Former Google CEO Eric Schmidt has also been purchasing beachfront properties in Miami – he reportedly acquired two adjacent beachfront properties worth $63 million on Miami's Sunset Islands. Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Inside Mark Zuckerberg’s $100M Lavish, Hush-Hush Hawaiian Hideaway Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Wikimedia © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}