{
    "title": "Cisco To Fire Thousands",
    "date": "2/10/2024",
    "url": "https://247wallst.com/consumer-electronics/2024/02/10/cisco-to-fire-thousands/",
    "text": "Cisco (NASDAQ: CSCO) is set to fire thousands of workers, according to Reuters. The router company has about 65,000 workers. Cisco joins Microsoft (NASDAQ: MSFT), Alphabet (NASDAQ: GOOG), and Meta (NASDAQ: META) as huge tech companies with pruned headcounts. Usually, the reason given is that they hope to be more “efficient.” This implies that they overhired at some point. Another reason for the cuts is that AI can do work once done by humans. Unlike most mega-cap tech companies, Cisco’s stock has struggled. It is up only 7% in the last year, against the S&P 500’s 23%. Microsoft’s shares are up 60% over the same period. These are the reasons to avoid Cisco shares. Analysts have been pessimistic about Cisco’s prospects. The company cut guidance when it last announced earnings. For the most recently reported quarter, revenue rose only 8% to $14.7 billion. Net income rose 36% to $3.6 billion. While margins were strong, most mega-cap tech companies posted double-digit revenue gains when they announced results from their most recent quarters. While other companies, notably Microsoft, have said AI would be a critical part of their futures and trigger sharp revenue growth, Cisco’s plans are much more modest. Its most recent announcement about AI is that it would add AI to its “networking cloud” business. The market did not reward the plans by sharply bidding Cisco’s stock up. The lack of major AI plans may have hurt Cisco’s stock. It has certainly been hit by weak guidance. ALERT: Today Could Be Your Best Shot At Early Retirement (Sponsored) If you want to retire before 65, pay attention. Study after study has shown that the longer you stay invested, the better your chances at an early retirement. Every day that goes by without saving and investing for tomorrow means more to earn and save later. Don’t waste any more time and get started with Robinhood today. The app makes it easy to buy and sell stocks, mutual funds, trade options, and even cryptocurrencies. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}