{
    "title": "Ontario Teachers Pension Plan Board Makes New Investment in Alphabet Inc. \n(NASDAQ:GOOGL)",
    "date": "2/28/2024",
    "url": "https://www.americanbankingnews.com/2024/02/28/ontario-teachers-pension-plan-board-makes-new-investment-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by ABMN Staff on Feb 28th, 2024 Ontario Teachers Pension Plan Board bought a new position in shares of Alphabet Inc. (NASDAQ:GOOGL – Free Report) in the 3rd quarter, HoldingsChannel.com reports. The firm bought 4,596,856 shares of the information services provider’s stock, valued at approximately $601,545,000. Alphabet accounts for about 6.5% of Ontario Teachers Pension Plan Board’s portfolio, making the stock its 2nd biggest position. Other institutional investors have also recently added to or reduced their stakes in the company. Vanguard Group Inc. raised its stake in Alphabet by 1,919.4% during the 3rd quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock worth $45,628,484,000 after acquiring an additional 453,413,389 shares in the last quarter. State Street Corp grew its stake in Alphabet by 1,900.6% during the 3rd quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock worth $20,770,809,000 after buying an additional 206,300,042 shares during the last quarter. Moneta Group Investment Advisors LLC boosted its stake in Alphabet by 111,197.8% during the 4th quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock worth $15,036,178,000 after purchasing an additional 170,267,122 shares during the period. Price T Rowe Associates Inc. MD boosted its stake in Alphabet by 1,759.2% during the 3rd quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock worth $11,106,502,000 after purchasing an additional 109,870,525 shares during the period. Finally, Norges Bank acquired a new stake in Alphabet during the 4th quarter worth $8,335,063,000. Hedge funds and other institutional investors own 35.08% of the company’s stock. In other Alphabet news, CAO Amie Thuener O’toole sold 420 shares of the firm’s stock in a transaction on Friday, December 1st. The stock was sold at an average price of $133.32, for a total value of $55,994.40. Following the sale, the chief accounting officer now directly owns 26,833 shares in the company, valued at $3,577,375.56. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this link. In other Alphabet news, CAO Amie Thuener O’toole sold 420 shares of the business’s stock in a transaction on Friday, December 1st. The stock was sold at an average price of $133.32, for a total transaction of $55,994.40. Following the completion of the transaction, the chief accounting officer now owns 26,833 shares in the company, valued at approximately $3,577,375.56. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this hyperlink. Also, Director Frances Arnold sold 230 shares of the firm’s stock in a transaction on Tuesday, January 30th. The shares were sold at an average price of $154.06, for a total value of $35,433.80. Following the transaction, the director now directly owns 15,104 shares in the company, valued at $2,326,922.24. The disclosure for this sale can be found here. Insiders sold a total of 208,350 shares of company stock worth $29,602,709 in the last three months. 0.88% of the stock is owned by insiders. Several analysts have commented on the company. Mizuho upped their price objective on Alphabet from $155.00 to $170.00 and gave the company a “buy” rating in a research note on Wednesday, January 17th. BMO Capital Markets boosted their price objective on shares of Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a research note on Wednesday, January 31st. Truist Financial lowered their price objective on Alphabet from $160.00 to $158.00 and set a “buy” rating on the stock in a report on Wednesday, January 31st. KeyCorp lifted their price objective on Alphabet from $153.00 to $165.00 and gave the company an “overweight” rating in a report on Monday, January 29th. Finally, Wedbush reissued an “outperform” rating and set a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Five research analysts have rated the stock with a hold rating, twenty-seven have issued a buy rating and two have given a strong buy rating to the company. Based on data from MarketBeat, the company currently has a consensus rating of “Moderate Buy” and a consensus target price of $153.65. Read Our Latest Report on GOOGL Shares of NASDAQ:GOOGL opened at $138.88 on Wednesday. Alphabet Inc. has a 1-year low of $89.32 and a 1-year high of $153.78. The company’s fifty day moving average is $142.98 and its two-hundred day moving average is $136.80. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. The stock has a market capitalization of $1.74 trillion, a price-to-earnings ratio of 23.94, a price-to-earnings-growth ratio of 1.33 and a beta of 1.06. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. The firm had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter last year, the company posted $1.05 earnings per share. Equities analysts anticipate that Alphabet Inc. will post 6.78 EPS for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Deutsche Bank AG Buys 4,738 Shares of Progyny, Inc. (NASDAQ:PGNY) Envestnet Portfolio Solutions Inc. Invests $426,000 in Hess Co. (NYSE:HES) "
}