{
    "title": null,
    "date": "2/13/2024",
    "url": "https://techeconomy.ng/chipmaker-nvidia-surges-past-amazon-alphabet-to-become-fourth-most-valuable-company/",
    "text": "Home » Chipmaker Nvidia Surges Past Amazon, Alphabet to Become Fourth Most Valuable Company Source: Nvidia This brings Nvidia among the top four most valuable companies in the world, with Microsoft retaining the number one spot. Nvidia’s success is fueled by investor confidence in its dominance within the thriving Artificial Intelligence (AI) market. Just 15 months ago, Nvidia’s market cap sat below $300 billion, dwarfed by Amazon and Alphabet’s valuations exceeding $1 trillion each. However, the company’s strategic focus on the growing AI field attracted huge investor interest, driving its stock price by over 400% in that timeframe. This surge has landed Nvidia the title of the fourth most valuable public company globally, trailing only Microsoft, Apple, and Saudi Aramco. This achievement strengthens the company’s standing as a leading producer of the semiconductor chips that power advanced AI technologies. Wall Street’s enthusiasm for Nvidia comes from its potential in the AI market and its outstanding financial performance. The company’s earnings before interest, taxes, depreciation, and amortization (EBITDA) skyrocketed over 500% year-over-year last quarter, primarily driven by its AI unit’s explosive growth. This far outpaced the respectable 20% earnings growth seen by Amazon and Alphabet during the same period. While Nvidia’s gross revenue and profits currently lag behind its larger peers (its $9.2 billion profit last quarter pales in comparison to Apple and Microsoft’s $22 billion profits), analysts anticipate rapid growth that will narrow the gap. Despite its impressive run-up in 2024, Nvidia remains a popular choice among Wall Street analysts. Both Goldman Sachs and Bank of America maintain “buy” ratings with $800 price targets, suggesting further potential for an 8% upside. Nvidia’s success isn’t confined to the recent AI trend. Over the past decade, its stock has delivered a 17,000% return, far exceeding any other company on the S&P 500. This performance dwarfs even fellow chipmaker Advanced Micro Devices, the second-best performer at over 5,600%. A $1,000 investment in Nvidia a decade ago would be worth a staggering $175,000 today. All eyes are on Nvidia’s upcoming earnings report next Wednesday, where analysts expect the company to deliver its third consecutive quarter of record sales and profits. With its AI leadership and investor confidence surging, Nvidia’s journey seems ready to continue its commendable growth direction. Joan thrives at helping individuals and businesses scale via storytelling... The Microsoft Garage - Africa Development Center (ADC - West Africa), Wednesday, hosted a highly informative workshop, with a specific... Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Privacy Policy Agreement *\n I agree to the Terms & Conditions and Privacy Policy.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Follow Us © 2023 Techeconomy - Designed by Opimedia. © 2023 Techeconomy - Designed by Opimedia. "
}