{
    "title": "India Antitrust Body To Probe Google's In-App Billing Amid Dispute With \nStartups",
    "date": "3/17/2024",
    "url": "https://www.india.com/technology/india-antitrust-body-to-probe-googles-in-app-billing-amid-dispute-with-startups-6794277/",
    "text": "click this icon for latest updates  Published: March 17, 2024 10:49 PM IST By Reuters NEW DELHI/BENGALURU: India’s antitrust body on Friday ordered a probe into Alphabet Inc’s Google (GOOGL.O), opens new tab in an ongoing dispute with local startups over its in-app billing system, saying the U.S. company implemented its policies in a “discriminatory manner”. Indian startups have been at odds with Google for months over the fee it charges for in-app payments.\\  The dispute escalated earlier this month after Google removed more than 100 Indian apps from its app store for violations related to billing, though it restored them after the Indian government intervened. The startups had asked the Competition Commission of India (CCI) to look into the matter and the watchdog on Friday ordered an investigation, saying: “Google is implementing its policies in a discriminatory manner”.\n\n The CCI also directed its investigation unit to complete the probe within 60 days.” We are examining CCI’s order initiating the investigation,” a Google spokesperson said in an emailed response to Reuters, adding that the company will cooperate with the process “in every way”. \n\nThe dispute centres on efforts by some Indian startups to stop Google from imposing a fee of 11% to 26% on in-app payments, after the country’s antitrust authorities ordered it to dismantle a system of charging 15% to 30% in 2022. Google denies wrongdoing and says it charges the fee for supporting investments in Google Play app store and the Android mobile operating system, ensuring it distributes it for free. The CCI has already spent months looking into startups’ complaint that Google is not following the earlier antitrust directive that prevents it from taking adverse measures against companies which use alternate billing systems.\nAlso Read:  \n\n\n  \n\n\nCCI Orders Probe Into Google Play Store, Details Here\n\n\n \n \n\n\n  \n\n\nGovt Has Assured Us Support On Google's New Play Store Policies: Startup Founders\n\n\n \n \n\n\n  \n\n\nGoogle Play Store: Majority Of Apps Yet To Be Relisted Says Internet And Mobile Association of India\n\n\n \n  \nFor breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest\n                        News News on India.com.\n                \n\n\nTopics\nGoogle Play StoreAlphabet IncCompetition Commission of India (CCI) \n\n\n\n\nMore Stories   The dispute escalated earlier this month after Google removed more than 100 Indian apps from its app store for violations related to billing, though it restored them after the Indian government intervened. The startups had asked the Competition Commission of India (CCI) to look into the matter and the watchdog on Friday ordered an investigation, saying: “Google is implementing its policies in a discriminatory manner”.  The CCI also directed its investigation unit to complete the probe within 60 days.” We are examining CCI’s order initiating the investigation,” a Google spokesperson said in an emailed response to Reuters, adding that the company will cooperate with the process “in every way”. The dispute centres on efforts by some Indian startups to stop Google from imposing a fee of 11% to 26% on in-app payments, after the country’s antitrust authorities ordered it to dismantle a system of charging 15% to 30% in 2022. Google denies wrongdoing and says it charges the fee for supporting investments in Google Play app store and the Android mobile operating system, ensuring it distributes it for free. The CCI has already spent months looking into startups’ complaint that Google is not following the earlier antitrust directive that prevents it from taking adverse measures against companies which use alternate billing systems. For breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest\n                        News News on India.com. India Antitrust Body To Probe Google's In-App Billing Amid Dispute With Startups OnePlus Nord CE 4 Confirmed To Launch In India: Know Expected Price, Specs, Features Here Samsung Galaxy A55, A35 DXOMARK Review: Comparing The Latest Samsung Releases POCO X6 Neo vs Nothing Phone 2a: Which Is The Better Option Under Rs 25,000 Motorola To Launch Edge 50 With Snapdragon 8 Gen 3 In India? Here's Everything You Need To Know India Antitrust Body To Probe Google's In-App Billing Amid Dispute With Startups CCI Orders Probe Into Google Play Store, Details Here Govt Has Assured Us Support On Google's New Play Store Policies: Startup Founders Google Play Store: Majority Of Apps Yet To Be Relisted Says Internet And Mobile Association of India Google Reinstates Shaadi.com Naukri Other Apps On Play Store Amid Criticism By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts Cookies Policy. "
}