{
    "title": "Scharf Investments LLC Trims Stake in Alphabet Inc. (NASDAQ:GOOGL)",
    "date": "3/23/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-sec-filing-2024-03-23/",
    "text": "Scharf Investments LLC cut its stake in Alphabet Inc. (NASDAQ:GOOGL - Free Report) by 73.3% during the 4th quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission (SEC). The firm owned 10,854 shares of the information services provider's stock after selling 29,863 shares during the quarter. Scharf Investments LLC's holdings in Alphabet were worth $1,516,000 as of its most recent SEC filing. Several other large investors have also recently bought and sold shares of GOOGL. DE Burlo Group Inc. grew its holdings in Alphabet by 520.0% during the 2nd quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider's stock worth $11,551,000 after acquiring an additional 80,934 shares during the last quarter. West Tower Group LLC bought a new stake in shares of Alphabet in the 2nd quarter valued at $88,000. Ballast Advisors LLC boosted its stake in shares of Alphabet by 9.6% in the 3rd quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider's stock valued at $2,061,000 after purchasing an additional 1,385 shares during the last quarter. Quantum Financial Advisors LLC boosted its stake in shares of Alphabet by 8.0% in the 3rd quarter. Quantum Financial Advisors LLC now owns 7,623 shares of the information services provider's stock valued at $998,000 after purchasing an additional 564 shares during the last quarter. Finally, Acadian Asset Management LLC boosted its position in Alphabet by 2.4% during the third quarter. Acadian Asset Management LLC now owns 4,416,533 shares of the information services provider's stock valued at $577,908,000 after acquiring an additional 104,366 shares during the last quarter. 35.08% of the stock is owned by institutional investors. In other Alphabet news, SVP Prabhakar Raghavan sold 16,088 shares of the stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the completion of the transaction, the senior vice president now directly owns 52,440 shares in the company, valued at $7,294,404. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is accessible through this hyperlink. In other news, SVP Prabhakar Raghavan sold 16,088 shares of Alphabet stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total value of $2,237,840.80. Following the completion of the sale, the senior vice president now directly owns 52,440 shares of the company's stock, valued at approximately $7,294,404. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this link. Also, CAO Amie Thuener O'toole sold 425 shares of Alphabet stock in a transaction on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now directly owns 27,259 shares of the company's stock, valued at $3,805,628.99. The disclosure for this sale can be found here. In the last 90 days, insiders have sold 279,659 shares of company stock worth $39,460,310. 0.88% of the stock is currently owned by company insiders. A number of equities analysts have issued reports on the stock. Wedbush lifted their price objective on shares of Alphabet from $160.00 to $175.00 and gave the stock an \"outperform\" rating in a report on Friday. Truist Financial decreased their target price on Alphabet from $160.00 to $158.00 and set a \"buy\" rating on the stock in a research note on Wednesday, January 31st. Wolfe Research increased their target price on Alphabet from $170.00 to $180.00 and gave the company an \"outperform\" rating in a research note on Wednesday, January 31st. Roth Mkm reduced their target price on shares of Alphabet from $166.00 to $164.00 and set a \"buy\" rating on the stock in a report on Wednesday, January 31st. Finally, Mizuho raised their price target on Alphabet from $155.00 to $170.00 and gave the stock a \"buy\" rating in a research report on Wednesday, January 17th. Five research analysts have rated the stock with a hold rating, twenty-six have assigned a buy rating and two have given a strong buy rating to the company. According to MarketBeat.com, Alphabet presently has a consensus rating of \"Moderate Buy\" and a consensus target price of $155.48. Check Out Our Latest Research Report on GOOGL Shares of NASDAQ GOOGL traded up $3.17 during midday trading on Friday, hitting $150.77. 29,211,769 shares of the company's stock were exchanged, compared to its average volume of 37,022,856. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a twelve month low of $99.74 and a twelve month high of $153.78. The stock's 50 day moving average price is $143.02 and its 200-day moving average price is $137.79. The firm has a market cap of $1.87 trillion, a P/E ratio of 25.99, a PEG ratio of 1.36 and a beta of 1.04. Alphabet (NASDAQ:GOOGL - Get Free Report) last announced its earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. During the same period in the prior year, the business posted $1.05 earnings per share. Equities research analysts anticipate that Alphabet Inc. will post 6.77 EPS for the current year. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.See AlsoFive stocks we like better than AlphabetStock Dividend Cuts Happen Are You Ready?MarketBeat Week in Review – 3/18 – 3/22Stock Splits, Do They Really Impact Investors?KB Home: Building on Strong Foundations During Volatile TimesThe Significance of a Trillion-Dollar Market Cap Goes Beyond a NumberNike Stock and the 30% Rally That's Expected  Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Which stocks are likely to thrive in today's challenging market? Click the link below and we'll send you MarketBeat's list of ten stocks that will drive in any economic environment. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}