{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by Capital Investment Advisors \nLLC",
    "date": "3/15/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-sec-filing-2024-03-15/",
    "text": "Capital Investment Advisors LLC boosted its holdings in Alphabet Inc. (NASDAQ:GOOGL - Free Report) by 3.4% in the 4th quarter, according to its most recent filing with the Securities & Exchange Commission. The institutional investor owned 351,924 shares of the information services provider's stock after purchasing an additional 11,560 shares during the quarter. Alphabet accounts for about 1.2% of Capital Investment Advisors LLC's portfolio, making the stock its 15th largest holding. Capital Investment Advisors LLC's holdings in Alphabet were worth $49,160,000 at the end of the most recent quarter. Several other hedge funds and other institutional investors have also bought and sold shares of the business. DE Burlo Group Inc. raised its position in shares of Alphabet by 520.0% in the 2nd quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider's stock valued at $11,551,000 after buying an additional 80,934 shares in the last quarter. Montag A & Associates Inc. grew its holdings in Alphabet by 2.1% during the 2nd quarter. Montag A & Associates Inc. now owns 129,511 shares of the information services provider's stock worth $15,502,000 after acquiring an additional 2,670 shares during the last quarter. West Tower Group LLC bought a new stake in Alphabet during the 2nd quarter worth approximately $88,000. Fisher Asset Management LLC grew its holdings in Alphabet by 1.4% during the 2nd quarter. Fisher Asset Management LLC now owns 42,725,279 shares of the information services provider's stock worth $5,114,215,000 after acquiring an additional 579,305 shares during the last quarter. Finally, Ballast Advisors LLC grew its holdings in Alphabet by 9.6% during the 3rd quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider's stock worth $2,061,000 after acquiring an additional 1,385 shares during the last quarter. Institutional investors and hedge funds own 35.08% of the company's stock. A number of research analysts recently issued reports on GOOGL shares. BMO Capital Markets boosted their target price on shares of Alphabet from $170.00 to $178.00 and gave the company an \"outperform\" rating in a research report on Wednesday, January 31st. Mizuho boosted their target price on shares of Alphabet from $155.00 to $170.00 and gave the company a \"buy\" rating in a research report on Wednesday, January 17th. Needham & Company LLC reiterated a \"buy\" rating and set a $160.00 target price on shares of Alphabet in a research report on Wednesday, January 31st. KeyCorp boosted their target price on shares of Alphabet from $153.00 to $165.00 and gave the company an \"overweight\" rating in a research report on Monday, January 29th. Finally, Citigroup upped their price objective on shares of Alphabet from $153.00 to $168.00 and gave the stock a \"buy\" rating in a report on Wednesday, January 31st. Five research analysts have rated the stock with a hold rating, twenty-seven have assigned a buy rating and two have given a strong buy rating to the company. According to MarketBeat, Alphabet has a consensus rating of \"Moderate Buy\" and a consensus target price of $153.65. View Our Latest Stock Analysis on GOOGL Shares of GOOGL traded down $1.92 during mid-day trading on Friday, reaching $141.18. The company's stock had a trading volume of 49,460,588 shares, compared to its average volume of 31,628,977. The stock has a market cap of $1.76 trillion, a PE ratio of 24.34, a P/E/G ratio of 1.29 and a beta of 1.04. The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a 52 week low of $95.50 and a 52 week high of $153.78. The company's fifty day moving average price is $142.32 and its two-hundred day moving average price is $137.34. Alphabet (NASDAQ:GOOGL - Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping analysts' consensus estimates of $1.60 by $0.04. The firm had revenue of $86.31 billion during the quarter, compared to analyst estimates of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same period in the previous year, the business posted $1.05 EPS. On average, analysts predict that Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. In related news, CEO Sundar Pichai sold 22,500 shares of the company's stock in a transaction on Wednesday, December 20th. The shares were sold at an average price of $141.43, for a total transaction of $3,182,175.00. Following the completion of the sale, the chief executive officer now directly owns 2,407,688 shares in the company, valued at approximately $340,519,313.84. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available at this link. In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the business's stock in a transaction on Wednesday, December 20th. The shares were sold at an average price of $141.43, for a total transaction of $3,182,175.00. Following the transaction, the chief executive officer now directly owns 2,407,688 shares of the company's stock, valued at approximately $340,519,313.84. The sale was disclosed in a legal filing with the SEC, which can be accessed through the SEC website. Also, Director Frances Arnold sold 230 shares of the business's stock in a transaction on Tuesday, January 30th. The shares were sold at an average price of $154.06, for a total transaction of $35,433.80. Following the transaction, the director now directly owns 15,104 shares in the company, valued at $2,326,922.24. The disclosure for this sale can be found here. Insiders sold 279,159 shares of company stock worth $39,220,185 in the last three months. 0.88% of the stock is owned by insiders. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.Further ReadingFive stocks we like better than AlphabetHealth Care Stocks Explained: Why You Might Want to InvestWhy Dollar General and Dollar Tree Are Similar Yet DifferentHow Investors Can Find the Best Cheap Dividend StocksJabil Stock Implodes: Market Manufactures Entry for New Money3 Grocery Stocks That Are Proving They Are Still Essential Flutter Receives Major Upgrades: Investor Interest Skyrockets  Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's guide to investing in 5G and which 5G stocks show the most promise. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}