{
    "title": null,
    "date": "3/25/2024",
    "url": "https://www.goodreturns.in/news/3-faang-stocks-lost-47-billion-how-apple-google-meta-amazon-may-face-10-20-fines-on-turnover-by-eu-1338349.html",
    "text": "FAANG giants Apple Inc, Google's parent Alphabet Inc, and Meta Platforms nosedived overnight, losing cumulatively 47 billion dollars in a single trading session. The reason why investors are bearish on these big techs is because of possible penalties by the European Union which is investigation the companies for non-compliance. While woes of Apple have further intensified after the US Justice Department's lawsuit with allegations of monopoly. Overnight, the iPhone maker Apple Inc's share price dived by 0.83% to end at $170.85 on Nasdaq. This second-largest company in the world lost massive money to the tune of $22.27 billion on Monday, with market value now at $2.659 trillion. Meanwhile, Alphabet Inc's Class C share price dipped by 0.41% to end at $151.15. Due to this, Google's parent lost about $7.75 billion in a single-day, taking its market value to $1.880 trillion. Coming to Mark Zuckerberg's Meta Platforms, formerly known as Facebook, recorded a drop of 1.29% in its share price to end at $503.02. Following this, Meta's market cap saw a decline of $16.98 billion to $1.299 trillion as of March 25, 2024. These three FAANG stocks together lost 47 billion dollars on March 25. These FAANG shares witnessed mayhem after the European Commission confirmed that it opened non-compliance investigations under the Digital Markets Act (DMA) an, into Alphabet's rules on steering in Google Play and self-preferencing on Google Search, Apple's rules on steering in the App Store and the choice screen for Safari and Meta's \"pay or consent model\". According to the Commission's statement, they suspect that the measures put in place by these gatekeepers fall short of effective compliance with their obligations under the DMA. Additionally, the Commission launched investigatory steps relating to Apple's new fee structure for alternative app stores and Amazon's ranking practices on its marketplace. Finally, the Commission has ordered gatekeepers to retain certain documents to monitor the effective implementation and compliance with their obligations, it said. If found guilty, these companies may face penalties of 10% and as high as 20% on worldwide turnover. World's 2nd Largest Stock Lost 3 Billion In 1 Day; Why US Filed Lawsuit, And Should You Buy-On-Dips? Details of what the Commission is investigating: Here, the Commission opened proceedings to assess whether the measures implemented by Alphabet and Apple about their obligations to app stores are in breach of the DMA. Article 5(4) of the DMA requires gatekeepers to allow app developers to \"steer\" consumers to offers outside the gatekeepers' app stores, free of charge. The Commission is concerned that Alphabet's and Apple's measures may not be fully compliant as they impose various restrictions and limitations. These constrain, among other things, developers' ability to freely communicate and promote offers and directly conclude contracts, including by imposing various charges. Alphabet's measures to prevent self-preferencing Investigation is carried out to determine whether Alphabet's display of Google search results may lead to self-preferencing about Google's vertical search services (e.g., Google Shopping; Google Flights; Google Hotels) over similar rival services. Proceedings are undergoing against Apple over their measures to comply with obligations to (i) enable end users to easily uninstall any software applications on iOS, (ii) easily change default settings on iOS and (iii) prompt users with choice screens which must effectively and easily allow them to select an alternative default service, such as a browser or search engine on their iPhones. Further, proceedings against Meta involve determining whether the recently introduced \"pay or consent\" model for users in the EU complies with Article 5(2) of the DMA which requires gatekeepers to obtain consent from users when they intend to combine or cross-use their data across different core platform services. Even Jeff Bezos' Amazon is under the scrutiny. The Commission revealed that they are also taking other investigatory steps to gather facts and information to clarify whether Amazon may be preferencing its brand products on the Amazon Store in contravention of Article 6(5) of the DMA, and Additionally, they are also looking into Apple's new fee structure and other terms and conditions for alternative app stores and distribution of apps from the web (sideloading) may be defeating the purpose of its obligations under Article 6(4) of the DMA. Apart from this, the Commission has also adopted five retention orders addressed to Alphabet, Amazon, Apple, Meta, and Microsoft, asking them to retain documents which might be used to assess their compliance with the DMA obligations, to preserve available evidence and to ensure effective enforcement. It also needs to be noted that the Commission has given Meta an extension of 6 months to comply with the interoperability obligation (Article 7 DMA) for Facebook Messenger. The decision is based on a specific provision in Article 7(3)DMA and follows a reasoned request submitted by Meta. Facebook Messenger remains subject to all other DMA obligations. The proceedings will be concluded within 12 months. And in case of infringement, the Commission said, it can \"impose fines up to 10% of the company's total worldwide turnover. Such fines can go up to 20% in case of repeated infringement. Moreover, in case of systematic infringements, the Commission may also adopt additional remedies such as obliging a gatekeeper to sell a business or parts of it, or banning the gatekeeper from acquisitions of additional services related to the systemic non-compliance.\" The DMA aims to ensure contestable and fair markets in the digital sector. "
}