{
    "title": "Financiere des Professionnels Fonds d investissement inc. Has $21.08 \nMillion Stock Position in Alphabet Inc ...",
    "date": "3/26/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-sec-filing-2024-03-26/",
    "text": "Financiere des Professionnels Fonds d investissement inc. reduced its holdings in shares of Alphabet Inc. (NASDAQ:GOOGL - Free Report) by 30.3% during the 4th quarter, according to its most recent 13F filing with the SEC. The fund owned 150,880 shares of the information services provider's stock after selling 65,564 shares during the period. Alphabet makes up 1.8% of Financiere des Professionnels Fonds d investissement inc.'s investment portfolio, making the stock its 6th largest holding. Financiere des Professionnels Fonds d investissement inc.'s holdings in Alphabet were worth $21,076,000 as of its most recent SEC filing. Other hedge funds and other institutional investors also recently bought and sold shares of the company. First Financial Corp IN lifted its stake in shares of Alphabet by 0.9% in the 4th quarter. First Financial Corp IN now owns 9,077 shares of the information services provider's stock worth $1,268,000 after acquiring an additional 80 shares during the period. Archvest Wealth Advisors Inc. lifted its stake in shares of Alphabet by 6.1% in the 4th quarter. Archvest Wealth Advisors Inc. now owns 5,774 shares of the information services provider's stock worth $807,000 after acquiring an additional 334 shares during the period. NovaPoint Capital LLC lifted its stake in shares of Alphabet by 2.5% in the 4th quarter. NovaPoint Capital LLC now owns 11,842 shares of the information services provider's stock worth $1,654,000 after acquiring an additional 288 shares during the period. Richelieu Gestion SA lifted its stake in shares of Alphabet by 11.6% in the fourth quarter. Richelieu Gestion SA now owns 40,602 shares of the information services provider's stock valued at $5,672,000 after purchasing an additional 4,222 shares during the period. Finally, Salem Investment Counselors Inc. lifted its stake in shares of Alphabet by 3.4% in the fourth quarter. Salem Investment Counselors Inc. now owns 277,593 shares of the information services provider's stock valued at $38,777,000 after purchasing an additional 9,017 shares during the period. 40.03% of the stock is owned by hedge funds and other institutional investors. Several brokerages recently commented on GOOGL. Redburn Atlantic raised their price objective on shares of Alphabet from $150.00 to $165.00 and gave the company a \"buy\" rating in a research note on Wednesday, January 31st. Roth Mkm cut their target price on shares of Alphabet from $166.00 to $164.00 and set a \"buy\" rating for the company in a research report on Wednesday, January 31st. JMP Securities lifted their target price on shares of Alphabet from $150.00 to $160.00 and gave the stock a \"market outperform\" rating in a research report on Wednesday, January 31st. KeyCorp lifted their target price on shares of Alphabet from $153.00 to $165.00 and gave the stock an \"overweight\" rating in a research report on Monday, January 29th. Finally, BMO Capital Markets lifted their target price on shares of Alphabet from $170.00 to $178.00 and gave the stock an \"outperform\" rating in a research report on Wednesday, January 31st. Five analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have assigned a strong buy rating to the company's stock. Based on data from MarketBeat.com, the company presently has a consensus rating of \"Moderate Buy\" and an average price target of $155.48. Get Our Latest Stock Report on GOOGL Shares of NASDAQ GOOGL traded up $0.60 during trading on Tuesday, reaching $150.67. 21,964,030 shares of the stock were exchanged, compared to its average volume of 31,435,551. The business's 50-day moving average price is $143.17 and its 200 day moving average price is $137.93. Alphabet Inc. has a twelve month low of $99.74 and a twelve month high of $153.78. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The company has a market capitalization of $1.87 trillion, a price-to-earnings ratio of 25.98, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL - Get Free Report) last posted its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating the consensus estimate of $1.60 by $0.04. The firm had revenue of $86.31 billion for the quarter, compared to analysts' expectations of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same period in the prior year, the company posted $1.05 earnings per share. As a group, equities analysts forecast that Alphabet Inc. will post 6.77 EPS for the current fiscal year. In related news, CEO Sundar Pichai sold 22,500 shares of the company's stock in a transaction on Wednesday, January 3rd. The shares were sold at an average price of $140.11, for a total value of $3,152,475.00. Following the sale, the chief executive officer now directly owns 2,422,691 shares of the company's stock, valued at $339,443,236.01. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available at this hyperlink. In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the business's stock in a transaction on Wednesday, January 3rd. The shares were sold at an average price of $140.11, for a total transaction of $3,152,475.00. Following the completion of the sale, the chief executive officer now owns 2,422,691 shares in the company, valued at $339,443,236.01. The transaction was disclosed in a legal filing with the SEC, which can be accessed through the SEC website. Also, insider John Kent Walker sold 28,281 shares of the business's stock in a transaction on Thursday, December 28th. The shares were sold at an average price of $141.40, for a total transaction of $3,998,933.40. Following the sale, the insider now owns 25,002 shares of the company's stock, valued at approximately $3,535,282.80. The disclosure for this sale can be found here. Insiders have sold 279,659 shares of company stock valued at $39,460,310 over the last ninety days. Corporate insiders own 0.88% of the company's stock. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.Featured StoriesFive stocks we like better than AlphabetInvesting in Travel Stocks Benefits3 Stocks With Unusual Call Option ActivityWhat to Know About Investing in Penny StocksTrump Media & Technology Group Soars on Market DebutShould You Add These Warren Buffett Stocks to Your Portfolio?3 Stocks Insiders Are Buying That Analysts Love  Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of the 10 best stocks to own in 2024 and why they should be in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}