{
    "title": "Google's newest office has AI designers toiling in a Wi-Fi desert",
    "date": "3/7/2024",
    "url": "https://www.marketscreener.com/quote/stock/ALPHABET-INC-24203373/news/Google-s-newest-office-has-AI-designers-toiling-in-a-Wi-Fi-desert-46122027/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) SAN FRANCISCO, March 7 (Reuters) - Google has been\ntouting the myriad innovations in the first building wholly\ndesigned and built by the web giant, even moving workers in to\nfocus on its highest-profile project: generative artificial\nintelligence. But, some say they wish the innovations had\nincluded decent Wi-Fi. The \"Bay View\" building, located on the Alphabet\nunit's Mountain View, California, headquarters, has been plagued\nfor months by inoperable or, at best, spotty Wi-Fi, according to\nsix people familiar with the matter. Its recliner-laden collaborative workspaces do not work well\nfor teams carting around laptops, since workers must plug into\nethernet cables at their desks to get consistent internet\nservice. Some make do by using their phones as hotspots. The company promoted the new building and surrounding campus\nin a 229-page glossy book highlighting its cutting-edge\nfeatures, such as \"Googley interiors\" and \"an environment where\neveryone has the tools they need to be successful.\" But, a Google spokeswoman acknowledged, \"we’ve had Wi-Fi\nconnectivity issues in Bay View.\" She said Google \"made several\nimprovements to address the issue,\" and the company hoped to\nhave a fix in coming weeks. According to one AI engineer assigned to the building, which\nalso houses members of the advertising team, the wonky Wi-Fi has\nbeen no help for Google pushing a three day per week\nreturn-to-office mandate. \"You’d think the world’s leading internet company would have\nworked this out,\" he said. Like others, he spoke to Reuters on\nthe condition of anonymity because Google has not authorized\nthem to talk about work conditions. Managers have encouraged workers to stroll outside or sit at\nthe adjoining cafe where the Wi-Fi signal is stronger. Some were\nissued new laptops recently with more powerful Wi-Fi chips. Google has not publicly disclosed the reasons for the\nWi-Fi problems, but workers say the 600,000-square-foot\nbuilding’s swooping, wave-like rooftop swallows broadband like\nthe Bermuda Triangle. Beneath that oceanic roof, Google employees are racing to\nroll out the latest versions of the advanced artificial\nintelligence software known as Gemini, a key to Google's future.\nSuch AI has become a Silicon Valley sensation following the\nbroad release of ChatGPT in late 2022. Asked by Reuters if the campus has ample Wi-Fi, Gemini\nappeared cautiously optimistic. \"It is highly likely that the\nBay View campus has Wi-Fi,\" the software replied. \"As the headquarters of a major tech company, Google, it\nwould be surprising if it did not.\"\n(Reporting by Greg Bensinger; Additional reporting by Max\nCherney in San Francisco; Editing by David Gregorio) Alphabet a 'Clear' Beneficiary of Generative AI, Wedbush Says March 22, 2024 at 11:54 am EDT Alphabet is in a league of its own Partnerships or mergers in disguise? Regulators examine the link between Microsoft and OpenAI  Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}