{
    "title": "Google Search Sees Revenue Gains As It Integrates AI 01/31/2024",
    "date": "3/19/2024",
    "url": "https://www.mediapost.com/publications/article/393093/google-search-sees-revenue-gains-as-it-integrates.html",
    "text": "Username Password Remember me Forgot your password? Subscribe today to gain access to every Research Intelligencer article we publish as well as the exclusive daily newsletter, full access to The MediaPost Cases, first-look research and daily insights from Joe Mandese, Editor in Chief. If you're already a paid subscriber, please sign-in. Username Password  \n                                      Forgot?  Log in if you are already a member Username Password  \n                                      Forgot?  Alphabet reported double-digit revenue growth during\nlast year’s final quarter. Fourth-quarter revenue rose 13% to $86.3 billion, beating the Street’s expectations of 12% growth, while operating income jumped 30% to $23.7 billion. The results, announced Tuesday, linked several consecutive quarters of revenue growth for Google with most of the sales coming through search and online advertising. “We are\npleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud,” Google CEO Sundar Pichai said in the earnings report, adding that investments in artificial\nintelligence (AI) drove the increase. “As we enter the Gemini era, the best is yet to come,” he said. Gemini is Google’s family of AI models that can understand and\ncommunicate through many types of prompts such as text, images and audio. advertisement advertisement During the earnings call, Pichai said generative AI (GAI) will fold into search, and AI tools will be tailored to\nboost long-term advertising sales in the new search experience. Google advertising revenue rose 11% to $65.5 billion in Q4, while Google Search and Other rose 12.7% to $48.02 billion, but came\nin slightly lower than analysts’ estimates of $48.1 billion. YouTube ads rose 15.5% to $9.2 billion, while Google subscriptions, platforms and devices rose 22.7% to $10.79 billion.\nGoogle Cloud rose 25.7% to $9.19 billion. Percentage-wise, the real winner was “Other Bets,” which rose 191% to $657 million. Google Network fell 2.1% to $8.3 billion. Alphabet also reported that for 2023, it took charges related to employee severance of $2.1 billion, with $1.2 billion in exit charges for the last three months of the year. advertisement "
}