{
    "title": "Alphabet Stock Slides Despite Earnings Beat. Ad Revenue Was a Slight Miss.",
    "date": "1/31/2024",
    "url": "https://www.barrons.com/livecoverage/microsoft-alphabet-google-amd-earnings-stock-price-today/card/alphabet-stock-falls-despite-earnings-beat-oyQyYivyTqR3QWByzJai",
    "text": "LIVE COVERAGE | CONCLUDED Last Updated: Jan. 31, 2024 at 3:11 AM EST Updated 2 months ago By Alex Eule Shares of Alphabet were falling in after-hours trading Tuesday despite overall better than expected fourth-quarter results from the search giant. For the December quarter, the Google-parent reported revenue of $86.3 billion, up 13% from a year ago, and ahead of the Wall Street consensus forecast of $85.3 billion. Earnings per share were $1.64, beating the consensus of $1.59 a share. Revenue for Google Cloud was $9.2 billion, up 26%, ahead of analysts' estimates for $8.9 billion. Overall Google advertising was $65.5 billion, a few hundred million below Street estimates. YouTube advertising generated $9.2 billion in revenue, up 16%, and right in line with estimates. Google Search and other advertising was $48.02 billion, a little below the Street consensus at $48.1 billion, and up 13%. \"Google Network\" ads, which appear on a range of websites and apps, were also a little below estimates at $8.3 billion, down about 2% from the year-ago quarter. The company lost $863 million in the quarter from its \"other bets\" portfolio. But operating income from Google Cloud was $864 million, reversing a loss of $186 million the year ago period. Alphabet said capital expenditures in the quarter were $11 billion, up from $8 billion in the September quarter, as the company continues to invest in AI and cloud infrastructure. The company said 2024 capital spending would be up considerably from 2023. “We are pleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud,\" CEO Sundar Pichai said in a statement. \"Each of these is already benefiting from our AI investments and innovation. As we enter the Gemini era, the best is yet to come.” Evercore ISI analyst Mark Mahaney pointed out in a \"flash\" research note on the results that the top-line beat was driven by the \"Google Other,\" catchall category that includes subscriptions, platforms and devices. He thinks the segment got a boost from the company's NFL Sunday Ticket football subscription service. \"We would like to point out that this is a fundamentally stronger quarter – Gross Revenue, Search, YouTube, and Cloud and Google Other Revenues all accelerated,\" Mahaney writes. \"That said, we believe the price actions following the print reflect the higher expectations that weren’t exceeded.\" Alphabet stock was down 5.9% in late trading following the earnings report. Alphabet Inc. Cl A GOOGL (U.S.: Nasdaq) Advertisement - Scroll to Continue "
}