{
    "title": "Alphabet Q4 2023 earnings",
    "date": "1/30/2024",
    "url": "https://finimize.com/content/alphabet-google-4q23-earnings",
    "text": "Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Premium stocks us macroeconomics interest rates inflation information technology tech consumer discretionary ai software Sponsored IG - The ISA with more flex than the rest 2 months ago  •  2 mins Initially, investors weren’t sure where to position Alphabet in the new AI world. For years, the firm was seen as a thought leader in the space, showing off advanced chatbots at all its annual technology events. But, when AI became a reality last year, investors got all nervous, fretting that Google’s parent was suddenly behind the curve. In fact, they even went one further, worrying that the company’s bread and butter – search – could be disrupted by the technology and that Alphabet could lose everything that made it what it is today. Fast forward a year, and most of those jitters have faded – if not outright vanished. Search revenue has accelerated nicely, posting more than 10% growth in the third quarter. That’s not quite the 20% growth the firm – and its investors – had become used to, but it’s much better than was feared only a year ago. Simply put, investors won’t want to see any growth reversal in search and you can expect 10% (or above) to be greeted warmly. Mind you, while it’s nice that AI hasn’t killed Alphabet’s golden goose, investors aren’t convinced that AI is actually helping the firm. Google’s cloud business – which ranks third in size behind Amazon’s AWS and Microsoft’s Azure – revealed an unexpected growth slowdown during the last quarterly update. And that was a blow, as it had been outpacing its rivals and grabbing share. It sent Alphabet’s stock lower and it’s partly why Alphabet shares trade at a cheaper valuation than the others. But this time around, if search maintains a healthy growth clip, and Google’s cloud business can pick up again to, say, 25% growth or better, then Alphabet could barge its way back into the AI club. And that would likely send its shares higher. –Alphabet is expected to announce earnings on Tuesday, January 30th, after the close of trading in New York. ai alphabet earnings stocks us alphabet amazon Disclaimer: These articles are provided for information purposes only. Occasionally, an opinion about whether to buy or sell a specific investment may be provided. The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment advisor. /3 • Your free quarterly content is about to expire. Uncover the biggest trends and opportunities. Subscribe now for 50% off. Cancel anytime. "
}