{
    "title": null,
    "date": "1/18/2024",
    "url": "https://qz.com/google-layoffs-youtube-ceo-sundar-pichai-1851175726",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Google’s “ambitious goals” for 2024 apparently don’t include some workers. The company said this week that more layoffs are ahead. That’s come amid broader job cuts in the tech sector to start 2024. “We have ambitious goals and will be investing in our big priorities this year,” Google CEO Sundar Pichai told employees in a memo Wednesday reported by The Verge. “The reality is that to create the capacity for this investment, we have to make tough choices.” The memo came only a day after another leaked memo showed that Google would cut hundreds of jobs on its advertising sales team, and just hours after an announcement that the company was slashing 100 jobs at YouTube. So far, Google has likely laid off more than 1,000 workers in 2024 — though it has not specified a number. There have been more than 7,500 layoffs in the tech industry in just the first 17 days of the year, squashing hopes for an end to last year’s doom and gloom in the sector. Technology firms are still feeling a comedown from the sector’s 2021 boom, when the companies were hiring left and right. Meanwhile, industry giants such as Meta, Microsoft, and Google are no longer seen as the gold star employers they once were, with layoffs hampering workers’ morale. Pichai told Google employees that the coming layoffs “are not at the scale of last year’s reductions, and will not touch every team.” In 2023, the company cut about 12,000 jobs, or 6% of its workforce. Tech layoffs may be happening in part due to companies shifting their priorities, as many have gone all-in on generative AI. Google stock edged up about 0.8% to $144.08 in Thursday morning trading. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}