{
    "title": "Google to build billion-dollar UK data centre",
    "date": "1/19/2024",
    "url": "https://www.proactiveinvestors.co.uk/companies/news/1038885/google-to-build-billion-dollar-uk-data-centre-1038885.html",
    "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. Enables storage (such as cookies) related to analytics e.g. visit duration. Enables storage related to personalization e.g. video recommendations Enables storage (such as cookies) related to advertising. Pharma & Biotech Sustainability Cannabis Battery Metals Artificial Intelligence Leo joins us with a degree in Media Production from Bournemouth University. His work includes reporting for the UK editorial team and video editing for the broadcast team.\r\n\r\nHe comes with an expertise in video editing and producing. Leo’s specialities include hospitality and leisure, support services, tech and video games.\r\n Read more Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. Proactive Investors Australia Pty Ltd  ACN 132 787 654 (the Company, we or us) provides you with access to the content set out above, including any news, quotes, information, data, text, reports, ratings, opinions, images, photos, graphics, graphs, charts, animations and video (Content) and this website (the Site) on the terms set out in this disclaimer, together with all other terms and conditions, disclaimers and other notices displayed elsewhere on this Site.\n                       It is important for you to know that:\n                       (a)\tnone of the Content is, or is intended to be, general or personal advice\n                       (b)\tthe principal purpose of the Content is to provide factual information only and to comment on news; \n                       (c)\tthe Content does not contain or imply any recommendation or opinion intended to influence your financial decisions, including in respect of any particular security, portfolio of securities, transaction or... Published: 08:34 19 Jan 2024 GMT Google, owned by Alphabet Inc (NASDAQ:GOOG), has started the construction of a new £789 million (US$1 billion) data centre in the UK, as announced at the World Economic Forum in Davos. The facility will be situated on a 33-acre site in Waltham Cross, Hertfordshire, which Google acquired in October 2020. The search engine giant emphasised that the data centre will accelerate artificial intelligence (AI) growth and ensure reliable digital services for Google Cloud customers and users in the UK. The heat generated by the centre will also be repurposed to benefit homes and local businesses. Google, already employing 7,000 individuals in the UK, anticipates the data centre to contribute to job growth, especially during the construction phase. Ruth Porat, president and chief investment officer, said: “This investment builds upon our Saint Giles and Kings Cross office developments, our multi-year research collaboration agreement with the University of Cambridge, and the Grace Hopper subsea cable that connects the UK with the United States and Spain.” Sign up to receive alerts and news direct to your inbox Oriole Resources PLC (AIM:ORR) CEO Tim Livesey and chief financial officer Bob Smeeton join Proactive's Stephen Gunnion with details of the company's 2023 financial and operational performance.\r\n\r\nLivesey highlighted successful exploration programs in Cameroon, at the Bibemi and Mbe projects,... © Proactive Group Holdings Inc, 2024 Proactive Investors Limited, trading as “Proactiveinvestors United Kingdom” is registered in England with the Company Registration number 05639690. Group VAT registration number 872070825. You can contact us here. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.  "
}