{
    "title": "Wing Announces Bigger Delivery Drone",
    "date": "1/17/2024",
    "url": "https://dronelife.com/2024/01/17/alphabets-wing-soars-to-new-heights-larger-drone-for-bigger-deliveries-announced/",
    "text": "Wing Introduces Larger Drone for Bigger Orders: 5 Pound Payload Alphabet’s Wing, one of the pioneers in commercial residential drone deliveries, has announced the introduction of a larger aircraft to its fleet. The announcement was made in a company blog post by Wing CEO Adam Woodworth. The new drone is designed to simplify and streamline larger orders, a move that is expected to optimize the company’s operations. “Today, we offer the ability for customers to fulfill larger orders, beyond what fits on one aircraft,” writes Woodworth. “To better serve that 30% and further optimize our business, we will be introducing an additional aircraft to complement our existing fleet.” The new drone is part of Wing’s Aircraft Library approach to development, where the team works on a variety of configurations based on core components already in use for their flight-proven aircraft. The new aircraft will have the same round-trip range of 12 miles and can cruise approximately 65 miles per hour, all while carrying a standard cardboard delivery box with a payload up to five pounds. This announcement comes on the heels of Walmart’s recent announcement of a major expansion of drone delivery in the Dallas/Fort Worth metroplex with partners Wing and Zipline. Wing was one of the very first drone delivery companies to complete commercial residential deliveries, with a robust history in Australia and in their original test community of Christianburg, VA. Since then, the company has expanded residential drone delivery programs around the world. “We’re excited to better serve our partners and customers with both aircrafts,” Woodworth adds. “Wing intends to work with partners and regulatory stakeholders to introduce this new aircraft in our service areas within the next 12 months.”  With the new aircraft carrying more food, medicine, and household essentials, customers in urban and suburban areas will be able to bundle their orders better—and Wing will have better capacity to deliver them in one quick trip. This development marks another significant step in Wing’s commitment to making drone delivery a reality for more shoppers. Read more: Miriam McNabb is the Editor-in-Chief of DRONELIFE and CEO of JobForDrones, a professional drone services marketplace, and a fascinated observer of the emerging drone industry and the regulatory environment for drones. Miriam has penned over 3,000 articles focused on the commercial drone space and is an international speaker and recognized figure in the industry.  Miriam has a degree from the University of Chicago and over 20 years of experience in high tech sales and marketing for new technologies.\nFor drone industry consulting or writing, Email Miriam. TWITTER:@spaldingbarker Subscribe to DroneLife here. About Us\r\n \r\n|\r\n \r\nContact Us\r\n  \r\n|\r\n \r\nAdvertise With Us\r\n  \r\n|\r\n\r\nWrite for Us\r\n  \r\n|\r\n  \r\n  \r\nPrivacy Policy\r\n  \r\n|\r\n  \r\nTerms of Service\n\nThe Trusted Source for the Business of Drones. \n©2017 DRONELIFE.com ©2017 DRONELIFE.com This website uses cookies and third party services. By clicking OK, you are agreeing to our privacy policy. ACCEPT "
}