{
    "title": "Google Stock Starts The Year With Winter Pruning",
    "date": "1/11/2024",
    "url": "https://www.investors.com/stock-lists/ibd-big-cap-20/google-stock-starts-the-year-with-winter-pruning-battles-to-hold-third-place/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Google-parent Alphabet (GOOGL) is this week's Big Cap 20 stock as the search giant hovers in a buy zone from an entry at 139.42. Google stock broke out in late December, then retreated before bouncing off its 50-day moving average. Google's move back into buy range comes as the company is trimming its ranks. It announced layoffs in its engineering teams on Wednesday as part of a broader effort to contain costs. Google stock is in an early stage base and can net higher gains as techs take back the driver's seat in 2024. Shares of Google already gained 58% last year, more than double that of the S&P 500's gains of 24%. Not persuaded? The stock is approaching an alternative buy point at 142.68. Further, it's not far from an all-time split-adjusted high of 151.55. That makes Google the third-largest stock by market cap for now. Sales growth over the past seven quarters has ranged from 1% to 23%. Earnings growth returned in the two most recent quarters after several quarters of declines. In the most recent quarter, earnings growth showed significant acceleration. When it reported third-quarter earnings in late October, Google said sales grew 11% to $76.7 billion while earnings surged 42% to $1.56 a share. The sales growth came from both of its segments, Google Services and Google Cloud. Google Services includes Search, Google Play, Google Ads, YouTube and other products and services. Google Cloud provides software and collaboration tools for businesses. Despite the sales growth, cloud computing revenue came in at $8.41 billion, and missed views of $8.64 billion. That sent shares spiraling downward, as investors fretted over intense cloud competition from Microsoft (MSFT) and Amazon (AMZN). In December, shares recovered after the earnings tumble as the search giant stepped up its efforts to integrate artificial intelligence and automation into its digital ad business. Also in December, parent company Alphabet launched its newest and most advanced artificial intelligence product, Gemini. The program is trained to understand text, image and audio. The stock since has climbed back and formed its current base as technical ratings also gave it support. Investor's Business Daily gives Google stock a near ideal score of 97 in both its Composite Rating and EPS Rating. The best-possible rating is 99. Google's Relative Strength Rating at 87 is up sharply from 17 a year ago. That shows that the stock is outperforming 87% of total stocks in the database. Also GOOGL stock ranks third in IBD's Internet Content group. The group holds 56th place among IBD's 197 industry groups. Mutual funds own 42% of outstanding shares of the company, and more funds have come in as net buyers of the stock over the past seven quarters. The MFS Growth Fund (MFEGX) and the AllSpring Growth Fund (SGRAX) are among those holding shares of GOOGL. Among exchange traded funds, the iShares Global Communications Services ETF (IXP) and State Street's Communication Services Select Sector SPDR Fund (XLC) hold shares of Google stock. Please follow VRamakrishnan on X/Twitter for more news on the stock market today. YOU MAY ALSO LIKE: Top Growth Stocks To Buy And Watch Learn How To Time The Market With IBD's ETF Market Strategy Find The Best Long-Term Investments With IBD Long-Term Leaders MarketSmith: Research, Charts, Data And Coaching All In One Place How To Research Growth Stocks: Why This IBD Tool Simplifies The Search For Top Stocks 3/29/2024\nBuying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the... 3/29/2024\nBuying a stock is easy, but purchasing the right stock... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}