{
    "title": "What You Need To Know Ahead of Google-Parent Alphabet's Earnings on Tuesday",
    "date": "1/29/2024",
    "url": "https://www.investopedia.com/what-you-need-to-know-ahead-of-google-parent-alphabet-earnings-8547164",
    "text": " Michael M. Santiago / Getty Images Google parent company Alphabet Inc. (GOOGL) is set to announce fourth-quarter earnings on Tuesday, with investors looking for Google Cloud revenue growth and any details on the company's artificial intelligence (AI) initiatives. Alphabet's revenue is expected to be $85.24 billion, according to consensus estimates collected by Visible Alpha, up from $76.05 billion in the fourth quarter of 2022.  Analysts anticipate net income to be $20.28 billion, up from $13.62 billion in the fourth quarter of 2022, while adjusted earnings per share (EPS) are pegged at $1.61, versus $1.05 in the same period of the previous year. Analysts said there could be an upturn in Google Cloud revenue after a disappointing third quarter, when cloud revenue fell short of expectations. CFRA analysts said that there could be a \"potential upside to cloud growth\" in the fourth quarter. Consensus estimates compiled by Visible Alpha project cloud revenue for the fourth quarter of 2023 at $8.95 billion, which would translate to roughly 22% growth year-over-year (YOY). In the third quarter of 2023, cloud revenue also grew 22% YOY versus 28% growth in the second quarter, with Alphabet CEO Sundar Pichai crediting the smaller-than-expected gains to customers choosing to optimize their spending amid economic uncertainty. Alphabet, alongside other tech giants, is working to stake its claim in the AI race. Wedbush Securities analysts expect that enterprise monetization of generative AI (GenAI) tech will be a key theme in 2024 and that the company could comment on AI potential in its earnings report. Google bolstered its stance in the AI space in the final quarter of 2023, launching its own AI model, Gemini, in December 2023. The company claims Gemini largely outperforms Microsoft-backed (MSFT) OpenAI's GPT-4. The company could solidify launch plans for Gemini Ultra and Bard Advanced, more advanced versions of its AI model and GenAI chatbot, which Google previously has said would be announced in \"early 2024.\" Wedbush noted that while the firm views Google as a \"long-term winner within the digital advertising industry with broad exposure and durable market share of overall media spending\" with \"significant optionality for Google across Cloud & AI,\" 2024 could be \"a relatively more challenging year for Google\" in part due to \"uncertainty related to its AI initiatives, and the unknown impact that generative AI will have on Search.\" The analysts wrote that \"consumer-facing generative AI products outside of ChatGPT,\" such as Google's Bard, \"may take several years to gain adoption and generate sustainable engagement with users.\" Google shares gained nearly 60% in 2023, outpacing all major benchmark indexes along with the other Magnificent Seven stocks. CFRA. \"Alphabet Dec-Q Preview–Will Cloud Growth Stabilize After Disappointing in Q3?\" Alphabet Inc. \"Q3 2023 Earnings Call.\" Wedbush Securities. \"Internet 2024 Outlook.\" Google. \"Introducing Gemini: Our Largest and Most Capable AI Model.\" "
}