{
    "title": "Even a rare Alphabet non-bull says Wall Street has overreacted on Google AI \nwoes",
    "date": "2/27/2024",
    "url": "https://www.marketwatch.com/story/even-a-rare-alphabet-non-bull-says-wall-street-has-overreacted-on-google-ai-woes-b8163ed8",
    "text": "Only about 20% of Wall Street analysts who cover Alphabet Inc. carry anything but a bullish stance on it. That’s why Bernstein analyst Mark Shmulik says his market-perform rating on the stock makes him uniquely qualified to defend the Google parent company in the wake of its latest artificial-intelligence blunder. Google came under fire last week after it released an image-generation tool that created some racially insensitive images. On Friday the company paused the tool, which it had added to its Gemini chatbot, and Wall Street spent Monday fretting about what the debacle meant for Google’s AI positioning, brand reputation and future in the world of search. Alphabet’s stock \n        GOOG,\n        +0.21%\nGOOGL,\n        +0.04%\n       dropped more than 4% in the session. See also: Alphabet’s stock has weathered past AI missteps. Is latest blunder different? Shmulik said that while Google was once the “Hermit Kingdom,” shipping products slowly and deliberately, AI peer pressure seemingly has forced the company to change its ways, leading to “a string of embarrassing misfires” over the past year or so that came after the company showed off some functions before they were ready. One concern is that high-profile AI flubs could affect the trust people place in Google’s brand, particularly as AI becomes a bigger part of the search landscape. Google overwhelmingly dominates the search market, but some users could turn elsewhere for generative-AI-driven search queries if they feel Google’s offerings aren’t up to par. “So is this the end of an era?” Shmulik asked, adding: “Not so fast.” He notes that Microsoft Corp.’s Bing has been shedding revenue share of the search market since Microsoft \n        MSFT,\n        -0.17%\n       began getting more aggressive in the field with its AI tie-ins. “Perhaps an unintended benefit of the human bias we’ve seen in Gemini raises AI trust questions more broadly, and pushes out consumer adoption of Gen AI search,” he wrote. “By then, Google should have fixed the bugs and be ready for prime time … we think.” The stock looks like a bet on Trump himself more than a company with significant revenue and profits. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}