{
    "title": "What Awaits Alphabet-Heavy ETFs After Disappointing Q4 Earnings?",
    "date": "2/1/2024",
    "url": "https://finance.yahoo.com/news/awaits-alphabet-heavy-etfs-disappointing-213100102.html",
    "text": "Alphabet GOOGL reported its fourth-quarter 2023 earnings results on Jan 30 after market close. The tech giant reported earnings of $1.64 per share, beating the Zacks Consensus Estimates of $1.60 by 2.5%. GOOGL has a Zacks Growth Score of A. Alphabet posted revenues of $86.31 billion for the quarter ended December 2023, increasing at the most rapid expansion rate of 13% year over year since the beginning of 2022. GOOGL, which belongs to the Zacks Internet - Services industry, surpassed the Zacks Consensus Estimate for revenues of $70.77 billion, reflecting a 21.96% positive surprise. Net income of $20.69 billion surged 51.9% from the year-ago quarter. Operating profit also rose 3% year over year, reaching 27%. Advertisement revenues for the company increased about 10.97% year over year, reaching $65.52 billion in the fourth quarter, but trailed analyst estimates, according to CNBC. The disappointing ad revenues indicate rising competition for ad budgets from alternative online platforms. According to Thomas Monteiro, an analyst at Investing.com, as quoted on Reuters, the tech giant’s sluggish ad revenues are indicative of the uncertainty regarding the pace of interest rate cuts by global central banks. The earnings results have a huge impact on ETFs heavily invested in this Internet giant, with shares of GOOGL falling 5.78% after market hours, following its fourth-quarter earnings results. Here, we have highlighted four ETFs with double-digit exposure to Alphabet and look at how the funds have performed since earnings were reported. IShares Global Comm Services ETF seeks to track the performance of the S&P Global 1200Communication Services 4.5/22.5/45 Capped Index, with a basket of 65 securities. The fund has an asset base of $254.5 million and charges an annual fee of 0.42%. IShares Global Comm Services ETF has an exposure of 12.75% in GOOGL. The fund has around 73.40% of its assets invested in the United States and 7.41% in Japan. Communication Services Select Sector SPDR Fund seeks to track the performance of the Communication Services Select Sector Index, with a basket of 22 securities. The fund has gathered an asset base of $17.07 billion and charges an annual fee of 0.10%. Communication Services Select Sector SPDR Fund has an exposure of 12.64% in GOOGL. The fund has invested around 96.13% in large-cap securities. Fidelity MSCI Communication Services Index ETF seeks to track the performance of the MSCI USA IMI Communication Services 25/50 Index, with a basket of 108 securities. The fund has amassed an asset base of $945.3 million and charges an annual fee of 0.08%. Fidelity MSCI Communication Services Index ETF has an exposure of 12.57% in GOOGL. The fund has invested around 86.01% in large-cap securities. Vanguard Communication Services ETF seeks to track the performance of the MSCI US Investable Market Communication Services 25/50 Index, with a basket of 118 securities. The fund has gathered an asset base of $3.74 billion and charges an annual fee of 0.10%. Vanguard Communication Services ETF has an exposure of 12.23% in GOOGL. The fund has invested around 49.68% in the technology sector, followed by 27.51% in consumer discretionary and 22.66% in telecommunications. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Vanguard Communication Services ETF (VOX): ETF Research Reports Fidelity MSCI Communication Services Index ETF (FCOM): ETF Research Reports iShares Global Comm Services ETF (IXP): ETF Research Reports Communication Services Select Sector SPDR ETF (XLC): ETF Research Reports To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}