{
    "title": "Are the \"Magnificent Seven\" Too Expensive to Buy?",
    "date": "3/29/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOGL-Q/pressreleases/25140035/are-the-magnificent-seven-too-expensive-to-buy/",
    "text": "The \"Magnificent Seven\" has driven most of the stock market gains since the beginning of 2023, but each stock is starting to show cracks in its armor. Some of them have gotten far too extended and trade for unreasonable valuations despite the success in their underlying businesses. But are all of them overvalued? Let's examine this group and see if any could be considered cheap or if you'll need to pay a hefty premium to own these seven stocks. The Magnificent Seven is made up of the following companies: 2023 was a phenomenal year for this cohort, with the worst-performing stock (Apple) returning nearly 50%. However, 2024 hasn't been so kind, and each stock's performance has been all over the place.  MSFT data by YCharts. Part of this dichotomy has been valuation, as investors aren't willing to pay up to own some of the stocks in the Magnificent Seven. Because the Magnificent Seven are mostly considered growth companies, I'll use their revenue growth combined with their forward price-to-earnings (P/E) ratio to assess their valuation; I believe these two metrics show a wider picture. Cost reduction measures can prop up earnings, but those can only grow earnings for so long without any top-line growth. Tesla has had the worst year, losing nearly a third of its value this year. Its declining market value can be attributed to slowing growth in electric vehicle (EV) sales and shrinking margins due to rising competition. The really high premium that investors were willing to pay for the stock tumbled, and now the stock trades for 55 times forward earnings. Apple is in a similar situation, but its problems have occurred for much longer. Throughout 2023, Apple's quarterly revenue either shrank or grew at a 2% pace on a year-on-year basis. That's not great for a company valued like a growth stock, so it is no surprise that investors aren't willing to pay as much of a premium. Even at its current 26 times forward earnings, the stock still looks pricey for its growth. Besides these two, the rest are up in 2024, but that doesn't mean they are all overpriced. Alphabet and Meta Platforms come to the top of the list for stocks that I believe aren't overpriced. Alphabet, Google's parent company, has had some public relations issues related to the rollout of its generative AI model. However, Alphabet's ad business is still doing well, and with the company trading at 22 times forward earnings, it's the cheapest on the list. Meta isn't much more expensive, with the stock trading at 25.5 times forward earnings. Since its primary business is advertising (through its various social media platforms), it's benefiting from the same ad recovery wave as Alphabet. As a result, it's primed to continue growing for some time. Nvidia isn't as expensive as some may expect, as its vast growth hasn't concluded yet. At 38 times forward earnings, it's quite pricey, but with Nvidia being at the center of the AI revolution with its best-in-class graphics processing units (GPUs), it's to be expected. Amazon is more difficult to assess. It's still optimizing its business for profits, so its forward earnings multiple is skewed and will likely remain that way for some time. At 42 times earnings, it's the second-most expensive on the list. However, with Amazon's rising gross profit margin, it will only be a matter of time before its profits rocket higher and its valuation looks more reasonable.  AMZN Gross Profit Margin (Quarterly) data by YCharts. Lastly, Microsoft is one of the most expensive stocks on this list despite being the largest company in the world by market capitalization. Microsoft's valuation is an incredibly pricey 37 times forward earnings -- nearly as expensive as Nvidia's despite far less growth. It earned this premium through fantastic AI product rollout and increased cloud computing market share. However, 37 times earnings is a lot for a company growing at 18% that appears to be fully optimized for profits. So, with all that information, how do these stocks rank from cheapest to most expensive? Ranking the stocks by their forward price-to-earnings (P/E) multiple alone doesn't tell the full picture, as companies like Apple are struggling to grow while Nvidia is tripling its revenue. These rankings won't solely be based on metrics; they'll also include a nod to current growth and future opportunities. With that in mind, here are my rankings of the Magnificent Seven from the cheapest to most expensive: Ranking Alphabet and Meta as the cheapest was a no-brainer, but I'm also convinced that Amazon and Nvidia have more room to grow, making their expensive valuations seem cheaper in the grand scheme of things. Tesla is hard to figure out, but if EV demand continues to rise, this may be a bargain price. Lastly, Microsoft and Apple are very expensive for their growth, with Apple being the worst offender because it's hardly growing. Although this is my ranking, investors should decide for themselves whether any of these stocks are \"cheap\" enough to buy. Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 25, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Alphabet, Amazon, Meta Platforms, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Alphabet Cl A stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}