{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by Red Door Wealth Management \nLLC",
    "date": "3/28/2024",
    "url": "https://www.defenseworld.net/2024/03/28/alphabet-inc-nasdaqgoogl-shares-acquired-by-red-door-wealth-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 28th, 2024 Red Door Wealth Management LLC increased its holdings in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 5.6% in the fourth quarter, Holdings Channel reports. The firm owned 16,067 shares of the information services provider’s stock after buying an additional 845 shares during the period. Red Door Wealth Management LLC’s holdings in Alphabet were worth $2,244,000 at the end of the most recent quarter. Several other institutional investors and hedge funds have also recently bought and sold shares of the stock. DE Burlo Group Inc. increased its stake in  Alphabet by 520.0% during the second quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider’s stock worth $11,551,000 after purchasing an additional 80,934 shares during the period.  West Tower Group LLC purchased a new stake in  Alphabet during the 2nd quarter worth approximately $88,000.  Ballast Advisors LLC lifted its holdings in  Alphabet by 9.6% during the 3rd quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider’s stock worth $2,061,000 after buying an additional 1,385 shares in the last quarter.  Quantum Financial Advisors LLC boosted its position in  Alphabet by 8.0% in the 3rd quarter. Quantum Financial Advisors LLC now owns 7,623 shares of the information services provider’s stock valued at $998,000 after buying an additional 564 shares during the period.  Finally, Acadian Asset Management LLC boosted its position in  Alphabet by 2.4% in the 3rd quarter. Acadian Asset Management LLC now owns 4,416,533 shares of the information services provider’s stock valued at $577,908,000 after buying an additional 104,366 shares during the period. 40.03% of the stock is currently owned by hedge funds and other institutional investors. GOOGL has been the topic of several analyst reports. KeyCorp increased their price objective on Alphabet from $153.00 to $165.00 and gave the company an “overweight” rating in a research note on Monday, January 29th. Wedbush increased their price target on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a research report on Friday, March 22nd. Wolfe Research boosted their price objective on Alphabet from $170.00 to $180.00 and gave the stock an “outperform” rating in a research report on Wednesday, January 31st. Rosenblatt Securities reduced their target price on shares of Alphabet from $174.00 to $172.00 and set a “buy” rating on the stock in a report on Wednesday, January 31st. Finally, Needham & Company LLC  reiterated a “buy” rating and set a $160.00 price target on shares of Alphabet in a report on Wednesday, January 31st. Five research analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have issued  a strong buy rating to the company’s stock. Based on data from MarketBeat, the stock presently has a consensus rating of “Moderate Buy” and an average price target of $155.48. Read Our Latest Analysis on GOOGL In other news, CEO Sundar Pichai sold 22,500 shares of the business’s stock in a transaction that occurred on Wednesday, January 3rd. The shares were sold at an average price of $140.11, for a total value of $3,152,475.00. Following the completion of the transaction, the chief executive officer now owns 2,422,691 shares of the company’s stock, valued at $339,443,236.01. The transaction was disclosed in a document filed with the SEC, which is accessible through this link. In related news, CAO Amie Thuener O’toole sold 425 shares of the stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the transaction, the chief accounting officer now directly owns 27,259 shares in the company, valued at $3,805,628.99. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this link. Also, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction dated Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total value of $3,152,475.00. Following the completion of the sale, the chief executive officer now directly owns 2,422,691 shares in the company, valued at $339,443,236.01. The disclosure for this sale can be found here. Insiders have sold 251,378 shares of company stock valued at $35,461,377 in the last ninety days. Insiders own  0.88% of the company’s stock. GOOGL stock opened at $150.87 on Thursday. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a 12 month low of $99.74 and a 12 month high of $153.78. The firm has a market capitalization of $1.88 trillion, a PE ratio of 26.01, a P/E/G ratio of 1.39 and a beta of 1.04. The company’s 50 day simple moving average is $143.33 and its 200-day simple moving average is $138.03. Alphabet (NASDAQ:GOOGL – Get Free Report) last announced its earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The firm had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $70.77 billion. During the same quarter in the prior year, the firm earned $1.05 EPS.  Equities analysts expect that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Fiduciary Alliance LLC Sells 1,459 Shares of Johnson & Johnson (NYSE:JNJ) Kingdom Financial Group LLC. Sells 527 Shares of Alphabet Inc. (NASDAQ:GOOGL) "
}