{
    "title": "Alphabet's CapitalG backs DTEX Systems with $50M to strengthen insider \nthreat protection",
    "date": "3/5/2024",
    "url": "https://siliconangle.com/2024/03/05/alphabets-capitalg-backs-dtex-systems-50m-strengthen-insider-threat-protection/",
    "text": "UPDATED 18:38 EST / MARCH 05 2024 by \nDuncan Riley Insider risk management company DTEX Systems Inc. today announced that it has raised $50 million in new funding from CapitalG Management Co. LLC, the independent growth fund of Alphabet Inc., to grow its go-to-market operations globally. Founded in 2000, DTEX offers a platform that allows organizations to prevent data loss and support a trusted workforce by stopping insider risks from becoming insider threats. The company’s InTERCEPT platform consolidates essential elements of data loss prevention, user behavior analytics and user activity monitoring into a single platform to detect and mitigate insider risks well before data loss occurs. InTERCEPT also uses artificial intelligence and machine learning with behavioral indicators, to enable proactive insider risk management at scale without sacrificing employee privacy or network performance. The platform seeks to address insider risk, with a survey from DTEX and the Ponemon Institute finding that 75% of insider incidents are not malicious, instead the result of negligent and mistaken employees or exploitation by external threat actors. Given the risks, DTEX argues that organizations are increasingly acknowledging the need to focus on the human element to shift from reactive to proactive security and prevent unnecessary damage. With the increasing recognition of insider risk, DTEX has seen strong growth, doubling its annual recurring revenue in the last year and closing its highest-ever number of $1 million plus deals, though it didn’t reveal more specifics. The deals included one with an unnamed leading financial services company that deployed the InTERCEPT platform enterprise-wide to cover more than 800,000 user devices and mission-critical servers. Customer wins spanned various industries, including energy, mining, healthcare, banking and finance, technology, media, pharma, telecommunications, federal agencies and other critical infrastructure entities. The company also landed a multimillion-dollar deal with a major U.S. government agency with over 100,000 endpoints. “Our investment in DTEX comes at a time when enterprises worldwide are increasingly reprioritizing their security investments in order to address the costs and impact of insider risks,” CapitalG partner James Luo, who will be joining the DTEX board of directors as part of the deal, said in a statement. “At the same time, the market is underserved by legacy technologies that don’t provide visibility into the behavioral nuances that are essential to understanding and proactively mitigating both malicious and unintentional insider risks.” The new funding will also be used to accelerate DTEX’s application of large language models and behavioral science research to disrupt the insider risk management market. Including the new funding, DTEX has raised $95.2 million to date, according to data from Tracxn. Previous investors include Wing Venture Management LLC, Northgate Capital LLC, Norwest Venture Partners and Four Rivers Group LLC. THANK YOU Blockchain-focused cryptography startup Zama raises $73M to protect data in use Bipartisan bill could see TikTok banned in US if it doesn’t split with China OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions Taalas raises $50M to develop chips optimized for specific AI models Claroty secures $100M to enhance cyber-physical system security Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research Blockchain-focused cryptography startup Zama raises $73M to protect data in use SECURITY - BY MIKE WHEATLEY . 3 HOURS AGO Bipartisan bill could see TikTok banned in US if it doesn’t split with China POLICY - BY JAMES FARRELL . 6 HOURS AGO OpenAI hits back at Elon Musk, saying he supported its for-profit ambitions AI - BY MIKE WHEATLEY . 8 HOURS AGO Taalas raises $50M to develop chips optimized for specific AI models AI - BY MARIA DEUTSCHER . 9 HOURS AGO Claroty secures $100M to enhance cyber-physical system security SECURITY - BY DUNCAN RILEY . 9 HOURS AGO Microsoft engineer flags Copilot Designer concerns as academics call for better AI risk research AI - BY MARIA DEUTSCHER . 10 HOURS AGO Forgot Password? Like Free Content? Subscribe to follow. "
}