{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.scmp.com/tech/big-tech/article/3248158/google-slashes-over-1000-jobs-focus-ai-amid-competition-microsoft-openai",
    "text": "Alphabet’s Google is laying off hundreds of people working on its digital assistant, hardware and engineering teams as part of a continued effort to lower costs and focus on artificial intelligence (AI). The affected employees included those working on the voice-based Google Assistant and the augmented reality hardware team. The central engineering organisation was also hit by cuts, the company said. The reductions come as Google’s core internet search business feels the heat from the AI offerings of rivals Microsoft and ChatGPT-creator OpenAI. On calls with investors in recent months, Google executives pledged to scrutinise their operations to identify places where they can make cuts, and free up resources to invest in their biggest priorities. “Throughout the second half of 2023, a number of our teams made changes to become more efficient and work better, and to align their resources to their biggest product priorities,” a spokesperson for the Mountain View, California-based company said in a statement. “Some teams are continuing to make these kinds of organisational changes, which include some role eliminations globally.” Alphabet shares were little changed on Thursday, closing at US$142.08 in New York. The cuts struck both rank-and-file employees and executives. Disclosures filed by Google with the state of California show that 630 workers in the state have been let go this week, including four vice-presidents and 25 directors. Employees at those levels often earn millions of dollars per year in compensation, according to a person with knowledge of the matter. The Alphabet Workers Union, which represents some Google employees, said more than 1,000 workers have been let go so far in total. The co-founders of Fitbit, James Park and Eric Friedman, are also leaving Google as part of the reorganisation, a company spokesperson confirmed. Google acquired the smartwatch company in 2019 for US$2.1 billion. The company continued to make smaller trims over the course of 2023, including lay-offs within teams focused on recruiting, news products and the Waze mapping app. While the large round of cuts in January 2023 was telegraphed by Alphabet chief executive officer Sundar Pichai, this year’s reductions have been communicated by lower-level leaders, such as vice-presidents and human resources, according to a current employee and a former worker. Googlers and recently laid-off employees shared information with each other about the cuts in Discord chats, hallway conversations and other social networks, two current employees told Bloomberg. A document noting which roles got cut, as well as resources for laid-off coworkers, circulated among workers on Wednesday and Thursday, one worker said. Workers said it was difficult to get a full picture of how many jobs were affected. Google – which had about 182,000 employees as of September 30, according to regulatory filings – said more cuts could be expected throughout January as decisions are made at the department level. The company employed 190,700 workers before the lay-offs last year, in addition to tens of thousands of contractors around the world. One of the Google employees who lost his job this week said the first sign of trouble came when he tried to check his work email, only to find he had been logged off. He found a message delivering the news that he had lost his job in his personal email. Over the past year, there have been several rounds of micro-lay-offs, the worker said, speaking on condition of anonymity for fear of professional repercussions. He said it has killed morale at the company and is not conducive to creating trust. Some Googlers have come to view January as a new grim annual tradition of mass lay-offs. While Google executives have framed the cuts as a way to refocus resources on the company’s biggest priorities, the worker who was just fired said that he and a number of his teammates who were let go were working on AI. Amazon.com also laid off hundreds of staff in its Prime Video and studios business this week, raising questions about whether another major round of job cuts was under way in Silicon Valley. Semafor first reported the lay-offs to the Google Assistant team, while 9to5Google first reported the reorganisation for hardware. Affected staff have begun receiving the news and will have the opportunity to apply for open positions elsewhere within Google, the company said. "
}