{
    "title": "Can Alphabet Be More Valuable Than Apple or Microsoft?",
    "date": "1/14/2024",
    "url": "https://247wallst.com/investing/2024/01/14/can-alphabet-be-more-valuable-than-apple-or-microsoft/",
    "text": "The news about market capitalization over the past week has been that Microsoft Corp.’s (NASDAQ: MSFT) topped Apple Inc.’s (NASDAQ: AAPL) as it raced above the $2.88 trillion level. Apple’s old-world hardware business was less valuable than the AI and cloud dominance, which have been the key to Microsoft’s financial success. One public corporation could top them both. Alphabet Inc. (NASDAQ: GOOGL), the owner of Google, ranks third in market cap among all U.S. companies. Alphabet’s figure is $1.8 trillion. (These are the seven stocks that could join the $1 trillion club.) Each company is the leader in a major business sector. Alphabet’s core is advertising on Google and YouTube. Alphabet also has a cloud operation and AI products, but neither dominates these industries. A bet on Alphabet is on whether online advertising will dominate the marketing business. Alphabet operates in many countries outside the United States, particularly in Europe. Google has a 25% share of the online ad business, primarily in the United States. It is trailed by Meta, owner of Facebook, at 18% and Amazon at 15%. Alphabet’s revenue rose 11% in the most recently reported quarter to $76.7 billion. Per-share earnings rose 44% to $1.55 billion. Of the revenue, $44 billion came from Google search, $8 billion from YouTube and $7.7 billion from its network of other websites. Its cloud business contributed $8.4 billion. Alphabet has much smaller operations, including YouTube’s paid subscription business. According to Yahoo Finance, six of the 13 analysts who cover Alphabet rated it a Strong Buy, and another six rated it a Buy. The most recent analyst call is from Tigress Financial, who rated it a Strong Buy. Late last year, Oppenheimer rated it Outperform, as did Piper Sandler. It is not enough for Alphabet to maintain its dominance in online advertising. Apple’s hardware sales problems must continue, and Microsoft has to face more competition in the AI market. To pass both of them in market share, each of the two needs to have a failure. Robinhood set out to democratize investing to individuals, and it’s not slowing down. The app makes it possible to buy and sell stocks, mutual funds, trade options, and even cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH). With FDIC insurance ,an award winning design, and benefits like IRAs and more, Robinhood could be your path to a richer tomorrow. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}