{
    "title": "Why Google's AI Thinks These 3 Stocks Can Double in 2024",
    "date": "1/10/2024",
    "url": "https://investorplace.com/2024/01/why-googles-ai-thinks-these-3-stocks-can-double-in-2024/",
    "text": " Let's dig deeper into these AI-generated picks Advertisement Source: Shutterstock Artificial intelligence has captivated people’s imaginations for decades, and it’s now becoming an indispensable part of many white-collar businesses requiring repetitive work. AI can quickly sift through massive amounts of data and lend a hand with research and analysis. Indeed, we can even apply AI to the stock market. While AI systems generally lack up-to-the-minute information on all stocks and aren’t meant to replace human judgment, they can still provide perspective and stock ideas worth exploring ourselves. With that notion in mind, I decided to query Google’s (NASDAQ:GOOG, NASDAQ:GOOGL) new natural language AI system, Gemini, to see if it had any stock picks that it thinks will double in 2024. Below, I’ll discuss Gemini’s choices and why it singled them out as potential doubles next year. I agree with the AI system that Coupang (NYSE:CPNG) is an intriguing pick as a potential double-up stock for 2024. This leading South Korean e-commerce company saw its share price nosedive nearly 70% from peak 2021 levels. However, this steep slide appears to have been overdone, and the stock could be bottoming out after a summer 2022 trough near $11 per share. With the stock recently pushing toward the $16 level, is there a doubling in the cards for 2024? Currently, CPNG stock looks moderately expensive, but peering out two years changes the picture. Consensus 2025 EPS projections of 0.69 cents against the current quote puts the company’s forward price-earnings multiple around 23-times. That’s not bad for 58% estimated profit growth. Coupang has consistently topped revenue estimates over the past three quarters as e-commerce recovers. Its cash position also hit a record $4.9 billion last quarter. Sturdy double-digit annual growth should spur an expanding earnings multiple over time. If this growth extends further out, I believe we’ll see substantially higher valuations. CPNG stock already trades at 1-times 2024 projected sales, with the company maintaining solid growth momentum. My verdict: The foundations look promising for this fallen e-commerce darling to potentially double within two years. Its reasonable growth metrics make the current stock price appealing to those willing to stomach some volatility. The stars could align for a doubling if execution remains steady. I’m also aligned with the AI system regarding Match Group’s (NASDAQ:MTCH) potential to double in 2024. Match cratered a jaw-dropping nearly 80% off its 2021 peak near $170. But since bottoming below $30 per share, the stock has crept higher to around $37. Despite Match’s epic slide, the underlying business saw healthy growth amidst the stock carnage. Its forward price-earnings ratio of just 11.7-times against 2024 projections seems attractive for a company averaging double-digit earnings growth. Consensus also calls for mid-single-digit sales growth in the years ahead. But for investors in MTCH stock, profit growth is paramount, and its dominance over popular dating apps like Tinder, Match, and Hinge cements an enormously profitable presence. Match currently boasts a superb 15.4% net margin, trumping 81% of interactive media peers. With secular growth tailwinds intact, its 29% 3-5 year earnings per share growth forecast (ex-items) tops 90% of competitors. Rising rates pressured Match due to its hefty debt load, but I expect much juicier profits as the Fed eventually pivots to a more dovish stance. With shares trading at a reasonable forward earnings multiple, MTCH stock looks positioned to potentially double within two years. Here, I diverge from the AI’s take. While Palantir (NYSE:PLTR) clearly has fantastic fundamentals, I believe shares already embed aggressive assumptions, limiting its doubling potential in 2024. Don’t get me wrong, I’m very bullish on Palantir over the long-term. But with the stock up 145% in the past year, I think its near-term upside looks limited. No doubt, Palantir has been crushing earnings estimates. But I worry the stock’s premium multiple leaves little room for error. Even using 2032 earnings projections, Palantir’s forward price-earnings mulitple still hovers above 11-times. Currently, PLTR stock trades at a lofty 15.7-times 2023 revenue, while the S&P 500 index trades under 2.5-times. Don’t misinterpret me – I believe Palantir deserves a premium valuation. But with the hype around AI/big data names possibly peaking in 2023, I foresee potential mean-reversion pressuring shares in 2024. On the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Omor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn. Artificial Intelligence, Consumer Discretionary, Retail, E-Commerce, Software, Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/why-googles-ai-thinks-these-3-stocks-can-double-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}