{
    "title": "US Earnings Week Ahead: From Alphabet, Meta to Apple - 7 tech companies to \npost record revenues | Mint",
    "date": "1/28/2024",
    "url": "https://www.livemint.com/companies/news/us-earnings-week-ahead-from-alphabet-meta-to-apple-7-tech-companies-to-post-record-revenues-11706409613484.html",
    "text": "Five of the so-called Magnificent Seven tech megacaps will report earnings next week, with artificial-intelligence investment, regulatory challenges and waning China demand among the shared themes in focus. Along with Microsoft Corp., which just hit a historic $3 trillion market valuation, Alphabet Inc., Meta Platforms Inc. and Amazon.com Inc. are set to post record revenues for the quarter, underscoring the strength of the US economy. Even so, they are likely to be asked about further cost reductions after the significant job cuts they have each embarked on in recent weeks. Apple Inc., grappling with slowing China sales, antitrust accusations and bruised from a patent fight, could give investors a better sense of early demand for its new Vision Pro, which some big-name developers are steering clear of. Boeing Co., mired deep in a safety crisis that prompted the US Federal Aviation Administration to freeze a planned production increase of 737 Max, will face more questions about how it plans to allay concerns over the quality of its aircraft. Monday: No notable earnings. Tuesday: Microsoft (MSFT US) is set to post a 16% jump to record quarterly sales, with TD Cowen seeing strength in its Azure segment from returning cloud customers and rising AI demand. The monetization of its AI-powered virtual assistant Copilot will be scrutinized though the product won’t make significant topline contributions until later this year, Evercore said. Alphabet’s (GOOGL US) earnings per share is seen rising 52%, with Jefferies pointing to ad revenue growth in the year-end quarter and the ramping up of NFL Sunday Ticket channel on YouTube as driving forces. Its Google Cloud segment should see “measured and gradual\" growth as customers prepare for AI deployments, Jefferies added.Advanced Micro Devices’ (AMD US) AI exposure will help drive sales 9.5% higher, in contrast to Qualcomm (QCOM US), which is seen revealing a stagnant topline when it reports Wednesday despite a rebound in its handset and automotive segments.Starbucks’ (SBUX US) North American same-store sales growth is projected to about halve to 5.8% from the same period a year ago. Domestic sales were volatile in November and December amid union walkouts and social-media calls to boycott the coffee chain over its perceived response to the Israel-Hamas war, William Blair noted.General Motors (GM US) deliveries were flat in the quarter as strikes cut output at four plants that make the automaker’s top-selling models. Despite the dropoff — deliveries were up 41% the same period a year ago — profit could still beat expectations as US production likely outpaced sales to account for lost output during the strike, Bloomberg Intelligence said.UPS (UPS US) adjusted earnings per share will slide by double-digits for the fourth quarter in a row, weighed down by higher costs from its new labor contract and tepid shipping growth. Investors will want to gauge the firm’s progress on winning back market share lost during fraught labor talks and hear about the impact of Red Sea shipping disruptions.Wednesday: Boeing (BA US) will see operating profit of $287 million, snapping a five-quarter streak of losses on more commercial-aircraft deliveries and strong services demand. With its growth ambitions dented by the US Federal Aviation Administration’s move to freeze planned production increases for the 737 Max aircraft, executives are set to face intense scrutiny on the company’s next steps.\n Mastercard (MA US) should be able to raise earnings per share by 16% for the quarter as cuts to expenses offset slowing revenue growth and increased buybacks. Company guidance for 2024 should be in line with consensus, Baird said.Thursday: Apple (AAPL US) may score a modest beat on earnings estimates despite slowing sales in China, Evercore said, noting that a patent dispute involving its smartwatches should have little impact. Initial signs point to strong demand for the Vision Pro headset which, along with AI-driven features on its iPhones, could drive growth this year, Bank of America said. Investors will want more color on its overhaul of its App Store and iPhone features in the European Union to appease regulators..   \n Meta’s (META US) 2023 ad revenue growth was fueled by Chinese e-commerce platforms but whether the Facebook parent can rely on the likes of Shein and Temu this year remains to be seen, given simmering China-US tensions, BI said. Meta may also need to focus investments in its large-language model to improve ad targeting amid declining user engagement.Amazon (AMZN US) may beat expectations for a low-double-digit revenue gain — consensus calls for 11% — given a stronger-than-expected holiday season and sequentially improving sales at Amazon Web Services, BI said. The addition of ads to its Prime video service, along with its cloud order book and insights on consumer shopping trends, will be in focus.Friday: Exxon Mobil (XOM US) has warned of a $2.5 billion writedown in some of its California operations in guidance released this month. Gas trading and downstream-derivative tailwinds shored up its profits, TD Cowen said, though consensus estimates point to a 35% fall in earnings per share. Lower oil prices have also dragged Chevron’s (CVX US) profits lower as earnings per share is seen retreating 21% with an LNG pricing uptick failing to offset lower refining margins. \n Charter Communications (CHTR US) investors may focus on broadband subscriber numbers after its fight with Walt Disney over fees left its pay-TV customers temporarily unable to view channels backed by the entertainment giant. Broadband revenue could still get a boost from better average revenue per user gains with the end of promotional discounts, BI said.Cigna’s (CI US) earnings per share likely jumped 32%, more than double the previous quarter’s rate, amid a rise in medical customers and a largely stable medical loss ratio. Medical costs, forecast 14% higher in the quarter, is a concern, especially after health insurance peer Humana’s recent move to cut its forecast on higher-than-anticipated expenses. \n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Beer is at the beginning of an era of growth in India: Heineken CEO          The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 28 Jan 2024, 08:40 AM IST\n\t\nTopics You May Be Interested In \n Microsoft Corp \n Alphabet Inc \n Meta Platforms Inc \n Amazon.com Inc \n Apple Inc \n US Federal Aviation Administration \n Qualcomm \n Advanced Micro Devices \n Starbucks Wednesday: Boeing (BA US) will see operating profit of $287 million, snapping a five-quarter streak of losses on more commercial-aircraft deliveries and strong services demand. With its growth ambitions dented by the US Federal Aviation Administration’s move to freeze planned production increases for the 737 Max aircraft, executives are set to face intense scrutiny on the company’s next steps. Mastercard (MA US) should be able to raise earnings per share by 16% for the quarter as cuts to expenses offset slowing revenue growth and increased buybacks. Company guidance for 2024 should be in line with consensus, Baird said.Thursday: Apple (AAPL US) may score a modest beat on earnings estimates despite slowing sales in China, Evercore said, noting that a patent dispute involving its smartwatches should have little impact. Initial signs point to strong demand for the Vision Pro headset which, along with AI-driven features on its iPhones, could drive growth this year, Bank of America said. Investors will want more color on its overhaul of its App Store and iPhone features in the European Union to appease regulators..   \n Meta’s (META US) 2023 ad revenue growth was fueled by Chinese e-commerce platforms but whether the Facebook parent can rely on the likes of Shein and Temu this year remains to be seen, given simmering China-US tensions, BI said. Meta may also need to focus investments in its large-language model to improve ad targeting amid declining user engagement.Amazon (AMZN US) may beat expectations for a low-double-digit revenue gain — consensus calls for 11% — given a stronger-than-expected holiday season and sequentially improving sales at Amazon Web Services, BI said. The addition of ads to its Prime video service, along with its cloud order book and insights on consumer shopping trends, will be in focus.Friday: Exxon Mobil (XOM US) has warned of a $2.5 billion writedown in some of its California operations in guidance released this month. Gas trading and downstream-derivative tailwinds shored up its profits, TD Cowen said, though consensus estimates point to a 35% fall in earnings per share. Lower oil prices have also dragged Chevron’s (CVX US) profits lower as earnings per share is seen retreating 21% with an LNG pricing uptick failing to offset lower refining margins. \n Charter Communications (CHTR US) investors may focus on broadband subscriber numbers after its fight with Walt Disney over fees left its pay-TV customers temporarily unable to view channels backed by the entertainment giant. Broadband revenue could still get a boost from better average revenue per user gains with the end of promotional discounts, BI said.Cigna’s (CI US) earnings per share likely jumped 32%, more than double the previous quarter’s rate, amid a rise in medical customers and a largely stable medical loss ratio. Medical costs, forecast 14% higher in the quarter, is a concern, especially after health insurance peer Humana’s recent move to cut its forecast on higher-than-anticipated expenses. \n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Beer is at the beginning of an era of growth in India: Heineken CEO          The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 28 Jan 2024, 08:40 AM IST\n\t\nTopics You May Be Interested In \n Microsoft Corp \n Alphabet Inc \n Meta Platforms Inc \n Amazon.com Inc \n Apple Inc \n US Federal Aviation Administration \n Qualcomm \n Advanced Micro Devices \n Starbucks Thursday: Apple (AAPL US) may score a modest beat on earnings estimates despite slowing sales in China, Evercore said, noting that a patent dispute involving its smartwatches should have little impact. Initial signs point to strong demand for the Vision Pro headset which, along with AI-driven features on its iPhones, could drive growth this year, Bank of America said. Investors will want more color on its overhaul of its App Store and iPhone features in the European Union to appease regulators.. Meta’s (META US) 2023 ad revenue growth was fueled by Chinese e-commerce platforms but whether the Facebook parent can rely on the likes of Shein and Temu this year remains to be seen, given simmering China-US tensions, BI said. Meta may also need to focus investments in its large-language model to improve ad targeting amid declining user engagement.Amazon (AMZN US) may beat expectations for a low-double-digit revenue gain — consensus calls for 11% — given a stronger-than-expected holiday season and sequentially improving sales at Amazon Web Services, BI said. The addition of ads to its Prime video service, along with its cloud order book and insights on consumer shopping trends, will be in focus.Friday: Exxon Mobil (XOM US) has warned of a $2.5 billion writedown in some of its California operations in guidance released this month. Gas trading and downstream-derivative tailwinds shored up its profits, TD Cowen said, though consensus estimates point to a 35% fall in earnings per share. Lower oil prices have also dragged Chevron’s (CVX US) profits lower as earnings per share is seen retreating 21% with an LNG pricing uptick failing to offset lower refining margins. \n Charter Communications (CHTR US) investors may focus on broadband subscriber numbers after its fight with Walt Disney over fees left its pay-TV customers temporarily unable to view channels backed by the entertainment giant. Broadband revenue could still get a boost from better average revenue per user gains with the end of promotional discounts, BI said.Cigna’s (CI US) earnings per share likely jumped 32%, more than double the previous quarter’s rate, amid a rise in medical customers and a largely stable medical loss ratio. Medical costs, forecast 14% higher in the quarter, is a concern, especially after health insurance peer Humana’s recent move to cut its forecast on higher-than-anticipated expenses. \n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Beer is at the beginning of an era of growth in India: Heineken CEO          The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 28 Jan 2024, 08:40 AM IST\n\t\nTopics You May Be Interested In \n Microsoft Corp \n Alphabet Inc \n Meta Platforms Inc \n Amazon.com Inc \n Apple Inc \n US Federal Aviation Administration \n Qualcomm \n Advanced Micro Devices \n Starbucks Friday: Exxon Mobil (XOM US) has warned of a $2.5 billion writedown in some of its California operations in guidance released this month. Gas trading and downstream-derivative tailwinds shored up its profits, TD Cowen said, though consensus estimates point to a 35% fall in earnings per share. Lower oil prices have also dragged Chevron’s (CVX US) profits lower as earnings per share is seen retreating 21% with an LNG pricing uptick failing to offset lower refining margins. Charter Communications (CHTR US) investors may focus on broadband subscriber numbers after its fight with Walt Disney over fees left its pay-TV customers temporarily unable to view channels backed by the entertainment giant. Broadband revenue could still get a boost from better average revenue per user gains with the end of promotional discounts, BI said.Cigna’s (CI US) earnings per share likely jumped 32%, more than double the previous quarter’s rate, amid a rise in medical customers and a largely stable medical loss ratio. Medical costs, forecast 14% higher in the quarter, is a concern, especially after health insurance peer Humana’s recent move to cut its forecast on higher-than-anticipated expenses. \n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Beer is at the beginning of an era of growth in India: Heineken CEO          The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 28 Jan 2024, 08:40 AM IST\n\t\nTopics You May Be Interested In \n Microsoft Corp \n Alphabet Inc \n Meta Platforms Inc \n Amazon.com Inc \n Apple Inc \n US Federal Aviation Administration \n Qualcomm \n Advanced Micro Devices \n Starbucks  Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}