{
    "title": "Google: The Best Mega-Cap Tech Stock For 2024 (NASDAQ:GOOGL)",
    "date": "1/3/2024",
    "url": "https://seekingalpha.com/article/4660989-google-the-best-mega-cap-tech-stock-for-2024",
    "text": "Ole_CNX  Ole_CNX While not without risks, Alphabet (NASDAQ:GOOGL) should be considered a core tech holding. The stock currently looks undervalued compared to its mega-cap tech peers. GOOGL owns a variety of products we use every day. Its Google search engine holds a virtual monopoly for search with an estimated over 90% global market share. Google Search generated nearly $162.5 billion in advertising revenue in 2022 and $127.0 billion through the first 9 months of 2023. Global Search Market Share (StatCounter) Global Search Market Share (StatCounter) Its YouTube video platform, meanwhile, is one of the largest in the world. It generated $29.2 billion in revenue in 2022 and $22.3 billion through the first 9 months of 2023. Unlike other media platforms, it doesn’t have to spend a lot on upfront content costs, instead using a revenue-sharing model with content creators. YouTube Music and Premium surpassed 80 million subscribers as of the last reported numbers in 2022. The company also serves up ads through its targeted advertising technology via Google Network, which includes AdSense, AdMob, and Google Ad Manager. Through these programs, the company will serve ads to client websites or apps based on their content, geographical location, and other factors. Google Networks generated $32.8 billion in revenue in 2022 and $23.0 billion through the first 9 months of 2023. Google Cloud is the #3 cloud infrastructure company behind leaders AWS, owned by Amazon (AMZN), and Microsoft (MSFT) Azure. It generated $26.3 billion in revenue in 2022 and $23.9 billion through the first 9 months of 2023. Cloud Infrastructure Market Share (Statista/Synergy Research Group) Cloud Infrastructure Market Share (Statista/Synergy Research Group) In addition, GOOGL owns the Android operating system, Gmail, the Chrome web browser, Google Classroom, navigation platforms Maps and Waze, and Google Photos, among others. It also has a hand in hardware with its Pixel smartphone, smart home product line Nest, Chromebook, and streaming device Chromecast. Finally, it is working on some more pie-in-the-sky projects such as self-driving cars (Waymo), quantum computing (Sycamore), and smart cities (Sidewalk Labs). GOOGL has a virtual monopoly in search, which should continue to be a growth engine for the foreseeable future. Its ability to deliver performance-based ads, as opposed to brand ads, is really unmatched by most rivals. Performance-based ads are bottom of the funnel and tend to be more resilient compared to brand advertising. They have a much more direct and measurable correlation to sales, so companies like to use this type of advertising, especially when there are more concerns around the consumer. Performance advertising has also been getting a boost from the big pushes of Chinese companies like Temu, owned by PDD (PDD), and Shein, which have been trying to draw in U.S. consumers with cheap deals. Another big opportunity for GOOGL is the monetization of YouTube Short videos. With an estimated 2.7 billion active users, YouTube is already quite large. Previously, Short creators had no options to earn money from producing videos, unlike with YouTube’s long-form videos. Starting in 2023, GOOGL started sharing 45% of ad revenue with creators on its Partner Program. To qualify, creators must have 1,000 followers and 10 million Short views over 90 days. Revenue will be allocated to creators based on their share of Short views. The goal here is to incentivize creators to produce content for YouTube Shorts to compete with TikTok. Meanwhile, the better the community performs as a whole, the more money creators can earn. It is also worth noting that creators will be allowed to monetize their content when using popular music, which has been a sticking point in the past. So far, YouTube Shorts appears to be working. In July, the company noted that Short video watchers had risen from 1.5 billion to 2.0 billion in a year. Meanwhile, in October, the company said Shorts averaged 70 billion views a day and that the company was working on closing the monetization gap between long form and short form videos. Google Cloud is another opportunity for the firm. Cloud continues to be one of its strongest top-line drivers, growing around 26% so far in 2023. It has yet to turn a full-year profit yet, although it is on track to do so this year. It’s a high fixed-cost business and GOOGL is the #3 player, so it continues to need to scale the business. If Google Cloud can continue its momentum, it should be a nice bottom line driver moving forward as well. One area that GOOGL has heavily invested in is artificial intelligence (\"AI\") and machine learning (\"ML\"). It’s looking to use this tech across the company, both with search, cloud computing, and other areas. Some particular areas of focus are translation, computer vision, and natural language processing. Discussing AI at a Scotiabank Conference last month, CTO of Google Cloud Will Grannis said: “Our experience is really approaching it from a full stack or a comprehensive approach. And what do I mean by that? The design principle behind Google Cloud's approach to AI is offering a complete AI stack. What does that mean? It means that the research that goes into these novel techniques, it means that the processors, both ours and others in the semiconductors and the chips. The design and the optimization, we spend a lot of time there. But then we also spent a lot of time on the tooling. Machine learning ops is a significant burden. Gen AI ops, a significant burden for any organization. So we also take it upon ourselves to create a platform that allows people to, without even knowing how to code, start their journey in generative AI. But then it also kind of goes up to the top of the stack, like I spoke about before. We want to give you an always-on collaborator. So even if you're operating in SaaS, like you're in Workspace, and you're like, you know what, like you're a small business. Maybe you started a dog walking business. There's still time for you if that's your aspiration. And the good news is Generative AI is here to help. And what it can do is you can express a desire like, \"Hey, I really want to track my clients, but I don't know how to get started.\" And you can give what we call Duet AI, that's our always-on AI collaborator. You can give Duet AI that intent, and it will generate for you a tracking spreadsheet with the typical columns and the typical fields. If you're trying to run a dog-walking business, for example, without you having to think through the structural components or get started.” While AI is an opportunity for GOOGL it is also a risk. OpenAI's ChatGPT got a lot of buzz in 2023, and rival MSFT made a $10 billion investment into the AI firm and incorporated its tech into its products, including Azure, Microsoft 365, and its search engine Bing. That upped the game and may have rushed GOOGL into an AI race before it wanted to be in one. The biggest risk from AI likely isn’t MSFT and ChatGPT, but from GOOGL cannibalizing its own revenue. If users can get information they need directly from Google without having to visit websites, it could potentially lead to less clicks on relevant ads. The counter argument is that it could lead to more use of the Google search engine, and that Google could benefit from more impressions while the company could create new forms of ads to benefit from AI answers. Outside on AI and technology disruption, the macroeconomy is another risk. As a leader in search and video, GOOGL makes the bulk of its money from advertising. As such, the company isn’t immune to a slowdown in ad spending. Unlike in the past where the secular trend could easily outpace any macro weakness, that isn’t necessarily the case anymore. Meanwhile, while Google Cloud has started to turn profitable, there is no guarantee that this will continue. You have three huge companies fighting for market share that could be willing to compete on price if necessary. AMZN’s AWS growth and operating margins have both fallen so far this year. Through the first 9 months to the year, its operating margins were 26.2% versus 30.0% last year. Growth so far in 2023, meanwhile, was 11% versus 32% during the same period in 2022. There is no doubt AMZN will try to fight back, and it has shown a willingness to sacrifice some margin to do so in the past. Regulation is another risk. The company has paid out a number of recent legal settlements recently. It recently agreed to pay $700 million and allow developers to offer direct payments on its Play app. It also settled a $5 billion lawsuit, terms not disclosed, in a privacy lawsuit because it tracked people who were viewing in private modes. Late last year, it reached a $391.5 million settlement with 40 states related to tracking personal data. The big risk, though, is the current DOJ case against the company that it is a monopoly that illegally used its power to its benefit. A loss could lead to a huge fine, a change in business practices, and a damage to brand reputation. It also would likely be followed by a similar case in Europe. Legal risks are always among the most difficult to quantify. GOOGL currently trades at about 11.5x 2024 EBITDA estimates of $139.9 billion. Stripping out its approximately $4.5 billion in losses on Other bets, the core business is only trading a 11.2x EBITDA. Based on the current 2025 EBITDA consensus of $158.3 billion, the stock trades at a 10.2x multiple. Revenue is projected to grow 11.3% in 2024 and 10.9% in 2025. The company has rebounded well this year, with revenue growth accelerating through the year, up 6% in constant currencies in Q1, 9% in Q2, and 11% last quarter. It also expanded its operating margin to 28% in Q3 from 25% a year ago. GOOGL currently has a free cash flow yield of about 4.4% based on FCF of $77.5 billion in the last trailing twelve months. GOOGL is among the cheaper mega-cap tech stocks. GOOGL Valuation Vs Peers (FinBox) GOOGL Valuation Vs Peers (FinBox) To get to a year-end 2024 fair value, I’d place between a 12-15x multiple of 2025 EBITDA for GOOGL, while assuming it adds about $75 billion in cash to its balance sheet or returns it shareholders through buybacks. That equates to a fair valuation range between $175-207. When it comes to technology, there is always the risk of disruption. It’s a common theme in tech that new upstarts eventually come along and disrupt incumbents. Starting from scratch gives these upstarts a huge advantage, as legacy incumbents are often weighed down by past designs and infrastructure investments that lead to inefficiencies as technologies shift. However, the fact that GOOGL has been built on its own flexible infrastructure helps protect it. The company also pours money into research and development to potentially “disrupt” itself. We are at the point where this is starting to play out, but GOOGL appears to be well prepared. GOOGL’s virtual monopoly on search is reason enough to own the stock at current levels. It is one of the largest and most dominant companies in the world. However, the company doesn’t sit on its laurels and continually looks at new products, services, and monetization efforts to drive growth. Longevity can be the biggest question around tech companies as they mature - it’s one reason why Warren Buffett has tended to avoid the sector. However, GOOGL has built a platform focused on simplicity and flexibility, which should allow it to endure and continue to prosper. At the same time, it continually pumps money into R&D to both drive growth and to help future proof itself. If you look at the number of products, services, and apps GOOGL offers, it’s actually quite staggering. GOOGL products are really ingrained in our everyday lives and often in our work lives as well. And it is GOOGL’s ability to continually innovate that will really drive growth moving forward. As such, I consider GOOGL a core, long-term holding. I have a “Buy” rating and $190 price target on the stock. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}