{
    "title": "Larry Page's Net Worth: How He Earns And Spends His $132 Billion Fortune",
    "date": "1/22/2024",
    "url": "https://www.therichest.com/larry-page-net-worth/",
    "text": "Larry Page's financial journey displays not just his tech expertise, but also how his business-oriented intellect built his fortune. Google's co-founder Larry Page, who also used to be the CEO of Alphabet, its parent company, has accrued personal wealth of more than $132 billion. Being one of the wealthiest people in the world, Page's financial journey is not only a testament to his entrepreneurial prowess but also a subject of intrigue for many. A Note About Larry Page's Net Worth: In early 2024, Bloomberg's \"Billionaires\" index continued tracking Larry Page's net worth in real-time, providing a more credible number to determine an exact sum. However, Page's net worth is subject to near-constant fluctuation. As such, while we used figures which were accurate at press time, the estimate changes on a near-daily basis. Page continues to increase his fortune through myriad assets such as Google, lucrative investments, and dividends. We can also look into the areas where he invests his money, such as philanthropy, real estate, emerging technology (i.e., flying cars), and life extension studies. With such massive financial resources, Page can sponsor his multiple interests and make a difference in the world. In this article, we will take a closer look at the economic life of one of the wealthiest people in tech. In the late 1990s, Larry Page and Sergey Brin were Ph.D. students at Stanford University, when they created Google as a research project. They made a new internet search engine technology dependent on evaluating website connections to develop more pertinent results for users. Page and Brin established Google Inc. to take this technology to market. Google's search engine soon became the most popular worldwide and a gateway to a then-rapidly growing web. Google is one of the world's dominant technology companies. Being a co-founder of Google with Larry Page earned and continues to make me a lot of money. Larry Page has made significant contributions to research on life extension, an endeavor which aims to increase human longevity. The nexus between biology and technology intrigues him. Page has funded research on aging at universities and firms, using techniques like cellular reprogramming and stem cell therapy to stop aging. Page believes that scientific advancements will allow humanity to live considerably longer, notwithstanding the controversy surrounding life extension. Through funding state-of-the-art longevity research, he intends to expedite anti-aging therapies and perhaps help extend the standard human lifespan during his lifetime. Larry Page has often used his money to invest in the startup stages of innovative companies that he considered promising. Some of his most profitable early investments were in companies such as Tesla, Planet Labs, and Kitty Hawk. At the early stage of the electric automaker's development, Page invested $100,000 in Tesla during Series A in 2004. Planet Labs is a satellite imaging startup he has supported since its founding. Page also invested in Kitty Hawk, a flying car startup that produced experimental aircraft. He has accumulated a fortune through prescient early investments in emerging technologies and provided funding for innovative companies consistent with his vision. Larry Page owns a slew of palatial properties and houses, both at home and overseas. His principal property is a $45 million mansion in Palo Alto, California, with environmentally friendly designs. In addition, Page owns a $15 million plantation-style mansion in Charleston, South Carolina. His global real estate holdings include an $18 million Georgian-style mansion in the United Kingdom purchased in 2021. In 2011, Page purchased a $15 million super yacht dubbed Senses for transportation. Luxury real estate and yachts are common expressions of wealth for billionaires like Page. Property, Location: Estimated Cost: Palo Alto Mansion $45 Million Charleston Mansion $15 Million United Kingdom Mansion $18 Million Larry Page has sizable assets invested in stocks, bonds, funds, and other securities. Although no longer CEO of Google (since late 2019), Page owns around six percent of Google's parent company, Alphabet, which affords him a hefty profit claim. Page will likely earn substantial dividend income from companies in which he holds stock. Page also generates interest income by lending money or keeping large cash balances in savings accounts or bonds. Passive income streams from his holdings in the form of dividends and interest allow Page to accumulate wealth without active participation, steadily. Larry Page directs a portion of his vast fortune towards philanthropy, aiming to create positive global change. Page established the Carl Victor Page Memorial Foundation in 2006, named after his father. It focuses on renewable energy, human health, and promoting entrepreneurship worldwide. Page has also personally funded efforts to battle infectious diseases and expand healthcare access in developing nations. While less visible publicly than other tech philanthropists, Page has contributed over $1 billion to charity. Larry Page resigned as CEO of Alphabet in 2019, but he stayed on the company's board of directors. Page still receives a salary in this advisory role, although less than his pay as chief executive. Public records show that Page was paid a salary of $1 as CEO, but his accurate compensation consisting of stock awards was over $200 million in some annual periods. Page will likely obtain seven-figure or high six-figure advisory fees as a board member and founder. Though not the primary source of his income, Page's salary from Alphabet provides steady cash alongside his other streams of income. Flying cars and other futuristic transportation technology have long captivated Larry Page. He is a board member and investor in the flying automobile startup Kitty Hawk. Kitty Hawk is creating electric vertical takeoff and landing aircraft for personal transportation. Page has also invested in Opener, a business that creates consumer-facing flying cars. His contributions make it possible to construct early prototypes and to conduct field-testing. The technology is still in its infancy, but Page hopes to bring the fantasy of flying automobiles to life by supporting early-stage firms. It fits with his idea of convenient, sustainable transportation in the future. Under Larry Page's leadership as CEO, Google bought the YouTube platform for $1.65 billion in stock in 2006. Page had the insight to acknowledge the budding video-sharing business at the time. Since joining Google, YouTube has expanded to become the world's largest online video platform, fueled by advertising revenue. As YouTube grew in popularity, so did its earnings. Page retains a six percent investment in Alphabet, providing him with a sizable portion of the revenue generated by YouTube ads. While no longer involved in operations, Page continues to create passive income from the foresighted YouTube acquisition and its rise as Google's crown jewel asset. Larry Page has ardently funded flying car startups like Kitty Hawk and Opener, driven by his longstanding vision of futuristic personal transportation. Through investing in and advising these companies, Page aims to overcome the technical challenges of vertical takeoff aircraft capable of whisking everyday commuters through the air. His involvement has enabled the testing of early flying car prototypes with features like foldable wings and drone technology. While regulatory and safety hurdles remain, Page's backing accelerates the pursuit of science fiction-esque flying vehicles as an eco-friendly alternative to congested highways. For Page, realizing the Jetsonian dream of flying cars is about progress through innovation. As of January 22nd, Larry Page's net worth stood at $132 billion, up more than $5 billion in January alone, and likely to continue rising due to his track record of smart investments.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Patrick Maina is a dynamic freelance writer who excels in the realms of entertainment and sports writing. With a passion for both fields, Patrick seamlessly blends the thrill of the game with the excitement of Hollywood, providing readers with engaging and informative content.\n When he's not in front of his computer, Patrick enjoys playing sports, talking to young people, and staying up-to-date with the latest in entertainment and athletics. He loves playing darts. Comic Katt Williams' net worth drew interest after his viral Club Shay Shay interview, and again after feds raided Diddy's house. His career spans stand-up, TV, and film, his films have grossed $2.5 billion, and Martin Lawrence has an estimated net worth of $110 million. Colognes are often among the most expensive accessories ... and the world's most expensive cologne surpasses the value of an average American house. John Travolta, a well-known actor and producer in Hollywood, has accumulated an estimated $250 million in his five-decade career. A rumor about Bruno Mars' supposed gambling debt went viral, causing MGM Resorts to issue a statement addressing it. Oprah Winfrey's ascent from modest origins to mega-wealthy is an inspiring story, and her net worth stands at a whopping $2.8 billion. "
}