{
    "title": "Alphabet (GOOGL) to Boost Bard Capabilities With New Updates",
    "date": "1/5/2024",
    "url": "https://www.zacks.com/stock/news/2206339/alphabet-googl-to-boost-bard-capabilities-with-new-updates",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    January 05, 2024 AMZN Quick QuoteAMZN MSFT Quick QuoteMSFT BIDU Quick QuoteBIDU GOOGL Quick QuoteGOOGL Better trading starts here. You follow Analyst Blog - edit You follow Zacks Equity Research - edit Zacks Equity Research Analyst Blog Alphabet (GOOGL Quick QuoteGOOGL  -  Free Report)     is launching a range of new features for Google Bard starting in 2024.The upcoming updates include custom bots, tasks, shared queries, \"Power Ups,\" and a paid \"Advanced\" tier.Further, Google will introduce new sections in Bard, namely \"Gallery\" and \"Tasks,\" to showcase its capabilities, including image generation and prompt improvement through the \"Power Up\" button.  Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Alphabet’s growing chatbot capabilities will further solidify its presence in the global chatbot market. This, in turn, will strengthen the company’s generative AI efforts, which are acting as key catalysts for the company. Alphabet’s shares have gained 56.2% in the past year compared with the Zacks Computer & Technology sector’s growth of 47.6%.Moreover, these efforts are expected to strengthen its presence in the booming generative AI market space. Per a Mordor Intelligence report, the chatbot market size is expected to hit $7.01 billion in 2024 and grow to $20.8 billion by 2029, witnessing a CAGR of 24.3% between 2024 and 2029.A Markets and Markets report indicates that the generative AI market will reach $76.8 billion by 2030, exhibiting a CAGR of 31.5% during the forecast period of 2023-2030.Solidifying prospects in these promising markets presents a significant growth opportunity for Alphabet. This, in turn, is expected to benefit its overall financial performance in the near term.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, indicating year-over-year growth of 15.6%. The estimate has been revised upward by 0.7% in the past 30 days. The latest move is likely to aid this Zacks Rank #2 (Buy) company to strengthen its competitive position against peers like Microsoft (MSFT Quick QuoteMSFT  -  Free Report)    , Amazon (AMZN Quick QuoteAMZN  -  Free Report)     and Baidu (BIDU Quick QuoteBIDU  -  Free Report)    , which are also making continuous efforts to capitalize on the growth opportunities present in the chatbot market. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Microsoft is gaining from the integration of OpenAI’s next-generation LLM — GPT-4 — into its search engine Bing and browser Edge.Microsoft‘s OpenAI also introduced fine-tuning for GPT-3.5 Turbo, enabling developers to customize models for specific use cases and run them at scale. This version outperforms GPT-4 on tasks, shortens prompts and speeds up API calls.Meanwhile, Amazon’s cloud-computing arm, Amazon Web Services, introduced Amazon Q, an AI-powered chatbot that assists in content creation and action-taking based on customer information repositories, code and enterprise systems.Further, Amazon Q streamlines tasks, accelerates decision-making and fosters creativity by providing personalized information and advice tailored to individual user identities, roles and permissions.Baidu, on the other hand, launched its chatbot, Ernie Bot, allowing users to ask questions, prompt it for market analysis and summarize documents.Additionally, Baidu's Ernie Bot chatbot has attracted over 100 million users in China, indicating strong growth potential and potentially boosting its Cloud business. Amazon.com, Inc. (AMZN) - $25 value - yours FREE >> Microsoft Corporation (MSFT) - $25 value - yours FREE >> Baidu, Inc. (BIDU) - $25 value - yours FREE >> Alphabet Inc. (GOOGL) - $25 value - yours FREE >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}