{
    "title": "Should You Buy Alphabet Inc Class C (GOOG) Stock Thursday Morning?",
    "date": "1/25/2024",
    "url": "https://www.investorsobserver.com/news/stock-update/should-you-buy-alphabet-inc-class-c-goog-stock-thursday-morning-2",
    "text": "Alphabet Inc Class C (GOOG) is higher by Thursday morning, with the stock adding 0.71% in pre-market trading to 151.41. \n\n\nGOOG's short-term technical score of 56 indicates that the stock has traded more bullishly over the last month than 56% of stocks on the market. In the Internet Content & Information industry, which ranks 107 out of 146 industries, Alphabet Inc Class C ranks higher than 71% of stocks.\n\nAlphabet Inc Class C has risen 5.35% over the past month, closing at $141.28 on December 28. During this period of time, the stock fell as low as $137.39 and as high as $150.01. GOOG has an average analyst recommendation of Strong Buy. The company has an average price target of $154.74.\n\n\n\n\n\n GOOG has an Overall Score of 67. Find out what this means to you and get the rest of the rankings on GOOG!\nSee Full GOOG Report\n\n\n\nAlphabet Inc Class C has a Long-Term Technical rank of 87. This means that trading over the last 200 trading days has placed the company in the upper half of stocks with 13% of the market scoring higher. In the Internet Content & Information industry which is number 92 by this metric, GOOG ranks better than 92% of stocks.\n\n\n\nImportant Dates for Investors in GOOG:\n\n\n-Alphabet Inc Class C is set to release earnings on 2024-01-30. Over the last 12 months, the company has reported EPS of $5.22.\n\n\n-We do not have a set dividend date for Alphabet Inc Class C at this time.\n\nClick Here To Get The Full Report on Alphabet Inc Class C (GOOG) Alphabet Inc Class C (GOOG) is higher by Thursday morning, with the stock adding 0.71% in pre-market trading to 151.41. \n\n\nGOOG's short-term technical score of 56 indicates that the stock has traded more bullishly over the last month than 56% of stocks on the market. In the Internet Content & Information industry, which ranks 107 out of 146 industries, Alphabet Inc Class C ranks higher than 71% of stocks.\n\nAlphabet Inc Class C has risen 5.35% over the past month, closing at $141.28 on December 28. During this period of time, the stock fell as low as $137.39 and as high as $150.01. GOOG has an average analyst recommendation of Strong Buy. The company has an average price target of $154.74.\n\n\n\n\n\n GOOG has an Overall Score of 67. Find out what this means to you and get the rest of the rankings on GOOG!\nSee Full GOOG Report\n\n\n\nAlphabet Inc Class C has a Long-Term Technical rank of 87. This means that trading over the last 200 trading days has placed the company in the upper half of stocks with 13% of the market scoring higher. In the Internet Content & Information industry which is number 92 by this metric, GOOG ranks better than 92% of stocks.\n\n\n\nImportant Dates for Investors in GOOG:\n\n\n-Alphabet Inc Class C is set to release earnings on 2024-01-30. Over the last 12 months, the company has reported EPS of $5.22.\n\n\n-We do not have a set dividend date for Alphabet Inc Class C at this time.\n\nClick Here To Get The Full Report on Alphabet Inc Class C (GOOG) Subscribe to our daily morning update newsletter and never miss out on the need-to-know market news, movements, and more. Thank you for signing up! You're all set to receive the Morning Update newsletter Stock Price data may be delayed up to 15 minutes. Copyright © 2024. Portions of this content may be copyrighted by Fresh Brewed Media, Investors Observer, and/or O2 Media LLC. All Rights Reserved. Portions of this content protected by US Patent numbers 7,865,496, 7,856,390, and 7,716,116. Investing in stocks, bonds, option and other financial instruments involve risks and may not be suitable for everyone. Portfolio results are unaudited and based on varying investment expiration dates. Terms of Service | Privacy Policy "
}