{
    "title": "Here's How Alphabet (GOOG) Utilized AI",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/alphabet-goog-utilized-ai-054623040.html",
    "text": "Wedgewood Partners, an investment management company, released its fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, Wedgewood Composite’s net return was 11.4% compared to the Standard & Poor’s 11.7%, Russell 1000 Growth Index’s 14.2%, and Russell 1000 Value Index’s 9.5% return for the same period. Year-to-date, the fund returned 29.2% compared to 26.3%, 42.7%, and 11.5%, respectively for the indexes. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Wedgewood Partners featured stocks such as Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On January 12, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $144.24 per share. One-month return of Alphabet Inc. (NASDAQ:GOOG) was 7.77%, and its shares gained 55.43% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.795 trillion. Wedgewood Partners stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: \"In 2023 Alphabet Inc. (NASDAQ:GOOG) was a top contributor to portfolio performance thanks to its search revenues accelerating due to the investments they have been making in AI over the past several years. The Company has spent almost $150 billion on research and development in just 5 years, creating products and services that helped drive a more than doubling of revenues. For example, almost 80% of the Company's advertising customers use an AI-enabled tool when they run their Google Search and YouTube campaign. Although the Company was criticized by the media for being “late” to the AI party when they rolled out a Gen-AI chatbot after Microsoft, Google has been creating scaled, context-aware AI functions for at least a decade, such as semantic search. While not necessarily a “large language model (LLM),” semantic search has become a mainstay in all-things search – predicting what users want to see or type before they type it. Consumers probably do not really care what kind of AI framework is being used behind the technology they are using, as long as it is useful to them – but these AI features are what have helped drive the rapid growth of Alphabet’s Google franchise…” (Click here to read the full text) A user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities. Alphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 163 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of third quarter which was 152 in the previous quarter. We discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared Tsai Capital Corporation's views on the company. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 12 Countries with Best Intelligence Agencies 16 States with Income Tax Cuts in 2024 16 Best Mid-Cap Growth Stocks To Buy Now Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}