{
    "title": "Is Most-Watched Stock Alphabet Inc. (GOOG) Worth Betting on Now?",
    "date": "2/21/2024",
    "url": "https://finance.yahoo.com/news/most-watched-stock-alphabet-inc-140023887.html",
    "text": "Alphabet Inc. (GOOG) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future. Over the past month, shares of this company have returned -4.4%, compared to the Zacks S&P 500 composite's +3% change. During this period, the Zacks Internet - Services industry, which Alphabet Inc. falls in, has lost 2.5%. The key question now is: What could be the stock's future direction? Although media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision. Earnings Estimate Revisions Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings. We essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements. For the current quarter, Alphabet Inc. is expected to post earnings of $1.49 per share, indicating a change of +27.4% from the year-ago quarter. The Zacks Consensus Estimate has changed +1.8% over the last 30 days. For the current fiscal year, the consensus earnings estimate of $6.77 points to a change of +16.7% from the prior year. Over the last 30 days, this estimate has changed +1.8%. For the next fiscal year, the consensus earnings estimate of $7.76 indicates a change of +14.7% from what Alphabet Inc. is expected to report a year ago. Over the past month, the estimate has changed +0.8%. Having a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Alphabet Inc. is rated Zacks Rank #3 (Hold). The chart below shows the evolution of the company's forward 12-month consensus EPS estimate: 12 Month EPS Projected Revenue Growth While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth. For Alphabet Inc. the consensus sales estimate for the current quarter of $65.95 billion indicates a year-over-year change of +13.6%. For the current and next fiscal years, $286.52 billion and $318.66 billion estimates indicate +11.7% and +11.2% changes, respectively. Last Reported Results and Surprise History Alphabet Inc. reported revenues of $72.32 billion in the last reported quarter, representing a year-over-year change of +14.6%. EPS of $1.64 for the same period compares with $1.05 a year ago. Compared to the Zacks Consensus Estimate of $70.81 billion, the reported revenues represent a surprise of +2.14%. The EPS surprise was +2.5%. The company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period. Valuation No investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance. Comparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is. The Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued. Alphabet Inc. is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade. Bottom Line The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet Inc. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}