{
    "title": "Elon Musk Calls Out Google's 'Woke Bureaucratic Blob' for Delay In Fixing \nGemini AI: 'This Is Extremely Alarming'",
    "date": "2/25/2024",
    "url": "https://www.tradingview.com/news/benzinga:29896dca2094b:0-elon-musk-calls-out-google-s-woke-bureaucratic-blob-for-delay-in-fixing-gemini-ai-this-is-extremely-alarming/",
    "text": "After revealing Alphabet Inc.'s GOOG GOOGL Google intends to take \"immediate action\" to fix \"racial and gender bias\" in Gemini AI, Elon Musk now says it will now \"take a few months.\" What Happened: On Sunday, Musk took to X, formerly Twitter, and said that he spoke with the senior Google executive again, who told him that fixing Gemini AI would take a few months. Musk has previously said that he spoke with a senior Google executive who assured him that the tech giant is taking \" immediate action to fix the racial and gender bias in Gemini.\" In his latest post, Musk said that the Google executive he spoke to, previously thought that the process to fix the errors with Gemini AI responses would be faster. The Tesla and SpaceX CEO said, \"Given that the Gemini AI will be at the heart of every Google product and YouTube, this is extremely alarming!,\" he said. See Also: Elon Musk Buys A New Windows PC, Fears Signing In Will Give Microsoft AI Access To His Computer: ‘This Is Messed Up’ The tech mogul further revealed, \"My response to him was that I doubted that Google's woke bureaucratic blob would *allow* him to fix it. Unless those who caused this are exited from Google, nothing will change, except to make the bias less obvious and more pernicious.\" Given that the Gemini AI will be at the heart of every Google product and YouTube, this is extremely alarming! The senior Google exec called me again yesterday and said it would take a few months to fix. Previously, he thought it would be faster. My response to him was that I... https://t.co/23uc7dd5fw Musk provided this latest information after an X user posted a screenshot of their interaction with Google Gemini in which they asked the chatbot if it is okay to misgender Caitlyn Jenner to stop a nuclear apocalypse, to which the reply came, \"No.\" The tech mogul also praised Jenner for saying that \"she would definitely prefer misgendering to nuclear apocalypse!\" Why It's Important: Users have been criticizing Google Gemini for either producing irrelevant images or outright refusing to generate them. In one case, Gemini failed to accurately generate images of Google co-founders Larry Page and Sergey Brin. Musk has also been openly voicing his dissatisfaction with Google Gemini. The tech also billionaire seized upon the public outcry against Google and revealed plans for an upcoming update to his AI chatbot, Grok, within the next fortnight. He has also slammed Jack Krawczyk, senior director for Gemini Experiences saying that the “tragic part” about Gemini “missing the mark” is that it is “directionally correct.” “I'm not picking on some rando. This nut is a big part of why Google’s AI is so racist & sexist,” he said about Krawczyk. Image Via Shutterstock Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Elon Musk Pushes xAI's Grok AI Chatbot After Google Gemini Comes Under Fire: ‘Truth... Never Been More Essential' © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}