{
    "title": "PINS Stock Alert: Pinterest Strikes New Deal With Google",
    "date": "2/9/2024",
    "url": "https://investorplace.com/2024/02/pins-stock-alert-pinterest-strikes-new-deal-with-google/",
    "text": " Heading into today, PINS stock had rallied 31% in the preceding three months Advertisement Source: DANIEL CONSTANTE / Shutterstock Pinterest (NYSE:PINS) stock is down 12% and trending on social media and financial news websites today after the company reported its fourth-quarter results. On the negative side, the social media website generated lower-than-expected Q4 revenue, while its guidance came in below analysts’ average estimates. On the other hand, PINS announced that it had made a new deal with Alphabet’s (NASDAQ:GOOG, NASDAQ:GOOGL) Google that is supposed to meaningfully boost Pinterest’s ad revenue. Pinterest generated Q4 sales of $981.3 million, below analysts’ average estimate of $990.2 million. However, the firm’s earnings per share, excluding certain items, came in at 53 cents, significantly higher than the mean estimate of 48 cents. Also noteworthy is that its top line increased 12% versus the same period a year earlier, while its monthly active users surged 11% year-over-year to 498 million, slightly above analysts’ mean estimate. On the guidance front, the firm expects its Q1 revenue to come in at $690 million to $705 million, or $697.5 million at the midpoint of the range. The latter figure was significantly below analysts’ mean outlook of $703 million. Under Pinterest’s deal with Alphabet, Google’s Ad Manager system will place ads on Pinterest. As a result, PINS will be able to start generating revenue from some of its overseas markets for the first time. Overseas users currently constitute 80% of its user base but just 20% of its sales. The firm reported that the deal has already had some impact on the demand for Pinterest’s ads and may start meaningfully affecting its financial results during the current quarter. Heading into today, the shares had gained 10% in the last month, 31% in the previous three months, and 54% in the last 12 months. On the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. Communications, Media, Social Media   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/pins-stock-alert-pinterest-strikes-new-deal-with-google/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}