{
    "title": "Is Alphabet a Millionaire Maker?",
    "date": "2/24/2024",
    "url": "https://www.fool.com/investing/2024/02/24/is-alphabet-a-millionaire-maker/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Alphabet (GOOG 0.21%) (GOOGL 0.04%) is one of the most disrespected stocks on Wall Street. Despite increasing its revenue growth pace and improving margins throughout 2023, it seemingly doesn't garner a premium valuation, unlike its tech peers. As a result, Alphabet's stock has fallen from its solid place as the third-largest U.S. company to the fifth, with Nvidia and Amazon, depending on the daily market fluctuations, passing it. With Alphabet nearing a value play combined with growth, it has the potential to provide market-crushing growth over the next few years, making it a no-brainer buy. But could it really be a millionaire maker? Alphabet is the parent company of many well-known brands like Google, YouTube, and Android. The thing this group has in common is advertising. Alphabet is primarily an advertising company, with 76% of revenue coming from this segment. While this industry struggled in late 2022 and early 2023, thanks to recession fears, it's showing its strength again. Alphabet's ad revenue rose 11% in the fourth quarter, with YouTube leading the way with 16% growth. YouTube (not YouTube TV) is a critical part of the ad business, as it controls about 9% of streaming time in the U.S. That's higher than any other service, including Netflix or Disney+. As a result, this segment should continue to see outsize growth as advertisers flock to where eyeballs are for maximum effectiveness. Alphabet is also involved in another critical area: cloud computing. Although Google Cloud is in third place, behind Amazon Web Services and Microsoft Azure, it still controls around 11% of the cloud computing market, according to Synergy Research Group. With the cloud computing market opportunity expected to expand from $626 billion in 2023 to roughly $1.3 trillion by 2028, being involved in this area is key for growth. Lastly, Alphabet has an important catalyst that could boost revenue in all previously discussed businesses: artificial intelligence (AI). Alphabet's generative AI model, Gemini, is among the best on the market. It beats many of its competitors (including OpenAI's ChatGPT) in head-to-head tests, including being the first model to outperform humane experts in the massive multitask language understanding test. Alphabet will eventually realize a lot of revenue from this platform as it integrates it into various offerings. Still, it can also improve Alphabet's internal processes by overhauling how its ad services work. Alphabet is doing well as a company, but how undervalued is the stock? Even though Alphabet has improved its margins through layoffs and other efficiency efforts, it's not done yet. Google was rumored to be laying off more employees as it restructures its workforce to utilize the power of AI. This should allow Alphabet to improve its margins as it tries to attain levels previously reached in 2022.  GOOGL Operating Margin (TTM) data by YCharts. TTM = trailing 12 months. If Alphabet can grow its profits faster than revenue, it will make the stock look cheaper with each quarter. With Alphabet's stock trading for just 21 times forward earnings, it's much cheaper than it has been in years.  GOOGL PE Ratio (Forward) data by YCharts. PE = price to earnings. Furthermore, the S&P 500 has a forward price-to-earnings (P/E) ratio of about 20.4 (according to FactSet), meaning Alphabet's stock trades close to that of an average company. With Alphabet's 13% revenue growth rate, improving margins, and AI leadership, it's safe to say Alphabet is far from average. As a result, I think it's fair to dub Alphabet's stock undervalued. If Alphabet received the same premium as Microsoft (34 times forward earnings), it would have a market cap of $2.9 trillion -- making it the second-largest company in the world. Alphabet doesn't get the same attention other tech stocks do, which makes it a no-brainer buy. But could it make you a millionaire? Likely not (unless you invest a large sum of money directly into it). Alphabet's stock is slated to crush the market with its undervalued state and strong growth. Owning it can accelerate your path to becoming a millionaire by improving your portfolio returns by a few percentage points over the market. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Keithen Drury has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}