{
    "title": "Alphabet is seeking outside investment for its GFiber internet business",
    "date": "2/11/2024",
    "url": "https://cyprus-mail.com/2024/02/11/alphabet-is-seeking-outside-investment-for-its-gfiber-internet-business/",
    "text": "March 28, 2024 March 28, 2024 March 28, 2024 March 28, 2024 March 28, 2024 March 27, 2024 March 24, 2024 March 23, 2024 March 20, 2024 March 8, 2024 March 3, 2024 March 2, 2024 March 28, 2024 March 28, 2024 March 27, 2024 March 27, 2024 March 28, 2024 March 22, 2024 March 21, 2024 March 21, 2024 March 20, 2024 March 15, 2024 March 15, 2024 March 9, 2024 February 26, 2024 February 24, 2024 Alphabet (GOOGL.O) plans to seek external investment for GFiber, its business selling Wi-Fi and internet connectivity in parts of the United States, the company told Reuters on Monday, as it looks to ramp up its expansion to more cities. GFiber, owned by Google’s parent company, competes with larger internet service providers including Comcast (CMCSA.O), Verizon Communications (VZ.N) and AT&T (T.N). Since vowing 14 years ago that it would boost internet speeds 100-fold through fiber-optic cables, GFiber has expanded to 15 states starting with its 2012 launch in Kansas. In the past six years, it has tripled its customer base, GFiber told Reuters, without specifying total users. It signed deals in 2023 that would bring its services to more than 25 additional cities. Still, the company faces competition from big incumbents and has yet to provide internet in large swaths of the US, including six of the 10 most populous cities including New York. “This next step of raising external capital will enable them (GFiber) to scale their technical leadership, expand their reach, and provide better internet access to more communities,” Ruth Porat, Alphabet’s president and chief investment officer, told Reuters in a statement. Alphabet declined to comment on the amount of funds GFiber was looking to raise or the valuation it was seeking. GFiber has already hired an investment bank to start the process of selling equity in the company, according to a source close to Alphabet’s efforts. The future goal is for GFiber to be independent from Alphabet, the source said on condition of anonymity. GFiber CEO Dinni Jain said in a statement: “We are now ready to scale this much faster.” GFiber is one of Alphabet’s so-called Other Bets, its collection of businesses other than Google that are at an earlier stage of research or commercialization. They include health company Verily and self-driving car business Waymo, which have both raised money from outside investors. In 2023, the Other Bets collectively lost $4.1 billion on revenue of $1.5 billion, primarily generated by internet and healthcare-related services, according to Alphabet’s annual report. Porat, who also serves as chief financial officer, told analysts last week that Alphabet aimed to “sharpen our investment focus, while capturing the upside given compelling technology breakthroughs across the portfolio” of Other Bets. One such business, Alphabet’s moonshot division known as X, was also looking for external capital to spin out more projects, she said at the time. Alphabet generally is working to revamp its cost base, Porat said. The company, like others in the technology sector, has recently announced job cuts. It declined to comment on whether GFiber’s fundraising effort had any relation to Alphabet’s overall cost-efficiency program. Sign up to the Cyprus Mail Newsletter We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. Please read this Cookie Policy carefully as it contains important information on who we are and how we use cookies on our website. This policy should be read together with our Privacy Policy  which sets out how and why we collect, store, use and share personal information generally, as well as your rights in relation to your personal information and details of how to contact us and/or the supervisory authorities in case you have any complaint. This Cookie Policy applies to the access and use of the Cyprus Mail Website hosted at https://cyprus-mail.com/ (hereinafter referred to as the “Website”), which is operated by NEO CYMED PUBLISHING LIMITED (hereinafter the “Company”, “we” or “us”). Our Company strives to protect personal data and apply high standards of conduct when it comes to privacy issues. We ensure that we provide our employees and staff with the appropriate training to handle personal data promptly and in accordance with the laws. Furthermore, we endeavour to ensure that any parties with whom we co-operate apply the same high standards when it comes to data protection and privacy as we do. Cookies A cookie is a small text file which is placed onto your device (e.g. computer, smartphone or other electronic device) when you use our Website. We use cookies on our Website. These help us improve your experience and at the same time help us to support our security features i.e. detect for malicious visitors, recognize you and your device and store some information about your preferences or past actions. For example, we may monitor . This information helps us to identify trusted web traffic, generate statistical and analytical data on how our visitors use our Website, our reach and click on links. We also uses cookies to personalize your online experience. Some of this data will be aggregated or statistical, which means that we will not be able to identify you individually. For further information on our use of cookies, including a detailed list of your information which we and others may collect through cookies, please see below. For further information on cookies generally, including how to control and manage them, visit the guidance on cookies published by the Office of the Commissioner of Personal Data Protection in Cyprus, or www.allaboutcookies.org/. Consent to use cookies and changing settings We will ask for your permission (Consent) to place cookies or other similar technologies on your device, except where they are essential for us to provide you with a service that you have requested (enabling basic functions like page navigation and access to secure areas of the Website) and ensure the security of our website and users. You may withdraw any consent provided regarding the use of cookies or manage any other cookie preferences by clicking on the Cookie Settings icon at the bottom end of any page on our Website. You can then adjust the sliders regarding the cookies as per your preferences. It may be necessary to refresh the page for the updated settings to take effect. For more information on how you can change your preferences via browser settings please see ‘How to turn off all cookies and consequences of doing so’ below. It may be necessary to refresh the page for the updated settings to take effect. Our use of cookies Categories of Cookies: The table below provides more information about the cookies we use and why: Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites  Third party access to the cookies The cookies we use will only be accessed by us and those third parties named in the table above for the purposes referred to in this Cookie Policy. Those cookies will not be accessed by any other third party. How to turn off all cookies and consequences of doing so If you do not want to accept any cookies, you may be able to change your browser settings so that cookies (including those which are essential to the services requested) are not accepted. If you do this, please be aware that you may lose some of the functionality of our Website. How to contact us Please contact us if you have any questions about this Cookie Policy or the information we hold about you. If you wish to contact us, please send an email to [email protected],  write to us at 195, Arch. Makariou III, Neocleous House, 1st-5th floor, 3030, Limassol, Cyprus, or call us at ++357 22818585. Changes to this policy This policy was last updated on 4/7/2023. We may change this policy from time to time, when we do so we will inform you via notification on our Website.   Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Please enable Strictly Necessary Cookies first so that we can save your preferences! "
}