{
    "title": "Meta, Alphabet Pushed to Enter Deals With Indonesia News Firms",
    "date": "2/20/2024",
    "url": "https://au.news.yahoo.com/meta-alphabet-pushed-enter-deals-015813230.html",
    "text": "(Bloomberg) -- Meta Platforms Inc. and Alphabet Inc. will be required to strike commercial deals with Indonesian news outlets to use their content. Most Read from Bloomberg Nvidia Surges After AI Sales Boom Shows No Signs of Letting Up Tech Up in Late Hours on Nvidia’s Bullish Outlook: Markets Wrap Your 401(k) Will Be Gone Within a Decade Biden Touts $1.2 Billion in Student Loan Relief With Eye to 2024 China Tightens Grip on Stocks With Net Sale Ban at Open, Close The publishers’ rule will push digital platforms to “support quality journalism” by entering licensing, revenue-sharing, data-sharing or other deals with local news outlets, without specifying how the income should be distributed. The regulation comes into effect six months after issuance on Feb. 20. “We want to provide a clear general framework for cooperation between news companies and digital platforms,” President Joko Widodo said on late Tuesday. “We still have to anticipate potential risks, especially during the implementation period, in terms of the response from digital platforms and the community using these services.” Indonesia joins Australia and Canada in pushing digital platforms to pay for news. Meta and Alphabet responded by restricting news availability on Instagram, Facebook and the Google search engine for users in Australia and Canada. Google warned the rule may hurt small publishers and creators, and “jeopardize the future of news media in Indonesia,” its Indonesia unit said in a blog post last July. Shares of local news outlets including PT Media Nusantara Citra and PT Tempo Inti Media may gain after the rule’s issuance. Most Read from Bloomberg Businessweek How Bad Movie Dubbing Led to the Fake Biden Campaign Robocalls Gene Therapy Makers Struggle to Find Patients for Miracle Cures US Citizens Become Collateral Damage in Global Sanctions Fight Pursuing ‘American Dynamism,’ Andreessen Horowitz Ups Its Game in DC The Dangers of Relying on the US to Power the Global Economy ©2024 Bloomberg L.P. Ever wondered what goes down at a tantric sex class? Here's your chance to find out. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos.  An American living down under has shared his views on one “weird” rule Australia has at Easter time. Fifteen years after his cheating scandal destroyed their marriage, Tiger Woods’ ex-wife Elin Nordegren is said to be living her “sweetest dream” with her new family. Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ...  An alleged plant thief who continued to come back to the same house has been stopped by the efforts of one very determined plant owner and technology. 'We love a girly that shreds,' one fan said of the very 'Barbie' moment. Network Ten is seeking to reopen Bruce Lehrmann’s defamation trial, two days before the judge was to hand down his decision.  Does bloody conquest, dark ritual or mercenary money explain a gold covered helmet found buried in a field? \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" The person who wrote on the road has been called a \"top bloke\" by motorists.  EXCLUSIVE: Eden Harper’s close friend has called out Jayden Eynaud after he was spotted looking very cosy with Lauren Dunn at a club. Read more. If you like your scrambled eggs soft and creamy, then there's one ingredient you need to start adding to your dish. Celebrity chefs swear by it. Fears that Putin could emulate Stalin by trying to further consolidate Eastern bloc  The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The former president’s son hemmed and hawed before eventually working in a Biden slam. Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more.  Ukrainian president says Easter shows ‘life can prevail’ ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’ \"The Daily Show\" star channeled the conservative channel to hilariously prattle on in defense of Trump. "
}