{
    "title": "Google posts strong Q4 2023 results despite January cuts",
    "date": "2/5/2024",
    "url": "https://mumbrella.com.au/google-posts-strong-q4-2023-results-despite-january-cuts-814517",
    "text": "Calls for government to put digital black-out on junk food ads Tourism WA’s new multi-year deal with UFC to bring two major events to Perth BMF poaches Google’s head of production to lead creative services ‘If you’re going to go big, make sure you don’t make a mistake’: What brand marketers can learn from the Major League Baseball CommsCon: How to handle a client who is sick of all this woke nonsense The renaissance of print magazines 1.6 million Aussies stuck in a gap between ideal home dreams and retail reality: What home retail marketers need to know Cheat Code: The moment you own it, never let it go Is SXSW no longer what it’s hyped up to be? The case for investing in independent publishers and news media ‘We’re telling the story of the deep ocean, because it can’t speak for itself’: An inside look into Emotive’s major pro-bono campaign with Deep Rising ‘There is more interest in Formula 1 now than ever before’: Trackside at the Australian Grand Prix A real-world look at how brands are achieving success in a cookieless world ‘I look forward to the day that we no longer need to mark IWD’: Is International Women’s Day tokenistic in adland? ‘We’ve all the great ingredients to succeed’: We take you into the kitchen for the new season of Ready Steady Cook New Mumbrellacast: Special edition live from Mumbrella CommsCon New Mumbrellacast: Agencies warned over Shell pitch, but who’s right?; TV network battles begin for 2024 New Mumbrellacast: Gender pay gap data revealed – we dissect the winners and losers; ARN responds to Jackie O’s KIIS FM walkout New Mumbrellacast: Woolies CEO steps down following disaster TV interview – but was that always the plan after all? New Mumbrellacast: Seven’s had a big week – some good news… and some bad news Nine’s Roll the Dice on Creativity Gumtree Media UpNext: The Future is Sustainable Apparently Spotify wants musicians to be OK with not being paid these days Taylor Swift fans are stealing CDs from JB Hi-Fi like it’s 1999 Brands take centre stage at Laneway Sydney Nine blames the robots for photoshopping politician’s body Coca Cola takes cue from triple j with The Bear inspired ad Volkswagen’s ‘RooBadge’ tool enters next trial phase onetwo agency gains more clients and a general manager Patties Food Group confirmed as Australian Olympic Committee’s official partner Special named top ‘most effective independent network in the world’ by WARC Always Human to take on PR for the Sydney Marathon New media platform focusing on Jewish issues launches Amplify shares two promotions and new hires The Mars Agency releases scorecard to help brands assess retail media networks oOh!media announces team for greater office and airport engagement CommsCon Awards Mumbrella Awards Sports Marketing Awards Publish Awards Retail Marketing Summit CommsCon Conference Mumbrella360 Finance Marketing Summit Google’s parent company Alphabet has posted a A$472.729 billion (US$307.39 billion) revenue for the 2023 full year, up 9% year on year (YoY).  Profit also saw a boost on the year prior, with Alphabet reporting a net income of A$113.43 billion (US$73.80 billion) in the 12 months to December 31, compared to A$92.18 billion (US$59.97 billion) over the same period in 2022.  Alphabet CEO, Sundar Pichai, said the business was “pleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud. Each of these is already benefiting from our AI investments and innovation. As we enter the Gemini era, the best is yet to come”. Ruth Porat, president and chief investment officer, added: “We ended 2023 with very strong fourth quarter\nfinancial results, with Q4 consolidated revenues of $86 billion, up 13% year over year. We remain committed to our work to durably re-engineer our cost base as we invest to support our growth opportunities.” In APAC, Q4 saw a reported increase in revenue of 17% YoY to A$21.47 billion (US$13.97 billion). Overall, 2023 was reported at a 10% increase YoY making for a regional revenue of A$79.14 billion (US$51.51 billion). Looking to advertising revenue, and Google Search, YouTube ads and Google Network all reported increased YoY revenue in the fourth quarter of 2023. The employee head count at the end of December was 182,502, down from 190,234 compared to the same period in 2022. The results come only weeks after the company confirmed mass redundancies across Google’s advertising sales team, following news earlier in the month of cuts to thousands of roles in hardware, voice-assistance and engineering. January also marked the start of Google’s long awaited deprecation of the third-party cookie, which will see cookies gradually disable across all Chrome users over the course of the year. Alphabet’s share price closed at A$220.56 (US$143.54) on 2 February. Its market capitalisation currently sits at A$2.73 trillion (US$1.78 trillion). Subscribe to the daily newsletter Kalila Welch joined the Mumbrella editorial team in November 2021. She took a brief career break in mid 2023 to complete her Masters of Journalism before returning to Mumbrella in October 2023. Login with: or Name Comment   Δ This website uses cookies for proper functioning and enhancing the user experience. By clicking 'Accept' on this banner or using our site you accept our use of cookies. You can also 'Read More' to view our Cookie Policy and learn how to control them. Read More Sign up to our free daily update to get the latest in media and marketing. "
}