{
    "title": null,
    "date": "2/18/2024",
    "url": "https://247wallst.com/technology-3/2024/02/18/google-faces-major-ai-challenge/",
    "text": "After over two decades of holding the lead position among search engines, by far, in the US, Europe, Latin America, and much of Asia, Alphabet’s (NASDAQ: GOOG) Google may face its first challenge due to AI. Several companies believe that, with artificial intelligence, they can build better search algorithms. If so, it could do major damage to Google’s revenue and that of its parent. Alphabet has started to cut costs. It recently laid off a number of people. The New York Times tested a new AI-based search engine called Perplexity. Jeff Bezos is among its investors. It raised money recently at a $520 million valuation. After extensive testing, the Times writer observed, “I’m now more convinced that A.I.-powered search engines like Perplexity could loosen Google’s grip on the search market, or at least force it to play catch-up.” He also pointed out that Google has several products like Gmail and Google Maps. Additionally, it may be hard to break the search habits of hundreds of millions of people. The largest threat to Google is that OpenAI, the massive AI company with close ties to Microsoft, may be working on its own search engine. Quartz reports, “Google was caught flat-footed by the AI apocalypse, which could spell disaster for the search giant.” A great deal is at stake. Alphabet relies on Google and YouTube for almost all of its revenue. It has a market cap of $1.7 trillion, making it among the world’s most valuable companies. Its stock has been up 154% in the last five years. In the year that just ended, it had revenue of $307 billion and net income of $74 billion. Its revenue continues to grow at a low double-digit pace. After years of dominance, Google may finally have some competition. Robinhood revolutionized commission free investing, and it continues to do so today. With a few simple taps you can trade stocks like Nvidia and Amazon, market beating mutual funds, and trade options with Robinhood Financial. FDIC insurance coverage is just another benefit. And, you can buy and sell cryptocurrencies like Bitcoin (BTC), Ethereum (ETH), and Dogecoin (DOGE) with Robinhood Crypto. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}