{
    "title": null,
    "date": "2/16/2024",
    "url": "https://finance.yahoo.com/news/2-ridiculously-cheap-growth-stocks-111000651.html",
    "text": "Given the market volatility of the past few years, it's nice to see that growth stocks are roaring back and looking red hot in 2023 and 2024. Huge gains for companies including Nvidia, Microsoft, and Apple have helped push the S&P 500 index up approximately 20% over the last 12 months. Meanwhile, the even more technology-heavy Nasdaq Composite index is up roughly 32% across the stretch. As impressive as the recovery for companies with growth-oriented valuations has been, there are still stocks in today's bull market that look quite cheap, especially when evaluated based on their earnings performance and long-term expansion potential. If you're looking for attractively valued growth plays to load up on in 2024, read on to see why two Motley Fool contributors identified Alphabet (NASDAQ: GOOGL)(NASDAQ: GOOG) and StoneCo (NASDAQ: STNE) as top buys at today's prices. Parkev Tatevosian: Alphabet, the parent company of Google and YouTube, has stock trading at a relatively cheap valuation considering the lucrative businesses it operates. The company makes its money primarily from advertising. Marketers are attracted to the wide reach of its ad-supported products and its ability to target specific types of customers. Over the last decade, Alphabet's annual revenue has grown from $66 billion in 2014 to $307 billion in 2023 (a 365% increase). Much of that revenue ends up making its way to the company's profitable bottom line. Over those same years, Alphabet's operating income soared from $16.5 billion to $84.3 billion (an even better 411% increase). Alphabet's customers -- marketers and advertisers -- get excellent returns on their spending with Alphabet because they get targeted access to the billions of folks that use Google Search, Gmail, and YouTube. The evidence of that is in Alphabet's continued revenue and profit expansion. If the returns were not attractive, advertisers would not keep coming back. To make the case for Alphabet stock more compelling, it is selling at a cheap valuation compared to its three-year average. Alphabet's forward price-to-earnings ratio of 18.8 is typically reserved for companies demonstrating limited growth, skinnier margins, and a less fortified business. Investors could do worse than adding Alphabet shares to their portfolios while they are cheap. Keith Noonan: StoneCo is a Brazilian financial-technologies company that provides payment processing services and retail-management software to small and medium-sized businesses (SMBs). Unfortunately, the company also made an ill-fated push into providing loans to SMBs that wound up tanking its valuation. Due to its reliance on insufficient and inaccurate data from Brazil's national registry system, the company wound up extending loans to businesses that weren't actually creditworthy. This problem was made worse by pandemic-related headwinds that resulted in an increase in business closures. StoneCo was left holding the bag, and it took large losses due to the poor quality of its loan portfolio. Even after some recent gains, the fintech stock is still down roughly 82% from its high. But there's a silver lining for investors today -- and seizing on the opportunity could deliver huge wins for your portfolio. Today StoneCo is trading at roughly 14 times this year's expected earnings and roughly 2 times expected sales. Here's the kicker: The company has resolved the issues with its credit business and is posting very strong growth thanks to its payment-processing business. In the third quarter, the company's revenue increased 25% year over year. Meanwhile, non-GAAP (adjusted) earnings per share were up 302%. On a pure price-to-earnings basis, StoneCo is valued like a company that could only grow profits at a mid-single-digit rate annually over the next decade. But there are good reasons to think that won't be the case. StoneCo has continued to attract new payments customers and increase the fees it takes for processing transactions at encouraging rates. This suggests that demand for its services remains high, and the company's management forecasts that it will manage to grow adjusted net income at a 31% compound annual growth rate from 2024 through 2027. If StoneCo were to grow its earnings at just half of management's projected rate, I think the stock would be cheap on a fundamental basis at today's prices. If the company manages to meet or exceed its target for earnings growth, shares could deliver explosive upside. I've been loading up on StoneCo stock in 2024, and believe that its risk-reward profile is very attractive at current valuation levels. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keith Noonan has positions in StoneCo. Parkev Tatevosian, CFA has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet and StoneCo. The Motley Fool has a disclosure policy. 2 Ridiculously Cheap Growth Stocks to Buy Hand Over Fist in 2024 was originally published by The Motley Fool Related Quotes "
}