{
    "title": "Alphabet's Trillion-Dollar Trajectory: 2 Reasons GOOG Is Still a Long-Term \nBuy",
    "date": "3/14/2024",
    "url": "https://investorplace.com/2024/03/alphabets-trillion-dollar-trajectory-2-reasons-goog-is-still-a-long-term-buy/",
    "text": " Alphabet looks very attractive for value-conscious growth investors Advertisement Source: turtix / Shutterstock.com Alphabet (NASDAQ:GOOGL,NASDAQ:GOOG) stock has surged over 50% since last year. With a forward P/E ratio below 20, growth investors are increasing their stake in this search behemoth. I’ve included myself in the bullish camp on Alphabet, largely due to its valuation and strong recent earnings results. The bear case for Alphabet’s core business is real because of AI competitors. The stock’s multiple reflects the difficulty of driving growth because of the company’s size. Let’s dive into whether Alphabet should still be considered a buy for interested growth investors right now. Despite its 338% share surge over the past 10 years, with a market cap about to reach $1.7 trillion, Alphabet still has investors scratching their heads over its allure. Over the last decade, Alphabet’s performance has been remarkable. The company’s compound annual growth rates hovered around the 18% range. That’s incredible, and a repeat of this performance for the next decade is unlikely. Growth is slowing, and the company’s multiple has come down to reflect this. Now, the question is whether the market is getting it wrong (as it has in the past) with Alphabet’s forward prospects. Alphabet provided some robust financials recently, delivering $285 billion in operating income during the past three years. Over the past five years, the company’s stock buyback program has reduced the number of outstanding shares by 10%. Thus, there’s a lot for bulls to continue to be excited about. With fifteen products that serve half a billion people apiece and six that serve over two billion, Alphabet is at the top of the world for digital services. Google Search has over 90% of the global market share and makes up 56% of the company’s revenue. The value of Alphabet goes beyond its online properties. In 2023, YouTube, which it bought for $1.7 billion in 2006, saw sales of $31.5 billion, beating even Netflix in U.S. TV viewing time. Because of the growing demand for cloud services, Google Cloud is expected to boost its revenue by 26% in 2023 and maintain a positive operating income. With well-known and loved brands like YouTube and Android, Alphabet sits on the throne in the information technology industry and holds 25% of the market share in digital advertising. Even with recent criticism of its AI initiatives (including the release of Gemini) its stock dropped 7% because of its subpar performance. Despite facing difficulties in improving its AI technology, Alphabet is still financially strong, clearing seen through its over $70 billion in free cash flow from last year. This stock remains a long-term buy in my books, particularly at a valuation of less than 20-times forward earnings. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Artificial Intelligence, Cloud, Communications, Media, Social Media, Streaming, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/alphabets-trillion-dollar-trajectory-2-reasons-goog-is-still-a-long-term-buy/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}