{
    "title": "Alphabet's (GOOGL) Waymo Makes Way to Austin, Boosts Efforts",
    "date": "3/7/2024",
    "url": "https://finance.yahoo.com/news/alphabets-googl-waymo-makes-way-174500944.html",
    "text": "Alphabet’s GOOGL Waymo is leaving no stone unturned to expand its ride-hailing service — Waymo One — across the United States.This is evident from the latest move of testing its self-driving vehicles on the streets of Austin, TX, which was declared as the fourth city for Waymo One last year.Waymo’s electric Jaguar I-PACE vehicles, which are equipped with advanced Waymo Driver technology, will be tested across 43 square miles in Austin, which includes the heart of downtown, Barton Hills, Riverside, East Austin and Hyde Park. The latest move bodes well for Waymo’s growing efforts toward reaching out to more customers on the back of its robust driverless technology and expansion efforts.  Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Recently, the company entered a multi-year partnership with Uber Technologies UBER to offer an autonomous driving experience to the latter’s customers in Phoenix, AZ. Uber, which offers a ride-sharing service, strives to infuse Waymo’s autonomous driving technology into its operations on the back of this partnership.It is in sync with the company’s deepening focus in Phoenix.GOOGL’s expansion of the operating area of Waymo One in the city, which now includes rides to Phoenix Sky Harbor International Airport, remains a plus.Waymo’s effort to expand its operations to downtown Phoenix remains noteworthy. It also rolled out a rider-only service in downtown Phoenix.Apart from Phoenix, Waymo’s expansion to San Francisco, CA, on the back of its Early Rider program called Trusted Tester, is a major positive. Notably, this marked its first expansion outside Phoenix.Recently, Waymo received regulatory approval to expand in the San Francisco Peninsula and Los Angeles.Waymo is also testing its self-driving vehicles on the streets of Bellevue, WA. The above-mentioned endeavors will help Alphabet further penetrate the booming autonomous driving space.Per a Precedence Research report, the global autonomous vehicle market is expected to reach $2.35 trillion by 2032, witnessing a CAGR of 35% between 2023 and 2032.We believe that Alphabet’s growing prospects in this promising market will help it win investors’ confidence in the days ahead.Notably, Alphabet has gained 40% in the past year.Additionally, expanding Waymo’s efforts will continue to strengthen Alphabet’s competitive position. Its peers like Amazon AMZN and Baidu BIDU are also making every effort to capitalize on the growth prospects in the autonomous driving space.Amazon’s buyout of Zoox, a developer of autonomous ride-hailing vehicles, remains a major positive. The company’s launch of its first self-driving robotaxi strengthened its position in the autonomous driving space.Zoox has been testing its autonomous vehicles in San Francisco, Las Vegas and Foster City. It intends to open an engineering office and operations facility, which will act as a base for its autonomous vehicle testing.It also plans to establish a large-scale manufacturing facility for its autonomous vehicles. The facility will be located at Hayward Exchange @ 92, 25810 Clawiter Rd. The facility is being built to expand Zoox’s presence in the East Bay.Meanwhile, Baidu is gaining from the strong momentum of the Apollo Go Robotaxi service across China on the back of its increasing availability in several cities and a growing number of rides.Apollo Go is available in ten cities, namely Beijing, Shanghai, Guangzhou, Shenzhen, Chongqing, Changsha, Cangzhou, Yangquan, Wuzhen Water Town and Wuhan.Nevertheless, Alphabet’s growing autonomous driving initiatives are likely to help it stay ahead of the curve.Currently, Alphabet carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Baidu, Inc. (BIDU) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Uber Technologies, Inc. (UBER) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}