{
    "title": null,
    "date": "3/21/2024",
    "url": "https://ca.movies.yahoo.com/movies/alphabet-googl-outpaces-stock-market-214509028.html",
    "text": "Alphabet (GOOGL) closed the most recent trading day at $2,142.87, moving +1.05% from the previous trading session. The stock outpaced the S&P 500's daily gain of 0.22%. Meanwhile, the Dow lost 0.13%, and the Nasdaq, a tech-heavy index, added 0.22%. Coming into today, shares of the internet search leader had lost 1.62% in the past month. In that same time, the Computer and Technology sector lost 9.55%, while the S&P 500 lost 10.02%. Wall Street will be looking for positivity from Alphabet as it approaches its next earnings report date. On that day, Alphabet is projected to report earnings of $26.55 per share, which would represent a year-over-year decline of 2.6%. Meanwhile, our latest consensus estimate is calling for revenue of $58.05 billion, up 13.93% from the prior-year quarter. For the full year, our Zacks Consensus Estimates are projecting earnings of $111.86 per share and revenue of $245.69 billion, which would represent changes of -0.3% and +15.85%, respectively, from the prior year. Investors might also notice recent changes to analyst estimates for Alphabet. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook. Based on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.67% lower within the past month. Alphabet is currently sporting a Zacks Rank of #3 (Hold). Investors should also note Alphabet's current valuation metrics, including its Forward P/E ratio of 19.16. This valuation marks a discount compared to its industry's average Forward P/E of 19.7. We can also see that GOOGL currently has a PEG ratio of 1.01. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Internet - Services was holding an average PEG ratio of 1.36 at yesterday's closing price. The Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 202, putting it in the bottom 21% of all 250+ industries. The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. To follow GOOGL in the coming trading sessions, be sure to utilize Zacks.com. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report To read this article on Zacks.com click here. Zacks Investment Research The EV and hybrid sales trend will be key Q1 auto sales reports. GM, Toyota and traditional auto stocks are soaring. Fast food workers in California will receive $20 minimum wage starting Monday April 1st. But what does that mean for jobs? Charles was applauded by crowds as he and the Queen re-emerged from St George’s Chapel at Windsor on Sunday morning. Liverpool are looking to go top of the Premier League as they take on Roberto De Zerbi’s Brighton at Anfield All the information you need to get ready for the Toyota Owners 400 NASCAR Cup Series race, Sunday night at Richmond Raceway. EastEnders star Balvinder Sopal has paid an emotional tribute to her \"fierce\" mother, Nirmal. Forays into psychedelia and world affairs serve the reformed British shoegaze pioneers well on their seventh album The former RNC chair was pushed out after a staff revolt – but why did NBC hire her in the first place? Legislation targeting baseless concept to keep state’s skies clear essentially futile given politicians cannot control sky and wind This powerful reimagining of the soprano’s toxic relationship with the Greek shipping tycoon captures the drama and heartbreak of one of the most celebrated singers of all time After he suddenly abandoned her, Chimene Suleyman bonded with other women who had also been tricked by her ex-partner More than 50 years ago, the Observer interviewed British women about their ‘everyday lives’. Gaynor Evans, one of those who took part, offers an update on what has changed for her Check out all the fighter walkout songs from Saturday's UFC on ESPN 54 event in Atlantic City. Food experts say a common misconception among people is the \"two-hour rule.\" Follow all the action from Anfield “A man rose from the dead. How’s that for an outrageous dream? That’s a dream people were inspired to die for,” writes Bunny Stevens. The Sacramento area’s concert scene is in full bloom this April. Just 40 minutes outside of Paris, the La Vallée Village shopping complex offers a retail experience unlike any other. Here’s everything you need to know. A fulfilling retirement is about more than money and wealth. “Cities should not allow placement of these towers within 500 feet of anyone’s home, especially a retirement community.” | Letters to the editor "
}