{
    "title": "Gene Munster Agrees With Dan Nathan's Views That These 2 Magnificent 7 \nCompanies Are AI Underdogs: 'I Believe ...",
    "date": "3/20/2024",
    "url": "https://www.tradingview.com/news/benzinga:6a7a1017d094b:0-gene-munster-agrees-with-dan-nathan-s-views-that-these-2-magnificent-7-companies-are-ai-underdogs-i-believe-that-will-change/",
    "text": "Deepwater Asset Management's managing partner Gene Munster has echoed the views of Dan Nathan from RiskRevarsal Advisors, saying that Apple Inc. AAPL and Alphabet Inc. GOOG GOOGL are underdogs in the artificial intelligence arena. What Happened: On Thursday, Munster took to X, formerly Twitter, and shared his conversation with Nathan on a podcast saying, \"Dan Nathan said it well, $GOOG and $AAPL are the AI underdogs. I believe that will change.\" Dan Nathan said it well, $GOOG and $AAPL are the AI underdogs. I believe that will change. https://t.co/JB6n0VJnZE See Also: Gene Munster Says US Government Likely To Block Top AI Firms From Foreign Funding Over National Security, Calls AI ‘The Next Arms Race’ On the podcast, the duo spoke about multiple subjects including ongoing TikTok debacle, Nvidia Corporation and the reported partnership discussions between Apple and Google regarding integrating the latter's AI model Gemini to power the new iPhone software features. At one point, Nathan said that if these two Magnificent 7 companies tie up, it would be \"fascinating,\" as it would get a \"good narrative going.\" \"It would be amazing that these two companies would be the underdogs ... that is the thing, and then when you see Jensen Wang walk out at the SAP Center yesterday to 10,000 adoring fans. Apple can’t even do live events anymore for things like Vision Pro because there’s just no excitement around their product,\" Nathan said, to which Munster largely agreed. Nathan added, \"I think we’re going to look back on this period and we’re gonna have some really interesting — whether it’s waves, whether it’s paradigm shifts, whatever. I think we’re going to look back in the last 12 months and there’s going to be, you know, a lot to debate.\" Why It's Important: Earlier this week, Mark Gurman reported that Apple was in similar discussions with both Google and ChatGPT-parent OpenAI, to license their AI models. Apple's reported discussion with Google has not been received well by some analysts. Previously, Tesla investor Ross Gerber criticized this reported deal calling it a \"sad admission\" of missed opportunities. Billionaire investor Chamath Palihapitiya also thinks that this reported decision mirrors Cupertino’s approach toward electric cars, as it was previously reported that Apple decided to retreat from the automotive sector. Check out more of Benzinga’s Consumer Tech coverage by following this link. Photo Courtesy: Koshiro K On Shutterstock Read Next: Gene Munster Predicts ‘Boat Loads’ Of Funding For Elon Musk’s xAI After It Open Sources Grok: ‘Many Will See This As A Swing At OpenAI’ © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}