{
    "title": "Google trims jobs in trust and safety while others work 'around the clock'",
    "date": "3/3/2024",
    "url": "https://www.mvariety.com/business/google-trims-jobs-in-trust-and-safety-while-others-work-around-the-clock/article_d3e2cfae-d91f-11ee-9c97-839cd99bd9d1.html",
    "text": "  The Google logo at Alphabet's Googleplex headquarters in Mountain View, California. (Dreamstime/TNS) CHARLOTTE, N.C (TNS) — Alphabet Inc.’s Google is laying off a handful of employees on its trust and safety team as part of broader staff cuts, even as it’s asking members of that group to be on standby over the weekend in order to troubleshoot problematic outputs related to its flagship generative AI tool, Gemini. The cuts in the trust and safety solutions group were confirmed by people with knowledge of the decision who asked not to be identified because Google isn’t publicly disclosing details. Fewer than 10 people will be affected, one of the people said, out of a team of about 250. Google’s various trust and safety teams are tasked with setting up guardrails on its AI products, trying to predict how bad actors could manipulate the tools and conducting risk evaluations to ensure the tools are safe for Google’s global user base. Google is increasing its reliance on its trust and safety staff, even if it’s doing so with fewer people. Recently, some employees have been asked to work over the weekend to test Gemini’s outputs to prevent further missteps by the tool, according to one of the people familiar with the moves. “We need multiple volunteers on a stand-by per time block so we can activate rapid adversarial testing on high priority topics,” a Google leader wrote in an email to trust and safety employees. While the cuts won’t impact the group’s members directly working on Gemini, one of the people said, Google’s broader trust and safety team has been managing an overwhelming workload as the company deals with the fallout of Gemini generating ahistorical images of people, another person said. Google framed the job cuts as a move that had been long planned and part of its ongoing belt-tightening efforts. Since mid-January and throughout February, the company has been reorganizing employees across teams, and hasn’t indicated when restructuring would stop. “We’re responsibly investing in our company's biggest priorities and the significant opportunities ahead,” a Google spokesperson said in a statement to Bloomberg. “We’re simplifying our structures to give employees more opportunity to work on our most innovative and important advances and our biggest company priorities, while reducing bureaucracy and layers.” Google added that the reorganization to the team affected would help it provide more support for its AI products and would allow the tech giant to eventually add more trust and safety roles at the company. Googlers working on ensuring the company’s AI tools are safe and accurate — including some members of the trust and safety teams — have struggled with low morale and a feeling of disempowerment over the past year as the company accelerated its pace of rolling out products to keep up with rivals such as OpenAI. In an email to staff late on Tuesday, Google Chief Executive Officer Sundar Pichai acknowledged the company’s increased dependence on the teams, saying employees were “working around the clock” to remedy the problems users had flagged with Gemini’s responses. He added that Google had already seen “a substantial improvement on a wide range of prompts” in Gemini as a result. (This is not a scientific poll.) Click below to view our latest e-Edition. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: "
}