{
    "title": null,
    "date": "3/13/2024",
    "url": "https://au.lifestyle.yahoo.com/lifestyle/meta-focus-strong-report-alphabet-110000953.html",
    "text": "By Nivedita Balu and Danielle Kaye Feb 2 (Reuters) - The holidays were a gift to Alphabet Inc's Google, quarterly results showed. Next up: Facebook owner Meta Platforms Inc. Alphabet's internet advertising, cloud computing and hardware businesses helped the Google owner soundly beat Wall Street targets for the holiday quarter, sending shares up as much as 9% in after-hours trading. Brian Wieser, global president of business intelligence, at the ad-buying giant GroupM, said Alphabet's results reinforce that the advertising industry as a whole is in a strong position, despite changes by Apple Inc that prevent advertisers from tracking iPhone and iPad users without their consent. That has been a concern for social media companies including Meta and Snap Inc. Unlike the previous quarter, during which marketers low on product and tech industry privacy changes led to lost sales, Google did not note any particular challenges this time around. \"It sets up well going into Meta Platform's earnings,\" after the market close on Wednesday, said Gene Munster of investment firm Loup Ventures. Alphabet's results drove a rally across internet advertising companies. Shares of Trade Desk Inc, Magnite Inc , PubMatic Inc and several more companies that both compete and work with Google all rose in after hours trading late Tuesday. Recent revenue beats by Alphabet, Apple and others in the tech industry come amid concerns that software and equipment makers alike cannot hold on to gains in usage from earlier in the pandemic. In a generally jittery market, as inflation kicks in, shares fell last month. Still, \"When you look at markets, when the big companies are doing well, you know it's hard to say that there's a problem with the economy,\" said Paul McCarthy, president at investment firm Kisco Capital. In the fourth quarter, Alphabet's advertising revenue rose 32.5% to $61.2 billion, $4 billion above Wall Street targets, according to Refinitiv data. Microchip maker Advanced Micro Devices Inc also posted strong results on Tuesday for the just-ended quarter. AMD projected 2022 revenue above expectations, driving its shares up as much as 11% in after-hours trading. But with further inflation looming, Sophie Lund-Yates, equity analyst at Hargreaves Lansdown, cautioned that shares of tech companies are \"unlikely to have seen the worst of the pain.\" (Reporting by Danielle Kaye, Nivedita Balu and Paresh Dave; editing by Peter Henderson and Richard Pullin) Ever wondered what goes down at a tantric sex class? Here's your chance to find out. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos.  An American living down under has shared his views on one “weird” rule Australia has at Easter time. Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ... An alleged plant thief who continued to come back to the same house has been stopped by the efforts of one very determined plant owner and technology.  Daylight saving is coming to an end soon, here’s what you need to do to ensure you don’t sleep past your alarm. 'We love a girly that shreds,' one fan said of the very 'Barbie' moment. Network Ten is seeking to reopen Bruce Lehrmann’s defamation trial, two days before the judge was to hand down his decision.  Does bloody conquest, dark ritual or mercenary money explain a gold covered helmet found buried in a field? \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" The person who wrote on the road has been called a \"top bloke\" by motorists.  EXCLUSIVE: Eden Harper’s close friend has called out Jayden Eynaud after he was spotted looking very cosy with Lauren Dunn at a club. Read more. If you like your scrambled eggs soft and creamy, then there's one ingredient you need to start adding to your dish. Celebrity chefs swear by it. Fears that Putin could emulate Stalin by trying to further consolidate Eastern bloc  The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The NSW schoolgirl has not been seen since being dropped at school on Thursday morning. Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more.  Ukrainian president says Easter shows ‘life can prevail’ ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’ The Australian model's father was rumored to have an issue with the couple's provocative public appearances. "
}