{
    "title": "Google: Why Investors Can Stop Searching for AI Stocks and Buy Alphabet \nShares",
    "date": "3/9/2024",
    "url": "https://www.thehindubusinessline.com/portfolio/stock-fundamental-analysis-india/google-why-investors-can-stop-searching-for-ai-stocks-and-buy-alphabet-shares/article67931640.ece",
    "text": "Get businessline apps on Connect with us TO ENJOY ADDITIONAL BENEFITS Connect With Us Get BusinessLine apps on Comments READ LATER Amidst the global frenzy for AI stocks, it is usually hard to find a solid AI play at a discount. However, when such opportunities are presented due to some misplaced pessimism around a stock, it is time to capitalise on it. The stock of Alphabet (Google) is now presenting such an opportunity which investors can take advantage of. Also read: Editorial. Digital markets law needed to curb monopolistic excesses With some recent controversies surrounding its Gemini large language model and perceived threats to its core search business from AI products/platforms of competitors, Google has been an underperformer ytd (3 per cent) versus peers such as Microsoft (up 10 per cent), Meta (up 48 per cent) and Amazon (up 18 per cent) as well as versus the broader index S&P 500 ( up 9 per cent). However, trading at a modest one-year forward PE of 18.5 times (5-year average at 20.8 times), it presents an opportunity to buy one of the world’s foremost technology companies at attractive valuation levels. Investors with a 3-5 year perspective can buy the stock at current levels and also accumulate on dips. Not only does Google have a solid core business, but it is also well-positioned in terms of technological prowess, balance sheet strength, financial resources, depth of management and technological talent to potentially become a leading player in the sunrise AI sector. The long-term commercial opportunity in AI is currently unquantifiable, but needless to say it will be huge and can drive meaningful wealth for investors. This wealth creation prospect still remains in the realm of probability and not certainty. At the same time, the interesting thing with the stock of Google is that even assuming an overly pessimistic scenario of stable to declining core business if and when any competitor’s AI chatbot impacts Google’s core search business and assuming zero value for its AI business prospects, 18.5 times earnings is not a very expensive price to pay. This makes the risk-reward very favourable for long-term investors at current levels. Google functions via three reporting segments — Google Services (88.7 per cent of revenue), Google Cloud (10.8 per cent) and Others (houses moonshots businesses). Google Services, which originally started with just Google’s search engine during the dotcom boom, today encompasses multiple products and platforms such as Android, Chrome, Gmail/drive, Google Maps and YouTube. These businesses primarily make money by delivering advertising that appears on these properties. These ads consist of both performance advertising (paid clicks that result in direct engagement of users with advertisers) and brand advertising (display ads/videos and interactive ads). Over the years, the company has been diversifying away from advertisements as well with subscription services on platforms such as YouTube Premium, YouTube TV, NFL Sunday Ticket (sports subscription), Google Drive, etc. Besides these, Google also makes money from sale of ads and in-app purchases in Google Play app store and sale of devices (pixel). In CY23, within this segment, ad revenue from its search business accounted for 64 per cent of revenue, while YouTube ads accounted for 12 per cent. Ads on network sites accounted for another 11 per cent. Non-ads business consisting of emerging subscriptions, platforms and devices business accounted for 13 per cent of revenues. The non-ads business has been growing faster at 20 per cent growth in CY23 as against the ads revenue growing at 6 per cent. Over the medium term, this can provide a reasonable hedge to the ads business. The other major segment is Google Cloud that competes with the likes of Amazon’s AWS and Microsoft’s Azure. Revenue is generated from consumption-based fees and subscriptions for infrastructure, platforms, collaboration tools and other cloud services. Globally, Google Cloud ranks third after AWS and Azure in the cloud infrastructure service providers. As compared to AWS’s revenue of $91 billion in 2023 (y-o-y growth of 13 per cent), Google Cloud generated revenue of $34.7 billion (y-o-y growth of 19 per cent). The ‘Others’ or Other Bets segment that houses Google’s moonshot businesses is like a start-up ecosystem within Google, where the company invests in technological research and development to attempt solving big problems. These are investments where, if successful, the payoffs can be big, but in many cases, many may not yield results. Some of the businesses in this segment are Waymo (autonomous car project) and Verily (Life sciences and healthcare research project). It would be worth noting that Google’s AI business, now part of core business, was originally incubated as a moonshot business. Overall at consolidated level, Google generates 77 per cent of revenue from ads, with non-ads business growing faster now. When it comes to Google, there are three main concerns. The first is that among big tech companies in the US, two companies that many love to hate are Google and Meta Platforms. This is due to concerns (some may be warranted) about how they use our data to maximise their profits. Further, accusations that they stifle competition, given their dominance, is also another factor. The recent controversy in India where Google delisted a few apps from Play Store is an example. Second, recent fumbles in Gemini AI, which has resulted in accusations of bias in the platform, have led to concerns that  Google may be falling behind in the AI race. The bigger concern is also that Google’s core search business might be impacted by AI search engines launched by competitors. Finally, an issue we pointed out in bl.portfolio dated March 3 (Are Big Techs getting too big?) — the increasing scale and dominance of companies like Google especially in an AI era may result in regulatory action to reduce their dominance. While right now this is in the realm of speculation,  it cannot be ignored. In our view, despite these risks, Google presents an attractive AI play for investors. For one, it is not just premature, but actually a bit absurd to make conclusions so early that Google may have fallen behind competitors in AI. Right now, the industry is at a very early stage and missteps by Google or anyone are highly probable as the business evolves. What is key to note is Google’s extensive investments in AI, built over the last decade and technological prowess that give it a good shot to become a formidable competitor in the space. Besides, it has deep financial resources to keep investing and building its capabilities. With near $100 billion of net cash on its Balance Sheet and consistent cash flow generation (estimated CY24 operating cash flow and fee cash flow of $125 billion and $84 billion respectively), the capacity is vast to build AI capabilities. Also read: Google reinstates popular Indian apps in Play Store, government says delisting cannot be permitted Further, if regulation gets more stringent, it may actually turn out to be better in the long term. For example, Google has consistently traded at a discount to Big Tech peers due to two reasons — dependency on ads and concerns on regulatory action (relating to data privacy). Better regulation that ensures better visibility of the future may actually eliminate some of the discounted valuation. Regulatory clarity on how governments intend to address dominance of Big Techs in the space of AI, while it may create short-term volatility, may work for the better in the long term. Amidst these factors, the stock trading at reasonable multiple following decent and consistent financial performance (see table), makes the risk-reward favourable. Comments BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Terms & conditions  |  Institutional Subscriber "
}