{
    "title": "Should You Be Adding Alphabet (NASDAQ:GOOGL) To Your Watchlist Today?",
    "date": "3/2/2024",
    "url": "https://finance.yahoo.com/news/adding-alphabet-nasdaq-googl-watchlist-120010855.html",
    "text": "For beginners, it can seem like a good idea (and an exciting prospect) to buy a company that tells a good story to investors, even if it currently lacks a track record of revenue and profit. Sometimes these stories can cloud the minds of investors, leading them to invest with their emotions rather than on the merit of good company fundamentals. Loss making companies can act like a sponge for capital - so investors should be cautious that they're not throwing good money after bad. If this kind of company isn't your style, you like companies that generate revenue, and even earn profits, then you may well be interested in Alphabet (NASDAQ:GOOGL). Now this is not to say that the company presents the best investment opportunity around, but profitability is a key component to success in business. See our latest analysis for Alphabet The market is a voting machine in the short term, but a weighing machine in the long term, so you'd expect share price to follow earnings per share (EPS) outcomes eventually. That means EPS growth is considered a real positive by most successful long-term investors. Shareholders will be happy to know that Alphabet's EPS has grown 26% each year, compound, over three years. If growth like this continues on into the future, then shareholders will have plenty to smile about. One way to double-check a company's growth is to look at how its revenue, and earnings before interest and tax (EBIT) margins are changing. The good news is that Alphabet is growing revenues, and EBIT margins improved by 2.2 percentage points to 29%, over the last year. Ticking those two boxes is a good sign of growth, in our book. The chart below shows how the company's bottom and top lines have progressed over time. To see the actual numbers, click on the chart. The trick, as an investor, is to find companies that are going to perform well in the future, not just in the past. While crystal balls don't exist, you can check our visualization of consensus analyst forecasts for Alphabet's future EPS 100% free. Since Alphabet has a market capitalisation of US$1.7t, we wouldn't expect insiders to hold a large percentage of shares. But we are reassured by the fact they have invested in the company. Notably, they have an enviable stake in the company, worth US$178b. Investors will appreciate management having this amount of skin in the game as it shows their commitment to the company's future. For growth investors, Alphabet's raw rate of earnings growth is a beacon in the night. This EPS growth rate is something the company should be proud of, and so it's no surprise that insiders are holding on to a considerable chunk of shares. On the balance of its merits, solid EPS growth and company insiders who are aligned with the shareholders would indicate a business that is worthy of further research. While we've looked at the quality of the earnings, we haven't yet done any work to value the stock. So if you like to buy cheap, you may want to check if Alphabet is trading on a high P/E or a low P/E, relative to its industry. There's always the possibility of doing well buying stocks that are not growing earnings and do not have insiders buying shares. But for those who consider these important metrics, we encourage you to check out companies that do have those features. You can access a tailored list of companies which have demonstrated growth backed by recent insider purchases. Please note the insider transactions discussed in this article refer to reportable transactions in the relevant jurisdiction. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}