{
    "title": "Google: Time To Load Up (NASDAQ:GOOG)",
    "date": "1/5/2024",
    "url": "https://seekingalpha.com/article/4661203-google-time-to-load-up",
    "text": " Spencer Platt/Getty Images News When I wrote my initial thesis about Google (NASDAQ:GOOGL), I was cautious, and that did not age well as the stock outperformed the broader U.S. market since mid-May. A lot happened since then, and today, I want to update my thesis about Google. While I believe that Google lags behind its primary rivals in the cloud and artificial intelligence [AI], its presence in these fields is also substantial. But what is more important is that the company's primary business is growing and experiencing secular tailwinds, which allows it to improve profitability. The company is well-positioned to continue investing heavily in innovation and expanding its vast ecosystem. Furthermore, my valuation analysis suggests the stock is very attractively valued. All in all, I assigned Google a \"Strong Buy\" rating. The latest quarterly earnings were released on October 24, when the company topped consensus estimates. Since earnings went live more than two months ago, I will not waste much of readers' time and will underline that revenue grew by a solid 11% YoY, and the adjusted EPS expanded notably, from $1.06 to $1.55. Seeking Alpha The balance sheet is a fortress with a cash position of $120 billion as of the latest reporting date. There is almost no leverage, and the company is in a massive $90 billion net cash position, which gives GOOGL vast room to continue investing heavily in both in-house R&D and strategic acquisitions. That said, the company's strong balance sheet positions the company well to unlock new revenue drivers with the help of acquisitions. Seeking Alpha Google has a stellar record of acquisitions, including YouTube, Android, Maps, etc. Bears would argue that past successful reinvestments are not a guarantee of future success, and I agree with it. However, consistent historical success substantially increases the probability of new economically sound strategic moves. Google has been a true superstar in generating superior returns over the long term, with ROIC consistently above 20% over the last decade. The company's ROIC performance looks stellar compared to its cost of capital. Thus, I am highly convinced of Google's capabilities to reinvest in highly profitable projects. FinanceCharts Fiscal 2023 full-year revenue is projected by consensus at $305.77 billion, which will mean an 8.1% YoY growth. These expectations look conservative enough since, for the first nine months of 2023, Google demonstrated a 7% YoY growth. With the holiday Q4 being historically by far the strongest, I believe that a projected 8.1% YoY revenue growth is doable for the full fiscal year. Apart from the solid revenue dynamic, I like that profitability metrics are improving, with Q2 and Q3 being more vital on a YoY basis from the operating margin perspective. I do not compare Q1 on a YoY basis because Q1 of 2022 mostly did not capture the adverse effects of the rapidly deteriorating macro environment, and Q1 of 2023 included substantial severance costs after massive layoffs in early 2023. That said, the financial performance is improving this year, but still, the operating margin is below 2021 levels and there is still room to improve. Seeking Alpha The earnings for the upcoming quarter are scheduled for release on February 1, 2024. Consensus estimates forecast quarterly revenue at $85.13 billion, which indicates a 12% YoY growth. As the revenue growth pace is expected to accelerate, the bottom line is expected to follow. Consensus estimates project a substantial adjusted EPS expansion from $1.05 to $1.61. Seeking Alpha I share Wall Street's analyst's positive view of Google's near-term prospects. As Google remains by far the most used search engine in the world and YouTube is the unmatched leader among video streaming platforms, the company's position in digital advertising is intact. According to GOOGL's latest 10-K report, this revenue stream represents 80% of the total, which means that the company's performance is significantly affected by the digital advertising industry. From the advertising industry perspective, Google has solid tailwinds behind its back. Precedence Research expects the digital advertising market to compound at a 9.7% CAGR over the next decade, and Google will likely be the major beneficiary of this growth. Precedence Research Google's dominance in digital advertising allows the company to benefit from vast pricing power and generate unmatched profitability. This makes the company well-positioned to build up a fortress financial position to be utilized to invest heavily in growth. I am not emphasizing much the latest generative AI update from Google and would prefer to look at how this will unfold in competing against a generative AI star, ChatGPT. I will discuss later in the \"Risks to consider\" section the fact that Google is lagging behind rivals in cloud computing and AI. Still, the company's presence in the global cloud computing market is notable, and Google will apparently absorb positive secular tailwinds here as well. It is also important to understand that Google has an extensive ecosystem, and users have very high switching costs if they want to change the ecosystem of services they use. That said, Google is willing to add new products and features to its ecosystem, which will highly likely provide synergetic effects. Substantial profits generated by the company's cash cow, digital advertising, give the company vast opportunities to invest in various projects across different industries which might unlock new revenue sources for decades. The project that I consider the closest to becoming a big long-term winner for Google is the company's self-driving taxi subsidiary, Waymo. The industry is in its nascent stages, but driverless ride-sharing looks inevitable on the horizon for multiple decades as the shift to cleaner energy emerges. Waymo's strategic partnership with Uber (UBER), the absolute leader in ride-sharing in the U.S., makes the company firmly positioned to absorb the projected 69% industry CAGR for the next decade. Autonomous taxis might sound like something unreal, but Waymo Driver is already available in Metro Phoenix, San Francisco, and Los Angeles. Having a firm pole position in the autonomous ride-sharing industry makes Google well-positioned to eventually become the dominant player in the global ride-sharing industry, expected to hit more than half a trillion USD over the next decade. It is difficult to project the pace of autonomous ride-sharing penetration across the world, but it will be fairly conservative to assume that Waymo will be able to capture 10% of the global ridesharing industry, which will mean an additional $50 billion in revenue per annum over the long run. Given the company's historical P/S ratio of around 6, an additional $50 billion in revenues could potentially add $300 billion to the business's fair value. However, the level of uncertainty is extremely high here, given the nascent stage of Waymo's monetization. It is important to emphasize that apart from having bright prospects for the top line, the management also prioritizes financial discipline. The company was one of the first big tech companies to start headcount optimization around a year ago. This was painful for employees but beneficial for shareholders as profitability metrics improved. Therefore, I look optimistically at the latest rumor that the company might cut another 30 thousand jobs in 2024, which could highly likely be a solid contribution to the company's profitability boost. This year's 12 thousand job cuts allowed the company to expand its operating margin by more than one percentage point. That said, a potential 30 thousand jobs cut could make the operating margin much closer to the stellar 30% operating margin level. With such strong revenue growth opportunities together with notable room to improve profitability via headcount optimization, it is not surprising to me that high-profile investment firms like Needham and Wedbush have put GOOGL in their 2024 top picks lists. GOOGL rallied by almost 57% over the last 12 months, significantly outperforming the broader U.S. stock market. Seeking Alpha Quant assigns the stock a low \"D\" valuation grade because its ratios are substantially higher than the sector median. But Google's market positioning is unmatched, and I think it will be more fair to compare Google vs Google, i.e., with historical averages. From that perspective, the stock looks fairly valued because current valuation metrics are close to historical averages across the board. Seeking Alpha I want to go ahead with the discounted cash flow [DCF] simulation. I use a 9.3% WACC for discounting, as recommended by valueinvesting.io. This is 70 basis points lower than I did during my previous analysis, which looks fair to me given the expected pivot in the Fed's monetary policy in 2024. Consensus revenue estimates project a moderate 9% CAGR for the next decade, which I consider conservative enough for my calculations given the company's strong positioning in promising industries. I use a 13.9% TTM FCF margin ex-SBC and project a 75 basis points yearly expansion. I consider the FCF margin expansion as fair given historical trends and the management's prioritization of financial discipline. Author's calculations According to my DCF simulation, the business's fair value is $2 trillion. This is around 16% higher than the current market cap, which means the stock is undervalued. That said, my target price for GOOGL is around $162. Author's calculations When I conducted a DCF simulation for Google last time in May, the business's fair value was indicated to be around $1.6 trillion. The 20% increase in my fair value estimate occurred due to several positive developments. First, I implemented a 70 basis points softer WACC because, in late 2023, the Fed shared the expectation that three rate cuts would take place in 2024. Second, I used a conservative FY 2022 level FCF margin in May. However, Google's profitability rebounded faster than expected, and this time, I used a TTM FCF margin level, which I consider fair enough. Last but not least, consensus revenue estimates upgraded due to the faster-than-expected recovery in digital advertising. That said, I believe that all the changes I have incorporated into my DCF simulation are sound in light of the improving financial performance and macro environment. The company faces significant antitrust issues given Google's dominant position in digital advertising and search advertising. Google's presence in these industries is overwhelming, and the company faces accusations of using its dominance to stifle competition. For example, just last month, Google lost an antitrust lawsuit filed by Epic Games. Last year, the company was fined over $4 billion for breaching the European antitrust rules. While $4 billion might not be as significant considering the company's hyper-scale, apart from financial losses, Google's reputation also gets hurt as a result of lost antitrust lawsuits. While I believe that Google is positioned to benefit from secular shifts in cloud computing and AI, it is important to highlight that the company competes with other superstars like Microsoft (MSFT) and Amazon (AMZN) in these fields. And Google lags behind both of its major rivals. AWS is an undisputable global leader in the cloud industry, but Google's Cloud also significantly lags behind Microsoft's Azure, which is in second place. While Google's third place looks intact, it is quite unlikely that it will be possible for the company to close the gap with leaders because both MSFT and AMZN also have vast resources and expertise to continue investing in innovation. I would also like to highlight that when in early February ChatGPT already reached 100 million users, Google's Bard generated errors. This also indicates that in terms of AI Google is behind Microsoft's partner, OpenAI. statista.com To conclude, Google is a \"Strong Buy\". My valuation analysis suggests that the global digital advertising leader is around 16% undervalued, which I consider a gift. I want to emphasize that a company like Google, with its dominating market positioning and stellar profitability, deserves a substantial premium to its fair value. That said, the 16% upside potential is the most conservative scenario while the stock price might appreciate much higher depending on massive factors like the Fed's monetary policy. The company's strong balance sheet and massive profitability from digital advertising provide vast opportunities to invest heavily in growth and innovation, both via in-house projects and strategic acquisitions. The company's prospects in autonomous ride-sharing look very bright as Waymo has started expanding its presence at a notable pace in 2023. This article was written by Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}