{
    "title": "Google, Amazon, Unity among tech companies laying off to start 2024",
    "date": "1/14/2024",
    "url": "https://seekingalpha.com/news/4054414-google-amazon-unity-among-tech-companies-laying-off-to-start-2024",
    "text": "Tarathip Kwankeeree Just as in 2023, layoffs have hit the tech sector in 2024. Tech firms are continuing to streamline costs, improve efficiencies and respond to a cooling labor market. The U.S. unemployment rate is at 3.7%, according to the most recent jobs data, a near 50-year low. However, job gains have cooled in recent months. Employers added 105,000 workers to payrolls in October, 173,000 in November and 216,000 in December, below the monthly average of 225,000 for 2023, according to the Bureau of Labor Statistics. Seeking Alpha has compiled a list of public tech companies to announce cuts so far in the new year. Google (NASDAQ:GOOG) (NASDAQ:GOOGL), confirmed on Thursday it is laying off hundreds of staff working on its voice assistant, hardware and engineering teams. \"Throughout the second half of 2023, a number of our teams made changes to become more efficient and work better, and to align their resources to their biggest product priorities,\" a Google spokesperson said in a statement to Seeking Alpha. \"Some teams are continuing to make these kinds of organizational changes, which include some role eliminations globally.\" It was also reported that Fitbit co-founders James Park and Eric Friedman were leaving the company. Google acquired Fitbit for $2.1B in 2021 amid competition with the Apple (AAPL) Watch. Alphabet also made several cuts in 2023, including January's announcement that it intended to eliminate roughly 12,000 jobs. Unity Software (NYSE:U) announced earlier this week it would cut 25% of staff as it restructures and refocus its core business. The company aims to position itself for long-term and profitable growth, it said in a filing. About 1,800 employees are being impacted by the layoffs. The company said it cannot reasonably estimate the costs and charges in connection with this reduction, which will be substantially incurred in the first quarter of 2024. Unity has struggled to turn a profit even as revenue has increased. Shares have tumbled 20% over the past six months. Amazon (NASDAQ:AMZN) is getting ready to cut several hundred employees on its media side – in the Prime Video unit and at MGM Studios. The company is also reportedly cutting 35% of its Twitch workforce, impacting approximately 500 workers and 5% of its Audible workforce. Like its big cap tech brethren Alphabet, Amazon also made various cuts to its employment ranks last year. Xerox (NASDAQ:XRX) said earlier this month it would reduce its workforce by 15% in the first quarter of this year. The job cuts were announced as part of the company's restructuring plan that will align resources into three key areas: improving and stabilizing the core print business; increasing productivity with a new Global Business Services organization; and focus the Digital Services and IT Services capabilities towards more profitable markets. The restructuring comes after the company said third-quarter sales fell 6% year-over-year. Seeking Alpha's Christiana Sciaudone, Josh Fineman, Ravikash Bakolia and Amy Thielen contributed to this story. "
}