{
    "title": null,
    "date": "1/21/2024",
    "url": "https://www.benzinga.com/news/24/01/36709679/employees-slam-google-leaderships-vision-in-wake-of-layoffs-they-are-all-profoundly-boring-and-glass",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Amidst a series of layoffs, Alphabet Inc.'s Google GOOGL employees are openly expressing their dissatisfaction with the company's leadership. The recent layoffs, which impacted several hundred individuals from Google's ad sales team and about a thousand from its Pixel, Fitbit, and Nest divisions have led to a surge of criticism from both current and former employees, according to the New York Post. Key among the critics is Diane Hirsh Theriault, a software engineer at Google, who took to LinkedIn to voice her concerns. Theriault's critique of the management at Google was stark, describing the leadership as lacking in vision and innovation. \"From the C-suite to the SVPs to the VPs, they are all profoundly boring and glassy-eyed,\" she wrote on her LinkedIn page. This sentiment was echoed by other employees, who were particularly aggrieved by CEO Sundar Pichai's approach to communicating the layoffs. Following these layoffs, Pichai hinted at the possibility of more job cuts in the future, though he assured they would not be as extensive as those from the previous year. Also Read: Google Salary Leak Reveals Mind-blowing Earnings Top Engineers Make In an internal memo, he spoke of the company's ambitious goals and the necessity of making difficult decisions. Kenneth Smith, a former engineering manager at Google, shared his perspective on LinkedIn, emphasizing the importance of personal interaction in such situations. \"Call me old school, but I think that if you find yourself in a situation where you need to let someone go, you owe it to them to meet them face-to-face, look them in the eyes, and acknowledge their humanity,\" he wrote. Smith also reflected on his own feelings of anger and frustration towards Google's leadership, particularly regarding how they managed the layoffs of 12,000 colleagues last year. As reported by the Post, Gergely Orosz, a software engineer and tech commentator, joined the chorus of criticism, labeling Google as a \"faceless corporation\" on social media platform X. In response to the layoffs, a Google representative emphasized the company's commitment to responsibly investing in its priorities and supporting affected employees in finding new roles. Now Read: Google Executives Threaten Workers With Layoffs, Say 'There Will Be Blood On The Streets': Report This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}