{
    "title": "Googlers complain about 'corporate overlords,' layoffs: report",
    "date": "1/15/2024",
    "url": "https://www.businessinsider.com/google-staff-complain-corporate-overlords-impersonal-layoffs-changing-culture-report-2024-1",
    "text": "       It's been just days since Google employees were hit by another round of layoffs. On Wednesday, the company laid off hundreds of staff working on Google Assistant, the activity tracker Fitbit, and its devices-and-services team. But The Verge's Command Line reported that CEO Sundar Pichai hadn't yet addressed the new round of layoffs internally. The poorly explained job cuts have left some employees disgruntled and lashing out against management. The Verge reported that a post on Google's internal meme board, Memegen, referring to Google leaders as \"corporate overlords,\" had thousands of upvotes. Related stories The popular post, which referenced Google's last round of job cuts, read: \"Thank you, our corporate overlords, for our new annual tradition.\" In a statement shared with Business Insider, a Google spokesperson said, \"As we've said, we're responsibly investing in our company's biggest priorities and the significant opportunities ahead. \"To best position us for these opportunities, throughout the second half of 2023, a number of our teams made changes to become more efficient and work better and to align their resources to their biggest product priorities.\" In a note to coworkers reviewed by The Verge, one engineering director affected by the cuts said the latest layoffs felt \"extremely impersonal.\" The director added that the new round of cold job reductions didn't come as a surprise: \"Google culture changed dramatically last year with its first major round of layoffs, and I saw the writing on the wall.\" The company cut 12,000 employees last January, or about 6% of its workforce. In an early-morning email on January 20, 2023, Google told affected US staff that \"we no longer have a job for you.\" Some laid-off workers previously told BI they were dismayed by the abrupt and impersonal way the company let them go. The new year has ushered in a wave of tech layoffs, with staffers at Amazon, Twitch, and Discord all affected by sweeping cuts. On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Read next Jump to "
}