{
    "title": "FTC generative AI investigation includes Alphabet, Amazon, Microsoft",
    "date": "1/25/2024",
    "url": "https://chainstoreage.com/ftc-generative-ai-investigation-includes-alphabet-amazon-microsoft",
    "text": "The Federal Trade Commission (FTC) is ordering five major tech companies to provide information about their generative AI activities. The agency’s 6(b) inquiry will scrutinize corporate partnerships and investments with AI providers in what it says is an effort to better understand these relationships and their impact on the competitive landscape. The compulsory orders were sent to Alphabet Inc. (parent of Google), Amazon Inc., Anthropic PBC, Microsoft Corp. and OpenAI Inc. In particular, the FTC is investigating activity among these companies related to generative AI, which is based on machine learning (ML) and can create new content and ideas, including conversations, stories, images, videos, and music. Specific information the FTC says it wants to examine includes: Interestingly, all five companies affected by the FTC order previously agreed to follow a set of voluntary commitments to ethically and safely develop AI released by President Biden in July 2023, which was followed by an executive order on AI safety in October. “History shows that new technologies can create new markets and healthy competition. As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity,\" said FTC chair Lina M. Khan. “Our study will shed light on whether investments and partnerships pursued by dominant companies risk distorting innovation and undermining fair competition.\" The FTC issued its orders under Section 6(b) of the FTC Act, which authorizes the agency to conduct studies that allow it to gain a deeper understanding of market trends and business practices. The companies will have 45 days from the date they receive the order to respond. The FTC voted 3-0 to issue the Section 6(b) orders and conduct the study of AI investments and partnerships. "
}