{
    "title": "Beating The S&P 500 By 40% Since The Start Of 2023, What To Expect From \nAlphabet Stock In Q4?",
    "date": "1/26/2024",
    "url": "https://www.forbes.com/sites/greatspeculations/2024/01/26/beating-the-sp-500-by-40-since-the-start-of-2023-what-to-expect-from-alphabet-stock-in-q4/",
    "text": "LAS VEGAS, NEVADA - JANUARY 11: People visit Google booths at CES 2024, the world's largest annual ... [+] consumer technology trade on January 11, 2024 at the Las Vegas Convention Center in Las Vegas, Nevada, United States. (Photo by Tayfun Coskun/Anadolu via Getty Images) Alphabet (NASDAQ: GOOG) is scheduled to report its fiscal Q4 2023 results on Tuesday, January 30, 2024. We expect revenues to remain just below (in line) the expectations, while earnings are likely to miss the consensus. The company outperformed the street expectations in the last quarter, with the top line increasing 11% to $76.7 billion. The growth was because of higher revenues in Google\nGOOG\n Search, Google Cloud, and Google Other segments. We expect the revenues to see year-on-year growth in Q4. Our interactive dashboard analysis on Alphabet’s Earnings Preview has more details. Amid the current financial backdrop, GOOG stock has seen extremely strong gains of 65% from levels of $90 in early January 2021 to around $150 now, vs. an increase of about 30% for the S&P 500 over this roughly 3-year period. However, the increase in GOOG stock has been far from consistent. Returns for the stock were 65% in 2021, -39% in 2022, and 59% in 2023. In comparison, returns for the S&P 500 have been 27% in 2021, -19% in 2022, and 24% in 2023 - indicating that GOOG underperformed the S&P in 2022. In fact, consistently beating the S&P 500 - in good times and bad - has been difficult over recent years for individual stocks; for other heavyweights in the Communication Services sector including META, NFLX, and TMUS, and even for the megacap stars TSLA, MSFT, and AMZN. In contrast, the Trefis High Quality Portfolio, with a collection of 30 stocks, has outperformed the S&P 500 each year over the same period. Why is that? As a group, HQ Portfolio stocks provided better returns with less risk versus the benchmark index; less of a roller-coaster ride as evident in HQ Portfolio performance metrics. Given the current uncertain macroeconomic environment with high oil prices and elevated interest rates, could GOOG face a similar situation as it did in 2022 and underperform the S&P over the next 12 months - or will it see a strong jump? Our forecast indicates that Alphabet’s valuation is $148 per share, which is 1% below the current market price of around $150. GOOG Earnings Estimates For FY2023Q4 (1) Revenues to just miss (in line) the estimates Alphabet’s revenues grew 7% y-o-y to $221.1 billion in the first three-quarters of FY2023.   Trefis estimates Alphabet’s fiscal Q4 2023 net revenues to be around $84.96 billion, just below (in line) the $85.23 billion consensus estimate. (2) EPS to marginally miss the consensus Alphabet Q4 2023 adjusted earnings per share is expected to be $1.56 per Trefis analysis, 2% below the consensus estimate of $1.59. The adjusted net income improved 15% y-o-y to $53.1 billion in the first nine months of FY 2023. Further, the figure jumped 42% y-o-y in Q3 due to lower total expenses as a % of revenues. We expect the Q4 results to follow the same trend. Overall, Alphabet is likely to report an annual GAAP EPS of $5.72 for the full year 2023. (3) Stock price estimate is 1% less than the current market price We arrive at Alphabet’s valuation, using an EPS estimate of around $5.72 and a P/E multiple of just below 26x in fiscal 2023. This translates into a price of $148, which is 1% below the current market price. Note: P/E Multiples are based on Share Price at the end of the year and reported (or expected) Adjusted Earnings for the full year GOOG Return Compared With Trefis Reinforced Portfolio Invest with Trefis Market Beating Portfolios See all Trefis Price Estimates  "
}