{
    "title": "Alphabet's Wing unveils larger drones for heavier packages",
    "date": "1/17/2024",
    "url": "https://www.theverge.com/2024/1/17/24040030/wing-delivery-larger-drone-payload-capacity-alphabet",
    "text": "By  Andrew J. Hawkins, transportation editor with 10+ years of experience who covers EVs, public transportation, and aviation. His work has appeared in The New York Daily News and City & State. If drone delivery is going to go mainstream, it’s going to need bigger aircraft that can handle more stuff. Today, Alphabet’s Wing unveiled the first in a new lineup of larger drones with more payload capacity. Wing’s flagship drone is designed to handle payloads of up to 2.5 pounds. The new drone can handle up to five pounds without sacrificing range. The company says that it has enough battery power to complete 12 miles round trip while cruising at up to 65mph. “It’s always been our vision to implement a multimodal drone delivery model, in the same way that ground delivery uses different vehicle sizes for different orders,” Wing CEO Adam Woodworth said in a blog post. “It’s always been our vision to implement a multimodal drone delivery model” By deploying larger drones capable of carrying more stuff, Wing says its customers can place orders for more items, making its service more useful and convenient. The new drone will be deployed in the communities where Wing operates within the next 12 months, the company says. The idea of bundling orders is based on data that Wing collects from its customers. The company says that while 70 percent of its orders are delivered by one drone, 30 percent are delivered by two. The addition of a larger drone with more capacity will help the company better serve those customers who were previously ordering so many items it required multiple drone deliveries. “Think of it like how airlines operate different aircrafts for different routes: This new aircraft will streamline our deliveries of larger orders,” Woodworth said. “For example, you could order last minute ingredients for dinner — pasta, marinara sauce, parmesan cheese, canned olives and garlic.” Wing’s drones use tethers and grappling hooks to pick up and drop off small bags and cardboard boxes on customers’ front lawns. The company says it has completed over 350,000 deliveries, most of which have taken place in Australia. The company also operates in Finland and the US, where it’s making deliveries for Walmart for customers within a six-mile range of two superstores outside of Dallas-Fort Worth and for certain stores in Christiansburg, Virginia. For years, drone delivery startups were hampered by rules that required operators to keep their aircraft within view at all times. The idea to station observers along a delivery drone was impractical and costly, preventing many companies from scaling up. “Think of it like how airlines operate different aircrafts for different routes” But after years of prototype testing and small suburban pilot projects, drone deliveries are expected to expand dramatically in the next few years after clearing some (but not all) of its regulatory hurdles. A number of companies, including Wing, UPS, and Skydio, have received permission from the Federal Aviation Administration to deliver goods to people who may live miles away and not in the drone operator’s line of sight. Allowing them to operate “beyond the visual line of sight” was a huge milestone for the nascent industry and opened the door to bigger service areas and more customers. Currently, customers can order items from a limited number of stores that are partnering with Wing, including Walgreens, Blue Bell Creameries, Easyvet, and Texas Health. Wing hopes to expand its delivery offerings by introducing different sizes of aircraft that can handle smaller or bigger packages. Wing is also thinking about other ways to improve the efficiency of its delivery network. It recently created a system that enables its drones to dynamically take pickup and delivery jobs back-to-back without needing to report back to an originating base. This system includes the use of Autoloader stations, which are installed at retailers’ parking lots for employees to load a prepared order when ready. When a drone is available, it can lower a rope to grab it without anyone waiting around. Drone delivery companies claim that by shifting more deliveries to small electric multi-rotor aircraft, fewer polluting trucks will be needed for last-mile deliveries. It’s a similar pitch being made by sidewalk robot companies delivering takeout orders to residents of Los Angeles and other cities. / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved "
}