{
    "title": "Why These 3 Stocks Are My Top Picks For 2024",
    "date": "1/22/2024",
    "url": "https://seekingalpha.com/article/4664210-why-3-stocks-my-top-picks-for-2024",
    "text": "Dilok Klaisataporn  Dilok Klaisataporn First of all - a delayed - Happy New Year to everyone reading. 2023 was a pretty solid year for the stock market with all major stock indices having a nice performance. Data by YCharts In this article I'm going to give a prediction on my Top 3 Stocks for 2024. I won't go into detail on every aspect of the business as this would be way too much information for one article. So for a deep dive please refer to my general articles. I nevertheless will be updating my valuation to the latest numbers so stay tuned even if you already read my previous articles. I published an article on Amazon (AMZN) in the middle of December 2023, however the company hasn't really moved from this price level since then: My AMZN Coverage (seekingalpha) My AMZN Coverage (seekingalpha) In short the company can be separated into the following relevant business segments: For this article, I will focus on the Online Stores 3rd Party, Advertising and the Cloud Segment. Of course the rest is also important but these three segments should especially drive the growth in the following years. Like mentioned above for more insight - also on the \"less\" impact-full segments - please refer to my last article on Amazon. The global e-commerce sales are expected to grow at a CAGR of 14.4% until 2027. Global eCommerce Revenue (statista) Global eCommerce Revenue (statista) While this is already pretty impressive growth, I believe that Amazon could achieve even higher growth rates, when considering that the company is currently laying increasing emphasis on their 3rd party sales and is therefore decreasing the share of the less profitable 1st party sales. E-commerce Sales By Business Model (statista) E-commerce Sales By Business Model (statista) With the above mentioned market growth rate of ~14%, these growth metrics for the 3rd party sales should be fitting: Bear: 14% p.a. Bull: 20% p.a. The feasible margins for Amazon lay between 20% to over 40%, when looking at two American rivals in this market Etsy (ETSY) and eBay (EBAY). Data by YCharts With this in mind, we can anticipate the following EBIT margins for the Bear and Bull Case: The general digital ad spend is predicted by experts to grow like this: Amazon is however heavily expanding its market share in this segment and I believe that their more \"targeted\" approach - where they directly display ads on a shopping site- is a USP for Amazon, which is why we can also anticipate that Amazon is growing above the market rate in this scenario. Global Advertising Market (statista) Global Advertising Market (statista) Bear: 12% p.a. Bull: 15% p.a. Major competitors of Amazon like Meta and Google are currently sitting at margins of 30% to 39% in this segment. Given that AMZN's advertisements are highly targeted to customers who are already considering making a purchase since they are on the Amazon website, Amazon should be able to achieve or even surpass these figures, in my opinion. With this in mind, we can anticipate the following margin development: Cloud - AWS According to statista Amazon is currently holding around 32% in the cloud infrastructure market. Market share in the worldwide cloud infrastructure market (statista) Market share in the worldwide cloud infrastructure market (statista) It is projected that between 2023 and 2030, the worldwide cloud computing is growing at a compound annual growth rate of 20%. Since Amazon has mostly been able to maintain its market share versus its rivals over the past few years, I think it is safe to predict that growth rates will be about in line with market rates. Cloud infrastructure services vendor market share worldwide (statista) Cloud infrastructure services vendor market share worldwide (statista) Bear: 15% p.a. Bull: 20% p.a. With our Bull Case, I only projected 20% annual growth because it appears unfeasible to rise beyond the market given our current 30%+ market share. With this knowledge, we can project the following for margins: With these assumptions and of course some assumptions on the here not mentioned different business segments, we get the following revenue and EBIT over the next years: Amazon DCF Bear Case I (amazon.com, seekingalpha.com, own assumptions) Amazon DCF Bear Case I (amazon.com, seekingalpha.com, own assumptions) With these metrics and through utilizing a suitable WACC, Perpetuity Growth Rate, and EBIT to FCF conversion we get the following target share price: Amazon DCF Bear Case II (amazon.com, seekingalpha.com, own assumptions) Amazon DCF Bear Case II (amazon.com, seekingalpha.com, own assumptions) We get a fair value share price of $138 in our Bear Case scenario, meaning that the company could be overpriced by only 10%. But bear in mind that this also includes a slowdown in growth, with some growth below the market rate and lower profits than competitors. Here are once again the main assumptions for revenue and EBIT margin summarized: Amazon DCF Bull Case I (amazon.com, seekingalpha.com, own assumptions) Amazon DCF Bull Case I (amazon.com, seekingalpha.com, own assumptions) Amazon DCF Bull Case II (amazon.com, seekingalpha.com, own assumptions) Amazon DCF Bull Case II (amazon.com, seekingalpha.com, own assumptions) Based on the Bull-Case assumptions, $265 is the current fair value share price. This suggests that Amazon may now be 73% undervalued. On the other hand, they include profit margins that are larger than those of their main rivals and growth rates that surpass the market. When we take a look at the current P/E Ratios of the Magnificent Seven, Alphabet (GOOG) (GOOGL) seems to be still the least expensive of the seven. Data by YCharts My last article on this company was in August, 2023 and the company returned a solid 13.6% since then: My GOOG Coverage (seekingalpha) My GOOG Coverage (seekingalpha) Alphabet's business can be separated into the following segments: As the services and cloud segment seem like the most important aspects of Google's business, we'll focus on these two in this article. For more insight once again refer to my last article on the company. The revenue from Google Ads makes up the majority of the services section. Around 88% of the service income is, in fact, what Alphabet itself classifies as advertising, in their latest quarterly earnings report. Keeping that in mind, I think it is reasonable to assume that Google's whole services business behaves like the digital advertising portion of the business. If we use the above stated market growth rate of the digital ad spend market and adjust it for the Bear and Bull case, we get the following growth metrics for this segment: The average EBIT margin of last 5 years - 34% - seems like a good starting point for the year 2023 in our DCF. The average of these 5 years and the margin of 2022 - 34% - seem like a good starting point for the year 2023 in our DCF. From there on, I anticipated the following development, based on the different scenarios: Google's growth in the Cloud segment is nothing but spectacular: Like mentioned in the AWS segment, the global cloud computing market is expected to grow at a compound annual growth rate of 20%. This however doesn't factor in the fact that Alphabet is increasingly gaining market share in this very dynamic market. The growing adoption of AI should also help Alphabet's position in this market, considering their AI tools for developers and customers. Cloud infrastructure services vendor market share worldwide (statista) Cloud infrastructure services vendor market share worldwide (statista) With this information, we can predict the following growth rates for this segment: Bear: 20% p.a. Bull: 25% p.a. The EBIT margin of Google's cloud is also trending in the right direction, as Alphabet is doing its best to improve their costs in this segment. : They are already doing rather well in 2023/2024, as in the most recent quarter, they were able to attain an EBIT margin in this sector of around +3.2%, meaning that they are turning a profit for the third consecutive quarter. Taking into account the margins of AWS and Azure however there is still a lot of room to grow, as AWS is currently achieving EBIT margins between 35% and 24%. MSFT is even achieving an EBIT margin of 43% in its \"intelligent cloud\" business. For the different scenarios, I expect the margins to develop as follows. For a similar starting point I assumed an EBIT margin of 5% for 2023, as in Q1/Q2 of 2023 they achieved a margin just around that mark: 34% Google DCF Bear-Case I (seekingalpha, own assumptions)Google DCF Bear-Case II (seekingalpha, own assumptions) Google DCF Bear-Case I (seekingalpha, own assumptions) Google DCF Bear-Case II (seekingalpha, own assumptions) According to our Bear-Case scenario, which predicts low growth rates in the Advertising and Cloud Segment as well as declining ad business margins and slowly increasing cloud business margins, we arrive at a price target of approximately $125, suggesting that the company may currently be 15% overvalued. Google DCF Bull-Case I (seekingalpha, own assumptions)Google DCF Bull-Case II (seekingalpha, own assumptions) Google DCF Bull-Case I (seekingalpha, own assumptions) Google DCF Bull-Case II (seekingalpha, own assumptions) Based on our Bull-Case scenario's ambitious yet realistic assumptions, we obtain a price objective of around $265, suggesting that Alphabet may be currently undervalued by around. But to justify this valuation, the company has to expand beyond the market rates and raise its margins in both of its main markets at the same time. I last covered T. Rowe Price Group (TROW) in September 2023, from this point on the company hasn't really changed significantly. While the S&P however returned a very solid 7.8% in the same time frame. My TROW Coverage (seekingalpha) My TROW Coverage (seekingalpha) TROW is steadily increasing its AUM (Assets Under Management) after the pretty sharp decline from 2021 to 2022. But the company has still a very long way to go, to get back to 2021-levels. TROW AUM by Year (TROW Investor Relations)  TROW AUM by Quarter (TROW Investor Relations) TROW AUM by Year (TROW Investor Relations) TROW AUM by Quarter (TROW Investor Relations) When we however take a look at the current valuation of the company, it seems rather cheap compared to its historical figures. Data by YCharts As this point of view however doesn't consider a potential stagnation AUM and therefore revenue growth, a DCF where we assume Bear and Bull Case scenarios, seems fitting to evaluate the company detached from any historical figures. For the Bear-Case, we assume that the company doesn't grow at all in the next few years and therefore the AUM and the revenue stay flat. This seems very unlikely as alone the market change should lead to growth over this time frame. Let alone potential net inflows of new or existing customers that want to invest their money with TROW products. DCF TROW Bear (seekingalpha, own assumptions) DCF TROW Bear (seekingalpha, own assumptions) With no growth included in for the next eight years, we get a target price of around $135 based on these assumptions, indicating that the firm is now undervalued by almost 20%. For our Bull-Case we assume that the company is managing to get back to their historical growth path and therefore achieve a revenue growth rate of ~6%. The other metrics stay the same. TROW Historical Growth Rates (seekingalpha)DCF TROW Bull (seekingalpha, own assumptions) TROW Historical Growth Rates (seekingalpha) DCF TROW Bull (seekingalpha, own assumptions) With our Bull-Case we arrive at a price target of ~$195, this indicates that the company is possibly undervalued by 45% right now, considering that the company manages to achieve its 10 years average revenue growth rate. For our Valuations we get the following over- and under-valuations: Amazon: -10% to +73% Google: -15% to +79% TROW: +20% to +45% With these metrics it is safe to say, that for these stocks the opportunities currently heavily outweigh potential risks and downsides. Which is why these three stocks could very well be a very solid foundation for a successful investing year in 2024. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of AMZN, GOOG, GOOGL, TROW either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}