{
    "title": "Sundar Pichai Net Worth 2024: How Rich Is The CEO Of Google?",
    "date": "1/23/2024",
    "url": "https://patty360.com/sundar-pichai-net-worth/",
    "text": "Published on By You might find it hard to believe, but the current CEO of Google, Sundar Pichai is a multi-millionaire. Despite being rich, he leads a simple lifestyle, staying true to his roots. He is a simple man with an intelligent brain. He was fascinated by technology from a very young age. It eventually prepared him to lead one of the biggest tech giants in the world. As of 2024, Sundar Pichai’s net worth is $1.3 billion and it is expected to increase further in the future. To know more about the CEO of Google, you should read this post. Sundar Pichai was born as Pichai Sundararajan. His birth date is June 10, 1972. He is a native of Madurai, Tamil Nadu in India. But now he is settled in the U.S. Coming from a humble background, Pichai is very close to his parents. His father, Regunatha Pichai, was an electrical engineer, and his mother, Lakshmi, was a stenographer. His father also owned a manufacturing plant in Madurai. Talking about Sundar Pichai’s education, he did his schooling at Jawahar Vidyalaya Senior Secondary School. Later, he enrolled at Vana Vani School in IIT Madras. He studied metallurgical engineering at IIT Kharagpur. He also has an M.S. degree in materials science and engineering from Stanford University. He attended the Wharton School of the University of Pennsylvania to get his MBA degree. Many of you are interested to know about Sundar Pichai’s personal life. Well, he is a married man. His wife’s name is Anjali Pichai. The two dated for a long time before tying the knot in 2003. The couple shares two kids, but their names are not known. Although Pichai was born in India, he is now settled in the U.S.  Right after completing his degree, Pichai secured a job at Applied Materials. After that, he worked at McKinsey & Company. He joined Google in 2004. Back then he was appointed as the head of product management and innovation. He was involved in the development of Google products like Google Chrome, Google Maps, and Gmail. In 2013, he got involved in the development of Android. From 2011 to 2013, he served as a director of Jive Software. Pichai was appointed as the CEO of Google in 2015. In 2017, he attended the World Internet Conference in China as a speaker. In 2019, he occupied the CEO position of Alphabet Inc. Sundar Pichai received the Padma Bhushan award from the Indian government because of his incredible work in the tech field. For those who don’t know Padma Bhushan is the third-highest civilian award. Sundar Pichai comes from an upper-middle-class family in India. He worked his way to the top. He already had a successful career before becoming the CEO of Google. The majority of his income comes from his job as a CEO. His current net worth is $1.3 billion. There’s no doubt that it will increase more in the future. As per the latest reports, Sundar Pichai is a billionaire with an estimated net worth of around $1.31 billion. While it is difficult to exactly pinpoint Pichai’s salary because he also earns in stocks in the company, available reports say that he earns a salary of $242 million annually being the CEO of Google. If you are wondering whether or not Sundar Pichai is one of the world’s highest-paid corporate leaders, the answer is a definite yes. With a yearly salary of $242 million, he earns one of the highest salaries possible in corporate companies. The CEO of Google and Alphabet Inc is Sundar Pichai. He earns an annual salary of $242 million, which in Indian rupees is 1880 crores INR. He also earns in stocks of the company, which isn’t included in the amount. Surprisingly, it isn’t Sundar Pichai. It is Elon Musk with a $10.1 billion salary income every year is the highest-paid CEO in the world. You might be surprised to know that despite the high salary, Sundar Pichai isn’t in the top 10 highest CEO ranks. Dream Pad Net Worth 2024 – Is the Company Functional After Shark Tank? Chris Larsen Net Worth Update 2024: Co-Founder Of XRP Tessa is a Senior Writer at Patty360. She has previously worked as a freelance journalist for various news sites in the UK. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  Δ Are you one of those adults that enjoy binge-watching home improvement, home décor, and interior design videos? If yes, you... If you spend most of your free time on Instagram or Snapchat, you must have heard about Belle Delphine. There’s... Have you ever wondered what the key to Lit Handlers’ success is? The company has quickly grown from a small... Copyright © 2021 Patty360 | All Content Rights Reserved. "
}