{
    "title": "Sergey Brin Net Worth",
    "date": "1/6/2024",
    "url": "https://fourweekmba.com/sergey-brin-net-worth/",
    "text": "The Leading Source of Insights On Business Model Strategy & Tech Business Models The Leading Source of Insights On Business Model Strategy & Tech Business Models Sergey Brin co-founded Google (now Alphabet) together with Larry Page. He controls the company tightly via a dual share ownership structure (made of Class A and B stocks). Alphabet is worth over a trillion dollars, valuing Sergey Brin’s stake at around $66 billion.   Table of Contents\nToggle\nHow did we calculate Sergey Brin’s net worth?Sergey Brin’s Net Worth Calculation:Related To GoogleRelated Net Worth Case Studies\nHow did we calculate Sergey Brin’s net worth?\nWe assume and compute Sergey Brin’s net worth primarily based on his ownership stake in Alphabet, his largest holding (though he also owns other assets). \nAccording to official financial data, our estimate was based on 300,758,936 shares of Class A common stock and 44,404,426 shares of Class B common stock outstanding on April 5, 2022. \nThe market cap has been computed based on March’s 2023 data of a 1.23 trillion dollars market cap. \nSergey Brin owns 18,566,632 Class B shares, representing 41.8% of Class B shares and 24.9% of total voting power.\nSergey Brin ownership percentage: \nSergey’s ownership % = \n(Class B shares owned by Sergey Brin / Total outstanding shares) * 100 Sergey’s ownership % = (18,566,632 / 345,163,362) * 100 ≈ 5.38%\nSergey Brin’s ownership stake value: \nOwnership value = (Sergey’s ownership % / 100) * Market cap Ownership value = (5.38 / 100) * $1.23 trillion ≈ $66.154 trillion\nSo, Sergey Brin’s stake in the company is worth approximately $66.154 billion.\nSergey Brin’s Net Worth Calculation:\n\nAlphabet Ownership: Sergey Brin’s primary source of wealth is his ownership stake in Alphabet Inc. (formerly Google), the parent company of Google. This ownership stake is derived from his holding of Class A and Class B common stocks.\nOwnership Breakdown:\n\nClass A Shares: 300,758,936 shares outstanding\nClass B Shares: 44,404,426 shares outstanding\nTotal Outstanding Shares: 345,163,362 shares\n\n\nMarket Capitalization: The market capitalization of Alphabet was valued at $1.23 trillion as of March 2023.\nClass B Ownership Percentage:\n\nSergey Brin owns 18,566,632 Class B shares.\nClass B shares represent 41.8% of the total Class B shares outstanding.\nClass B shares also represent 24.9% of the total voting power.\n\n\nCalculation of Ownership Percentage:\n\nSergey’s ownership % = (Class B shares owned by Sergey Brin / Total outstanding shares) * 100\nSergey’s ownership % = (18,566,632 / 345,163,362) * 100 ≈ 5.38%\n\n\nCalculation of Ownership Stake Value:\n\nOwnership value = (Sergey’s ownership % / 100) * Market cap\nOwnership value = (5.38 / 100) * $1.23 trillion ≈ $66.154 billion\n\n\n\nConclusion: Based on these calculations, Sergey Brin’s ownership stake in Alphabet is estimated to be worth approximately $66.154 billion. This estimation is derived from his ownership of Class B shares and his proportional ownership of Alphabet’s overall market capitalization.\nRelated To Google\nGoogle Business Model\nGoogle is an attention merchant that – in 2022 – generated over $224 billion (almost 80% of revenues) from ads (Google Search, YouTube Ads, and Network sites), followed by Google Play, Pixel phones, YouTube Premium (a $29 billion segment), and Google Cloud ($26.2 billion).\nGoogle Other Bets\nOf Google’s (Alphabet) over $282 billion revenue for 2022, Google also generated over a billion dollars from a group of startup bets, which Google considers potential moonshots (companies that might open up new industries). Those Google’s bets also generated a loss for the company of over $6 billion in the same year. In short, Google is using the money generated by search and betting it on other innovative industries. Of Google’s (Alphabet) over $282 billion revenue for 2022, Google also generated over a billion dollars from a group of startup bets, which Google considers potential moonshots (companies that might open up new industries). Those Google’s bets also generated a loss for the company of over $6 billion in the same year. In short, Google is using the money generated by search and betting it on other innovative industries. \nGoogle Cloud Business\n\nHow Big Is Google?\nGoogle is an attention merchant that – in 2022 – generated $224 billion (almost 80% of its total revenues) from ads (Google Search, YouTube Ads, and Network sites), followed by Google Play, Pixel phones, YouTube Premium (a $29 billion segment), and Google Cloud ($26.3 billion).\nGoogle Traffic Acquisition Costs\nThe traffic acquisition cost represents the expenses incurred by an internet company, like Google, to gain qualified traffic – on its pages – for monetization. Over the years, Google has been able to reduce its traffic acquisition costs and, in any case, to keep it stable. In 2022 Google spent 21.75% of its total advertising revenues (over $48 billion) to guarantee its traffic on several desktop and mobile devices across the web.\nHow Does Google Make Money\nAlphabet generated over $282B from Google search and others, $32.78 billion from the Network members (Adsense and AdMob), $29.2 billion from YouTube Ads, $26.28B from the Cloud, and $29 billion from other sources (Google Play, Hardware devices, and other services).\nYouTube Business Model\nYouTube was acquired for almost $1.7 billion in 2006 by Google. It makes money through advertising and subscription revenues. YouTube advertising network is part of Google Ads, and it reported more than $29B in revenues by 2022. YouTube also makes money with its paid memberships and premium content. \nGoogle vs. Bing\n\nGoogle Profits\n\nGoogle Revenue Breakdown\nIn 2022, Google generated over $282 billion in revenues, of which over $162 billion from Google Search, over $29 billion from YouTube Ads, and almost $33 billion from Network Members’ properties. In addition, Google generated over $29 billion in other revenue, over $26 billion from Google Cloud, and over a billion dollars from other bets. \nGoogle Advertising Revenue\n\nApple vs. Google\n\nGoogle Employees Number\n\nGoogle Ad vs. Facebook Ad\n\nYouTube Ad Revenue\nYouTube, by 2022, generated over $29 billion in advertising revenues. \nRelated Net Worth Case Studies\nElon Musk Net Worth\nBy 2022, most of Tesla’s shares are still owned by Elon Musk, among the company’s co-founders and the CEO. Elon Musk is the top individual investor, with a 23.5% stake in the company. At current rates, this is valued at around $145-50 billion, making Elon Musk one of the wealthiest men on earth. In addition, Musk also holds a significant stake in Twitter and SpaceX, which makes him worth anywhere between $180-90 billion.\nBernard Arnault Net Worth\nBernard Arnault’s wealth is around $203 billion. Indeed Arnault is the CEO and chairman of the luxury goods conglomerate LVMH Moët Hennessy Louis Vuitton, a massive luxury group that generated over €79 billion in revenue ($83 billion) in 2022, spanning across wines, fashion, cosmetics, and retail. The Arnault family group owns 48.18% of the capital for LVMH with 63.9% voting power, making Bernard Arnault the principal owner and decision-maker. His stake is worth over $203 billion.\nWarren Buffet Net Worth\nWarren Buffett is an American investor, business tycoon, and philanthropist. Known as the “Oracle of Omaha,” Buffett is best known for his strict adherence to value investing and frugality despite his immense wealth. Warren Buffet owns an investment firm, Berkshire Hathaway. He owns 238,624 Class A shares which gives him control over the company. His stake in the company is valued at over $100 billion.\nJeff Bezos Net Worth\nJeff Bezos’ net worth is primarily based on his ownership stake in Amazon. Indeed, as of 2023, Bezos owned a 12.7% stake in Amazon, worth over $120 billion.\nTim Cook Net Worth\nTim Cook’s net worth is primarily comprised of his Apple stocks. As of 2023, he owned 3,279,898 worth about $480 million at the current rate. However, Tim Cook has sold part of his Apple stocks over the years for hundreds of millions of dollars, making him a billionaire.\nBill Gates Net Worth\nBill Gates was the co-founder and former CEO of Microsoft until 2000, and he was on the board of Microsoft until 2020. However, over the years, Gates sold various stakes in Microsoft and diversified away from it. As of 2019, Gates had a 1.34% stake in Microsoft, which he might still own, valued at about $25 billion.\nSatya Nadella Net Worth\nAs of 2022, Satya Nadella had 763,518, valued at $190 million at Microsoft’s current market value. Nadella also got a $2.5 million base salary in 2022, plus $42.27 million in stock awards and over $10 million in non-stock incentives. Nadella sold hundreds of millions of dollars of Microsoft stocks in the last ten years, making him a centi-millionaire. In 2022, 96% of Nadella’s salary was performance-based, whereas only 4% comprised a base salary. \nLarry Page Net Worth\nLarry Page co-founded Google (now Alphabet) and Sergey Brin. He controls the company tightly via a dual share ownership structure (made of Class A and B stocks). Alphabet is worth over a trillion dollars, valuing Larry Page’s stake in the company at around $70 billion. \nSergey Brin Net Worth\nSergey Brin co-founded Google (now Alphabet) together with Larry Page. He controls the company tightly via a dual share ownership structure (made of Class A and B stocks). Alphabet is worth over a trillion dollars, valuing Sergey Brin’s stake at around $66 billion. \nMark Zuckerberg Net Worth\nMark Zuckerberg is the co-founder and principal shareholder of Facebook (now Meta), in which he owns a controlling stake worth over $68 billion. Thus Mark Zucberkerbs’ net worth is around $68 billion in 2023. \nEduardo Saverin Net WorthEduardo Saverin Net Worth\nEduardo Luiz Saverin is a billionaire entrepreneur and angel investor. He co-founded Facebook with Mark Zuckerberg; he was later ousted. Yet later on, Facebook settled a lawsuit with Saverin giving him a good chunk of the company’s stock, now worth over ten billion dollars. Thus, Eduardo Saverin’s net worth is around $10.45 billion in 2023. \nLarry Ellison Net Worth\nWhile Larry Ellison is a shareholder in various tech companies (such as Tesla), his primary wealth comes from his ownership stake in the company he founded, Oracle. He owns almost 43% of the company’s stock, valued at over $100 billion, making him among the wealthiest people on earth.\nHoward Schultz Net Worth\nHoward Schultz’s net worth is over $2.2 billion. Indeed, he is the founder of Starbucks and a major institutional shareholder, with 1.88% ownership of the company, valued at over $2.2 billion at the current market value, making him a billionaire.\nDaniel Ek Net Worth\nDaniel Ek is one of the founders and one of the principal shareholders of Spotify. Indeed, in 2023 with 16.5% of Spotify’s shares, he’s worth around $3.7 billion. \nFrancois-Henri Pinault Net Worth\nThe Pinault family is the main shareholder behind the Kering Group luxury empire, with a stake of 41.7%, valued around €30 billion, thus $32-33 billion. The Kering Group owns iconic brands like Gucci, Yves Saint Laurent and Bottega Veneta. \nPierre Omidyar Net Worth\nPierre Omidyar is a technology entrepreneur andPierre Omidyar is a technology entrepreneur and founder of eBay. As of 2020, before he stepped down from the company’s board of directors, he still owned 4.69% of the company’s stocks, valued at over one billion dollars. Yet, over the years, he sold a good chunk of his stocks, making him a billionaire.  founder of eBay. As of 2020, before he stepped down from the company’s board of directors, he still owned 4.69% of the company’s stocks, valued at over one billion dollars. Yet, over the years, he sold a good chunk of his stocks, making him a billionaire. \nMarc Benioff Net Worth\nMarc Benioff’s net worth is $5 billion. His net worth primarily comes from his stake in Salesforce. Indeed, he owns 3% of the company’s stock, valued at around $5 billion at current market value, making Marc Benioff a billionaire.\nReed Hastings Net Worth\nReed Hastings is the co-founder, former CEO, and now executive chairman of Netflix. He’s also one of the major shareholders, with 1.7% ownership in the company, valued at $2.4 billion at the current rate.\nEvan Spiegel Net Worth\nEvan Thomas Spiegel is the co-founder and CEO of Snapchat. He’s also the main shareholder. Indeed, he both owns and controls Snapchat, and his stake in the company is currently valued at around $3 billion. \nBrian Chesky Net Worth\nBrian Chesky is an industrial designer and businessman who is also Airbnb’s co-founder and current CEO. Since the company was founded in 2007, Chesky has been in charge of it, amassing a net worth of about $10 billion, thanks to his shares in the company.\nPhil Knight Net Worth\nPhil Knight, the founder of Nike, controls the company via a personal stake of shares for 7% ownership, plus the shares held via the family’s owned Swoosh, LLC, in addition to the shares in possession of his son’s Trust. Phil Knight directly controls a significant stake in Nike’s Class A and B shares, valued at over $40 billion. \nMichael Jordan Net Worth\nMichale Jordan is a billionaire but doesn’t own the Jordan brand, which is part of Nike. Yet, he gets 5% royalties on the sales of Jordan. For instance, as of May 31, 2022, Nike had endorsement contract obligations of $7.6 billion, of which over $250 million were to be paid out to Michael Jordan as royalties on the sales of Jordan in 2022 (the company made over 5$ billion in sales in that year). We estimated that between 2018-2022 alone, Nike paid (or is paying) Michael Jordan almost one billion dollars in royalties for Jordan’s brand sales. \nKevin Plank Net Worth\nKevin Plank is Under Armour’s primary owner and founder, of which he’s also chairman. His stake in the company is worth over a billion dollars at current market value, making him a billionaire. \nRead More: \n\nBusiness Models\nPlatform Business Models\nDigital Business Models\nDistribution Channels\nBusiness Strategy\nValue Proposition\nMarketing Strategy\nBrand Building\nSWOT Analysis\n\n\n\n\n\nRelated\nMore ResourcesWho Is Sergey Brin?How Did Mark Cuban Make His Money? Mark Cuban Net…Warren Buffet Net WorthJeff Bezos' Net WorthSundar Pichai Net WorthLarry Ellison Net WorthKevin Plank Net WorthFrederick W. Smith Net Worth Table of Contents We assume and compute Sergey Brin’s net worth primarily based on his ownership stake in Alphabet, his largest holding (though he also owns other assets). According to official financial data, our estimate was based on 300,758,936 shares of Class A common stock and 44,404,426 shares of Class B common stock outstanding on April 5, 2022. The market cap has been computed based on March’s 2023 data of a 1.23 trillion dollars market cap. Sergey Brin owns 18,566,632 Class B shares, representing 41.8% of Class B shares and 24.9% of total voting power. Sergey Brin ownership percentage: Sergey’s ownership % = (Class B shares owned by Sergey Brin / Total outstanding shares) * 100 Sergey’s ownership % = (18,566,632 / 345,163,362) * 100 ≈ 5.38% Sergey Brin’s ownership stake value: Ownership value = (Sergey’s ownership % / 100) * Market cap Ownership value = (5.38 / 100) * $1.23 trillion ≈ $66.154 trillion So, Sergey Brin’s stake in the company is worth approximately $66.154 billion. Conclusion: Based on these calculations, Sergey Brin’s ownership stake in Alphabet is estimated to be worth approximately $66.154 billion. This estimation is derived from his ownership of Class B shares and his proportional ownership of Alphabet’s overall market capitalization. Google Business Model Google Other Bets Google Cloud Business How Big Is Google? Google Traffic Acquisition Costs How Does Google Make Money YouTube Business Model Google vs. Bing Google Profits Google Revenue Breakdown Google Advertising Revenue Apple vs. Google Google Employees Number Google Ad vs. Facebook Ad YouTube Ad Revenue Elon Musk Net Worth Bernard Arnault Net Worth Warren Buffet Net Worth Jeff Bezos Net Worth Tim Cook Net Worth Bill Gates Net Worth Satya Nadella Net Worth Larry Page Net Worth Sergey Brin Net Worth Mark Zuckerberg Net Worth Eduardo Saverin Net WorthEduardo Saverin Net Worth Larry Ellison Net Worth Howard Schultz Net Worth Daniel Ek Net Worth Francois-Henri Pinault Net Worth Pierre Omidyar Net Worth Marc Benioff Net Worth Reed Hastings Net Worth Evan Spiegel Net Worth Brian Chesky Net Worth Phil Knight Net Worth Michael Jordan Net Worth Kevin Plank Net Worth Read More:   Copyright © 2024  FourWeekMBA Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}