{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.theguardian.com/technology/2024/jan/11/google-alphabet-layoffs",
    "text": "Tech giant among others – including Amazon and Meta – to cut workforce as business predictions slowed down in the past year Google has laid off a thousand workers in its hardware, voice-assistance and engineering teams as part of cost-cutting measures, according to the Alphabet Workers Union. The cuts come as Google looks towards “responsibly investing in our company’s biggest priorities and the significant opportunities ahead”, the company said in a statement. “Some teams are continuing to make these kinds of organizational changes, which include some role eliminations globally,” it said. Google at first said said it was eliminating a few hundred roles across engineering, hardware and the Assistant teams, though most of the impact hit the company’s augmented reality hardware division. The next day, the Alphabet Workers Union pegged the figure at 1,000 workers. The layoffs follow pledges by executives of Google and its parent company, Alphabet, to reduce costs. A year ago, Google said it would lay off 12,000 employees, about 6% of its workforce. The same day news of the cuts broke, Google announced that it would deprecate 17 “underutilized” features of Google Assistant, including playing audiobooks, sending an email or starting a meditation session with Calm by using a voice command. In a post on X – previously known as Twitter – the Alphabet Workers Union described the job cuts as “another round of needless layoffs”. “Our members and teammates work hard every day to build great products for our users, and the company cannot continue to fire our coworkers while making billions every quarter,” the union wrote. “We won’t stop fighting until our jobs are safe!” Google experienced record growth in the early days of the coronavirus pandemic but has needed to adjust predictions for its business as that expansion has slowed over the past year. It is not the only technology company in that boat. Meta – the parent company of Facebook, Instagram and WhatsApp – has slashed more than 20,000 jobs. Spotify said in December that it was axing 17% of its global workforce, the music streaming service’s third round of layoffs in 2023 as it moved to slash costs and improve its profitability. Sign up to TechScape Alex Hern's weekly dive in to how technology is shaping our lives after newsletter promotion Earlier this week, Amazon laid off hundreds of employees in its Prime Video and studios units. It also will lay off about 500 employees who work on its live-streaming platform Twitch. Amazon has cut thousands of jobs after a hiring surge during the pandemic. In March, the company announced it planned to lay off 9,000 employees, on top of 18,000 employees it said it would lay off in January 2023. Google is now locked in a fierce rivalry with Microsoft as both firms strive to lead in the artificial intelligence domain. The office software giant has stepped up its artificial intelligence offerings to rival Google’s. In September, Microsoft introduced a Copilot feature that incorporates artificial intelligence into products such as its search engine Bing, browser Edge as well as Windows for its corporate customers. "
}