{
    "title": "Why Alphabet Stock Rallied 58% in 2023, and Why There's More in Store for \n2024",
    "date": "1/16/2024",
    "url": "https://www.fool.com/investing/2024/01/16/why-alphabet-stock-rallied-58-in-2023-and-why-ther/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Shares of Alphabet (GOOGL 0.04%) (GOOG 0.21%) charged sharply higher in 2023, soaring 58%, according to data provided by S&P Global Market Intelligence. The rally was in sharp contrast to its performance in 2022, when the stock plunged 39%. While the company no doubt benefited from the improving economy, it was Alphabet's latest foray into artificial intelligence (AI) that has investors most excited. Image source: Getty Images. The bear market that began in 2022 took a toll on Alphabet stock, as the digital advertising that generates the lion's share of Google's revenue dried up, resulting in year-over-year revenue declines. Businesses tend to slash marketing budgets during economic challenges to shore up their financial positions. As the industry leader in online advertising, Alphabet felt the impact more than most. The improving economy in 2023 saw marketers loosen their purse strings, and ad spending resumed, which gave the company a boost. However, it was the advent of AI last year that really kicked Alphabet stock into high gear. AI is nothing new, having been around for decades. Furthermore, Alphabet has long used these algorithms to improve the accuracy and relevance of its search, ensure its digital advertising finds its target audience, and underpin the autonomous systems for its Waymo self-driving cars. However, advances in the field of generative AI promise to be a game changer, and Alphabet was quick to throw its hat in the ring. This latest branch of AI can create original content, summarize and draft email responses, create presentations, search the internet and company records for data, and even write and debug computer code. Microsoft and its partnership with ChatGPT parent OpenAI was arguably the catalyst for the AI revolution that ensued, but Alphabet was quick to respond to the challenge. While its Bard chatbot initially stumbled, Google quickly recovered, infusing AI across a broad cross-section of its vast empire. AI-powered tools improved Gmail, Google Docs, and Google Slides, among others, while the company also announced plans to augment its search with new AI-fueled capabilities. Perhaps the most important development, however, was the debut of generative AI tools on Google Cloud. Just last month, the company announced the debut of Gemini AI, which the company called its \"largest and most capable AI model.\" Google says its latest entry is far more advanced than GPT-4, which forms the foundation of ChatGPT, with five times the computational power. Gemini was tested on various skills, including audio and video understanding, natural image, and mathematical reasoning, \"exceeding current state-of-the-art results on 30 of the 32 widely used academic benchmarks used in large language model (LLM) research and development.\" Gemini also scored 90% using massive multitask language understanding (MMLU), one of the predominant approaches for testing AI's problem-solving proficiency. This resulted in Gemini being the first generative AI \"model to outperform human experts\" using this standard. Given the steady improvements in the economy and the company's foray into generative AI, 2024 is stacking up to be a good year for Alphabet. We don't know how big AI could be, but current estimates suggest a range of between $2.6 trillion and $4.4 trillion annually, according to data compiled by the McKinsey Global Institute. That, combined with Alphabet's dominant position in search and digital advertising, suggests the company is well positioned coming into 2024. Make no mistake: Alphabet stock is a buy. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet and Microsoft. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}