{
    "title": "Invest In Google, Ignore The Pressure Around Only Buying Dividend Stocks \n(NASDAQ:GOOG)",
    "date": "1/20/2024",
    "url": "https://seekingalpha.com/article/4663919-invest-in-google-ignore-pressure-around-only-buying-dividend-stocks",
    "text": "da-kuk/E+ via Getty Images da-kuk/E+ via Getty Images Every day, you'll see a new article on Seeking Alpha, or other investment sites. Five long-term dividend investments, why you need this 10% yielding investment, and much more. However, despite the cash flow of dividends, keep in mind that dividends are a form of double taxation, unless it's a unique company like an REIT. There's plenty of non-dividend paying companies that we expect to outperform dividend investments made today for your retirement, and one of them is Google (NASDAQ:GOOGL). As we'll see throughout this article, Google's dominance in both software engineering talent, infrastructure, and assets, will cement its future cash flow for numerous years to come. Google has managed to continue achieving strong financial results despite a volatile market for its share price. The company reports the next set of its earnings in less than 2 weeks. What we're primarily looking for from the company's earnings here is continued growth in its revenue, especially in segments the market is worried about or are facing competition such as YouTube and Google Search. We're expecting double-digit growth here in continuation of the company's prior strength and we'll keep an eye out. Google Press Release Google Press Release The company earned $77 billion in revenue in the most recent quarter, up double-digits YoY. In constant currency that was constant, the same constant improvement in 2022 from the year before. However, thanks to an expansion in the company's operating income and a focus on cutting costs, margins of 28% led to $21.3 billion in operating income. Net income for the company of almost $20 billion was a massive expansion in EPS of almost 50% from just under $14 billion. Those impressive results show the massive benefits from the company both increasing its revenue along with its focus on increasing margins, reading to a double benefit in margins. From a segment perspective, Google's improved performance is clear. Google Press Release Google Press Release The company's core businesses of Google Search and YouTube have all seen continued growth in their revenue. The company's Google Network revenue declined but that's less important than the company's core businesses. Google Cloud saw dramatic growth as the company continues to use its technological prowess to grow within the cloud markets. The company's other bets remains a small part of its revenue, but did see almost 50% growth. This led to strong total revenue growth. The company's TAC did increase by less than the % its revenue grew, and TAC remains a necessary and affordable cost for the company's business. The company's employee count decreased by ~3% due to layoffs. The company has announced more layoffs in 2024, and while we remain concerned about the potential impact that will have to morale and technological success, other large tech layoffs mean the company has been able to continue its performance. Google Press Release Google Press Release From an operating perspective, the company has worked hard to clean up its balance sheet. The company's operating income grew from its core services and most importantly google cloud switched from a major negative impact in the billions to a strong positive impact. The company's other bets also saw costs decrease dramatically. The company did shift Google DeepMind + Research (Brain) to their own corporate costs division to accelerate progress rather than being part of Google Services. That shifted over a $1.6 billion quarterly loss and shows the scale of the company's AI investment, and it's something that only a few of the largest companies in the world could swallow. The large scale clean-up here shows the continued strength of the company's business. Google has shifted to focusing on increased shareholder returns. The company recently announced $70 billion in share buybacks in 2023, a continuation over the same thing in 2022. MacroTrends MacroTrends As a result of that, the company has been able to aggressively repurchase shares, as seen with the above graph, despite the shares it continues to hand out to employees. The company has a $1.8 trillion market capitalization, meaning $70 billion is enough to repurchase ~4% of its outstanding shares annualized. This is a pace that the company can continue with earnings. The company also has a $118 billion cash pile that it can direct towards shareholder returns. This commitment to long-term shareholder returns as the company grows its earnings shows its financial strength. Its newfound focus on shareholder returns rather than expensive growth at all costs helps to highlight the company as a valuable investment. Google has been on the forefront of technology since its creation. The company's DeepMind division is inarguably the leader in artificial intelligence. A lack of ability to commercialize it, versus ChatGPT, has led to panic within the company but the underlying LLMs that the company employs are competitive with ChatGPT. Another easy way to tell Google's strength is to look at its open source projects. These projects that spawned from the company's internal technology and now dominate modern technology. For many, especially those who work in technology it's obvious. As long as Google continues to employ and fund brilliant engineers, the company will continue to have dominant technology. It might not always be the first to market for a new idea but it will be able to regularly catch up. The largest risk to our thesis is the competition that Google faces. That's despite our discussion above about how we feel the company can comfortably navigate the artificial intelligence threats that it faces. The company's largest competitors are some of the largest and wealthiest companies in the world and they're working to actively compete. That risk is worth paying close attention to. Google remains a technological giant. The diversification of the company's portfolio of tech assets might not be as diverse as investors think on the surface looking at Google ads, however, underneath the company has grown to dominate many segments of technology. ChatGPT might have scared the company, however, its core AI assets are market leading and competitive. The company remains a cash flow giant and it continues to use that cash flow to drive substantial shareholder returns through share buyback. It can afford to continue its pace of $70 billion / year in share buybacks. That will provide base shareholder returns that'll continue over time. All of that together makes Google a valuable investment. The Retirement Forum provides actionable ideals, a high-yield safe retirement portfolio, and macroeconomic outlooks, all to help you maximize your capital and your income. We search the entire market to help you maximize returns. Recommendations from a top 0.2% TipRanks author! Retirement is complicated and you only get once chance to do it right. Don't miss out because you didn't know what was out there.  We provide: Click for our discounted 2-week free trial! This article was written by The Value Portfolio specializes in building retirement portfolios and utilizes a fact-based research strategy to identify investments. This includes extensive readings of 10Ks, analyst commentary, market reports, and investor presentations. He invests real money in the stocks he recommends. Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}