{
    "title": "Investors Watch Closely as Google Takes on Microsoft, Amazon - Alphabet \n(NASDAQ:GOOG), Alphabet (NASDAQ:G",
    "date": "1/11/2024",
    "url": "https://www.benzinga.com/government/24/01/36596980/investors-watch-closely-as-google-takes-on-microsoft-amazon",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Alphabet Inc's GOOG GOOGL Google has announced a significant policy change in its cloud-computing services to facilitate customer transitions to rival services. This move, effective immediately, involves eliminating fees for customers who wish to migrate from Google Cloud to a competitor's platform, such as Amazon.com Inc AMZN or Microsoft Corp MSFT. This decision could potentially influence these competitors to adopt similar policies, Bloomberg reports. Also Read: Battle in the Clouds: How Amazon and Google's Allegations Might Reshape Microsoft's Strategy This strategic shift by Google is amidst growing regulatory scrutiny of global cloud services. The U.K.'s antitrust authorities have initiated an investigation focusing on such switching penalties, and the U.S. Federal Trade Commission is also examining various cloud-related concerns, including these fees. Amit Zavery, Google's Vice President overseeing the cloud business, highlighted that while switching fees constitute a small fraction (about 2%) of the total costs of moving to a new cloud provider, they have become a point of contention among regulators and customers. The underlying motive for Google's policy change is not solely customer-centric. The company also aims to redirect regulatory focus towards what it perceives as a more significant issue: Microsoft's restrictive practices that hinder customers from opting for Google Cloud. Google, Amazon Web Services, and other stakeholders have criticized Microsoft for imposing higher costs and difficulties running critical Microsoft programs on rival cloud platforms. Despite Microsoft's efforts to address these complaints, including some relaxation of restrictions in 2022, major competitors like Amazon, Google, and Alibaba Group Holding Ltd BABA remain affected. Google's stance is also part of a broader industry effort, with Amazon leading the charge in lobbying policymakers to challenge Microsoft's practices. As regulatory investigations, particularly by the European Union, delve into Microsoft's bundling of products with its cloud services, Google aims to ensure its concerns and customer feedback are heard. However, Google acknowledges the risk of being sidelined in potential business opportunities if regulatory actions are delayed. Google has been going through multiple developments as it clocked the new year. Today, Google made headlines by announcing layoffs within its hardware and digital assistant teams as part of a broader cost-cutting initiative. The affected employees primarily come from the Google Assistant and augmented reality hardware teams and the central engineering organization. Google is reallocating resources to focus on priority investments due to increasing competition in its core search business from rivals like Microsoft and OpenAI's ChatGPT. Last week's reports indicated that Google was initiating a significant change in online user tracking by beginning tests to limit cookie usage on 1% of Chrome users and to completely phase out cookies for all Chrome users by the end of the year. This move directly impacts the $600 billion online advertising industry and aims to eliminate third-party cookies, which advertisers rely on for tracking internet users. The change is motivated by privacy concerns raised by consumer advocates regarding the invasive nature of third-party cookies.  Google stock gained 56% last year versus the broader index SPDR S&P 500 (SPY) at 20%. Amazon achieved 63%, and Microsoft at 62%. Price Action: GOOG shares traded lower by 0.31% at $143.36 on the last check Thursday. Also Read: Great News for Nvidia? Amazon, Google, Microsoft Spending Big On AI and Cloud Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Company © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}