{
    "title": "Investors in Alphabet (NASDAQ:GOOGL) have seen solid returns of 164% over \nthe past five years",
    "date": "1/9/2024",
    "url": "https://simplywall.st/stocks/us/media/nasdaq-googl/alphabet/news/investors-in-alphabet-nasdaqgoogl-have-seen-solid-returns-of",
    "text": "Stock Analysis The most you can lose on any stock (assuming you don't use leverage) is 100% of your money.  But when you pick a company that is really flourishing, you can make more than 100%.  One great example is Alphabet Inc. (NASDAQ:GOOGL) which saw its share price drive 164% higher over five years. Now it's worth having a look at the company's fundamentals too, because that will help us determine if the long term shareholder return has matched the performance of the underlying business. See our latest analysis for Alphabet There is no denying that markets are sometimes efficient, but prices do not always reflect underlying business performance.  One imperfect but simple way to consider how the market perception of a company has shifted is to compare the change in the earnings per share (EPS) with the share price movement. During five years of share price growth, Alphabet achieved compound earnings per share (EPS) growth of 32% per year.   This EPS growth is higher than the 21% average annual increase in the share price.  Therefore, it seems the market has become relatively pessimistic about the company. You can see below how EPS has changed over time (discover the exact values by clicking on the image). Dive deeper into Alphabet's key metrics by checking this interactive graph of Alphabet's earnings, revenue and cash flow. It's nice to see that Alphabet shareholders have received a total shareholder return of 58% over the last year.    Since the one-year TSR is better than the five-year TSR (the latter coming in at 21% per year), it would seem that the stock's performance has improved in recent times.  Someone with an optimistic perspective could view the recent improvement in TSR as indicating that the business itself is getting better with time.        Is Alphabet cheap compared to other companies? These 3 valuation measures might help you decide. If you are like me, then you will not want to miss this free list of growing companies that insiders are buying. Please note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges. Find out whether Alphabet is potentially over or undervalued by checking out our comprehensive analysis, which includes fair value estimates, risks and warnings, dividends, insider transactions and financial health. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. Solid track record with excellent balance sheet. Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. "
}