{
    "title": "Alphabet's Isomorphic Labs to collaborate with Novartis, Lilly on AI-driven \ndrug discovery",
    "date": "1/8/2024",
    "url": "https://fortune.com/well/2024/01/08/alphabet-google-isomorphic-labs-collaborate-ai-drug-discovery-novartis-lilly/",
    "text": "Bloomberg—Isomorphic Labs, a subsidiary of Alphabet Inc., said it entered into strategic research collaboration agreements with Novartis AG and Eli Lilly & Co. Under the terms of the partnership with Lilly, Isomorphic Labs will receive an upfront cash payment of $45 million to collaborate on research into small molecule therapeutics against multiple targets, the company said in a statement. It is also eligible to receive as much as $1.7 billion in performance-based milestone payments, excluding the upfront payment and any subsequent tiered royalties of up to low double digits on net sales. Isomorphic Labs also entered into an agreement with Novartis to discover small molecule therapeutics against three undisclosed targets. The company will receive an upfront payment of $37.5 million and is eligible to receive as much as $1.2 billion in performance-based milestone payments, according to a separate statement. “This collaboration harnesses our companies’ unique strengths, from AI and data science to medicinal chemistry and deep disease area expertise, to realize new possibilities in AI-driven drug discovery,” said Fiona Marshall, president of biomedical research at Novartis. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}