{
    "title": "Google: Cheapest Mag 7 Ripped To Reach $170 By The Year End",
    "date": "2/4/2024",
    "url": "https://seekingalpha.com/article/4667343-google-cheapest-mag-7-ripped-to-reach-170-by-the-year-end",
    "text": "SOPA Images/LightRocket via Getty Images  SOPA Images/LightRocket via Getty Images I have kicked off this year of investing by including Alphabet, the parent company of Google (NASDAQ:GOOGL) (NASDAQ:GOOG), in my Top 3 Picks for 2024. I am convinced that 2024 is the year Google will benefit from further ad-spending recovery, a contested presidential election in the US, and increased efficiency and ad-targeting led by AI improvements. The company has just reported Q4 and full-year 2023 earnings, and the results came in very positively, with a 13% revenue growth in Q4 and EPS up 56% YoY. For the full year, revenue is up 10%, and EPS is up 27%. These are great results, if I were to judge; yet, the stock has dropped from its 52-week high of $154 down to $143, or roughly an 8% pullback. Price Development (Seeking Alpha) Price Development (Seeking Alpha) With the year-end 2023 rally and a strong start to 2024, the valuations of the Magnificent 7 have become stretched, and nothing less than stellar earnings would avoid punishment. That is precisely what happened. Google delivered good results, but they were not stellar, as Google advertising dragged a bit on overall revenue growth, only up by 11% to $65.5 billion, falling short of expectations for $65.8 billion. So, let's examine whether this presents a good buying opportunity for what I believe should be a great year for advertising businesses in 2024. We've been through this situation before, do you recall? In the previous quarter, Google posted strong Q3 earnings, but its stock faced a 15% drop from its peak of $142, plunging to $121. This downturn resulted in the company shedding more than $180 billion in market capitalization within a week. During that period, the decline in the stock price was primarily linked to Google's Cloud unit, which didn't grow as rapidly as expected. It was the only segment that fell short of Wall Street's consensus expectations, despite a respectable 11.1% revenue growth for the quarter. Back then, I wrote an article titled \"Why I'm aggressively buying the dip,\" and since its publication, I've seen my investment return by over 11%. Today, the narrative is strikingly similar once again. Let's ensure we draw lessons from the past and seize the opportunity. In its Q4 earnings report, Google has achieved a 13% increase in overall revenue to $86.3 billion. This marks the company's fastest growth in the last six quarters. Quarterly Growth (CNBC) Quarterly Growth (CNBC) The revenue has surpassed Wall Street expectations of 12% growth, and the operating income has surged by 30% to $23.7 billion, with an operating margin of 27%, marking a 300 basis points increase YoY. Net income has reached $20.7 billion, reflecting a 52% growth YoY, and the EPS of $1.64 has exceeded analysts' expectations by $0.04. Q4 Earnings (GOOGL IR) Q4 Earnings (GOOGL IR) In the broader context, Google's performance in Q4 has been robust, particularly when compared to previous quarters. This is confirmed by the almost exclusively double-digit growth in each segment: Q4 Earnings by Segment (GOOGL IR) Q4 Earnings by Segment (GOOGL IR) Now, one might ask, if the earnings were so good and mostly beat analysts' expectations, alongside the reaccelerating growth in the cloud unit, why did the stock experience a significant 8% pullback since the report came out? The expectations going into the earnings were quite high; the valuation of the Magnificent 7 companies has become relatively stretched. Anything better than stellar earnings and beating expectations would be punished, as we have observed with other stocks. Google's blended P/E heading into the earnings was 26.2x, or one could say \"priced to perfection,\" marking a significant increase from the 23.2x its earnings we were accustomed to between 2022 and the end of 2023. With the valuation stretched, the company had to deliver, and Google did produce good results. However, Google's total advertising revenue slightly impacted overall revenue growth, increasing by only 11% to $65.5 billion, falling short of expectations for $65.8 billion, or perhaps even an overdelivery. Yet, there were highlights, such as the growth in YouTube Ads and Google's Cloud unit, which performed better than expectations. Ultimately, the 8% pullback is not a reaction to poor results; instead, it signifies a normalization of expectations. In my opinion, we may see more of this during this earnings season as expectations are excessively stretched. One thing I am keeping an eye on heading into 2024 is Google's increased R&D spending, which came in Q4 at $12.1 billion, showing a 17.5% YoY increase. This could pose a challenge to the operating margins. Q4 Expenses (GOOGL IR) Q4 Expenses (GOOGL IR) The company has also highlighted an increase in CapEx spending, reaching $11 billion in Q4, as it strives to catch up in the AI race. This surge is predominantly fueled by investments in technical infrastructure, with servers being the largest component, followed by data centers. The elevation in CapEx during Q4 reflects their anticipation of the extraordinary applications of AI, aiming to deliver benefits for users, advertisers, developers, cloud enterprise customers, and governments globally. It underscores their belief in the long-term growth opportunities presented by AI. Looking ahead to 2024, Google anticipates that CapEx investment will notably exceed the figures from 2023. This trend is expected to be consistent among most Magnificent 7 companies as they position themselves at the forefront of innovation. Yet, I am optimistic about 2024, as ad spending growth is widely forecasted to accelerate. The market seems to be cheering for a return to higher growth in 2024, driven by new synergies from generative AI advertising offerings from Big Tech, and pockets of stronger growth in digital and retail media ad spend. Growth forecasts from Magna, Dentsu, and GroupM generally point to an acceleration next year, averaging around 5.7% between the three, compared to 4.7% in 2023. Global Ad Spending Forecast (Forbes) Global Ad Spending Forecast (Forbes) As we glance into 2024, a pivotal election year in the US, it's clear that the stage is set for intense political discussions amid the prevailing issues in the country. Companies focused on advertising are likely to gain substantially from the surge in online campaigning. Meta is expected to be among the key beneficiaries in this scenario. As you can see from the table above, Google is currently the most affordable among the Magnificent 7 stocks. After the pullback, the stock is trading at 24.3x its blended P/E ratio. Since 2013, the average valuation has stood at 24.8x its earnings, with an average annual growth rate of 17.7% in EPS over the same period. Following a robust recovery in 2023, with a 27% increase in EPS, the growth is not expected to slow down: The upward trajectory of this growth indicates that the historical valuation of 24.8x provides a reasonable estimate for where the stock is likely to trade in the future, given the anticipated sustained growth. This scenario suggests that we can expect annual returns of approximately 17% until 2023, making it one of the most promising prospects among the Mag 7 stocks. Setting a short-term target, I aim for the stock to reach $170 by the end of 2024. While the stock seems to be trading at a fair valuation, the ongoing growth is expected to drive capital appreciation. If Google were to follow in Meta's footsteps and initiate its first-ever dividend, there is potential for a 0.5-1% yield over the next couple of years, accompanied by substantial buyback activity. Valuation (Fast Graphs) Valuation (Fast Graphs) Google just dropped 8% after reporting its Q4 earnings. In my view, it's a justified dip because, let's face it, the stock was a bit overpriced heading into the earnings, compared to what we've been used to in the past couple of years. Now, the earnings report itself was good - a solid 13% revenue growth, nothing mind-blowing though. But here's the twist: the drop in stock value isn't a sign of doom and gloom for Google's future. Instead, it's a reality check, a recognition of more normalized growth forward. Interestingly, as of now, Google's stock is the cheapest among the Magnificent 7 companies. I'm optimistic about Google's future, especially in 2024. I'm betting on a dynamic year ahead, partly fueled by the expected intense US presidential election and a boost in ad spending. Seizing the moment, I've doubled down on my Google holdings after the earnings report. Google is now one of my top holdings, and I'm setting my sights on a $170 target by the end of the year. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}