{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/trading-ideas/long-ideas/24/02/36948095/apple-alphabet-fiverr-international-and-a-global-payments-processor-cnbcs-final-trades",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW On CNBC’s \"Halftime Report Final Trades,\"  Steve Weiss of Short Hills Capital Partners named  Alphabet Inc. GOOG GOOGL as his final trade. Alphabet recently posted better-than-expected earnings results for its fourth quarter. However, Google’s advertising sales came in short of market estimates. Alphabet’s fourth-quarter revenue increased 13% year-over-year to $86.31 billion, which beat the consensus estimate of $85.33 billion, according to Benzinga Pro. The company reported quarterly adjusted earnings of $1.64 per share, which beat analyst estimates of $1.59 per share. Sarat Sethi named PayPal Holdings, Inc.  PYPL, which is scheduled to release its quarterly earnings this week. PayPal Holdings recently initiated company-wide layoffs, impacting around 9% of its workforce, or approximately 2,500 employees. CEO Alex Chriss confirmed this development to employees in a letter. Don’t forget to check out our  premarket coverage here Amy Raskin  of Chevy Chase Trust picked  Fiverr International Ltd.  FVRR. Fiverr International is expected to release fourth-quarter financial results for the period ended Dec. 31, 2023, before the opening bell on Feb. 22, 2024. Analysts expect the company to report quarterly earnings at 48 cents per share on revenue of $92.55 million. Joe Terranova of Virtus Investment Partners named  Apple Inc. AAPL. Apple Inc reported better-than-expected earnings and revenue for its first quarter. The iPhone maker reported first-quarter earnings per share of $2.18 and revenue of $119.6 billion, thanks to record Services revenue and iPhone revenue. However, the company reported a revenue decline in China. Check This Out:  Ford, Eli Lilly And 3 Stocks To Watch Heading Into Tuesday Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}