{
    "title": "Nvidia soaring market cap nears Amazon and Alphabet, fueled by surging AI \ndemand",
    "date": "2/12/2024",
    "url": "https://www.techspot.com/news/101836-nvidia-soaring-market-cap-nears-amazon-alphabet-fueled.html",
    "text": "Jackpot baby! Artificial intelligence has proven incredibly fruitful for Nvidia and its shareholders over the past year, and could even help the chipmaker surpass Amazon in terms of total market capitalization. Closing at over $720 today, that's an increase of more than 20% year over year and nearly 50% since the beginning of 2024. Update (Feb 12): Nvidia stock keeps on rising. Today it briefly passed both Amazon and Alphabet. Nvidia is officially the 4th largest company in the world by market cap\n\nIt passed BOTH Amazon and Alphabet this morning with shares up 2.5%\n\nThe show goes on pic.twitter.com/eFp3U9SQtu Nvidia shares closed at $223.37 a year ago today. It is a respectable figure, but was down about $50 compared to where the stock sat in early February 2022. Today, it is trading at $721. That is an increase of more than 221 percent year over year and up nearly 50 percent since the start of 2024. Nvidia's market cap currently sits at $1.77 trillion, which is not far behind Amazon's cap of $1.81 trillion or Alphabet at $1.86 trillion. Tech titan Apple is currently valued at $2.92 trillion, well ahead of most of its peers. Those holding on to shares purchased prior to 2020 are no doubt having a hard time wiping the grin of their face. Back then, you could pick up shares of Nvidia for around $50 each.  Earlier this week, Morgan Stanley raised its Nvidia stock price target from $603 per share to $750 per share, spurring recent gains. Analysts said that although wait times are coming down, developers are still facing long waits in order to train models using Nvidia hardware from cloud providers. Nvidia has been selling AI-capable hardware as fast as it can make it, but is not the only one benefitting from the AI race. Last month, Microsoft overtook Apple as the most valuable company in the world. As of writing, Microsoft's market cap sits at $3.12 trillion with shares trading at $420.22 apiece. Other tech firms in the top 10 that have not already been mentioned include Meta at number seven with a market cap of $1.19 trillion and TSMC in 10th place at $693.8 billion. Tesla and Broadcom reside just outside the grouping at 11 and 12, respectively, with valuations of $615.17 billion and $600 billion. Nvidia's next quarterly earnings report is due out on February 21. Image credit: Elias Gamez TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}