{
    "title": "Google One Crosses 100 Million Subscribers, Focusing on AI Premium, Says \nSundar Pichai",
    "date": "2/11/2024",
    "url": "https://www.latestly.com/technology/google-one-crosses-100-million-subscribers-focusing-on-ai-premium-says-sundar-pichai-5752038.html",
    "text": "New Delhi, February 11: Google and Alphabet CEO Sundar Pichai announced that the company has reached 100 million subscriptions to Google One service that allows additional storage for free services like Gmail, Drive and Photos, as well as access to more features. The Google One Premium plan comes with 2TB of storage and other features like VPN and dark web monitoring. The new AI Premium Plan just announced by the company gives users access to Gemini AI, and will soon offer generative AI features inside Gmail and Docs. “We just crossed 100 million Google One subscribers! Looking forward to building on that momentum with our new AI Premium Plan, offering AI features like Gemini Advanced, plus Gemini in Gmail, Docs + more coming soon,” Pichai said in a post on X. Google and Alphabet CEO Sundar Pichai Says ’Bard Will Now Simply Be Call Gemini: Report Google One provides expanded storage, unlocks exclusive features in Google products, and allows the company to build a strong relationship with its most engaged users. Google One Plans start from $1.99 per month, which gives 100GB of storage shareable with five people and access to its VPN service in the US. People can start using Gemini Advanced by subscribing to the new Google One AI Premium plan. Google Bard Advanced: Google-Parent Alphabet’s CEO Sundar Pichai Confirms Its Upcoming AI Chabot Based on Gemini AI Ultra Architecture, Check Expected Subscription Plans The ‘Gemini Ultra’ AI model will be a paid experience, available through a new $20 Google One tier (with a two-month-long free trial) that also includes 2TB of storage and access to Gemini in Google Workspace apps like Docs, Slides, Sheets and Meet. (The above story first appeared on LatestLY on Feb 11, 2024 10:01 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com). Copyright © Latestly.com All Rights Reserved. "
}