{
    "title": "5 Best Least Shorted Stocks to Buy Now",
    "date": "2/21/2024",
    "url": "https://www.insidermonkey.com/blog/5-best-least-shorted-stocks-to-buy-now-1254684/5",
    "text": "Number of Hedge Fund Investors: 163 Despite concerns regarding Alphabet Inc C’s (NASDAQ:GOOG) search business amid the AI wave and rising competition, Alphabet Inc C (NASDAQ:GOOG) remains one of the least-shorted stocks with a highly positive hedge fund sentiment. The stock recently stumbled even after Alphabet Inc C (NASDAQ:GOOG) posted strong Q4 results which shows its ad revenue jump by 11%. Many analysts believe Alphabet Inc C (NASDAQ:GOOG) shares will rebound. Alphabet Inc C’s (NASDAQ:GOOG) revenue in the last quarter of 2023 jumped 13.5% year over year to $86.31 billion, beating estimates by $1.04 billion. Of the 910 hedge funds tracked by Insider Monkey, 221 hedge funds had stakes in Alphabet Inc C (NASDAQ:GOOG). The FPA Crescent Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: “Alphabet Inc. (NASDAQ:GOOG) continued going from strength to strength during 2023 despite concerns that competition may infringe on the company’s dominant position in Search. Thus far, Alphabet has continued to hold its own, and we look forward to seeing how the company incorporates further AI developments across the Alphabet ecosystem. Lastly, we are hopeful that the impending arrival of a new CFO will bring a renewed focus on efficiency – an area where we believe Alphabet has ample room for improvement.” Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below. You can also look at the 15 Best Affordable Stocks To Buy Now and the 13 Best Grocery Stocks To Buy Now. NYSE:MANYSE:JPMNYSE:LLYNYSE:BRK.BNASDAQ:GOOGMastercard Inc (NYSE:MA)Eli Lilly and Co (NYSE:LLY)Alphabet Inc C (NASDAQ:GOOG)13 Best Grocery Stocks To Buy NowJPMorgan Chase & Co. (NYSE:JPM)15 Best Affordable Stocks To Buy Now5 Best Least-Shorted Stocks to Buy NowBerkshire Hathaway Inc Class B (NYSE:BRK.B)Show more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}