{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.indiatimes.com/worth/news/april-fools-day-interview-sundar-pichai-google-job-627334.html",
    "text": "2004 is surely a historic year in Google’s history. That year not only saw Google launch its IPO, but also the arrival of Sundar Pichai, who went on to become its CEO many years later. Now, two decades later, let us unfold the story of Sundar Pichai's interview at Google and how he landed a job at the search engine giant. Google CEO Sundar Pichai/reuters It was on 1st April 2004, i.e. April Fools' day, when Sundar Pichai got interviewed at Google. During his interview, Sundar Pichai was asked about Gmail a couple of times. At that time, Google had just introduced Gmail and much like many people, Pichai had thought Gmail was a prank from the company. He had shared his interview experience during a fireside chat at his alma mater the Indian Institute of Technology-Kharagpur. \"I hadn’t had a chance to use it (access to Gmail was invite-only at the time), I thought it was an April Fools' joke.\"  He had discarded Gmail as a spoof effort from Google for sometime, only to realize after watching grimy faces from interviewers that he may have been wrong. google sundar pichai interview/shutterstock \"In the fourth interview, when somebody asked me, 'have you seen Gmail?' I said no, and then he showed it to me,\" Pichai had shared. \"So in the fifth interview, I told them about what I think of Gmail, how to improve Gmail.\" Pichai had also once shared that he was among the first few people to have not being interviewed by Larry Page, the co-founder of Google. He says, \"I still joke sometimes that I got a job because Larry didn’t interview me.\" After his interview, Sundar Pichai went on to join Google as the head of product management and development. While Pichai was rising up the ranks in Google,  he was approached by Twitter to join the social networking company in 2011, but he was reportedly given a big raise by Google to stay there. Alphabet CEO Sundar Pichai/getty Eventually from October 2015, Sundar Pichai was named Google CEO. Then in December 2019, Pichai was further promoted to the position of CEO of Google’s parent company Alphabet as well. Also Read: Why Apple & Google CEOs Fight To Hire & Retain Two IITians eric schmidt google first ceo/getty In 2001, Google co-founders Sergey Brin and Larry Page ultimately hired Eric Schmidt as Google's first CEO. He went on to serve as Google's first CEO from 2001 to 2011 and then as company's executive chairman from 2011 to 2015. For the latest and more interesting financial news, keep reading Indiatimes Worth. Click here Get the NEWS that fits your groove. Subscribe to Indiatimes Newsletter and get handpicked updates based on your interests! Connect With Us On "
}