{
    "title": null,
    "date": "2/19/2024",
    "url": "https://finance.yahoo.com/news/alphabet-nasdaq-googl-sheds-4-120021390.html",
    "text": "When you buy shares in a company, it's worth keeping in mind the possibility that it could fail, and you could lose your money. But on the bright side, if you buy shares in a high quality company at the right price, you can gain well over 100%. For instance, the price of Alphabet Inc. (NASDAQ:GOOGL) stock is up an impressive 152% over the last five years. On the other hand, the stock price has retraced 4.8% in the last week. However, this might be related to the overall market decline of 0.06% in a week. In light of the stock dropping 4.8% in the past week, we want to investigate the longer term story, and see if fundamentals have been the driver of the company's positive five-year return. View our latest analysis for Alphabet To quote Buffett, 'Ships will sail around the world but the Flat Earth Society will flourish. There will continue to be wide discrepancies between price and value in the marketplace...' By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time. Over half a decade, Alphabet managed to grow its earnings per share at 22% a year. This EPS growth is reasonably close to the 20% average annual increase in the share price. This indicates that investor sentiment towards the company has not changed a great deal. In fact, the share price seems to largely reflect the EPS growth. You can see how EPS has changed over time in the image below (click on the chart to see the exact values). We know that Alphabet has improved its bottom line lately, but is it going to grow revenue? You could check out this free report showing analyst revenue forecasts. It's nice to see that Alphabet shareholders have received a total shareholder return of 49% over the last year. That gain is better than the annual TSR over five years, which is 20%. Therefore it seems like sentiment around the company has been positive lately. In the best case scenario, this may hint at some real business momentum, implying that now could be a great time to delve deeper. Is Alphabet cheap compared to other companies? These 3 valuation measures might help you decide. If you would prefer to check out another company -- one with potentially superior financials -- then do not miss this free list of companies that have proven they can grow earnings. Please note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}