{
    "title": "\"Unacceptable\": Google CEO Sundar Pichai on Gemini's 'woke' and offensive \noutputs",
    "date": "2/28/2024",
    "url": "https://mspoweruser.com/unacceptable-google-ceo-sundar-pichai-on-geminis-woke-and-offensive-outputs/",
    "text": "Follow us Share this article Improve this guide 3 min. read Published on February 28, 2024 published on \n\nFebruary 28, 2024 Share this article Improve this guide Read the affiliate disclosure page to find out how can you help MSPoweruser effortlessly and without spending any money. Read more Key notes Google’s AI tool Gemini, known for generating images and text, has come under fire for producing biased and offensive content. The tool was suspended last week after users reported issues such as: These issues sparked public criticism, with some accusing Google of harboring an anti-white bias. In response, Google CEO Sundar Pichai acknowledged the problems and called them “completely unacceptable.” He emphasized Google’s commitment to providing unbiased information and building products that deserve user trust. Pichai outlined a plan to address the concerns, including: While acknowledging the challenges, Pichai emphasized Google’s continued commitment to advancing AI responsibly. He underlined the importance of learning from mistakes and building helpful products that earn user trust. The full note from Pichai to Google employees, first reported by Semafor, is below. I want to address the recent issues with problematic text and image responses in the Gemini app (formerly Bard). I know that some of its responses have offended our users and shown bias – to be clear, that’s completely unacceptable and we got it wrong. Our teams have been working around the clock to address these issues. We’re already seeing a substantial improvement on a wide range of prompts. No AI is perfect, especially at this emerging stage of the industry’s development, but we know the bar is high for us and we will keep at it for however long it takes. And we’ll review what happened and make sure we fix it at scale. Our mission to organize the world’s information and make it universally accessible and useful is sacrosanct. We’ve always sought to give users helpful, accurate, and unbiased information in our products. That’s why people trust them. This has to be our approach for all our products, including our emerging AI products. We’ll be driving a clear set of actions, including structural changes, updated product guidelines, improved launch processes, robust evals and red-teaming, and technical recommendations. We are looking across all of this and will make the necessary changes. Even as we learn from what went wrong here, we should also build on the product and technical announcements we’ve made in AI over the last several weeks. That includes some foundational advances in our underlying models e.g. our 1 million long-context window breakthrough and our open models, both of which have been well received. We know what it takes to create great products that are used and beloved by billions of people and businesses, and with our infrastructure and research expertise we have an incredible springboard for the AI wave. Let’s focus on what matters most: building helpful products that are deserving of our users’ trust. Meanwhile, experts believe the controversy stems from technical shortcomings rather than deliberate bias. They argue that the issue lies in the software “guardrails” that control the AI’s output, not the underlying model itself. More about the topics: gemini, Sundar Pichai Devesh Beri Tech Journalist These are the things that motivate me - creating informative and helpful content, pursuing my passion for motorsports and music, engaging in expeditions, maintaining a healthy lifestyle, and spending time with my adorable cat Taco. Devesh Beri Tech Journalist Devesh is our tech journalist. His main mission is to break and break down the complex jargon-y tech news for MSPowerUser readers. Was this page helpful? Let us know if you managed to solve your tech problem reading this article. We’re happy to hear that! You can subscribe to our newsletter to stay up to date with the latest news and best deals! Do you have a suggestion? We know how frustrating could be to look for an universal solution. If you have an error which is not present in the article, or if you know a better solution, please help us to improve this guide.  Δ Follow us "
}