{
    "title": "Google Entices Publishers With A Five-Figure 'Stipend' To Test Unreleased \nGenAI Platform: Report (Updated",
    "date": "2/29/2024",
    "url": "https://www.benzinga.com/news/24/02/37391408/google-entices-publishers-with-a-five-figure-stipend-to-test-unreleased-genai-platform-report",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Update: This article was updated with Google’s comments at 9:30 a.m. EST. Alphabet Inc.'s GOOG GOOGL Google reportedly pays publishers five-figure sums to test an unreleased artificial intelligence platform. What Happened: Google has reportedly initiated a private program for a select group of independent publishers, offering them beta access to an unreleased generative artificial intelligence platform, reported Adweek. In exchange, these news organizations are expected to provide analytics and feedback. As part of the agreement, publishers are required to use AI tools to produce a certain amount of content for a year. In return, they receive a monthly stipend that amounts to a five-figure sum annually and the means to produce content relevant to their readership at no cost. See Also: Marc Andreessen Says Elon Musk, Startups And Open Source ‘Only Viable Alternatives’ To Big Tech AI’s ‘Bizarre Behavior’ The AI platform allows publishers to create aggregated content more efficiently by indexing recently published reports from other organizations, summarizing them, and publishing them as new articles. The program is part of the Google News Initiative, launched in 2018 to provide publishers with technology and training. The year-long program began in February, with participating publishers required to produce and publish three articles per day, one weekly newsletter, and one monthly marketing campaign. Update: A Google spokesperson has issued the following statement to Benzinga. “The experimental tool is being responsibly designed to help small, local publishers produce high quality journalism using factual content from public data sources – like a local government's public information office or health authority. Publishers remain in full editorial control of what is ultimately published on their site. These tools are not intended to, and cannot, replace the essential role journalists have in reporting, creating, and fact-checking their articles.\" Why It Matters: Google’s latest move comes in the wake of the company’s ongoing efforts to enhance its AI capabilities. In October, Google announced “Assistant with Bard,” a generative AI-powered personal assistant for Android and iOS devices. However, Google’s AI initiatives have not been without controversy. The company faced criticism over its Gemini AI chatbot, which generated historically inaccurate images and text. Google CEO Sundar Pichai acknowledged these errors as \"completely unacceptable.\" Despite these challenges, Google’s investment in AI technology and its commitment to improving its capabilities underscore the company’s belief in the potential of AI to revolutionize content creation and dissemination. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Nvidia CEO Jensen Huang Uses These AI Tools ‘Almost Every Day’ For Research Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Andrea De Santis on Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}