{
    "title": "5 Best Guru Stocks To Buy Now",
    "date": "3/14/2024",
    "url": "https://www.insidermonkey.com/blog/5-best-guru-stocks-to-buy-now-2-1273860/2",
    "text": "4. Alphabet Inc. (NASDAQ:GOOGL) Number of Hedge Fund Holders: 214 Guru’s Stake as of March 11: $660,127 Alphabet Inc. (NASDAQ:GOOGL) is ranked high among the best Guru stocks. The Global X Guru Index ETF (NYSE:GURU), as of March 11, holds 4,795 shares of Alphabet Inc. (NASDAQ:GOOGL) worth $660,127. On January 30, the company reported a Q4 GAAP EPS of $1.64 and a revenue of $86.31 billion, outperforming Wall Street estimates by $0.04 and $1.04 billion, respectively. According to Insider Monkey’s fourth quarter database, 214 hedge funds were bullish on Alphabet Inc. (NASDAQ:GOOGL), in contrast to the previous quarter when 221 funds had invested in the stock. Ken Fisher’s Fisher Asset Management is the largest stakeholder of the company, with 45.18 million shares worth $6.31 billion. The FPA Crescent Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOGL) in its fourth quarter 2023 investor letter: “Alphabet Inc. (NASDAQ:GOOG) continued going from strength to strength during 2023 despite concerns that competition may infringe on the company’s dominant position in Search. Thus far, Alphabet has continued to hold its own, and we look forward to seeing how the company incorporates further AI developments across the Alphabet ecosystem. Lastly, we are hopeful that the impending arrival of a new CFO will bring a renewed focus on efficiency – an area where we believe Alphabet has ample room for improvement.” NASDAQ:AMZNNASDAQ:METANASDAQ:MSFTNASDAQ:NVDANASDAQ:GOOGLAmazon Inc. (NASDAQ:AMZN)Alphabet Inc. (NASDAQ:GOOGL)5 Best Guru Stocks To Buy NowNVIDIA Corporation (NASDAQ:NVDA)Meta Platforms Inc. (NASDAQ:META)Microsoft Corporation (NASDAQ:MSFT)13 Best Biotech Stocks To Buy Under $2020 Biggest Natural Gas Companies in the WorldShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}