{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.hindustantimes.com/business/google-co-founder-sergey-brins-rare-public-comments-on-gemini-we-messed-up-101709628147614.html",
    "text": "Subscribe Now! Get features like Google co-founder Sergey Brin, in a rare public appearance, said that the company “messed up on the image generation” feature of Gemini which was pulled after users discovered historical inaccuracies and questionable responses stirring a major controversy for the tech giant. Addressing a group of artificial intelligence enthusiasts in California, Sergey Brin said that he came out of retirement “because the trajectory of AI is so exciting.” Reflecting on AI’s impact on search and Google's position, he said on Gemini gaffes, “I think it was mostly due to just not thorough testing. It definitely, for good reasons, upset a lot of people.” Google said last week that it plans to relaunch the image generation feature soon as Sergey Brin asserted that some Chatbot replies were “personal” answers and did not represent the company. “Seeing what these models can do year after year is astonishing,” he said, adding, “We haven’t fully understood why it leans left in many cases” but “that’s not our intention.\" The company has recently made accuracy improvements by as much as 80% on certain internal tests, he added, marking the first time a a company executive has spoken on the Gemini matter in a live setting. Earlier, Prabhakar Raghavan, said in a blog post, “So what went wrong? In short, two things. First, our tuning to ensure that Gemini showed a range of people failed to account for cases that should clearly not show a range. And second, over time, the model became way more cautious than we intended and refused to answer certain prompts entirely — wrongly interpreting some very anodyne prompts as sensitive. These two things led the model to overcompensate in some cases, and be over-conservative in others, leading to images that were embarrassing and wrong.” Sergey Brin also said that Google is far from alone in its struggles to produce accurate results with AI. Citing OpenAI’s ChatGPT and Elon Musk’s Grok services as AI tools he said that “say some pretty weird things that are out there that definitely feel far left, for example.” “We have made them hallucinate less and less over time, but I’d definitely be excited to see a breakthrough that’s near-zero,” he said, continuing, “But you can’t just like — count on breakthroughs so I think we’re just going to keep doing the incremental things we do to bring it down, down, down over time.” Follow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered. ...view detail   "
}