{
    "title": null,
    "date": "3/25/2024",
    "url": "https://au.lifestyle.yahoo.com/lifestyle/ftse-100-live-vodafone-delivers-074256174.html",
    "text": "Vodafone boss Nick Read today backed his growth strategy after the mobile phone giant delivered quarterly results in line with expectations. Read is under increased scrutiny following a poor share price performance and this week's disclosure that activist investor Cevian Capital has built a stake in the group. Vodafone's third quarter results showed revenues growth of 2.7%, up from 2.4% in the previous three months and a performance that Read said showed the “sustainability of our growth strategy and medium-term ambition”. Vodafone shares rise after update Alphabet earnings lift tech spirits Playtech sale under threat Ocado shares jump 15:04 , Brian McGleenon Today Playtech shareholders held a Court Meeting and General Meeting to decide upon the acquisition offer from Aristocrat. However, the total votes in favour of the Aristocrat bid were 56.13% at the Court Meeting and 54.68% at the General Meeting, which was below the minimum threshold 75% needed to agree on the offer. As a result, Playtech is no longer in an offer period as defined by the City Code on Takeovers and Mergers. Read more 14:49 , Brian McGleenon Google-parent Alphabet and semiconductor manufacturer Advanced Micro Devices (AMD) stocks surged following strong quarterly results. The S&P 500 (.SPX) rose 19.78 points, or 0.44%, on the opening bell. S&P 500 opened at 4566.39â\u0080\u008b. The Nasdaq Composite (.IXIC) rose 148.5 points, or 1.03%, to open at 14494.472 points. 14:22 , Brian McGleenon The Nasdaq is poised to open higher today after increased revenue announcements for the fourth quarter of 2021 from both Google and semiconductor manufacturer Advanced Micro Devices (AMD). Fourth-quarter results for AMD saw revenue of $4.8 billion, which was up 49% year-over-year and 12% quarter-over-quarter. The profits were due to its Ryzen processors and Radeon graphics processor sales. AMD said it expected $21.5 billion in sales in 2022. This was ahead of analyst expectations of $19.26 billion. That would see a 31% increase over 2021′s sales. 13:54 , Simon English Is the Bank definitely going to put rates up? It will be a big surprise if they don’t. The City expects the nine-strong Monetary Policy Committee (MPC) to increase rates from 0.25% to 0.5%, the first back-to-back interest rate rises since 2004. It increased rates in December from 0.1% -- that was a more controversial decision. The Bank said then it could no longer ignore inflation, something that until it had tried to present as a passing issue. Read more here 13:26 , Brian McGleenon US stock futures rose on Wednesday with Google helping the Nasdaq futures rise by 1.5%. Alphabet (NASDAQ: GOOGL) had a premarket surge of 10.4% before the Wall Street opening bell This was after the company reported soaring profits at an earnings call late on Tuesday. Shares of Facebook parent Meta Platforms rose 3% in the premarket ahead of its earnings announcement later today. Stocks gained across Asia and Europe today. Trading in London saw the FTSE 100 rising by 0.76%, Frankfurt's DAX gained 0.35% and the CAC 40 in Paris up 0.54%. The Nikkei in Japan was rose 255 points today, up 1.68%. 12:47 , Oscar Williams-Grut Cevian’s targeting of Vodafone is a head-scratcher. The Swedish money manager is an activist fund, specialising in investments where it thinks it can add value. Before taking a position, it “commits considerable time and resources to develop a deep understanding” of the businesses it goes after. It looks for opportunities among Europe’s unloved businesses. Vodafone is certainly unloved but it is hard to see what new Cevian can bring to the table. Read today’s City comment on the Voda/Cevian situation. 12:24 , Brian McGleenon The FTSE 100 is up 0.89% today amid the news that Eurozone inflation has hit a record high of 5.1%. The green gains look set to spread across the Atlantic with US stocks set for a positive start. Among the risers, Vodafone Group PLC (LSE:VOD) is up 2.25% following its latest update, now at 130.83p. Ocado Group PLC (LSE:OCDO) is another riser, up 7.03%, now at 1,531.61p Another gainer was Auto Trader Group PLC (LSE:AUTO), 3.7% higher today, ow at 700.6p. Those that fell into the red as of lunchtime today included Antofagasta plc (LSE:ANTO), down 3.53%, now at 1313.5p. BAE Systems plc (LSE:BA) took a drop of 0.93%, down to 574p. Hikma Pharmaceuticals (LSE:HIK) fell 0.58%, down to 2050p. 11:56 , Brian McGleenon Inflation in the Eurozone jumped 5.1% last month, breaking through a forecasted increase of 4.4% The record-high inflation is putting pressure on the president of the European Central Bank (ECB), Christine Lagarde, to implement an aggressive tightening of monetary policy. In contrast to the Bank of England and the US Federal Reserve, the ECB has so far refrained from following suit with an interest rate rise of its own. Lagarde insists inflation within the bloc will prove short-lived. Inflation in the eurozone has had risen 5.1% from a year ago, from measurements in January. The price growth has been inflamed by a spike in energy costs. 11:37 , Oscar Williams-Grut The co-founder of Games Workshop has successfully raised £115 million for one of London’s first SPACs — a cash shell targeting takeover deals. Sir Ian Livingstone, who helped set up the fantasy figurine retailer, chairs Hiro Metaverse Aquisitions, a SPAC targeting a company in the gaming, connected fitness or metaverse space. Hiro today raised £115 million in only the second SPAC IPO on the London Stock Exchange. SPACs — special purpose acquisition companies — exploded in in the US in 2020 but have since seen their star fade. Fans say they offer a cheaper and quicker route for firms to join public markets but critics argue SPACs are a fad. 10:40 , Graeme Evans Auto Trader shares hit the road to recovery today as another broker upgrade heightened interest in its potential as a long-term tech winner. Shares rose 4% to 702.3p in the FTSE 100 index after Jefferies upped its price target to 870p and backed the classifieds business as a strong play on the theme of online car retailing. Counterparts at Liberum took a similar view yesterday after raising their estimate to 825p, pointing out that the emergence of digital players Cazoo and Cinch has fundamentally shifted how consumers purchase cars. Auto Trader was one of a number of tech and growth-focused stocks to see a resurgence in fortunes as investors regained their risk appetite following January's volatility. The resilient mood was helped last night by Google parent company Alphabet reporting better-than-expected fourth quarter results. The Google search and YouTube ads division lifted revenues 32% and there was a growing contribution from cloud operations. AJ Bell's investment director Russ Mould said: “The technology sector started 2022 with some of the biggest question marks over it since the dotcom crash more than two decades ago. “However the largest and highest quality US tech names continue to deliver the answers the market wants with big earnings beats.” Other top flight tech stocks doing well today included industrial software business Aveva, while financial services business Abrdn lifted 6.9p to 247.5p after analysts at HSBC unveiled a “buy” recommendation and 330p target price. The FTSE 100 index returned to near a two-year high after climbing 56.39 points to 7592.46, with the domestic-focused FTSE 250 index up 211.45 points at 22,378.21 after cyber security firm Darktrace rallied 18.6p to 408p. Molten Ventures, whose investments include Cazoo and banking app Revolut, also surged 5% as it stuck by guidance for valuation growth of 35% in the year to March. Chief executive Martin Davis said: “The European technology venture market continues to thrive despite the wider fluctuations in public markets. Molten is well-positioned to take advantage of this disconnect.” Shares in the FTSE 250-listed company, which used to be known as Draper Esprit, rose 41p to 825p but still trades at a discount to November's net asset value of 887p. 09:57 , Oscar Williams-Grut Vodafone boss Nick Read is eying more deals in his push to improve performance and is said to have held talks about buying UK mobile operator Three. He declined to comment on the specifics but said consolidation more generally made sense. “We think this is the right time for consolidation,” he told the Standard. “It’s needed to accelerate investment. The UK and EU are falling behind on 5G. “Policymakers understand the need for a new balance between: yes, we want competitive prices but we also need investment. Through the pandemic they woke up to the fact that we are critical infrastructure.” Read said Vodafone was evaluating a range of possible targets: “It’s going to come down to are they pragmatic, are they reasonable on price and are they aligned on strategy.” Read more on the company’s update. 09:47 , Oscar Williams-Grut Playtech’s £2.7 billion sale to Australian slot machine maker Aristocrat is on the verge of collapse. The London-listed gaming group warned that proxy votes received to date show the deal is unlikely to win investor approval. The final results of a shareholder vote will be announced later today. The Australian gambling group’s offer is now expected to lapse, forcing Aristocrat to “accelerate alternative plans”. Playtech first warned that the takeover was in doubt last month. If the deal does collapse, the Playtech board said it will evaluate other proposals received in recent months. Options include a deal to take it into the fast-growing US betting market. Aristocrat said “a number of material investors who have not engaged meaningfully” were “effectively blocking” the deal. CEO Trevor Croker said he was “disappointed” and called the situation “highly unusual and largely beyond Aristocrat’s control.” Read the full story. 09:08 , Graeme Evans European markets are higher for a third session in a row, with the FTSE 100 index up 0.5% or 37.34 points to 7572.19. The two biggest rises in the top flight were the result of broker upgrades for Ocado and Auto Trader. Shares in grocery warehouse technology business Ocado rallied 7% or 99.5p to 1530.5p on the back of an “outperform” rating and new price target of 1750p from Credit Suisse. Online portal Auto Trader added 21p to 696p, a gain of 3% after Jefferies lifted its target price to 870p. Defensive stocks were lower as some of the volatility came out of markets. BAE Systems fell 10.4p to 570p and British American Tobacco dipped 9p to 3164.5p. The FTSE 250 index rose 159.46 points to 22,327.40, with technology investor Molten Ventures among those higher after it stuck by guidance for year-end valuation growth of 35%. Shares in the Cazoo and Trustpilot backer rose 30p to 814p. 08:24 , Graeme Evans Commenting on Vodafone's third quarter results, Interactive Investor's head of markets Richard Hunter said the mobile phone giant has continued “its grind towards higher growth”. He said: “For all the progress Vodafone has become a company which has yet to fulfil the potential provided by its scale, cash generation, experience and global sprawl.” Hunter highlights the “extraordinary expense” of 5G participation, net debt of over 44 billion euros (£37 billion) and the ferocity of competition as factors working against Vodafone. Recent reports of stakebuilding by an activist investor and a potential partner tie-up within its troubled Italian market have refocused interest in the shares, which have seen a rise of 11% since the beginning of the year. However, Hunter said this bounce does not repair the longer term underperformance despite a dividend yield of 5.9%. He said: “Over the last year the shares have risen by just 1% as compared to a hike of almost 16% for the wider FTSE 100. Further back the performance worsens, with the shares down by 15% over the last two years and by 34% over the last five years. “Despite the possibility of Vodafone becoming the perennial underperformer and “jam tomorrow” stock, its supporters remain resolute on prospects, and the market consensus of the shares as a strong buy remains defiantly in place.” Vodafone shares were 2.5% higher at 131p following today’s results. 08:05 , Graeme Evans Alphabet's core Google Services business, which includes Google Search and YouTube ads, lifted revenues by 32% to $69.4 billion (£51.3 billion) in the final three months of 2021. This meant Alphabet delivered better-than-expected fourth quarter revenues of $75.3 billion (£55.6 billion) and helped operating profits to improve 29% to $21.9 billion (£16.2 billion). The Google Cloud operation posted revenues of $5.5 billion (£4.1 billion). Shares were 7.8% higher in after-hours trading, having been one of the tech sector's more resilient performers in the recent turbulence. Hargreaves Lansdown analyst Sophie Lund-Yates said: “The sector is unlikely to have seen the worst of the pain, and Alphabet is by no means immune from that. “However, a company with well over $100 billion (£73.9 billion) of net cash swashing around the balance sheet, while not protected from taking on some muddy water, is more than capable of staying afloat as macro tides change.” Lund-Yates added that Google Cloud has the potential to do what Amazon Web Services has done for the retail giant – revolutionise the earnings engine driver. She said: “From a profit perspective, Google Cloud has a little way to go before it can pad out the bottom line, although losses are narrowing. And once the costs of the new mammoth infrastructure are covered, operating leverage dynamics means earnings will jump, pretty much instantly.” 07:42 , Graeme Evans The momentum behind London's FTSE 100 index is set to continue after Wall Street markets finished in positive territory last night. Futures trading also points to a strong session for US investors after Google owner Alphabet's better-than-expected fourth quarter earnings sent its shares 8% higher in dealings after the closing bell. Alphabet's performance extends the improved mood around the tech sector after Netflix and Tesla shares rebounded sharply on Monday. Comments from Federal Reserve policymakers have also helped after they suggested that markets have got ahead of themselves in their outlook for future interest rates. The sector's recovery benefited London investors yesterday, with Scottish Mortgage Investment Trust one of the biggest risers in the FTSE 100 index. The top flight index rose 1% on Tuesday and is expected to add another 45 points to 7580 today, according to CMC Markets. Other key developments include the start of the Bank of England's monetary policy committee meeting, with members tomorrow expected to announce an increase in interest rates from 0.25% to 0.5%. OPEC+ ministers are also considering whether to raise production quotas in March by more than the current plan of 400,000 barrels. Brent crude futures stood at $89 a barrel today. Ever wondered what goes down at a tantric sex class? Here's your chance to find out. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos.  An American living down under has shared his views on one “weird” rule Australia has at Easter time. Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ... An alleged plant thief who continued to come back to the same house has been stopped by the efforts of one very determined plant owner and technology. He’s calling this one “the greatest investment in history,” and adds: “All my data is clear. It will be 20X bigger than bitcoin.” Daylight saving is coming to an end soon, here’s what you need to do to ensure you don’t sleep past your alarm. 'We love a girly that shreds,' one fan said of the very 'Barbie' moment. Network Ten is seeking to reopen Bruce Lehrmann’s defamation trial, two days before the judge was to hand down his decision.  Does bloody conquest, dark ritual or mercenary money explain a gold covered helmet found buried in a field? \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" The person who wrote on the road has been called a \"top bloke\" by motorists.  EXCLUSIVE: Eden Harper’s close friend has called out Jayden Eynaud after he was spotted looking very cosy with Lauren Dunn at a club. Read more. If you like your scrambled eggs soft and creamy, then there's one ingredient you need to start adding to your dish. Celebrity chefs swear by it. Fears that Putin could emulate Stalin by trying to further consolidate Eastern bloc  The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The NSW schoolgirl has not been seen since being dropped at school on Thursday morning. Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more.  Ukrainian president says Easter shows ‘life can prevail’ ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’ The Australian model's father was rumored to have an issue with the couple's provocative public appearances. "
}