{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/clear-harbor-asset-management-llc-has-19-41-million-stake-in-alphabet-inc-nasdaqgoog.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Clear Harbor Asset Management LLC lowered its stake in shares of  Alphabet Inc. (NASDAQ:GOOG – Free Report) by 1.9% in the fourth quarter, Holdings Channel.com reports. The firm owned 137,744 shares of the information services provider’s stock after selling 2,721 shares during the period. Alphabet comprises approximately  1.8% of Clear Harbor Asset Management LLC’s investment portfolio, making the stock its 11th biggest holding. Clear Harbor Asset Management LLC’s holdings in Alphabet were worth $19,412,000 as of its most recent SEC filing. A number of other hedge funds have also added to or reduced their stakes in GOOG. Tolleson Wealth Management Inc. purchased a new position in shares of  Alphabet in the 2nd quarter worth approximately $411,000.  Westshore Wealth LLC boosted its stake in shares of  Alphabet by 31.2% in the 2nd quarter. Westshore Wealth LLC now owns 15,700 shares of the information services provider’s stock worth $1,887,000 after buying an additional 3,730 shares during the last quarter.  Washington Trust Bank raised its holdings in shares of  Alphabet by 33.0% in the 3rd quarter. Washington Trust Bank now owns 7,359 shares of the information services provider’s stock worth $970,000 after purchasing an additional 1,826 shares during the period.  Woodley Farra Manion Portfolio Management Inc. raised its holdings in shares of  Alphabet by 20.0% in the 2nd quarter. Woodley Farra Manion Portfolio Management Inc. now owns 5,986 shares of the information services provider’s stock worth $724,000 after purchasing an additional 996 shares during the period.  Finally, CNB Bank raised its holdings in shares of  Alphabet by 6.6% in the 3rd quarter. CNB Bank now owns 27,723 shares of the information services provider’s stock worth $3,655,000 after purchasing an additional 1,710 shares during the period. Institutional investors and hedge funds own  27.26% of the company’s stock. A number of research firms recently commented on GOOG. Susquehanna lifted their price target on shares of Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a report on Wednesday, January 31st. Raymond James lifted their price target on shares of Alphabet from $150.00 to $160.00 and gave the stock an “outperform” rating in a report on Wednesday, January 24th. Five research analysts have rated the stock with a buy rating,  Based on data from MarketBeat.com, the company currently has a consensus rating of “Buy” and an average target price of $146.33. View Our Latest Research Report on Alphabet In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the business’s stock in a transaction on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total transaction of $59,334.25. Following the sale, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this hyperlink. In other news, insider John Kent Walker sold 12,084 shares of the company’s stock in a transaction on Wednesday, March 27th. The shares were sold at an average price of $151.19, for a total value of $1,826,979.96. Following the transaction, the insider now owns 48,717 shares of the company’s stock, valued at $7,365,523.23. The transaction was disclosed in a legal filing with the SEC, which is available at the SEC website. Also, CAO Amie Thuener O’toole sold 425 shares of the company’s stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the completion of the transaction, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. Insiders have sold 263,312 shares of company stock valued at $37,268,315 in the last 90 days. 12.99% of the stock is currently owned by company insiders. Shares of GOOG stock opened at $152.26 on Friday. The company’s fifty day simple moving average is $144.89 and its two-hundred day simple moving average is $139.48. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a 1 year low of $100.29 and a 1 year high of $155.20. The stock has a market capitalization of $1.89 trillion, a price-to-earnings ratio of 26.25, a PEG ratio of 1.40 and a beta of 1.05. Alphabet (NASDAQ:GOOG – Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The business had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $85.28 billion. During the same quarter in the previous year, the firm posted $1.05 EPS. The business’s revenue for the quarter was up 13.5% compared to the same quarter last year.  As a group, analysts anticipate that  Alphabet Inc. will post 6.77 earnings per share for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOG? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOG – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 271 Shares in NIKE, Inc. (NYSE:NKE) Acquired by Planned Solutions Inc. "
}