{
    "title": "Alphabet Inc. Cl A stock underperforms Tuesday when compared to competitors",
    "date": "3/19/2024",
    "url": "https://www.marketwatch.com/data-news/alphabet-inc-cl-a-stock-underperforms-tuesday-when-compared-to-competitors-49316420-97df467ed246",
    "text": "Shares of Alphabet Inc. Cl A \n        GOOGL,\n        +0.04%\n       dropped 0.44% to $147.03 Tuesday, on what proved to be an all-around positive trading session for the stock market, with the S&P 500 Index \n        SPX,\n        +0.11%\n       rising 0.56% to 5,178.51 and the Dow Jones Industrial Average \n        DJIA,\n        +0.12%\n       rising 0.83% to 39,110.76. Alphabet Inc. Cl A closed $6.75 below its 52-week high ($153.78), which the company achieved on January 29th. The stock underperformed when compared to some of its competitors Tuesday, as Microsoft Corp. \n        MSFT,\n        -0.17%\n       rose 0.98% to $421.41, Amazon.com Inc. \n        AMZN,\n        +0.31%\n       rose 0.81% to $175.90, and Meta Platforms Inc. \n        META,\n        -1.68%\n       fell 0.15% to $496.24. Trading volume (23.5 M) remained 9.3 million below its 50-day average volume of 32.8 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. The S&P 500 has marched higher by nearly 30% over the past five months, prompting even bullish market strategists to entertain, or even welcome, the prospect of a “healthy” correction. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}