{
    "title": "Why Alphabet Inc (GOOGL) Stock Is A Buy? Acquirer's Multiple Stock Screener \nAnalysis",
    "date": "3/7/2024",
    "url": "https://acquirersmultiple.com/2024/03/why-alphabet-inc-googl-stock-is-a-buy-acquirers-multiple-stock-screener-analysis/",
    "text": "The Absurdly Simple, Ridiculously Powerful Deep Value Stock Screener Johnny HopkinsMarch 7, 2024Stock ScreenerLeave a Comment As part of our ongoing series here at The Acquirer’s Multiple, each week we focus on one of the stocks from our Stock Screeners, and why it’s a ‘buy’ based on key fundamentals. One of the cheapest stocks in our Stock Screeners is: Alphabet Inc (GOOGL) Alphabet is a holding company. Internet media giant Google is a wholly owned subsidiary. Google generates 99% of Alphabet revenue, of which more than 85% is from online ads. Google’s other revenue is from sales of apps and content on Google Play and YouTube, as well as cloud service fees and other licensing revenue. Sales of hardware such as Chromebooks, the Pixel smartphone, and smart home products, which include Nest and Google Home, also contribute to other revenue. Alphabet’s moonshot investments are in its other bets segment, where it bets on technology to enhance health (Verily), provide faster internet access (Google Fiber), enable self-driving cars (Waymo), and more. A quick look at the share price history (below) over the past twelve months shows that the price is up 51.75%. Here’s why the company is undervalued.  GOOGL data by YCharts Key Stats Market Cap: $1.699 Trillion Enterprise Value: $1.618 Trillion Operating Earnings Operating Earnings: $86.144 Billion Acquirer’s Multiple Acquirer’s Multiple: 18.80 Free Cash Flow (TTM) Free Cash Flow: $69.50 Billion FCF/EV Yield %: FCF/EV Yield: 4.09 Shareholder Yield %: Shareholder Yield: 3.60 Other Indicators Piotroski F Score: 9.00 Altman Z-Score (TTM): 11.25 ROA (5 Year Avge%): 21 For all the latest news and podcasts, join our free newsletter here. FREE Stock Screener Don’t forget to check out our FREE Large Cap 1000 – Stock Screener, here at The Acquirer’s Multiple:  Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Notify me of follow-up comments by email. Notify me of new posts by email.   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Click the link below for the latest episodes on Acquirers Channel:   Join 21,007 other investors in search of undervalued stocks, value investing news, investing strategies, and The Acquirer's Podcast Click here for a list of our value investing archives "
}