{
    "title": "Alphabet Falls From 3rd- to 5th-Largest U.S. Company. Should You Buy, Sell, \nor Hold the Stock?",
    "date": "3/3/2024",
    "url": "https://finance.yahoo.com/news/alphabet-falls-3rd-5th-largest-163000032.html",
    "text": "Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) is better known by some of the brands it owns, like Google and YouTube. It's one of the largest tech companies and one of the members of the exclusive trillion-dollar market-cap club. However, thanks to other tech giants posting strong quarters, it has lost its place as the third-largest U.S. company behind Microsoft and Apple. Nvidia and Amazon have now passed it, although Amazon may fall beneath Alphabet on a day-to-day basis. So, is there something wrong with the stock? Let's look at all sides of the analysis, then decide which camp is best. The biggest factor in many big tech companies' success right now is artificial intelligence (AI). AI progress and optimism is why Nvidia has shot up so dramatically over the past year, and what propelled Microsoft to pass Apple as the world's largest company. From the start, Alphabet has appeared behind in the AI race. It lost to ChatGPT as the first to launch a usable generative AI product, and to Microsoft's Bing as the first search engine to integrate generative AI. Additionally, its generative AI engine, Gemini, has recently been subjected to bad press, as its image generation feature failed to depict accurate images of prompts. The big problem is that if Alphabet's AI model is flawed, or shows a particular bias, it can affect its primary business: advertising. The Gemini model will become the basis of everything Alphabet does, and if it causes issues with Alphabet's advertising model, advertisers may look elsewhere to spend. Considering that 76% of Alphabet's total revenue comes from ads, this would be a big problem. Alphabet is well aware of the issues with its Gemini model. It apologized for the image generation issue and vowed to improve the platform. Additionally, just because the consumer-facing model does one thing doesn't mean that there isn't a different model being used internally to perform tasks like improving search results. The Gemini model still scores better than many competitors in tasks like math and coding, making it a clear choice for many applications. While time will tell what Alphabet does, investors should be assured that the company isn't letting a generational investment opportunity slip by. Because of Alphabet's various problems, there isn't much of a premium attached to the stock. Alphabet is trading for just 21 times earnings estimates, the same as the S&P 500. Essentially, the market is valuing Alphabet like an average company. While this assessment may be fair due to its lackluster performance in critical product development, if Alphabet hits its stride, the company will look incredibly undervalued. As another side note, if Alphabet fetched the same premium as Microsoft (35 times forward earnings), its market cap would be $2.95 trillion -- making it the second-largest company in the world and only a bit behind Microsoft at $3.05 trillion. Perception is a big part of how stocks are valued in the market, and market sentiment about Alphabet isn't great right now. So, which viewpoint makes the most sense? In my opinion, the stock is a buy. The other big tech firms are expensively priced, and not doing so much better that they warrant those massive premiums. As a result, Alphabet is one of my top tech stocks to buy right now. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy. Alphabet Falls From 3rd- to 5th-Largest U.S. Company. Should You Buy, Sell, or Hold the Stock? was originally published by The Motley Fool Related Quotes "
}