{
    "title": "Invera Wealth Advisors LLC Invests $4.11 Million in Alphabet Inc. \n(NASDAQ:GOOGL)",
    "date": "3/27/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-sec-filing-2024-03-27/",
    "text": "Invera Wealth Advisors LLC bought a new stake in shares of Alphabet Inc. (NASDAQ:GOOGL - Free Report) during the fourth quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The institutional investor bought 29,442 shares of the information services provider's stock, valued at approximately $4,113,000. Alphabet comprises about 2.6% of Invera Wealth Advisors LLC's holdings, making the stock its 8th biggest position. A number of other hedge funds have also recently modified their holdings of the business. DE Burlo Group Inc. grew its stake in Alphabet by 520.0% in the 2nd quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider's stock worth $11,551,000 after acquiring an additional 80,934 shares in the last quarter. West Tower Group LLC bought a new position in Alphabet during the 2nd quarter worth about $88,000. Ballast Advisors LLC grew its holdings in Alphabet by 9.6% during the 3rd quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider's stock worth $2,061,000 after acquiring an additional 1,385 shares in the last quarter. Quantum Financial Advisors LLC grew its holdings in Alphabet by 8.0% during the 3rd quarter. Quantum Financial Advisors LLC now owns 7,623 shares of the information services provider's stock worth $998,000 after acquiring an additional 564 shares in the last quarter. Finally, Acadian Asset Management LLC grew its holdings in Alphabet by 2.4% during the 3rd quarter. Acadian Asset Management LLC now owns 4,416,533 shares of the information services provider's stock worth $577,908,000 after acquiring an additional 104,366 shares in the last quarter. Institutional investors own 40.03% of the company's stock. In related news, CFO Ruth Porat sold 48,077 shares of the firm's stock in a transaction dated Friday, March 8th. The shares were sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the completion of the sale, the chief financial officer now directly owns 1,777,106 shares in the company, valued at $243,854,485.32. The transaction was disclosed in a document filed with the SEC, which is available through the SEC website. In related news, CFO Ruth Porat sold 48,077 shares of the firm's stock in a transaction dated Friday, March 8th. The stock was sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the completion of the sale, the chief financial officer now directly owns 1,777,106 shares of the company's stock, valued at approximately $243,854,485.32. The sale was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, insider John Kent Walker sold 28,281 shares of the firm's stock in a transaction dated Thursday, December 28th. The stock was sold at an average price of $141.40, for a total value of $3,998,933.40. Following the sale, the insider now directly owns 25,002 shares of the company's stock, valued at $3,535,282.80. The disclosure for this sale can be found here. Over the last ninety days, insiders sold 279,659 shares of company stock worth $39,460,310. Insiders own 0.88% of the company's stock. A number of brokerages recently weighed in on GOOGL. Barclays dropped their price objective on Alphabet from $180.00 to $173.00 and set an \"overweight\" rating on the stock in a research report on Wednesday, January 31st. Needham & Company LLC reaffirmed a \"buy\" rating and set a $160.00 price objective on shares of Alphabet in a research report on Wednesday, January 31st. Roth Mkm dropped their price objective on Alphabet from $166.00 to $164.00 and set a \"buy\" rating on the stock in a research report on Wednesday, January 31st. Truist Financial dropped their price objective on Alphabet from $160.00 to $158.00 and set a \"buy\" rating on the stock in a research report on Wednesday, January 31st. Finally, Mizuho raised their price objective on Alphabet from $155.00 to $170.00 and gave the stock a \"buy\" rating in a research report on Wednesday, January 17th. Five equities research analysts have rated the stock with a hold rating, twenty-six have assigned a buy rating and two have issued a strong buy rating to the stock. Based on data from MarketBeat, the stock presently has a consensus rating of \"Moderate Buy\" and an average target price of $155.48. Check Out Our Latest Stock Analysis on GOOGL Shares of Alphabet stock traded up $0.20 during mid-day trading on Wednesday, reaching $150.87. 22,864,169 shares of the stock traded hands, compared to its average volume of 31,287,359. The business has a 50-day moving average of $143.33 and a 200 day moving average of $138.03. Alphabet Inc. has a fifty-two week low of $99.74 and a fifty-two week high of $153.78. The stock has a market capitalization of $1.88 trillion, a PE ratio of 25.92, a PEG ratio of 1.39 and a beta of 1.04. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet (NASDAQ:GOOGL - Get Free Report) last released its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating analysts' consensus estimates of $1.60 by $0.04. The company had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter in the prior year, the firm earned $1.05 EPS. On average, analysts predict that Alphabet Inc. will post 6.77 EPS for the current year. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.Recommended StoriesFive stocks we like better than AlphabetAbout the Markup CalculatorBest Bear Market Funds: Top 3 Investment Options to ConsiderWhat is a Death Cross in Stocks?Is DraftKings A Good Bet Ahead of Q1 Earnings?How to Calculate Retirement Income: MarketBeat’s CalculatorMid-Cap Stocks to Outperform the Market This Cycle  Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Just getting into the stock market? These 10 simple stocks can help beginning investors build long-term wealth without knowing options, technicals, or other advanced strategies. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}