{
    "title": "Alphabet (NASDAQ:GOOGL) Price Target Raised to $175.00",
    "date": "3/22/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-boost-price-target-2024-03-22/",
    "text": "Alphabet (NASDAQ:GOOGL - Get Free Report) had its price target raised by stock analysts at Wedbush from $160.00 to $175.00 in a research note issued on Friday, Benzinga reports. The firm presently has an \"outperform\" rating on the information services provider's stock. Wedbush's price objective would indicate a potential upside of 16.07% from the company's current price. GOOGL has been the subject of several other reports. Redburn Atlantic increased their price objective on shares of Alphabet from $150.00 to $165.00 and gave the company a \"buy\" rating in a research report on Wednesday, January 31st. Wells Fargo & Company increased their price objective on shares of Alphabet from $141.00 to $144.00 and gave the company an \"equal weight\" rating in a research report on Monday. Wolfe Research increased their price objective on shares of Alphabet from $170.00 to $180.00 and gave the company an \"outperform\" rating in a research report on Wednesday, January 31st. Citigroup raised their price target on shares of Alphabet from $153.00 to $168.00 and gave the stock a \"buy\" rating in a research report on Wednesday, January 31st. Finally, Mizuho raised their price target on shares of Alphabet from $155.00 to $170.00 and gave the stock a \"buy\" rating in a research report on Wednesday, January 17th. Five analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have assigned a strong buy rating to the stock. Based on data from MarketBeat, the company currently has an average rating of \"Moderate Buy\" and a consensus target price of $155.48. Read Our Latest Analysis on Alphabet Shares of NASDAQ GOOGL traded up $3.17 during mid-day trading on Friday, reaching $150.77. The company had a trading volume of 29,177,445 shares, compared to its average volume of 31,812,004. The business's 50-day moving average is $142.86 and its 200-day moving average is $137.68. The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. The stock has a market cap of $1.87 trillion, a price-to-earnings ratio of 26.04, a price-to-earnings-growth ratio of 1.37 and a beta of 1.04. Alphabet has a 52 week low of $99.74 and a 52 week high of $153.78. Alphabet (NASDAQ:GOOGL - Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The company had revenue of $86.31 billion for the quarter, compared to analysts' expectations of $70.77 billion. During the same period in the prior year, the business earned $1.05 EPS. Equities analysts expect that Alphabet will post 6.77 earnings per share for the current year. In related news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the sale, the chief executive officer now owns 2,310,191 shares of the company's stock, valued at $343,710,216.98. The transaction was disclosed in a filing with the SEC, which can be accessed through this hyperlink. In other news, CAO Amie Thuener O'toole sold 425 shares of Alphabet stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the transaction, the chief accounting officer now directly owns 27,259 shares of the company's stock, valued at approximately $3,805,628.99. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction dated Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total value of $3,347,550.00. Following the completion of the transaction, the chief executive officer now directly owns 2,310,191 shares in the company, valued at $343,710,216.98. The disclosure for this sale can be found here. Over the last 90 days, insiders have sold 279,659 shares of company stock valued at $39,460,310. Insiders own 0.88% of the company's stock. Several hedge funds and other institutional investors have recently bought and sold shares of the stock. Live Oak Investment Partners bought a new stake in shares of Alphabet in the 4th quarter valued at approximately $26,000. Vermillion & White Wealth Management Group LLC bought a new stake in shares of Alphabet in the 4th quarter valued at approximately $30,000. Sanctuary Wealth Management L.L.C. bought a new stake in shares of Alphabet in the 4th quarter valued at approximately $34,000. VitalStone Financial LLC increased its holdings in shares of Alphabet by 1,900.0% in the 2nd quarter. VitalStone Financial LLC now owns 280 shares of the information services provider's stock valued at $34,000 after acquiring an additional 266 shares during the last quarter. Finally, Turim 21 Investimentos Ltda. bought a new position in Alphabet during the 3rd quarter worth $38,000. 35.08% of the stock is owned by institutional investors and hedge funds. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.Featured ArticlesFive stocks we like better than AlphabetWhy is the Ex-Dividend Date Significant to Investors?KB Home: Building on Strong Foundations During Volatile Times3 Tickers Leading a Meme Stock RevivalNike Stock and the 30% Rally That's ExpectedOptions Trading - Understanding Strike PriceHeadwinds for Darden Restaurants are an Opportunity For Investors  Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat has just released its list of 20 stocks that Wall Street analysts hate. These companies may appear to have good fundamentals, but top analysts smell something seriously rotten. Are any of these companies lurking around your portfolio? Find out by clicking the link below. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}