{
    "title": "Google's AI Controversy, Apple's Shift In Focus, And Musk's Legal Battle \nAgainst OpenAI: This Week In AI",
    "date": "3/2/2024",
    "url": "https://www.tradingview.com/news/benzinga:7607eab81094b:0-google-s-ai-controversy-apple-s-shift-in-focus-and-musk-s-legal-battle-against-openai-this-week-in-ai/",
    "text": "This week was a whirlwind in the tech industry, with controversies, strategic shifts and legal disputes taking center stage. We saw Alphabet Inc.’s GOOG GOOGL Google in hot water due to Gemini AI’s missteps, Apple Inc. AAPL abandoning its electric car project to focus on generative AI and Elon Musk‘s lawsuit against OpenAI and Microsoft Corporation MSFT. Let’s delve into the details. Google’s Gemini AI Fiasco Google’s CEO Sundar Pichai publicly addressed criticism surrounding its Gemini AI chatbot, which has been generating historically inaccurate images and text. Pichai deemed these errors “completely unacceptable”, recognizing the issue for the first time since the controversy broke out. The AI inaccurately generated racially diverse images of Nazi-era German soldiers and misrepresented Google’s co-founders, leading to its temporary disablement. Read the full article here. Apple Puts Brakes on EV Project Apple has decided to abandon its electric vehicle (EV) development project, popularly known as Titan, shifting much of its workforce towards the company’s generative AI division instead. The news was broken to almost 2,000 employees on Tuesday, although the number of layoffs remains uncertain. Read the full article here. See Also: Nvidia CEO Jensen Huang Uses These AI Tools ‘Almost Every Day' For Research Musk Sues OpenAI and Altman Elon Musk has filed a lawsuit against Sam Altman and OpenAI, alleging a ‘stark betrayal’ of the startup’s founding agreement. Musk accuses OpenAI, under its new board, of maximizing profits for Microsoft rather than benefitting humanity. Read the full article here. Musk’s Microsoft Account Allegations In another episode involving Musk, the tech billionaire claimed that Microsoft was forcing him to create an account to use his new laptop, thereby granting their AI access to his computer. Musk expressed his discontent over this requirement on X, formerly Twitter. Read the full article here. AI Revolution on the Horizon? The AI revolution seems to be gaining momentum, with mid-cap AI company c3.ai, Inc. AI reporting better-than-expected Q4 results and narrowing its full-year guidance. Tech analyst Daniel Ives of Wedbush sees this as evidence of an accelerating AI revolution, citing Microsoft’s strong performance and high demand for its Copilot AI tool. Read the full article here. Read Next: This Jeff Bezos-Backed AI Tool Can Replace Search Engine For Many People, Says Top Ex-Googler — But ‘There’s A Catch’ Photo courtesy: Shutterstock Engineered by Benzinga Neuro, Edited by Rounak Jain The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}