{
    "title": "Forget Nvidia: 2 Members of the \"Magnificent Seven\" Appear Poised to Become \nWall Street's Next Stock-Split Stocks",
    "date": "3/11/2024",
    "url": "https://www.theglobeandmail.com/investing/markets/stocks/GOOGL-Q/pressreleases/24692972/forget-nvidia-2-members-of-the-magnificent-seven-appear-poised-to-become-wall-streets-next-stock-split-stocks/",
    "text": "Since this year began, the ageless Dow Jones Industrial Average, broad-based S&P 500, and growth stock-fueled Nasdaq Composite have powered to record-closing highs. While there have been patches of strength throughout the broader market, it's the \"Magnificent Seven\" stocks that have done the bulk of the heavy lifting. The Magnificent Seven represent some of the largest and most-influential businesses in the country. Listed in descending order of market cap (as of the closing bell on March 5, 2024), the Magnificent Seven are comprised of: Image source: Getty Images. What makes the Magnificent Seven so special is their sustained competitive advantages. Many of the Magnificent Seven stocks are also known for conducting stock splits -- Meta is the only Magnificent Seven component to have never split its shares. A \"stock split\" is a purely cosmetic event that allows a public company to alter its share price and outstanding share count while having no impact to its market cap or operating performance. The Magnificent Seven are known for conducting forward-stock splits, which are designed to make shares more affordable for retail investors who may not have access to fractional-share purchases with their broker. Since the midpoint of 2021, quite a few of the Magnificent Seven have completed a forward-stock split, including: Given that a single Nvidia share is setting investors back by almost $860, as of the closing bell on March 5, you'd probably think it's a slam-dunk to become Wall Street's next stock-split stock. However, Nvidia is set to face an ever-growing mountain of headwinds this year, and there's a real possibility the company's stock is an epic bubble. In other words, a split may not be in the cards anytime soon. For example, even though Nvidia's A100 and H100 GPUs are dominating in high-compute data centers for the moment, competition is picking up in a big way. Advanced Micro Devices has begun its ramped rollout of the MI300X AI-GPU, while Intel anticipates launching its Gaudi3 AI chip later this year. What's far more concerning is that four Magnificent Seven members -- Microsoft, Meta Platforms, Amazon, and Alphabet -- account for about 40% of Nvidia's sales, yet they're all developing their own high-powered AI chips. It's plainly evident that Nvidia's top customers are looking to lessen their reliance on GPUs from the current kingpin of AI. Add in regulatory export concerns to China, a lack of insider buying, and the possibility of cannibalizing its own margins as its ramps A100 and H100 production, and there's potential for significant downside in Nvidia stock. Instead of Nvidia becoming Wall Street's next stock-split stock, two other Magnificent Seven components appear poised to beat it to the punch. Image source: Getty Images. The first Magnificent Seven member I'd expect to split its stock before Nvidia is social media titan Meta Platforms. Shares of the company topped $500 for the first time ever on March 1. Although Meta has artificial intelligence tie-ins -- e.g., it's using generative AI solutions to help advertisers tailor their messages to individual users -- it wouldn't be susceptible to a bubble-bursting event if demand for AI infrastructure didn't meet investors' lofty expectations. This makes it more likely that Meta can sustain, if not build on, its nearly $500 share price. The company's social media \"real estate\" is what makes it tick. Facebook, WhatsApp, Instagram, and Facebook Messenger are consistently among the most-downloaded social apps worldwide. Businesses are aware that no social media company offers a greater reach than what Meta can bring to the table. As a result, Meta's ad-pricing power is exceptional in most economic climates. As I've pointed out previously, Meta is sitting on an ever-growing treasure chest of cash. It closed out last year with $65.4 billion in cash, cash equivalents, and marketable securities, and generated more than $71 billion in net cash from its operating activities in 2023. What all this cash does is allow CEO Mark Zuckerberg to take chances. Despite hefty operating losses from Meta's Reality Labs segment, Zuckerberg is attempting to position Meta to be an on-ramp to the metaverse in the latter-half of this decade. Few other companies have the luxury of taking chances the way Meta can. And unlike Nvidia, Meta remains historically inexpensive, even after its significant run-up from its 2022 bear market lows. Shares can be purchased right now for 13 times estimated cash flow in 2025, which represents a substantial discount to Meta's multiple to its cash flow over the trailing decade. The other Magnificent Seven constituent that appears poised to become Wall Street's next stock-split stock before Nvidia is none other than tech giant Microsoft. Microsoft has split its shares nine times since going public, but last did so in February 2003. A single share of Microsoft is currently tipping the scales at north of $400. Microsoft didn't reach a $3 trillion valuation and become the largest publicly traded by accident. It's achieved this distinction by seamlessly blending its legacy cash-cow segments with its fast-paced growth initiatives. As I pointed out earlier, Microsoft's legacy operations are still exceptionally profitable. Even though Windows has lost desktop operating system (OS) share over the past decade, it remains the undisputed OS leader in personal computing. The cash flow Microsoft generates from the likes of Windows and Office allows it to reinvest in high-growth initiatives and/or make acquisitions. In terms of \"high-growth initiatives,\" cloud services and AI take the cake. On a currency-neutral basis, sales for Azure catapulted 28% higher during the fiscal second quarter, ended December 31. Enterprise cloud spending is still in its relative early innings, which suggests Azure can continue to capture global cloud infrastructure service spend share, as well as sustain a double-digit growth rate with ease. Microsoft's AI ambitions are also on display. It's invested billions into OpenAI, the company behind popular chatbot ChatGPT, incorporated AI solutions into search engine Bing, and plans to lean on various generative AI solutions to assist businesses with document processing and conversational AI on the Azure platform. Lastly, Microsoft is one of only two publicly traded companies that sports the highest possible credit rating (AAA) from Standard & Poor's, a division of S&P Global. Even if the AI bubble were to burst, Microsoft's legacy operations and cloud services wouldn't miss a beat. Should you invest $1,000 in Meta Platforms right now? Before you buy stock in Meta Platforms, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks  *Stock Advisor returns as of March 8, 2024  John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Sean Williams has positions in Alphabet, Amazon, Intel, and Meta Platforms. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, S&P Global, and Tesla. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Paid Post: Content produced by Motley Fool. The Globe and Mail was not involved, and material was not reviewed prior to publication. How much is Alphabet Cl A stock worth? Invest with precise valuations. Get Report. All market data (will open in new tab) is provided by Barchart Solutions. Copyright © 2024. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer (will open in new tab). © Copyright 2024 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO "
}