{
    "title": "Google fires employee who interrupted tech conference with anti-Israel \nrant: 'Not okay'",
    "date": "3/9/2024",
    "url": "https://www.foxbusiness.com/technology/google-fires-employee-interrupted-tech-conference-israel-rant-okay",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy 'The Claman Countdown' panelists Stephen Guilfoyle and JC Parets discuss S&P 500 performance and the Magnificent Seven stocks The Google employee who interrupted a tech conference by unleashing an anti-Israel rant and accusing his company of \"power[ing] genocide\" has been terminated, FOX Business has learned. The disruption happened at New York City's \"Mind the Tech\" conference on Monday. Google Israel managing director Barak Regev was giving a lecture at the time. The employee, whose name was not released by Google, abruptly interrupted Regev's speech to reference the war between Hamas and Israel. The conflict began on Oct. 7, after Hamas terrorists massacred Israeli civilians on the Jewish holiday of Simchat Torah. GOOGLE CO-FOUNDER SAYS COMPANY 'DEFINITELY MESSED UP' ON GEMINI'S IMAGE GENERATION \"I'm a Google cloud software engineer, and I refused to build technology that powers genocide or surveillance!\" the employee said, referring to the Israeli military's bombardment of Gaza. Google headquarters in Mountain View, Calif. (Marlena Sloss/Bloomberg via Getty Images / Getty Images) \"Project Nimbus puts Palestinian community members in danger,\" the Google employee shouted, as the audience appeared to groan at his speech. \"I refused to build technology that powers genocide.\" Audience members were heard mocking the employee, who was quickly escorted out of the room by security. \"See ya later!\" one woman yelled back. GOOGLE GEMINI: FORMER EMPLOYEE, TECH LEADERS SUGGEST WHAT WENT WRONG WITH AI CHATBOT Smoke rises over Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas. (REUTERS/Tyrone Siu / Reuters Photos) Project Nimbus is a $1.2 billion contract between Amazon Web Services, Google and Israel. The project helps provide cloud services for the Israeli government and military. Regev handled the interruption coolly and commended Google for being a \"democratic\" institution that allowed different opinions before he continued with his speech. Google confirmed the termination of the employee to FOX Business. \"Earlier this week, an employee disrupted a coworker who was giving a presentation – interfering with an official company-sponsored event,\" the Google spokesperson explained. GET FOX BUSINESS ON THE GO BY CLICKING HERE Google building at their campus in Mountain View, Calif.  (AP Photo/Jeff Chiu / AP Newsroom) \"This behavior is not okay, regardless of the issue, and the employee was terminated for violating our policies.\" Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}