{
    "title": "Alphabet Inc. (NASDAQ:GOOGL) Shares Sold by Acorn Financial Advisory \nServices Inc. ADV",
    "date": "3/28/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-sec-filing-2024-03-28/",
    "text": "Acorn Financial Advisory Services Inc. ADV trimmed its position in Alphabet Inc. (NASDAQ:GOOGL - Free Report) by 49.0% during the 4th quarter, according to its most recent disclosure with the Securities and Exchange Commission. The fund owned 16,854 shares of the information services provider's stock after selling 16,208 shares during the quarter. Acorn Financial Advisory Services Inc. ADV's holdings in Alphabet were worth $2,353,000 at the end of the most recent reporting period. Several other large investors have also recently made changes to their positions in the company. Live Oak Investment Partners purchased a new stake in Alphabet during the fourth quarter worth $26,000. VitalStone Financial LLC grew its position in Alphabet by 1,900.0% during the 2nd quarter. VitalStone Financial LLC now owns 280 shares of the information services provider's stock worth $34,000 after purchasing an additional 266 shares during the period. Sanctuary Wealth Management L.L.C. acquired a new stake in Alphabet during the 4th quarter worth about $34,000. Turim 21 Investimentos Ltda. purchased a new stake in shares of Alphabet during the 3rd quarter worth about $38,000. Finally, Meritage Group LP lifted its stake in Alphabet by 1,061.5% in the 3rd quarter. Meritage Group LP now owns 302 shares of the information services provider's stock valued at $40,000 after buying an additional 276 shares in the last quarter. 40.03% of the stock is owned by institutional investors. In related news, CEO Sundar Pichai sold 22,500 shares of the company's stock in a transaction that occurred on Wednesday, March 6th. The stock was sold at an average price of $132.70, for a total value of $2,985,750.00. Following the sale, the chief executive officer now directly owns 2,332,691 shares in the company, valued at $309,548,095.70. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this hyperlink. In related news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction on Wednesday, March 6th. The stock was sold at an average price of $132.70, for a total value of $2,985,750.00. Following the completion of the sale, the chief executive officer now directly owns 2,332,691 shares of the company's stock, valued at approximately $309,548,095.70. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this link. Also, CAO Amie Thuener O'toole sold 682 shares of the stock in a transaction on Monday, March 4th. The shares were sold at an average price of $136.49, for a total value of $93,086.18. Following the completion of the sale, the chief accounting officer now directly owns 28,602 shares of the company's stock, valued at $3,903,886.98. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 251,378 shares of company stock valued at $35,461,377. 0.88% of the stock is currently owned by corporate insiders. Shares of NASDAQ GOOGL traded up $0.06 during midday trading on Thursday, reaching $150.93. The company's stock had a trading volume of 24,476,168 shares, compared to its average volume of 31,181,576. The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a fifty-two week low of $99.78 and a fifty-two week high of $153.78. The stock has a market capitalization of $1.88 trillion, a price-to-earnings ratio of 26.06, a PEG ratio of 1.39 and a beta of 1.04. The stock has a 50 day simple moving average of $143.52 and a 200-day simple moving average of $138.12. Alphabet (NASDAQ:GOOGL - Get Free Report) last released its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, topping analysts' consensus estimates of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The firm had revenue of $86.31 billion during the quarter, compared to analysts' expectations of $70.77 billion. During the same period in the previous year, the business posted $1.05 earnings per share. Equities research analysts predict that Alphabet Inc. will post 6.77 earnings per share for the current year. GOOGL has been the subject of several recent analyst reports. Royal Bank of Canada reaffirmed an \"outperform\" rating and set a $155.00 price objective on shares of Alphabet in a research report on Wednesday, January 31st. Needham & Company LLC restated a \"buy\" rating and set a $160.00 target price on shares of Alphabet in a research report on Wednesday, January 31st. Wells Fargo & Company upped their price target on shares of Alphabet from $141.00 to $144.00 and gave the company an \"equal weight\" rating in a report on Monday, March 18th. Barclays reduced their price target on shares of Alphabet from $180.00 to $173.00 and set an \"overweight\" rating on the stock in a report on Wednesday, January 31st. Finally, Citigroup upped their price objective on shares of Alphabet from $153.00 to $168.00 and gave the company a \"buy\" rating in a research note on Wednesday, January 31st. Five research analysts have rated the stock with a hold rating, twenty-six have assigned a buy rating and two have assigned a strong buy rating to the company. Based on data from MarketBeat.com, the stock has a consensus rating of \"Moderate Buy\" and an average target price of $155.48. Read Our Latest Research Report on GOOGL Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.See AlsoFive stocks we like better than AlphabetHow to Evaluate a Stock Before Buying 3 Value Stocks Too Small For Buffett’s PortfolioConsumer Staples Stocks, ExplainedFoot Locker Builds Up Another Head of Steam; Gains ImminentThe 3 Best Fintech Stocks to Buy NowDisney Stock Catches 3 Upgrades In a Single Week  Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Click the link below and we'll send you MarketBeat's list of seven best retirement stocks and why they should be in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}