{
    "title": "Alphabet Terminates AI Firm Trainer of Google's Bard",
    "date": "1/23/2024",
    "url": "https://www.techtimes.com/articles/300933/20240123/alphabet-terminates-ai-firm-trainer-bard.htm",
    "text": " Google's parent company, Alphabet, is set to cut ties with AI firm Appen on March 19. Appen is one of the firms that helped train Google's AI model Bard as well as other AI models from other tech giants as reported by CNBC. According to Appen, Alphabet informed the company over the weekend of the termination, which will take effect on March 19. The business claimed that it was unaware of Google's intention to end the two company's contractual ties beforehand. Google reportedly states that the quality rating work that Appen contractors completed will be transferred to other suppliers, implying that Appen is simply one of many contractors impacted by the company's evaluation to identify cost reductions and process improvements over the board, not only AI work.  Appen, an Australian company, has reportedly helped big tech firms including Microsoft, Apple, Meta, Google, and Amazon train its AI models. Appen has been in business for about 30 years and has an amazing clientele, but recently it has struggled with declining sales, a number of executive departures, and poor financial outcomes. The Alphabet Workers Union claimed in a statement on Monday that the decision to cut connections will impact at least 2,000 subcontracted Alphabet employees, as the company accounted for around one-third of Appen's income. Read Also: Google AI is Now on Android Auto, Assistant to Summarize Messages, But There's A Catch Alphabet's move is stated to impact workers that are also known as \"ghost workers,\" or the invisible human labor engaged in training systems people use on a daily basis-and work to identify images, text, audio, and other data to develop AI systems used by major tech firms like Google. Employees at Appen work from home, painstakingly going over information to train the AI that facilitates public searches and speech recognition apps like Google Assistant. The firm stated that the news was surprising and disappointing as Appen stated it remains a primary emphasis on cost control, business turnaround, and providing its clients with high-quality AI data. The Alphabet Workers' Union, the union that represents Google employees in the US, countered that the move would have a \"devastating impact\" on subcontracted workers and serve as a wake-up call for tech sector employees regarding the impact of AI on working people, given that Google accounts for one-third of Appen's business revenues. As per the Verge, Google spokesman Courtenay Mencini reportedly said that in order to ensure a seamless transition, Google is closely collaborating with Appen. Workers at Accenture, a different Google contractor, unanimously decided to join the Alphabet Workers Union in November of last year after refusing to put up with vulgar, abusive, and obscene prompts for the chatbot Bard, which was not yet available. Furthermore, it reportedly affects more than simply Google. Sama, a data-labeling business, and its customer Meta were sued by content moderators in Kenya who were paid $2.20 per hour to watch obscene photos and videos. Related Article: Google's Workforce is Getting the AI Treatment to Replace Some Humans Googlers Soon  Sign up for our free newsletter for the Latest coverage!   "
}