{
    "title": "Google: I Never Thought That Alphabet's Moat Could Be In Danger \n(NASDAQ:GOOG)",
    "date": "1/20/2024",
    "url": "https://seekingalpha.com/article/4663942-google-i-never-thought-that-alphabets-moat-could-be-in-danger",
    "text": " JHVEPhoto Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) could have been a powerhouse in generative AI, but they moved too slowly, giving others the first-mover advantage. And that could really impact their revenues and margins going forward as the search landscape changes. And I really think that this could lead to problems with advertising revenue if they cannot find a way to incorporate advertising into generative AI, because the GPT competition is currently operating without ads, which many end users like. Alphabet still has a compelling case with strong cloud growth, but will it be enough to meet shareholders' high expectations? Search remains Alphabet's most important business, even as the cloud business grows. So major impacts to that segment would really impact the company. Much has changed with the growth of generative AI, which creates content based on the data it is trained on, as opposed to classification AI, which only looked for patterns. But generative AI will truly improve and transform the search experience. Typically, Google results are sorted by relevance and engagement, whereas a Generative Pre-trained Transformer ('GPT') provides an answer that comes from multiple sources. And the advantage of GPT is that there is no scrolling and searching for the answer you are looking for, and follow-up questions are better answered. Google can also do follow-up questions, but currently on a smaller scale. So the GPT results are currently more individualized, and a big plus is that they have no ads. While Alphabet likes to emphasize that ads are important to the user, they are also very important to Google, as this is its main source of revenue. Paid placements and links, as well as ads, are important parts of their business model. So Google wants to add high-quality ads designed specifically for generative AI. What this could look like can be seen with Google Circle to Search, for example. You can take a picture with your phone and add a question, which is kind of like a Multisearch experience with Google Lens and generative AI. For example, if you take a picture of something you want to buy, Google can give you shopping links and the answer right there. This improves the user experience and provides useful advertising. And a really important fact that many do not know is that Transformers, the basis for tools like ChatGPT, comes from Google Research. The neural network architecture used today was developed by Google scientists in 2017. So Alphabet has a lot of experience in this area. In fact, one could argue that they are the pioneers of generative AI, even if most people today think that OpenAI (MSFT) is. But one can also say that Alphabet may have missed this rush a bit and other companies were able to gain the upper hand in this area. Alphabet is working in this area with its Search Generative Experience ('SGE') project and Google Gemini, but it looks like the competition is currently ahead. Especially the Google Gemini demo in December last year was criticized. I firmly believe that search engines as we know them today will be transformed by generative AI. And the big question is, how will this affect the monetization of search engines? And Alphabet in particular has to find a way, because search is the segment with the best margins and the highest profits, because the cloud segment is still in its infancy and only marginally profitable. So I see Google's incredibly large moat potentially in jeopardy. For the first time in over 15 years, to be honest. But all moats are tested at some point. And the next generation may grow up with other companies that they use primarily to gather information. For now, GPTs have a long way to go to improve the quality of their results, but they are making rapid progress. Maybe in 10 years people will no longer say let's Google it, but lets GPT it. Alphabet's chart in terms of shares outstanding is a pleasing one. They do have a lot of SBC costs, which are also rising, but the buybacks are significantly higher. SBC's expenses for the first 9 months were $16,801 million, up from $14,889 a year ago, but buybacks were $45,313 million. So Alphabet is one of the few software companies where the buybacks are really making a difference and not just offsetting the dilution from SBC. And Alphabet has said they want to use SBC to keep the best AI specialists, and they certainly have the money to do that. Plus, existing shareholders don't have to worry about much dilution, even if the comps are in the 7-digit range, as we have seen in the last picture, because the buybacks are huge. Alphabet's ROIC is also excellent at 24.31%, with a very low cost of capital. Their investments yield a very positive return, and this has been reflected in the stock price over the past decade. Author A big part of my valuation process is looking at what the market is pricing in. And if we take the TTM diluted EPS of $5.21, we can see that the market is pricing in a little over 11% compound annual growth rate for Alphabet over the next 10 years. Historically, Alphabet beats that with a 10Y EPS CAGR of 18.92%, but the landscape has changed and Google's biggest competitive advantage is really in jeopardy for the first time. While the cloud business is growing and will drive revenue growth, margins are currently well below advertising. Clearly, they will improve over time, but can they reach levels similar to those in advertising? Alphabet 10-Q Q3 2023 If we look at the revenue for the first 9 months of 2023, we get the following revenue figure: Google Services - $196,232 million and Google Cloud - $23,896 million. Google Cloud surpassed YouTube Ads, Google Network and Google Other to become the second-largest division after Google Search & Other. But the problem is the operating margin. Google Services made $69,128 million in operating income, which is a margin of ~35%, but Google Cloud only made $852 million, which is a margin of ~3.5%. If your fastest-growing segment has by far the worst margins, the margins of all of Alphabet will most likely shrink over the next few years as a result. But we have to note that in the first nine months of 2022, cloud operating income was negative, and now it's slightly positive. This is a positive trend. But it will be interesting to see how the margins evolve, because the competition in the cloud industry is fierce. Seeking Alpha Earnings Estimates The estimates represent a CAGR of approximately 17% from $5.74 to $12.53. This is higher than what the market is pricing in, but I think the estimates are a bit high because I think the margins will suffer, and therefore I think a lower EPS in December 2028 is more likely. I think a number between $9.5 and $10 is realistic. This would put the stock at around $237.5 to $250 at a 25x multiple. But cloud combined with AI is really in its infancy, and Google Cloud has a better cost per IOPS for disk volume and is faster and has fewer hours of downtime than the competition. So Alphabet has a competitive advantage in this segment, which can translate into better margins going forward. Most of the time, the market is right, and if we compare Alphabet to the rest of the Magnificent Seven, we can clearly see that the others are trading at a premium. So the market is also seeing some trends that could be unfavorable for Alphabet. Alphabet could have been the clear leader in generative AI if it had better leveraged its outstanding research and development. So now they are behind in what was first developed in their labs. This is not a good look. Nevertheless, Google is still a very strong company that is relatively fairly valued and will continue to grow. But they were a little bit late on the next big trend. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of META either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}