{
    "title": "Google's Wing introduces new delivery drone with double the payload",
    "date": "1/19/2024",
    "url": "https://finance.yahoo.com/news/google-wing-introduces-delivery-drone-120000552.html",
    "text": "This story originally appeared on Flyingmag.com. Wing — the drone delivery arm of Google parent Alphabet so far responsible for more than 350,000 deliveries across three continents — is ready to think bigger. On Wednesday, the company unveiled a new larger drone, which it said will be added to its fleet to “simplify and streamline” bigger orders. Wing will work with partners and regulatory stakeholders to introduce the unnamed model, which boasts double the payload of its predecessor, to service areas worldwide in the next 12 months. The news follows Wing’s recent Dallas-Fort Worth expansion with Walmart, which the retailer claims to be the largest drone delivery expansion of any U.S. company. Wing began flying in DFW in 2022, partnering with Walmart in August to add service out of two regional Supercenters. Combined, the stores serve 60,000 homes. The company also picked up new permissions from the FAA in December, allowing it to fly drones beyond the visual line of sight (BVLOS) of the operator, without human observers on the ground. Only a handful of drone delivery providers have that approval, which can improve range and reduce costs by cutting down on human capital.  According to internal company data, 70% of Wing’s U.S. orders are delivered by a single aircraft. That means the remaining 30%, however, require two or more drones. The company’s revamped design is intended to address that issue. “Think of it like how airlines operate different aircraft for different routes: This new aircraft will streamline our deliveries of larger orders,” said Adam Woodworth, CEO of Wing. “For example, you could order last-minute ingredients for dinner — pasta, marinara sauce, parmesan cheese, canned olives and garlic.” Wing’s larger design was borne out of its Aircraft Library approach, wherein engineers develop a variety of aircraft configurations that build on the core components of its flight-proven aircraft. This allows the firm to quickly adapt its design to meet needs identified in the market, such as a bigger drone. The latest design shares much of its hardware and architecture with the drones comprising Wing’s fleet. These can carry up to 2.5 pounds on 12 square miles (10 nautical miles) flights, cruising at 65 mph (56 knots). The new drone maintains that range and speed but doubles the payload to 5 pounds, using the same standardized cardboard delivery box. It also keeps a hybrid aircraft configuration, which combines vertical takeoff and landing (VTOL) and precision hovering capability with fixed wings for cruise flight. The updated model is also designed to work with the infrastructure and automation supporting the company’s current fleet, which comprise the Wing Delivery Network. Announced last year, the system aims to streamline deliveries by intelligently calculating routes, allocating drones based on demand, and flying fluidly between Wing hubs. It also introduces new technologies to simplify operations on the customer side, such as the Autoloader. In lieu of loading the aircraft themselves, store associates can simply leave packages to be picked up. Essentially, it’s curbside delivery for drones. Crucially, Wing’s new drone won’t replace other aircraft within its fleet. Part of the Wing Delivery Network philosophy is using multiple aircraft for different mission profiles. “It’s always been our vision to implement a multimodal drone delivery model, in the same way that ground delivery uses different vehicle sizes for different orders,” Woodworth said. “We’re committed to making that vision a reality so more shoppers can experience the convenience of drone delivery. With the new aircraft carrying more food, medicine and household essentials, customers in urban and suburban areas will be able to bundle their orders better — and receive them in one quick trip.” The introduction of a larger aircraft could add to Wing’s momentum. Outside of Zipline, which focuses primarily on medical deliveries (and is also partnered with Walmart), it boasts more deliveries than any other firm. By cutting back on the number of inefficient two-drone deliveries, that figure could rise even faster. And while the new model has the same range as Wing’s other aircraft, the company’s entire fleet may soon fly farther. Before receiving Federal Aviation Administration approval to remove visual observers, the firm was limited to 6 square miles (5 nautical mile) trips, which needed to be monitored continuously by human eyes. Now, computers can do the tracking, which should enable longer routes. The post Google’s Wing introduces new delivery drone with double the payload appeared first on FreightWaves. Related Quotes "
}