{
    "title": "Facebook Now Monitors Your Browsing History In The App: Here's What It \nMeans For You And How You Can Disa",
    "date": "1/3/2024",
    "url": "https://www.benzinga.com/news/24/01/36468777/facebook-now-monitors-your-browsing-history-in-the-app-heres-what-it-means-for-you-and-how-you-can-d",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Meta Platforms Inc.'s META Facebook has unveiled a new ‘Link History' feature on its iOS and Android apps. The feature tracks your browsing history when you click on links in the Facebook app and is enabled by default. What Happened: The Facebook app's ‘Link History' feature records the websites a user visits from the app within 30 days. It’s available on Android and iOS devices and is turned on by default, but users can disable it. While this could spark privacy concerns, Facebook has clarified that the link history does not capture sites visited during Messenger chats. According to Facebook’s support page, turning off the link history feature will erase the user’s link history. However, it may take up to 90 days for the complete deletion from Facebook's servers. See Also: How to Use Google Maps For Live Location Updates On iMessage, WhatsApp, Messenger And More What It Means For You: This development comes at a time when Facebook recently settled a $725 million data privacy lawsuit. Its peer Alphabet Inc.'s GOOG GOOGL Google has also agreed to settle a $5 billion privacy lawsuit, underlining how data privacy has been under increasing focus. Facebook's decision to make the feature opt-out rather than opt-in could also hamper user privacy. Follow these steps to disable Facebook link history: Check out more of Benzinga's Consumer Tech coverage by following this link. Read Next: Apple Card Savings Account Holders To Receive 1099 Interest Tax Form: What You Need to Know Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}