{
    "title": "Lepší technologická akcie: Alphabet vs. Apple",
    "date": "1/5/2024",
    "url": "https://medium.seznam.cz/clanek/mercurius-pro-lepsi-technologicka-akcie-alphabet-vs-apple-38414",
    "text": "Tlačítkem Sledovat můžete odebírat oblíbené autory a témata. Články najdete v sekci Moje sledované. Tyto společnosti dominují svým trhům, ale jedna z nich se obchoduje za mnohem lepší hodnotu Technologický průmysl je rozsáhlý a zahrnuje vše od spotřebitelských produktů, jako jsou chytré telefony a herní konzole, až po umělou inteligenci, cloud computing, elektronické obchodování, digitální reklamu a mnoho dalšího. Získalo si pověst odvětví, které odměňuje inovativní společnosti a jejich investory konzistentními a výraznými dlouhodobými zisky - od roku 2019 vzrostl technologický sektor Nasdaq-100 o více než 150 %. Není proto divu, že mnozí akcionáři věnovali značnou část svých portfolií rychle rostoucímu trhu. Ve skutečnosti holdingová společnost Berkshire Hathway Warrena Buffetta investovala téměř 50 % svého portfolia do technologických akcií a v letech 1965 až 2022 se těšila 20% složenému ročnímu zisku. Není tedy špatný nápad rozšířit svou pozici v technologiích a přidat na seznam svých podílů několik nových společností. Alphabet (GOOG) (GOOGL) a Apple (AAPL) jsou dvě atraktivní možnosti, které patří mezi nejvýznamnější jména v oboru. Podívejme se na tyto dva podniky a určete, zda je v současné době lepší technologickou akcií Alphabet, nebo Apple. Alphabet Společnost Alphabet zaznamenala v roce 2023 hvězdný růst, dosáhla významných zisků v oblasti digitální reklamy a posílila svou pozici v oblasti umělé inteligence. Ve třetím čtvrtletí roku 2023 zaznamenala společnost Alphabet meziroční nárůst tržeb o 11 %, čímž překonala odhady Wall Street o 980 milionů dolarů. K tomuto nárůstu přispělo především zlepšení v reklamních segmentech, reprezentované 11% nárůstem příjmů z vyhledávání Google a 12% nárůstem příjmů z reklamy na YouTube. Předpokládá se, že trh s digitální reklamou dosáhne v roce 2024 hodnoty 740 miliard dolarů, přičemž společnost Alphabet se na něm bude podílet přibližně 25 %. Populární značky jako Google, Android a YouTube přitahují miliardy uživatelů, což představuje téměř nekonečné reklamní příležitosti. Jejich popularita se mezitím pravděpodobně ukáže jako užitečná při expanzi společnosti Alphabet v oblasti umělé inteligence. Minulý měsíc společnost představila svůj očekávaný model s umělou inteligencí Gemini. Očekává se, že nový model bude konkurovat modelu GPT-4 společnosti OpenAI a mohl by posílit pozici společnosti Alphabet na trhu. Díky modelu Gemini by společnost Alphabet mohla vytvořit dynamičtější vyhledávání Google, efektivněji analyzovat trendy videa na YouTube a zlepšit různé služby pro zvýšení produktivity. Volný peněžní tok společnosti Alphabet vzrostl za poslední rok o 29 % na 77 miliard dolarů. Vedle silného postavení v oblasti technologií má společnost finanční zdroje, aby mohla pokračovat v investicích do svého podnikání a dlouhodobě dosahovat významného růstu. Apple Zdálo se, že společnost Apple v loňském roce naráží na jednu překážku za druhou. Jeho tržby se ve fiskálním roce 2023 meziročně propadly o 3 %, protože ho dostihly makroekonomické překážky, které vedly k poklesu prodeje produktů. Koncem roku 2023 pak byla společnost nucena stáhnout své nejnovější hodinky Apple Watch z amerických regálů kvůli možnému porušení patentů. Čínská vláda mezitím zvýšila omezení pro pracovníky používající iPhony. Výsledkem je, že technologický gigant začíná rok 2024 s prací, která ho čeká. Nejsou to však jen špatné zprávy. Segment digitálních služeb společnosti Apple, který je druhou nejvýnosnější částí jejího podnikání, zůstává světlým bodem. Služby vykázaly za fiskální rok 9% růst tržeb, čímž výrazně překonaly všechny ostatní segmenty. Společnost Apple přesto dosáhla v roce 2023 volného peněžního toku ve výši téměř 100 miliard dolarů, což dokazuje, že dokáže překonat současné překážky a investovat do svého výzkumu a vývoje. V roce 2024 společnost čeká několik zajímavých událostí, včetně prvního vstupu na trh virtuální/rozšířené reality s novou náhlavní soupravou a postupné expanze v oblasti umělé inteligence. Apple zůstává jednou z největších technologických firem a já bych si na jeho dlouhodobý úspěch nevsadil. Je lepší technologickou akcií Alphabet, nebo Apple? Alphabet a Apple jsou lídry ve svých oborech a ne nadarmo jsou součástí „sedmičky velkolepých“ technologických společností. Nicméně to, že společnost dominuje trhu, nemusí nutně znamenat, že je ten správný čas na nákup jejích akcií. Společnost Alphabet je levnější variantou na základě tří různých ukazatelů ocenění. Nižší hodnoty mateřské společnosti Google naznačují, že její akcie v současnosti nabízejí mnohem větší hodnotu než akcie společnosti Apple. Spolu s lepšími výsledky v roce 2023 a pevnější pozicí na rychle se rozvíjejícím trhu s umělou inteligencí je Alphabet tento měsíc lepší technologickou akcií. Máte na tohle téma jiný názor? Napište o něm vlastní článek. Texty jsou tvořeny uživateli a nepodléhají procesu korektury. Pokud najdete chybu nebo nepřesnost, prosíme, pošlete nám ji na medium.chyby@firma.seznam.cz. Reklama Reklama Stačí mít účet na Seznamu a můžete začít psát. Ty nejlepší články se mohou zobrazit i na hlavní stránce Seznam.cz Reklama Copyright © 1996–2024, Seznam.cz, a.s. "
}