{
    "title": "Google Layoffs: Big News! This company may lay off hundreds of people, see \ndetails here",
    "date": "1/17/2024",
    "url": "https://www.informalnewz.com/google-layoffs-big-news-this-company-may-lay-off-hundreds-of-people-see-details-here/",
    "text": "Google Layoffs: There is a bad news for the people working in Google, soon the company may show the exit to hundreds of employees working in this department. Google Layoffs: With the beginning of 2024, many big companies have started laying off hundreds of employees. According to the memo obtained by Business Insider, Google, which is included in the list of big companies, is preparing for layoffs in its advertising sales unit. Earlier, the company had recently announced large-scale layoffs in its hardware, core engineering and Google Assistant teams. Google said this In an internal memo released by Google, Chief Business Officer Philipp Schindler has said that the company is soon going to lay off many employees in the advertising sales unit as part of the restructuring plan. This will affect hundreds of employees working in the team. The company is taking the help of AI for this work, so that it can know how much money the company has to spend on which work. Along with this, Google’s Chief Business Officer Philipp Schindler while talking to Business Insider also said that this step of ours will directly benefit the customers. We will be able to provide them products as per their need. Google has recently announced layoffs Before planning layoffs in the advertising sales unit, last week Google’s parent company Alphabet Inc had announced to fire people working on Augmented Reality in its hardware team. Along with this, the company had also asked its central engineering team to fire its employees. All these layoffs were planned for the third quarter of 2023. As of September 2023, Alphabet Inc. has a total of 182,381 employees. Citigroup will lay off 20,000 employees Citigroup Inc., one of America’s leading banks, has planned to fire a total of more than 20,000 employees in the next two years. The bank will reduce its total workforce by 8 percent by 2026. Citigroup has taken this decision in view of its worst quarterly results in 14 years. INFORMALNEWZ brings the Latest News & Top Breaking headlines on Politics and Current Affairs. Up-to-date news coverage, aggregated from sources all over the world by informal Newz. Find latest news coverage of breaking news events, trending topics, and compelling articles. Contact us: informalnewz@gmail.com © informalnewz.com 2022 Izon web Pvt. Ltd. All Rights Reserved. "
}