{
    "title": "Estimating The Intrinsic Value Of Alphabet Inc. (NASDAQ:GOOGL)",
    "date": "1/14/2024",
    "url": "https://finance.yahoo.com/news/estimating-intrinsic-value-alphabet-inc-120203925.html",
    "text": "Alphabet's estimated fair value is US$145 based on 2 Stage Free Cash Flow to Equity Alphabet's US$143 share price indicates it is trading at similar levels as its fair value estimate Our fair value estimate is 7.2% lower than Alphabet's analyst price target of US$157 How far off is Alphabet Inc. (NASDAQ:GOOGL) from its intrinsic value? Using the most recent financial data, we'll take a look at whether the stock is fairly priced by taking the expected future cash flows and discounting them to today's value. Our analysis will employ the Discounted Cash Flow (DCF) model. It may sound complicated, but actually it is quite simple! Remember though, that there are many ways to estimate a company's value, and a DCF is just one method. Anyone interested in learning a bit more about intrinsic value should have a read of the Simply Wall St analysis model. Check out our latest analysis for Alphabet We are going to use a two-stage DCF model, which, as the name states, takes into account two stages of growth. The first stage is generally a higher growth period which levels off heading towards the terminal value, captured in the second 'steady growth' period. In the first stage we need to estimate the cash flows to the business over the next ten years. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years. A DCF is all about the idea that a dollar in the future is less valuable than a dollar today, and so the sum of these future cash flows is then discounted to today's value: 2024 2025 2026 2027 2028 2029 2030 2031 2032 2033 Levered FCF ($, Millions) US$87.7b US$99.6b US$119.2b US$123.5b US$117.3b US$114.2b US$112.8b US$112.6b US$113.2b US$114.4b Growth Rate Estimate Source Analyst x17 Analyst x15 Analyst x5 Analyst x2 Analyst x1 Est @ -2.67% Est @ -1.20% Est @ -0.17% Est @ 0.54% Est @ 1.05% Present Value ($, Millions) Discounted @ 7.5% US$81.6k US$86.2k US$95.8k US$92.4k US$81.5k US$73.8k US$67.8k US$62.9k US$58.8k US$55.3k (\"Est\" = FCF growth rate estimated by Simply Wall St)Present Value of 10-year Cash Flow (PVCF) = US$756b The second stage is also known as Terminal Value, this is the business's cash flow after the first stage. The Gordon Growth formula is used to calculate Terminal Value at a future annual growth rate equal to the 5-year average of the 10-year government bond yield of 2.2%. We discount the terminal cash flows to today's value at a cost of equity of 7.5%. Terminal Value (TV)= FCF2033 × (1 + g) ÷ (r – g) = US$114b× (1 + 2.2%) ÷ (7.5%– 2.2%) = US$2.2t Present Value of Terminal Value (PVTV)= TV / (1 + r)10= US$2.2t÷ ( 1 + 7.5%)10= US$1.1t The total value is the sum of cash flows for the next ten years plus the discounted terminal value, which results in the Total Equity Value, which in this case is US$1.8t. To get the intrinsic value per share, we divide this by the total number of shares outstanding. Compared to the current share price of US$143, the company appears about fair value at a 1.8% discount to where the stock price trades currently. Remember though, that this is just an approximate valuation, and like any complex formula - garbage in, garbage out. Now the most important inputs to a discounted cash flow are the discount rate, and of course, the actual cash flows. You don't have to agree with these inputs, I recommend redoing the calculations yourself and playing with them. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at Alphabet as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 7.5%, which is based on a levered beta of 1.065. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business. Strength Debt is not viewed as a risk. Weakness Earnings declined over the past year. Opportunity Annual revenue is forecast to grow faster than the American market. Good value based on P/E ratio and estimated fair value. Threat Annual earnings are forecast to grow slower than the American market. Valuation is only one side of the coin in terms of building your investment thesis, and it shouldn't be the only metric you look at when researching a company. The DCF model is not a perfect stock valuation tool. Preferably you'd apply different cases and assumptions and see how they would impact the company's valuation. For instance, if the terminal value growth rate is adjusted slightly, it can dramatically alter the overall result. For Alphabet, there are three essential items you should assess: Financial Health: Does GOOGL have a healthy balance sheet? Take a look at our free balance sheet analysis with six simple checks on key factors like leverage and risk. Future Earnings: How does GOOGL's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart. Other Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered! PS. Simply Wall St updates its DCF calculation for every American stock every day, so if you want to find the intrinsic value of any other stock just search here. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}