{
    "title": "GOOG Stock in 2024: Why Alphabet Remains a Strong Bet Despite AI Setbacks",
    "date": "1/24/2024",
    "url": "https://investorplace.com/market360/2024/01/goog-stock-in-2024-why-alphabet-remains-a-strong-bet-despite-ai-setbacks/",
    "text": " Google's layoffs don't have to be a deal-breaker for GOOG stock investors Advertisement Source: achinthamb / Shutterstock.com If you’re going to invest in a particular market sector, it’s not a bad idea to focus on the leaders and ignore the laggards. Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) doesn’t have to have the number-one position in every tech field to be a winner. GOOG stock is still a “monopoly stock” and deserves a “B” grade because it holds a dominant position among U.S. search-engine providers. This isn’t to suggest that Alphabet and Google are problem-free. As we’ll see in a moment, Google isn’t immune to challenges and the company’s layoffs might worry some investors. There are reasons to consider owning at least a few shares of Alphabet stock this year. One area of concern is that Google plans to implement layoffs in 2024. Don’t be too alarmed, however, as Google expects that the layoffs this year will be on a smaller scale than the company’s workforce reductions from 2023. Besides, Google’s job cuts aren’t just being done randomly. There’s a plan in place here, as CEO Sundar Pichai assured that Google is cutting costs to invest in “our big priorities this year,” such as artificial intelligence (AI). Another concern is that Alphabet isn’t the top contender in the AI arms race. This is a primary reason why we’re not assigning Alphabet stock a full “A” grade right now. By investing early and aggressively in ChatGPT developer OpenAI, Microsoft (NASDAQ:MSFT) took an early lead over Alphabet in the generative AI field. To quote Argus analyst Joseph Bonner, “Alphabet remains at minimum competitive if not a leader in the development of generative AI.” That’s a fair assessment, so stay tuned for further developments as Alphabet attempts to play catch-up in the gen-AI field. So, if Alphabet isn’t number-one in gen-AI, can we still call GOOG stock a “monopoly stock”? The answer is yes, as Alphabet doesn’t have to lead every technology niche market. Alphabet’s Google is still, by a wide margin, the top U.S. search-engine provider. Microsoft’s Bing is a very distant runner-up. In fact, Bloomberg recently reported that Google “has more than 90% of the [search engine] market.” Not only that, but Bing “ended 2023 with just 3.4% of the global search market.” Enhancing Bing with ChatGPT gen-AI functionalities didn’t seem to move the needle very far. There hasn’t been an “iPhone moment” for Microsoft in the search-engine category. Therefore, until there’s data to prove otherwise, it looks like Google’s monopoly position is quite secure. Even in 2024, Alphabet is still licking its wounds from the company’s notoriously bad rollout of its Bard gen-AI chatbot. Going forward, it remains to be seen whether Alphabet can gain traction against Microsoft in developing gen-AI technology. Still, Google remains the undisputed heavyweight champion among U.S. search-engine providers. Furthermore, Alphabet’s layoffs are notable but shouldn’t be a deal-breaker for investors. Consequently, GOOG stock earns a “B” grade and should be appropriate for a moderately sized position in a broad variety of portfolios. On the date of publication, Louis Navellier had a long position in MSFT. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article. The InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article. Artificial Intelligence, Communications, Media, Social Media, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/goog-stock-in-2024-why-alphabet-remains-a-strong-bet-despite-ai-setbacks/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Stocks to Buy Hot Stocks Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}