{
    "title": null,
    "date": "1/21/2024",
    "url": "https://9to5google.com/2024/01/21/google-2024-goals/",
    "text": "Earlier this week, Sundar Pichai said that Google has “ambitious goals and will be investing in [its] big priorities” in 2024. This includes AI and spans Google’s consumer to enterprise platforms. In that company-wide memo (via The Verge), the CEO laid out seven goals for Google in 2024: Artificial intelligence is unsurprisingly at the top of this list. Gemini Ultra should be nearing launch, while work on future versions of Gemini was something the company already teased as being underway when launching 1.0 in December. Particularly important this year is adding generative AI features that people actually want. For example, Duet AI – to me – is a more straightforward application than SGE. On the consumer side, there’s building the “most helpful personal computing platforms and devices.” That’s undoubtedly a reference to Android and Chrome, while devices being mentioned in the same breath feels noteworthy, especially when coupled with the hardware reorg. Meanwhile, Google should be introducing a new platform with Android XR this year. Building products and platforms that are “trusted” can be evaluated from a number of criteria, including the perennial “will this product be killed.” Google Cloud is the only brand name to get an explicit mention as the company continues to compete with Amazon and Microsoft in enterprise. Speaking of Duet AI in Google Workspace, it will be interesting to see whether consumers will want to pay for it in Drive, Docs, Sheets, etc. as a standalone subscription. The more internal-facing goals are about making the company more efficient, but it remains to be seen how effective the stated goals – “simplify execution and drive velocity in some areas” – of the layoffs will end up being. A leaner Google with less cruft and bureaucracy that can ship products/features faster would be the best possible outcome. FTC: We use income earning auto affiliate links. More. Check out 9to5Google on YouTube for more news: Stay up to date on news from Google headquarters… Editor-in-chief. Interested in the minutiae of Google and Alphabet. Tips/talk: abner@9to5g.com "
}