{
    "title": "Alphabet Inc. Outperforms S&P 500 — TradingView News",
    "date": "1/10/2024",
    "url": "https://www.tradingview.com/news/tradingview:b34939739094b:0-alphabet-inc-outperforms-s-p-500/",
    "text": "Alphabet Inc. (GOOG) has seen a positive adjustment in its latest trading sessions, ending at $142.56 and $140.95 respectively. This performance outpaced the S&P 500's loss. Over the past month, Alphabet's stock has climbed by 4.33% and 4.16%, exceeding the sector's gain. The financial results of Alphabet Inc. are eagerly anticipated. The company is expected to post an EPS of $1.62, up 54.29% from the prior-year quarter. The projected net sales are $70.59 billion, up 11.83% from the year-ago period. In terms of valuation, Alphabet holds a Forward P/E ratio of 20.59, marking a discount compared to its industry's average Forward P/E of 23.86. The company currently has a PEG ratio of 1.24, compared to its industry's average PEG ratio of 1.99. For the current quarter, Alphabet Inc. is expected to post earnings of $1.62 per share, indicating a change of +54.3% from the year-ago quarter. The consensus earnings estimate for the current fiscal year is $5.83, pointing to a change of +27.9% from the prior year. For the next fiscal year, the consensus earnings estimate of $6.74 indicates a change of +15.6% from the previous year. The consensus sales estimate of $70.59 billion for the current quarter points to a year-over-year change of +11.8%. The estimates for the current and next fiscal years are $254.75 billion and $284.03 billion, indicating changes of +8.9% and +11.5%, respectively. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}