{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.fool.com/investing/2024/02/06/this-artificial-intelligence-ai-stock-just-tanked/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Earnings season is in high gear and all eyes are on big tech. \"Magnificent Seven\" member Alphabet (GOOG 0.21%) (GOOGL 0.04%) recently reported earnings for its fourth quarter and full year 2023. Despite healthy growth across each of Alphabet's major revenue streams, investors were left uninspired. Since reporting earnings on Jan. 30, Alphabet stock is down roughly 7% as of market close on Feb. 1. Let's dig into the report, and assess why investors may be souring on Alphabet. More importantly, by taking a thorough look at the entire picture and thinking longer term, investors may come to view the sell-off as an opportunity to buy the dip. Alphabet's largest revenue driver is advertising, which primarily stems from Google and YouTube. In addition to ads, Alphabet also has a fast-growing cloud computing operation as well as a services business which includes purchases through its app store and hardware devices. Despite its diversified business, the overwhelming majority of Alphabet's operating profits come from the advertising business. For this reason, it's pretty consistent that investors keep a close eye on the performance of Alphabet's advertising services. For the period ended Dec. 31, Alphabet generated $65.5 billion in advertising revenue -- up 11% year over year. And for the full year 2023, advertising revenue was up just 6% annually. Competition in the advertising space has risen dramatically over the last couple of years. Platforms such as TikTok and Meta Platforms-owned Facebook and Instagram are all gaining momentum across different demographic segments. Furthermore, Amazon's advertising business is also making significant inroads in the space. To make matters more complex, the macroeconomic environment has been plagued by lingering inflation and high borrowing costs. Subsequently, businesses of all sizes have been much more careful with their budgets and where to allocate capital. The combination of rising competition and tighter budgets has undoubtedly impacted Alphabet's core business -- from revenue to profits. Given this dynamic, some investors may be wondering if it's time to move on from Alphabet. However, by zooming out and looking at the bigger picture, the long-term investment thesis around Alphabet goes far beyond its ads business. Image source: Getty Images. One theme that underscores the best businesses is expanding outside of your legacy products. For example, Microsoft evolved from being the developer of the Windows operating system to a giant corporation spanning gaming, cloud computing, and hardware devices. I see Alphabet at a similar point in its lifecycle. Given the challenges facing its ads business, the company needs to prove that it has more to offer. While it trails Amazon and Microsoft by a notable margin, Alphabet's cloud operation is quickly becoming an important pillar for the business. In 2023, Alphabet's cloud business grew 26% year over year to $33 billion. Furthermore, the cloud unit generated $1.7 billion of operating income -- compared to a loss of $1.9 billion in 2022. Not only did Google Cloud Platform's growth outpace that of Microsoft's Azure and Amazon Web Services, but it has swung to a profitable segment in just one year. Some contributors to Google Cloud's growth include its unique leverage of artificial intelligence (AI) applications and cybersecurity use cases. The intersection of AI and cybersecurity is important, and Alphabet's strategic acquisitions in these industries over the last couple of years are already yielding accelerating growth and profits. With growth being top of mind for many investors, particularly in the tech sector, Alphabet may not be seen as the best opportunity at the moment. While I understand the concerns surrounding the advertising business, I also see the cloud business as overlooked. More importantly, the investments the company is making in AI to ignite growth across its entire ecosystem also appear to be underappreciated, if not misunderstood. As of this writing, Alphabet stock trades at a forward price-to-earnings (P/E) multiple of 21 -- essentially in line with that of the S&P 500. Nevertheless, compared to historical averages, this forward P/E level doesn't imply a rock-bottom valuation by any means. While the legacy ad business is facing some existential competition, it's too early to tell if decelerating growth will be an ongoing theme. Moreover, the prospects of the cloud business look encouraging, and I view Alphabet as an under-the-radar AI opportunity with robust long-term potential. I see the sell-off as an opportunity to use dollar-cost averaging to add to existing Alphabet positions or initiate one for your portfolio. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}