{
    "title": "Google parent Alphabet took a $1.2 billion hit to exit office space last \nquarter — news that flew under the radar in a ...",
    "date": "2/3/2024",
    "url": "https://finance.yahoo.com/news/google-parent-alphabet-took-1-103400067.html",
    "text": "Google parent company Alphabet this week reported a $1.2 billion charge in the fourth quarter to exit office space, a notable cost that largely flew under under the radar in a hectic week, according to a Barclays researcher. I inherited $246,000 from my mother and used $142,000 to pay off our mortgage. If we divorce, can I get it back? When mortgage rates will cross the ‘key threshold’ that unfreezes the housing market, according to five economists Nvidia’s stock could ride to $800, says Goldman Sachs. Here’s its path. Super Micro board member buys over $1 million in stock after 600% yearly surge Palantir’s stock surges nearly 20% as company rides AI wave to upbeat earnings, outlook The search-engine giant GOOG GOOGL on Tuesday said the new charge stems from an effort to optimize its office space globally, which in 2023 resulted in a total of $1.8 billion in related costs as the company worked through announced staff cuts. While many corporations have been downsizing their office footprints in the wake of the pandemic, big reductions in space from major technology companies can have an outsize impact. Momentum by companies to bring more staff back to their offices has been building. Still, Jones Lang LaSalle Inc. JLL said in a fourth-quarter U.S. office outlook that office-space demand was still roughly 30% below pre-pandemic levels last quarter, due in part to a “largely absent” pipeline of technology and co-working expansions. Leasing volume by technology companies was still less than 50% of 2019 levels, JLL noted. “To keep it short, a lot happened this week,” said Lea Overby, a Barclays researcher focused on securitized credit, in a Friday client note — citing a barrage of corporate earnings, the Federal Reserve’s interest-rate decision and New York Community Bank’s NYCB charge-offs relating to two commercial-real-estate loans as among the week’s action. “And to put all this in perspective, Alphabet noted in its earnings that it took a $1.2 [billion] charge to exit office space in Q4, more than twice the charge it took Q1, and this has not even made the news,” Overby said. While at least one real-estate business publication highlighted the charge , much of the broader coverage of Alphabet’s fourth-quarter earnings results this week focused on the company’s digital-advertising business. Related  : Alphabet’s stock dips because advertising was good, but not good enough Despite more negative news this week on the commercial-real-estate front, Overby said the market for commercial-mortgage-backed securities — a segment of the market used to finance landlords at ultra-low rates over the past decade — continued to rally. U.S. stocks also rallied Friday, with the Dow Jones Industrial Average DJIA hitting its ninth record close of 2024, the S&P 500 index SPX up 1.1% and the Nasdaq Composite Index COMP 1.7% higher, according to FactSet. The benchmark 10-year Treasury yield BX:TMUBMUSD10Y was up 17 basis points to 4.03%. Alphabet did not immediately respond to a request for comment. Bond-market selloff driven by ‘higher for longer’ fears leads to worst two-day losses in years Major bond-market gauge cements worst 2-day rout since October as market rethinks path of Fed rate cuts My wife and I sold our home to her son at a $100,000 discount. He’s now selling at a $250,000 profit. Do I ask for a cut? Fate of the Mag 7 depends on their ability to deliver rapid revenue growth in 2024, says Goldman Sachs My brothers are co-owners on $1.9 million of our mother’s bank and brokerage accounts. She now has Alzheimer’s. How can I rectify this? Related Quotes "
}