{
    "title": "Alphabet's Verily Founder Andy Conrad Departs for VC Firm S32",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/news/alphabets-verily-founder-andy-conrad-140000507.html",
    "text": "(Bloomberg) -- Andy Conrad, the founder of Alphabet Inc.’s life sciences unit Verily, has joined venture capital firm S32 as a general partner as the firm seeks to deepen its investments in the booming field of artificial intelligence. Most Read from Bloomberg Nvidia Rises Most in About Nine Months as AI Drives Sales Biden Touts $1.2 Billion in Student Loan Relief With Eye to 2024 Stocks Around the World Are Swept Up in AI Rally: Markets Wrap She Was Set to Break Goldman’s Glass Ceiling. Now Beth Hammack Is Leaving Why Are There Suddenly So Many Car Washes? Conrad is best known in Silicon Valley for launching Verily, which captured the public imagination with efforts to develop glucose-detecting contact lenses and has in recent years focused more on its bottom line. He stepped down as executive chairman of Verily earlier this month but remains an adviser to Alphabet, a spokesperson for S32 said. The venture firm, which announced Conrad’s appointment on Thursday, was founded by veteran Google executive Bill Maris. Conrad said he was drawn to S32 by the opportunity to work with Maris, a friend of more than 25 years, and to help startups as they begin packaging pioneering AI tools as products for corporate clients. “Helping entrepreneurs transition from the theoretical components of computer science to the practical ones is a very, very interesting and challenging thing,” Conrad said in an interview. “I really do think there’s a new dawn. And it’s time to get the practical things addressed about the role of machine learning and the role of generative AI and AI in general.” Having made investments in AI startups such as Cohere and BigHat Biosciences, S32 is focused on helping AI companies find the talent they need to sell their tools to major enterprises, said S32 Chief Executive Officer Andy Harrison, who is also a veteran of Alphabet and Verily. “Now we’re really in the product phase of AI,” Harrison said in an interview. For AI startups to do business with big companies and generate a return on the investment, “we need to start to build out full teams of product, operational, business and technical people,” he said. Most Read from Bloomberg Businessweek A24’s Risky Hollywood Moment Plug-In Hybrids Are Booming in the World’s Biggest EV Market How Bad Movie Dubbing Led to the Fake Biden Campaign Robocalls US Citizens Become Collateral Damage in Global Sanctions Fight How Capital One’s $35 Billion Discover Merger Could Affect Consumers ©2024 Bloomberg L.P. Related Quotes "
}