{
    "title": "Google CEO acknowledges issues with Gemini AI in internal memo",
    "date": "2/28/2024",
    "url": "https://www.republicworld.com/business/google-ceo-acknowledges-issues-with-gemini-ai-in-internal-memo/",
    "text": "Finally, a news app that is for the believers. Republic World Mobile App. Download App Updated February 28th, 2024 at 12:45 IST Pichai stated that Google has been working tirelessly to address problematic text and image responses. Pichai addresses AI concerns: Google CEO Sundar Pichai addressed concerns about the company's Gemini AI in an internal memo, acknowledging that the AI's output has been historically inaccurate and has \"offended our users and shown bias.\" The memo, reported first by Semafor, comes after Google paused Gemini's ability to generate images last week due to widespread criticism of its output. The Gemini AI generated images included racially diverse Nazi-era German soldiers, non-white US Founding Fathers, and inaccuracies in depicting Google's own co-founders. While the company has apologised for missing the mark and is working to re-enable image generation, Pichai's memo is the first public acknowledgment of the controversy. In the memo, Pichai stated that Google has been working tirelessly to address problematic text and image responses in the Gemini app. He stressed that, while no AI is perfect, especially at this early stage of the industry's development, Google is committed to meeting the high standards expected of it. He reassured employees that the company would continue its efforts until the issues were resolved. Google's Gemini AI has faced scrutiny for its inaccuracies, highlighting the challenges of developing AI systems that are free from bias and capable of producing accurate and sensitive content. Published February 28th, 2024 at 12:45 IST Send us your views, we’ll publish them. This section is moderated. Viral Video Shows A Man Riding Bull On Busy City Street | WATCH Zodiac Signs With The Best Sense Of Humour Zodiac Signs That Are Incompatible With Each Other BSF Foils Intrusion Attempt, Recovers China-Made Pak Drone in Punjab YouTube Music web app launches offline downloads Apple extends discounts to employees on select Apple Watch bands Woman In Lahore Thrown Out Of Window By Her Husband, Video Goes Viral Pooran makes bold statement on Mayank Yadav after LSG vs PBKS Four Arrested For Attack On Interfaith Couple In Hyderabad Unseen pictures from LSG vs PBKS match as Lucknow emerge victorious © 2024 Republic. All rights reserved. Big Stories Quick Live TV Video "
}