{
    "title": null,
    "date": "2/17/2024",
    "url": "https://www.fijitimes.com.fj/google-touts-ai-to-vet-troves-of-content-in-seconds-ceo-predicts-profit/",
    "text": "Listen to this article: (Reuters) – Reading “War and Peace,” Leo Tolstoy’s monumental novel that runs half a million words long and often over 1,000 pages, might be a minute-long affair for a new artificial intelligence model from Google. The Alphabet-owned company on Thursday showcased Gemini 1.5, an upgrade to its suite of AI models it announced two months ago. In a single prompt, a user can ask Google’s AI to analyze vastly more content than before — 30,000 lines of code, 11 hours of audio, a whole hour of video, Google said. That’s for Pro, the family’s mid-sized model. In concrete terms, Pro can process 1 million pieces of data known as tokens — five times the amount that Anthropic, perhaps the closet competitor in this regard, handles in a query of its Claude 2.1 technology. Reuters was unable to independently test the claims. Google’s increasingly voracious AI, on the heels of releases by ChatGPT’s creator OpenAI and others, reflects the rapid arms race underway in Silicon Valley to build the most capable – and marketable – technology yet. In an interview with Reuters, Alphabet CEO Sundar Pichai heralded the advance as one of multiple “breakthroughs” that would fuel his company’s myriad businesses. At root, he said, the search-industry mainstay was making a new manner of inquiry possible. “You’re dramatically giving a wider view for people to ask questions about the world.” One example that Google discussed internally is how a movie maker could ask the AI to judge a rough-cut film like a critic would, Pichai said. “This is just one use case we were talking about as a team, but the sky’s the limit here,” he said. Another: querying several companies’ financial reports in one go, said Pichai. Press demos showed how the AI could extract information from a 44-minute video in about 59 seconds, as well as multimodal prompts, in which a user asked the AI to respond to a combination of text and imagery. Beyond imparting updated technology to Google Search and YouTube, Alphabet is looking to Gemini 1.5 to draw customers to its cloud unit. Locked in competition with bigger rival and OpenAI’s backer Microsoft, Alphabet recently saw a rebound in sales growth for the division. Beginning Thursday, Google said it would open its million-token AI to a limited number of business customers, while any developer could build with version 1.0 and swap in the latest generation once available. Asked when such powerful AI models, typically cost-intensive, would be profitable for Alphabet, Pichai said: “These are profitable things for us to do. Also, over time, we will be very, very efficient at running these models.” Efficiency was another improvement Google highlighted for Gemini 1.5. Google said it implemented a less onerous way for the AI to gather information known as a “mixture of experts,” in line with its prior research and a competitor’s recent announcement. One company official likened the approach to calling a savant to answer a question, rather than dialing every person one knows. © 2024 FijiTimes. All rights reserved. Powered by PageSuite "
}