{
    "title": "Crowd sets Waymo self-driving car ablaze in San Francisco",
    "date": "2/11/2024",
    "url": "https://www.marketscreener.com/quote/stock/ALPHABET-INC-24203373/news/Crowd-sets-Waymo-self-driving-car-ablaze-in-San-Francisco-45928664/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) Feb 11 (Reuters) - A crowd vandalized a Waymo\nself-driving vehicle and set it on fire by throwing a firework\ninside the car in San Francisco on Saturday, said Waymo, which\nis owned by Alphabet. This is not the first time people have attacked a\nself-driving car, but the severity of the incident may\nillustrate growing public hostility toward self-driving cars\nfollowing a pedestrian-dragging accident last year involving a\nself-driving vehicle operated by General Motors' Cruise\nunit. Waymo said that around 9 p.m. on Saturday (0500 GMT\nSunday), someone in a crowd broke a car window and threw a\nfirework inside, setting the vehicle ablaze. Waymo did not say\nwhat caused the crowd to attack the car. Video footage on social media showed the electric vehicle\nburning, sending up a huge plume of black smoke. \"The vehicle was not transporting any riders and no injuries\nhave been reported. We are working closely with local safety\nofficials to respond to the situation,\" the company said. The San Francisco fire department said it turned over the\ncase to the police who were investigating the cause of the\nattack. The fire department on social media posted pictures of the\ncharred remains of the car, along with saying that a firework\ninside the vehicle started the blaze. The San Francisco police\ndepartment was not immediately available for comment. Last week, a driverless Waymo car collided with a cyclist in\nSan Francisco, causing minor injuries and the incident is being\nreviewed by the state's auto regulator. On Oct. 2, a pedestrian hit by another vehicle was thrown\ninto the path of a self-driving Cruise vehicle and dragged 20\nfeet (6 meters). California suspended the company's driverless testing\nlicense, and Cruise pulled all its U.S. self-driving vehicles\nfrom testing.\n(Reporting by Hyunjoo Jin and Abhirup Roy in San Francisco and\nMariana Sandoval; Editing by Lisa Shumaker)  0 selected Alphabet a 'Clear' Beneficiary of Generative AI, Wedbush Says March 22, 2024 at 11:54 am EDT Alphabet is in a league of its own Partnerships or mergers in disguise? Regulators examine the link between Microsoft and OpenAI  Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}