{
    "title": "Alphabet Stock: One Of AI's Most Aggressive Investors And Innovators \n(NASDAQ:GOOG,GOOGL)",
    "date": "2/4/2024",
    "url": "https://seekingalpha.com/article/4667406-alphabet-stock-ai-most-aggressive-investors-and-innovators",
    "text": "NurPhoto/NurPhoto via Getty Images NurPhoto/NurPhoto via Getty Images The following segment was excerpted from this fund letter. More recently, \"AI\" has risen to the top of investor interests. We think it is important to point out that AI and machine learning development is not a particularly new phenomenon and has been going on for decades, as we have witnessed from the companies in Wedgewood's portfolio. Not only have our companies been investing and developing key AI technologies, but they have - most importantly - been monetizing these investments and will continue to do so for the foreseeable future. The ebullient interest in AI, starting early on in 2023, was precipitated by Nvidia's (NVDA) surge in its AI chip revenues (and surging stock price). The fundamental driver of that performance has been the rapid rise in data center GPU revenues during the past few quarters. Investors have been wondering: \"Where are all of these GPUs going?\" and then have filled in the blanks, with \"large language models (LLM),\" \"generative AI\" etc., being bandied about in the daily headlines. The majority of the recent boost in GPU spending has been driven by the handful of cloud- scale service providers (e.g. Azure, AWS, GCI, OCI) that can make very large but not always consistent purchases of compute equipment but that can also send skewed signals to the rest of the market. Many of these GPUs are destined to be utilized for generative AI (\"chatbots\") that consume vast amounts of compute power conventional CPUs cannot practically provide. How useful these generative artificial intelligence (GenAI) applications will prove to be to the masses is open to question. However, there are benefits of AI that are very real and massive and that have been around for years - companies did not just discover it during Nvidia's recent earnings releases. Meta Platforms, Alphabet, Apple, and Taiwan Semiconductor Manufacturing, to name a few, have created some of the most profitable franchises extant by developing and applying AI. In 2023 Alphabet was a top contributor to portfolio performance thanks to its search revenues accelerating due to the investments they have been making in AI over the past several years. The Company has spent almost $150 billion on research and development in just 5 years, creating products and services that helped drive a more than doubling of revenues. For example, almost 80% of the Company's advertising customers use an AI- enabled tool when they run their Google Search and YouTube campaigns. Although the Company was criticized by the media for being \"late\" to the AI party when they rolled out a Gen-AI chatbot after Microsoft, Google has been creating scaled, context-aware AI functions for at least a decade, such as semantic search. While not necessarily a \"large language model (LLM),\" semantic search has become a mainstay in all-things search - predicting what users want to see or type before they type it. Consumers probably do not really care what kind of AI framework is being used behind the technology they are using, as long as it is useful to them - but these AI features are what have helped drive the rapid growth of Alphabet's Google franchise. More recently, the Company announced its next generation LLM, Gemini, which will serve as the updated engine for Google's Bard chatbot tool. The update offers an array of content recognition and understanding capabilities across several different types of information and media types. Gemini can understand and produce more accurate, complex computer code, text and related images and audio to help users find or create what they need. However, the Company's AI capabilities go well beyond software and extend into hardware infrastructure. Many of Gemini's capabilities are enabled by Alphabet's proprietary hardware technology. Google's own infrastructure - used to power all of its services - has had custom, AI-dedicated hardware since at least 2015. The Company created and open- sourced the ubiquitous machine learning \"TensorFlow\" framework nearly a decade ago and then specialized an integrated circuit, the Tensor Processing Unit (TPU), to accelerate Google's most popular and monetizable products which billions of people use every day, including YouTube, Gmail, and Maps. Today, the Company's Gemini LLM has been designed to be trained on their in-house TPUs so they can run faster and more efficiently. When it comes to AI, Alphabet has been one of the most aggressive investors and innovators. The Company has an ample budget dedicated to maintaining leadership in productizing and monetizing AI. Alphabet even has ample room to rationalize spending in other non-AI areas to drive better returns on investments and also increase capital returns to shareholders at these relatively attractive forward earnings multiples. The information and statistical data contained herein have been obtained from sources, which we believe to be reliable, but in no way are warranted by us to accuracy or completeness. We do not undertake to advise you as to any change in figures or our views. This is not a solicitation of any order to buy or sell. We, our affiliates and any officer, director or stockholder or any member of their families, may have a position in and may from time to time purchase or sell any of the above mentioned or related securities. Past results are no guarantee of future results. This report includes candid statements and observations regarding investment strategies, individual securities, and economic and market conditions; however, there is no guarantee that these statements, opinions or forecasts will prove to be correct. These comments may also include the expression of opinions that are speculative in nature and should not be relied on as statements of fact. Wedgewood Partners is committed to communicating with our investment partners as candidly as possible because we believe our investors benefit from understanding our investment philosophy, investment process, stock selection methodology and investor temperament. Our views and opinions include \"forward-looking statements\" which may or may not be accurate over the long term. Forward-looking statements can be identified by words like \"believe,\" \"think,\" \"expect,\" \"anticipate,\" or similar expressions. You should not place undue reliance on forward-looking statements, which are current as of the date of this report. We disclaim any obligation to update or alter any forward-looking statements, whether as a result of new information, future events or otherwise. While we believe we have a reasonable basis for our appraisals and we have confidence in our opinions, actual results may differ materially from those we anticipate. The information provided in this material should not be considered a recommendation to buy, sell or hold any particular security. Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}