{
    "title": "Alphabet (NASDAQ:GOOGL): Undervalued and Overlooked Magnificent Seven Stock",
    "date": "2/24/2024",
    "url": "https://finance.yahoo.com/news/alphabet-nasdaq-googl-undervalued-overlooked-194931703.html",
    "text": "Magnificent Seven stocks have attracted plenty of buzz as investors gravitate toward their vast market share and exceptional returns. Every Magnificent Seven stock has more than doubled over the past five years. These assets have significantly outperformed the market during that time. However, Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) has been a largely underappreciated stock. The corporation has amassed a $1.75 trillion market cap and is up by 56% over the past year. Still, that gain falls behind most of the Magnificent Seven stocks. New opportunities and a good valuation can help Alphabet gain momentum and accumulate long-term returns for investors. Those catalysts make me bullish on the stock. Although the company owns the largest search engine in the world, it’s fallen behind the Magnificent Seven stocks in recent years. These are the one-year and five-year returns for each stock within the cohort. One-year returns: Nvidia: 223% Meta Platforms: 171% Amazon: 77% Microsoft: 58% Alphabet: 56% Apple: 22% Tesla: -2% Five-year returns: Nvidia: 1,579% Tesla: 882% Apple: 320% Microsoft: 260% Meta Platforms: 187% Alphabet: 157% Amazon: 106% These are still impressive returns and outpace the S&P 500 (SPX) and Nasdaq 100 (NDX). However, Alphabet has been outclassed by every Magnificent Seven stock except Amazon (NASDAQ:AMZN) over the past five years. While the stock has underperformed its peers within the cohort, Alphabet has a better valuation than most tech companies. The stock trades at a 24.5 P/E ratio and has solid profit margins. The company’s net profit margin usually exceeds 20% and should get a big boost in future quarters. Alphabet has three components on its side: rising revenue, more profits, and cost-cutting measures. The tech giant reported 13% year-over-year revenue growth and 51.8% year-over-year net income growth in Q4 2023. Alphabet’s efforts to trim its workforce contributed to higher margins and seem to be ongoing. A contributing factor to Alphabet’s rising net income is the recent profitability of Google Cloud. The cloud computing segment has been taking up a larger percentage of revenue and attributed to more than 10% of Q4-2023 revenue. Google Cloud generated $9.2 billion of the company’s $86.3 billion in revenue. Google Cloud swung from a $186 million operating loss in Q4 2022 to generating $864 million in operating income in Q4 2023. Google Cloud’s margins should improve significantly in future quarters and reduce the company’s P/E ratio by increasing its earnings. While it’s nice to see Alphabet expanding in other verticals, it’s no secret that advertising is the main engine for this corporation. Advertising sales slowed down in 2022 but came back to life in 2023. Its fourth-quarter results further highlight this fact and suggest that Alphabet has more to gain. The fourth quarter featured $76.3 billion in Google Services revenue. This segment mainly consists of the company’s advertising and grew by 12.5% year-over-year. Advertising should receive an additional boost from the Olympic Games and the upcoming Presidential Election. Higher advertising revenue also translates into more profits. While the same can be said about most businesses, Alphabet achieved a 35.0% operating margin with its Google Services segment in Q4. Among the Magnificent Seven stocks, Nvidia (NASDAQ:NVDA) and Microsoft (NASDAQ:MSFT) are the clear leaders in the artificial intelligence industry. However, Alphabet is also poised to gain a meaningful slice of the pie by using its existing technology and making new investments. Alphabet recently launched Gemini in a bid to bolster its AI presence. The tech firm also invested over $2 billion into an OpenAI competitor. Alphabet has been using artificial intelligence to improve its search results and cloud platform, but these investments represent the next steps to gain market share. Alphabet can close the gap in the AI race with Microsoft. The company started Google Cloud two years after Amazon got a head start with Amazon Web Services. Now, Google Cloud is a critical component of the company’s business. Alphabet has invested in many ventures known as Other Bets that are growing at a high rate. While this segment makes up a small part of total revenue, it’s worth monitoring the collection of businesses under the umbrella term. Most analysts are bullish on Alphabet stock. The stock sports 29 Buys and eight Hold ratings from analysts, giving it a Strong Buy consensus rating. The average GOOGL stock price target of $164.59 implies 14.3% upside potential. Alphabet is an under-the-radar stock (relatively) due to the impressive performances of other Magnificent Seven stocks. The tech giant has outperformed the market but has underperformed most of the corporations in its cohort. Rising revenue and profits from advertising and cloud computing present a great opportunity. Alphabet also seems determined to gain more market share in artificial intelligence, which is a great long-term move for the corporation. Disclosure Related Quotes "
}