{
    "title": null,
    "date": "2/18/2024",
    "url": "https://investorplace.com/2024/02/goog-stock-outlook-why-alphabet-shares-could-surge-higher-in-2024/",
    "text": " AI Stocks have gotten ahead of themselves, but GOOG Stock is still fairly valued Advertisement Source: rvlsoft / Shutterstock.com The Alphabet (NASDAQ:GOOGL,NASDAQ: GOOG) stock outlook suggests the company has solidified itself as one of the market leaders in artificial intelligence. The company is making all the right moves, and AI is already making meaningful contributions to the company’s quarterly financial results. The dawn of artificial intelligence has sparked a new technological revolution. This is the largest technological shift since the birth of the internet, set to contribute trillions of dollars to the global economy over the next decade. As GOOG works to integrate AI across its entire tech stack, growth is likely to speed up in 2024. One of Google’s most recognizable offerings is Google Search. By constantly refining its algorithms and understanding user intent, Google delivers tailored results within milliseconds. Evidently, this has been their bread and butter, and artificial intelligence is going to make these tasks more seamless and efficient. While Google Search continues to be a dominant force, YouTube is gradually climbing up the ranks. YouTube has been one of their greatest acquisitions, and their recent pivot to short form videos like YouTube shorts was a well-calculated move. In Q4 FY23, YouTube ad revenue swelled 15% YOY to $9.2 billion. Google Search and Google Cloud also saw strong double digit growth in the quarter. YouTube’s contribution to advertising revenue is a great sign, and investments in artificial intelligence in FY24 will continue to drive growth and innovation. While Google’s strength lies in cloud computing and search engine technology, they are set to become a major AI company. Google’s new Gemini AI model already boasts superior features compared to Microsoft backed ChatGPT 4.0. Gemini possesses a strong understanding of factual information, and can process real-time data ensuring its responses are up-to-date. Secondly, Gemini’s training of diverse data sets increases the inclusivity of information to reduce biases. Furthermore, Gemini Ultra is Google’s most powerful LLM. It offers multimodal capabilities, meaning it can handle text, code, and images. Early reviews have praised its speed, reasoning abilities, and lack of messaging cap. This could be one of the game changers moving forward as new features continue to be released. Google may have a competitive advantage for training data sets and LLMs. The data that Google Search has built up over the last several decades will solidify their position as a leader in the AI race. GOOG stock is still fairly valued, despite surging more than 40% in 2023. Its forward P/E currently stands at 21, and their P/S ratio is well below other large-cap AI stocks. This is great news for aspiring AI stock investors who may feel left behind by the surge in stock prices. In fact, when AI stocks inevitably face a correction, there is more reason to pounce on the stock in 2024. Apart from GOOG stock’s valuation, their liquidity remains strong with approximately $110 billion in cash and marketable securities. They are well positioned to continue investing in R&D and drive innovation in AI and the cloud. On the date of publication, Terel Miles did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Terel Miles is a contributing writer at InvestorPlace.com, with more than seven years of experience investing in the financial markets. Artificial Intelligence, Cloud, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/goog-stock-outlook-why-alphabet-shares-could-surge-higher-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}