{
    "title": null,
    "date": "2/2/2024",
    "url": "https://www.wired.com/story/google-spending-acquisitions-cratered-in-2023/",
    "text": "To revisit this article, visit My Profile, then View saved stories. Paresh Dave Pennies were pinched in Mountain View last year. For much of its existence as a public company, Google had made a headline-grabbing acquisition at least once a year as it used the profits from its surging ads business to bet on new frontiers. Billions of dollars went to scooping up Motorola, Nest, HTC, and Fitbit to build up its hardware business. Apigee, Looker, and Mandiant rounded out Google’s cloud computing unit. But Alphabet’s latest annual report reveals that the splurging stopped in 2023. Alphabet omitted a section describing acquisitions over the past year in the annual report filed this week to the US Securities and Exchange Commision, meaning any dealmaking wasn’t significant enough to flag to shareholders. New financial results released by Amazon and Meta Thursday showed their own spending on acquisitions also dipped significantly in 2023. The slowdown suggests that pressure from antitrust regulators concerned about corporate power, and investors who demanded cost cuts as interest rates jumped, is forcing tech giants to pull back from one of their signature strategies. The European Commission and other regulators have increasingly challenged deals that they view as a threat to fair competition, forcing companies such as Amazon and Adobe to abandon planned purchases. Alphabet, Amazon, and Meta each laid off thousands of workers last year. “Deals from mega cap companies are being much more scrutinized,” says Angelo Zino, who studies tech stocks as vice president and senior equity analyst at CFRA Research. “In addition, 2023 was more of a cash preservation year.” Google and Amazon declined to comment. Apple and Meta did not respond to requests for comment. Since Google first went public in 2004, the company has never had a year without a section on acquisitions in its annual report—until 2023. The new filing says Alphabet did spend $495 million net in cash on acquisitions or “intangible assets” last year, an outlay that is the company’s lowest since 2017. Intangible assets could reflect standalone purchases of patents or trademarks. Apple has also pulled back. It spent $306 million in cash on acquisitions during the year ending in September 2022, but had so little to disclose for the year ending in September 2023 that it removed the line item about deals from its annual report and instead bundled any such spending into a line called “other,” where spending fell 36 percent. The latest financial results released by Meta and Amazon Thursday suggest that cost cutting can help boost profits, though that may not be their primary motivation. At Meta, cash investment in acquisitions or tangible assets dropped by half, to $629 million in 2023, after two years of growing spending. Those savings along with layoffs and additional cutbacks led Meta’s profits to soar about 69 percent in 2023. Amazon’s results show that it swung to a $30.4 billion profit in 2023 from a $2.7 billion loss the year earlier. The fact that net cash spending on acquisitions \"and other\" dipped from $8.3 billion in 2022 to $5.8 billion last year certainly contributed after years of ups and downs in those expenditures. The dive in acquisitions comes after several years of increasingly aggressive enforcement of antitrust laws from Washington and EU regulators and threats from lawmakers to impose new restrictions. While companies still consider acquisitions, they have in some cases decided that the potential pushback could be too much to bear. Celia Ford Adrienne So Matt Simon Matt Kamen One example of that chilling effect played out in 2020, when Meta had won the bidding over Snap and Reddit for TikTok rival Dubsmash, according to three people familiar with the auction. Meta backed off from closing the deal soon after UK regulators started scrutinizing its $315 million purchase of meme-image search engine Giphy, one of the sources says. Expecting the Dubsmash deal might draw similar investigation, Meta didn’t want to take on two battles at once, the source says. Reddit went on to buy Dubsmash, and Meta lost the fight with the Competition and Markets Authority—an unprecedented defeat—and last year sold Giphy to image database Shutterstock for just $53 million. The scrutiny of tech dealmaking has only intensified since then. Amid antitrust investigations into both deals, Adobe in December gave up on buying design tool Figma and Amazon this week canceled plans to acquire Roomba vacuum creator iRobot. Spending less on acquisitions frees companies to direct cash elsewhere—including to shareholders. Meta announced yesterday it would pay a dividend on its shares for the first time, starting in March. Companies typically pay a dividend to hand profits back to shareholders when they can’t find a better use for the cash, whether acquisitions or internal research and development efforts. Microsoft has been an outlier in the dealmaking downturn. It managed to win over competition regulators to complete its $69 billion acquisition of video game developer Activision Blizzard in October and Nuance Communications for $18.8 billion in 2022. But for the Activision deal Microsoft issued a series of promises aimed at placating rivals and consumers concerned about losing access to games and paying higher prices. Whether corporate wallets will open more readily in 2024 is unclear. The Big Five tech giants have the cash and stock to spend. Alphabet, Amazon, Apple, Meta, and Microsoft collectively closed last year with $178 billion in cash, and all have share prices at or near all-time highs, providing more ammunition for dealmaking. All those companies have said they largely plan to focus on investing in generative AI technologies, ramping up spending on highly technical workers and pricey computer chips such as GPUs. Unfortunately for the likes of Google and Microsoft, even buying minority stakes in AI startups has become a potential problem. The US Federal Trade Commission last week launched a competition study of investments made by Amazon and Google into Anthropic, and by Microsoft into OpenAI. That cannot directly lead to any divestment orders, but just conducting the study could be enough to deter big companies from future injections of capital into AI companies. Scott Devitt, who researches tech companies for Wedbush Securities, says, “I wouldn’t expect much in the way of acquisitions given the regulatory scrutiny each of the companies face.” A year from now, more annual reports could be one section lighter. In your inbox: Will Knight's Fast Forward explores advances in AI This shadowy firm enables businesses to operate in near-total secrecy Scientists are inching closer to bringing back the woolly mammoth The first rule of the Extreme Dishwasher Loading Facebook group is … Phones for every budget: These devices stood up to WIRED’s testing Morgan Meaker Morgan Meaker Morgan Meaker Makena Kelly Will Knight Vittoria Elliott Lauren Goode Paresh Dave More From WIRED Reviews and Guides © 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices "
}