{
    "title": "Google Was Silicon Valley's Vanguard of Cool. Now It's a Dinosaur.",
    "date": "2/29/2024",
    "url": "https://www.businessinsider.com/google-gemini-ai-layoffs-innovation-boring-2024-2",
    "text": "It used to be Silicon Valley's vanguard of cool. Now it's a dinosaur.        Just two months after Google launched Gemini, its flashy new AI model, the company revealed that it had already built a better version. Gemini 1.5, Google said, was bigger, faster, and more capable than its predecessor. The February 15 announcement, outlined in a giddy 1,600-word blog post replete with sizzle reels, prompted buzzy coverage among AI researchers and the tech press. For a few hours, anyway. Later that day, OpenAI introduced Sora, a tool that generates videos up to 60 seconds long based on text prompts. The rapturous response was immediate. CEO Sam Altman took prompt requests from X users and posted the results in real time. Words like \"eye-popping\" and \"shockingly powerful\" were thrown around, while researchers mused about the threat to Hollywood and the potential for deepfakery. Then, days later, Google scrambled to explain why its image generation tool spit out racially inaccurate depictions of historical figures. The instinct to erect sky-high guardrails led Gemini to \"overcompensate in some cases, and be over-conservative in others,\" the company said. Industry insiders responded by questioning whether the company had a culture problem and calling for CEO Sundar Pichai's head. It was yet another gut punch. \"It's a PR nightmare for the company,\" a current senior employee said. \"Googlers are pissed.\" Pichai has been describing Google as an AI-first company since 2016, but it has struggled to turn its foundational research — which powers technology like ChatGPT — into products that dazzle. Chatter about Google's transition from vanguard to dinosaur is hardly new. The company just turned 25 — roughly two centuries in tech years. It has lived through five presidents and two major market crashes. Its boy-wonder cofounders are now emeritus executives, and it changed its corporate name from a word that telegraphed futurism and brainpower to a word most people learn by age 3. But the past few years have introduced new troubles: lower tolerance for risk, crackdowns on innovation, layoffs, and a narrative that its famed products like search and Gmail are getting worse. They have supercharged the perception that Google, once seen as the most desirable place to work in Silicon Valley, has become the one thing it promised it would never be: boring. The downstream consequences of Google's graying loom large: a talent exodus, stale products, and an overreliance on its advertising cash cow. It also raises larger questions for Silicon Valley. What do you do when your formerly freewheeling juggernaut — the company that powered your reputation for boundless creativity and the idea that billions of dollars lurked behind any old line of code — loses its luster? When Google went public in 2004, Larry Page and Sergey Brin famously told investors that theirs was not a \"conventional\" company and that they didn't intend for it to become one. For at least a decade, they kept that promise. Google created the mold for a new Silicon Valley culture. It was an engineer's paradise, flush with great perks, fat salaries, and a belief that long-term investments always trumped short-term payoffs. Brin and Page had little interest in defacing their clean, powerful search engine with clutter, until they tested what would turn out to be Google's golden goose: search advertising. The upside was shedloads of cash and, in turn, freedom. The ad umbrella gave the founders cover to explore out-there ideas, and they encouraged employees to do the same. \"The whole culture of 'treat employees really well, give them a sense of ownership' — that was new and crazy in the early 2000s,\" one veteran staffer said. It built giant internet balloons. It virtually mapped Earth with satellite imagery. It built its own high-speed internet. It even tried to extend people's lives. In 2012, Business Insider listed 10 reasons Google was \"the greatest company in the world,\" including that it \"made sick perks standard for startups\" and created \"a little something we call 'Google Glass.'\" As the company grew, the founders became wary of creeping bureaucracy. The formation of Alphabet in 2015, which put Google's riskier bets outside the core business, was meant to be a solution. \"In the technology industry, where revolutionary ideas drive the next big growth areas, you need to be a bit uncomfortable to stay relevant,\" Page wrote in a memo to employees at the time. It would prove more portentous than he could have imagined. Ask Googlers when, how, and why their employer got too comfortable, and you'll hear different theories. Some say the company got too big. Others believe it lacks visionary leadership. Some say a fear of regulation and public backlash led to paralysis; others think it became subservient to Wall Street. One thing they can agree on, however, is the financial success of the Pichai era. Alphabet's revenue has soared. The company's market cap stands at around $1.7 trillion, up from just over $400 billion in 2015 when Pichai took the helm. Last year, Google announced that its cloud business — one of Pichai's early big bets — had finally become profitable. Yet 80% of Alphabet's revenue still comes from advertising — the bulk of which comes from simple text ads that have sat atop Google's search-results page since the turn of the millennium. (On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices.) As the company has struggled to diversify, fears of tipping the cash cow have only intensified. Risky prospects are viewed with skepticism, particularly when they don't involve selling ads. The result is a growing sense that preservation has replaced innovation as Google's chief form of currency. \"They can't get out of their own way because they're so entrenched in just protecting what they have,\" one former director said. Indeed, few of Google's notably successful products were launched within the past decade. Plenty have been killed, however, including augmented-reality glasses and a short-lived foray into gaming. Even its core products have lagged. Users have long bemoaned — and researchers recently found — a decline in the quality of Google Search results. AI only threatens to make it worse. \"They just fell into the trap of this incrementalism,\" said Michael Avrukin, a former Google engineer manager who joined in 2014 but left of his own volition last year. \"It became so metric-driven, to 'Are you moving this tiny needle by a little bit of an inch?' If not, don't do it.\" For years, Googlers were encouraged to explore side projects that weren't directly related to their job — something known as \"20% time.\" Some of these experimental projects eventually shifted to an internal incubator named Area 120, a nod to a joke among employees that 20% time had actually become \"120% time.\" In 2021, it cut short a policy that allowed employees to \"bungee\" into other Alphabet companies for several months. In 2022, it dramatically scaled back Area 120, shuttering several projects that were unrelated to AI and laying off most of its staff. A Google spokesperson noted that employees were still encouraged to pursue other projects, and pointed to work like AlphaFold and quantum computing and products like Magic Eraser as examples of innovation. Still, X — a moonshot lab that birthed Google's self-driving-car unit and explored exoskeletons and space elevators — has also curtailed its ambitions as it faces increased pressure to reduce losses. Historically, projects inside X considered good enough to stand on their own feet might \"graduate\" into a separate Alphabet company, but staffers were recently told, according to a report by The Information, that there would be no such graduations this year and that those close to graduating should seek outside funding and leave Alphabet entirely. A job at Google was once seen as a job for life. The company's engineers, constantly courted by rival tech firms, wouldn't even bother to take their calls or update their résumés. So news of a plan to cull its workforce by 12,000 people in January 2023 — around the time Microsoft and Amazon announced layoffs — landed with an unexpected thud. \"It came out of the blue, and nothing like that had ever happened before,\" the veteran staffer said. \"Twenty years of carefully built employee trust gone in an instant.\" The drip, drip, drip of layoffs continued into 2024, and the anxiety is palpable. \"It's now a zero-sum survival game,\" the veteran staffer added. \"Each employee feels pressured to join whatever team is least likely to have layoffs, and nobody feels any ownership over the culture anymore.\" The flip side of Google's \"Hunger Games\" is that smart people who challenge ideas and start debates are pushed to the side. It's a far cry from the Google of 2012, when its Project Aristotle study found that the strongest trait in high-performing teams was \"psychological safety.\" \"If you lose trust and psychological safety, it's virtually impossible to get the innovation,\" said Patrick Mork, who led marketing for Google Play before leaving the company in 2013. \"The minute it becomes too institutionalized and you slow down innovation, you lose the best people, because the best people hate bureaucracy.\" Googlers have long been allergic to bureaucracy. In 2018, more than a dozen vice presidents sent a letter to Pichai saying the company was moving too slowly and needed more decisive leadership, The New York Times reported. And employees have long circulated a document, titled \"Why everything is so darn hard at Google,\" criticizing the bottom-up structure. That unhappiness has not gone away. In a 2023 companywide survey obtained by Business Insider, more than three-quarters of respondents said they were proud to work at Google. But 45% — tens of thousands of employees — said bureaucracy was slowing down their work. The company appears to be aware of this creep. \"We're simplifying our structures,\" the Google spokesperson noted, while \"reducing bureaucracy and layers.\" As the company has grown, so has the number of new hires who might not have met the \"Googliness\" standard once required to enter the hallowed Googleplex. At Google Cloud, employees jokingly call the company \"Goracle\" — a reference to the hordes of employees who joined from Oracle, Salesforce, and other enterprise outfits that weren't typically seen as \"Googley.\" In 2018, a Google software engineer named Eric Lehman sent an email with the subject line \"AI is a serious risk to our business.\" In it, Lehman predicted a machine-learning system would outperform Google's search engine. Such a system, he mused, could be developed outside Google by a rival giant, \"or even a startup.\" \"Personally,\" he wrote, \"I don't want the perception in a few years to be, 'Those old school web ranking types just got steamrolled and somehow never saw it comin'...'\" Google has been working on artificial intelligence for well over a decade, quietly incorporating it into search, ad products, and YouTube video recommendations. It acquired DeepMind, the pioneering AI startup, in a cutthroat secret auction in 2014. In 2017, the company published a groundbreaking research paper that introduced a faster and more effective way for AI to parse information. It was so influential, in fact, that OpenAI used it as the foundation for ChatGPT. How Google failed to capitalize on its own discovery has been the ultimate question since ChatGPT arrived in 2022. People inside Google started pointing fingers: How could the company have let a small startup get ahead? Part of the answer may lie with its pesky aversion to risk. Caesar Sengupta, a former Google vice president, said that the company feared releasing generative-AI products that risked public backlash if they went wrong. \"Everyone would have skewered it,\" Sengupta, who launched and ran Google Pay, said. And skewer it they did this week with the Gemini debacle. A similar scenario unfolded with its voice assistant, according to two people familiar with the project. The company was afraid of being the first to launch a product, dubbed Google Mic, that it had internally developed but came with many potential privacy headaches. In the end, Amazon's Alexa debuted first, while Google was left to settle for second place. There's good reason to be cautious, as various public embarrassments with new technology have made clear. Pichai has also stressed the broader merits of waiting a beat. \"While some have tried to reduce this moment to just a competitive AI race, we see it as so much more than that,\" he wrote in 2023. \"What matters even more is the race to build AI responsibly and make sure that as a society we get it right.\" But this has meant that Google now often holds ready-to-release products back from launch and lets rivals make the first move. \"The fact that Google is not a decade ahead on generative AI is a joke, right? The fact that Google is not far and away the self-driving-car leader, it's, like, a total joke,\" the former Google director said, adding that the problem of Google's lost supremacy is \"maybe impossible to solve, frankly.\" There are some signs of hope. Google now is reminiscent of the Steve Ballmer-era Microsoft, which missed the smartphone, search, and cloud waves and was overtaken by Apple, Google, and Amazon. But under its current CEO, Satya Nadella, Microsoft performed an epic turnaround. Say it quietly, but for the first time in decades, Microsoft is sexy again. But a better comparison may be IBM: still big, but no longer dominant, having shed the freewheeling culture that bred innovation and made its brightest thinkers feel like anything was possible. Becoming the new IBM isn't all downside, but it's clear Silicon Valley's original tastemaker is no longer the belle of the ball. \"I think the bigger challenge they're facing is that everything becomes a utility,\" Sengupta said, \"and utilities are never sexy.\" Morphing from a magic factory to a power plant may simply be the logical end of the Great Google Culture Experiment. But this inflection point requires more-radical change than a few rounds of layoffs. Rivals like Meta and Microsoft have turned their fortunes around in recent years with more-decisive, top-down leadership, forging a cultural compromise between unconstrained innovation and corporate efficiency. As Google enters its next 25 years, it may well follow in an effort to reclaim its prestige — and in doing so, radically redefine what it means to be \"Googley.\" Hugh Langley is a senior correspondent at Business Insider, focusing on Google and tech investigations. You can reach him via encrypted messaging apps Signal and Telegram (628-228-1836) or email. Lara O'Reilly is a senior correspondent on Business Insider's tech desk, focusing on digital advertising. You can reach her via Telegram (@loreilly1) or email. Through our Discourse journalism, Business Insider seeks to explore and illuminate the day’s most fascinating issues and ideas. Our writers provide thought-provoking perspectives, informed by analysis, reporting, and expertise.\n                              Read more Discourse stories here. Related stories More from Tech Jump to "
}