{
    "title": "Alphabet (NASDAQ:GOOGL) Trading 0.3% Higher",
    "date": "3/20/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-percent-advance-2024-03-20/",
    "text": "Shares of Alphabet Inc. (NASDAQ:GOOGL - Get Free Report) were up 0.3% during trading on Wednesday . The company traded as high as $148.83 and last traded at $147.43. Approximately 5,528,054 shares traded hands during mid-day trading, a decline of 83% from the average daily volume of 31,692,750 shares. The stock had previously closed at $147.03. GOOGL has been the topic of a number of recent analyst reports. Tigress Financial raised their target price on shares of Alphabet from $172.00 to $176.00 and gave the company a \"strong-buy\" rating in a research note on Tuesday, November 21st. Redburn Atlantic raised their target price on shares of Alphabet from $150.00 to $165.00 and gave the company a \"buy\" rating in a research note on Wednesday, January 31st. Citigroup raised their target price on shares of Alphabet from $153.00 to $168.00 and gave the company a \"buy\" rating in a research note on Wednesday, January 31st. Susquehanna boosted their price objective on shares of Alphabet from $150.00 to $170.00 and gave the stock a \"positive\" rating in a report on Wednesday, January 31st. Finally, Wedbush restated an \"outperform\" rating and issued a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Five equities research analysts have rated the stock with a hold rating, twenty-six have assigned a buy rating and two have given a strong buy rating to the stock. According to MarketBeat, the company has a consensus rating of \"Moderate Buy\" and an average target price of $155.03. Get Our Latest Report on GOOGL The business's fifty day moving average is $142.62 and its two-hundred day moving average is $137.54. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The stock has a market capitalization of $1.85 trillion, a PE ratio of 25.64, a price-to-earnings-growth ratio of 1.36 and a beta of 1.04. Alphabet (NASDAQ:GOOGL - Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping analysts' consensus estimates of $1.60 by $0.04. The company had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same period last year, the company earned $1.05 earnings per share. As a group, research analysts anticipate that Alphabet Inc. will post 6.77 EPS for the current fiscal year. In other news, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the completion of the sale, the chief executive officer now directly owns 2,310,191 shares in the company, valued at $343,710,216.98. The transaction was disclosed in a filing with the SEC, which can be accessed through the SEC website. In related news, Director John L. Hennessy sold 200 shares of Alphabet stock in a transaction dated Wednesday, January 10th. The stock was sold at an average price of $143.49, for a total value of $28,698.00. Following the completion of the sale, the director now directly owns 6,784 shares in the company, valued at $973,436.16. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction dated Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total value of $3,347,550.00. Following the completion of the sale, the chief executive officer now owns 2,310,191 shares of the company's stock, valued at $343,710,216.98. The disclosure for this sale can be found here. Over the last ninety days, insiders sold 279,659 shares of company stock worth $39,460,310. 0.88% of the stock is currently owned by insiders. Institutional investors and hedge funds have recently made changes to their positions in the company. Live Oak Investment Partners purchased a new position in Alphabet in the fourth quarter valued at about $26,000. Vermillion & White Wealth Management Group LLC purchased a new stake in shares of Alphabet during the fourth quarter worth about $30,000. Sanctuary Wealth Management L.L.C. purchased a new stake in shares of Alphabet during the fourth quarter worth about $34,000. VitalStone Financial LLC grew its stake in shares of Alphabet by 1,900.0% during the second quarter. VitalStone Financial LLC now owns 280 shares of the information services provider's stock worth $34,000 after acquiring an additional 266 shares during the last quarter. Finally, Turim 21 Investimentos Ltda. purchased a new stake in shares of Alphabet during the third quarter worth about $38,000. 35.08% of the stock is currently owned by institutional investors. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.See AlsoFive stocks we like better than AlphabetHow Can Retail Investors Trade the Toronto Stock Exchange (TSX)?Is Ollies Bargain Outlet a Smart Buy-On Post-Release Weakness?What is an Earnings Surprise? Chipotle Stock Shoots Higher, Announcing 50 for 1 Stock SplitThe Role Economic Reports Play in a Successful Investment StrategyGeneral Mills Stock Price Reversal Gains Momentum on Good News Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Do you expect the global demand for energy to shrink?! If not, it's time to take a look at how energy stocks can play a part in your portfolio. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}