{
    "title": "Analysts Are Calling For Google CEO Sundar Pichai To Step Down Despite \nCompany's Massive Growth Under His",
    "date": "3/2/2024",
    "url": "https://www.benzinga.com/news/24/03/37440362/analysts-are-calling-for-google-ceo-sundar-pichai-to-step-down-despite-companys-massive-growth-under",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Alphabet Inc's Google GOOG is at a crossroads, with increasing scrutiny over its ability to keep pace with competitors. This has led to a growing number of voices within the tech community calling for a leadership change at the helm of the tech giant, specifically targeting CEO Sundar Pichai. Ben Thompson, analyst and author at Stratechery, recently suggested that Google requires a significant transformation, which might necessitate changes in leadership, including the potential replacement of Pichai. His sentiments were echoed by Bernstein internet analyst Mark Shmulik, who questioned whether the current management team is suited to navigate Google through the emerging AI era. According to a report by Business Insider, Google's recent missteps, including a notable error by its AI chatbot Bard during a public demonstration, have highlighted the company's struggles with rapid innovation amidst bureaucratic hurdles. Also Read: Google Salary Leak Reveals Mind-blowing Earnings Top Engineers Make In a newsletter, Thompson wrote,  Google is in need of a transformation that would mean \"removing those who let the former run amok, up to and including CEO Sundar Pichai.\" \"The most recent saga only further raises increasingly louder questions around whether this is the right management team to guide Google into this next era,\" Shmulik said in a statement. Pichai, who took the reins of Google in 2015 and Alphabet in 2019, has been praised for his steady leadership and diplomatic handling of regulatory challenges. Under his leadership, Google's market cap has soared to approximately $1.7 trillion from just over $400 billion. However, the current climate of AI innovation and competition has sparked debates about the company's direction and leadership efficacy. Also Read: Google Executives Threaten Workers With Layoffs, Say 'There Will Be Blood On The Streets': Report Business Insider noted that concerns about a \"stasis\" setting in at Google have been reported, with current and former employees feeling that the company's innovation engine is slowing down. This sentiment is compounded by the tech industry's rapid shift towards AI-driven solutions, with competitors quickly bringing new products to market. Meanwhile, predictions from Gartner suggest a 25% drop in traditional search volume by 2026 due to AI alternatives, underscoring the urgent need for Google to adapt. As the tech world watches closely, the question of whether Sundar Pichai will continue to lead Google and Alphabet into this new era remains open. Now Read: Employees Slam Google Leadership's Vision In Wake Of Layoffs: 'They Are All Profoundly Boring And Glassy-eyed' This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}