{
    "title": "Three Undervalued Stocks Drawing the Attention of Institutions",
    "date": "3/14/2024",
    "url": "https://www.marketbeat.com/stock-ideas/big-investors-like-what-comcast-schwab-alphabet-have-to-offer/",
    "text": " Comcast Corp. NASDAQ: CMCSA, Charles Schwab Corp. NYSE: SCHW and Alphabet Inc. NASDAQ: GOOGL are among institutional-quality large-cap stocks that are currently undervalued. There are a few reasons why institutions continue showing conviction when it comes to stocks priced below where their intrinsic value indicates they should be trading. Large-cap stocks like Comcast, Schwab and Alphabet have the advantage of being components of indexes like the SPDR S&P 500 ETF Trust NYSEARCA: SPY, which generally ensures continued institutional buying. The number of funds owning Comcast stock has grown in the past two quarters; that's reflected in Comcast's one-year return of 25.59%. The Comcast chart shows 10 months of upside trade in the past year, a sign that institutions are jumping on board. That has the potential to send the stock's price higher. The stock is currently consolidating; watch for it to overcome resistance below $48. According to a February research note from Argus analyst Joseph Bonner, \"Comcast's core cable business enjoys significant competitive advantages that we expect will endure for two decades or longer; that's why Morningstar awards Comcast a wide economic moat rating.\" Bonner added that he's expecting \"modest growth but strong cash flows from Comcast for the foreseeable future. Our key assumption is that Comcast will hold on to its position as a dominant internet access provider—and that will provide a solid foundation upon which the company can build customer relationships and deliver pricing power.\" Wall Street expects Comcast to earn $4.28 a share this year, an increase of 8%. In 2025, that's expected to rise by another 8% to $4.63 a share. Charles Schwab's institutional ownership data shows that the rate of buying versus selling is wildly lopsided. In the past 12 months, 1,501 institutional buyers accounted for $68.51 billion in inflows, while 884 institutional sellers accounted for $12.22 billion in outflows. The Charles Schwab chart shows you how the stock has bounced around in the past year while gradually advancing to a 14.99% one year return. Schwab earnings growth slowed among rising interest rates; clients moved billions out of Schwab sweep accounts, which pay low rates, to other types of outside accounts with higher yields. Wall Street expects Schwab earnings to begin growing again this year, although there's still uncertainty about interest rates, causing analyst to lower their growth forecasts. The Schwab analyst forecasts show a consensus view of \"hold\" on the stock. The consensus price target is $69.92, an upside of 4.42%. Communications services stocks lag most others on a one-month basis, as heavily-weighted sector component Alphabet is down 6.13% in that time. If you glance at the Alphabet chart, you'll see the stock consolidating below its January 29 high of $153.78. Alphabet stock, part of 2023's Magnificent 7 group of leaders, underperformed the Communication Services Select Sector SPDR Fund NYSEARCA: XLC in the past month. However, this is Google we're talking about. Yes, the company has had some recent missteps, including with its Gemini artificial intelligence-driven image generation feature. But Wall Street, and pretty much anybody with a pulse, understands that Alphabet still has room to grow. Analysts expect the company to earn $6.89 per share this year, an increase of 20%, while forecasting double-digit revenue growth in each of the next two quarters. When it comes to search, Google has established a significant competitive advantage. Institutional buyers seem to agree: Alphabet institutional ownership data show 3,151 institutional buyers accounting for $59.33 billion in inflows, while 2,557 Institutional sellers accounted for $53.53 billion in outflows in the last 12 months. Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here MarketBeat's analysts have just released their top five short plays for April 2024. Learn which stocks have the most short interest and how to trade them. Click the link below to see which companies made the list. Retirement, Asset Allocation, and Tax Strategies Kate Stalter has been a contributing writer for MarketBeat since 2021. Series 65-licensed investment advisor, financial advisor, Blue Marlin Advisors; investment columnist for Forbes, U.S. News & World Report Asset allocation, technical and fundamental analysis, retirement strategies, income generation, risk management, sector and industry analysis Bachelor of Arts, Saint Mary’s College, Notre Dame, Indiana; Master of Business Adminstration, Kellogg School of Management at Northwestern University Founder, financial advisor for Better Money Decisions; editor, stock trading instructor for Investor’s Business Daily; columnist, podcast host, video host for MoneyShow.com; contributor for Morningstar magazine Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}