{
    "title": "Alphabet (NASDAQ:GOOG) Trading Up 0.2%",
    "date": "3/29/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-goog-percent-advance-2024-03-29/",
    "text": "Alphabet Inc. (NASDAQ:GOOG - Get Free Report)'s share price traded up 0.2% during mid-day trading on Friday . The stock traded as high as $152.67 and last traded at $152.26. 21,105,628 shares changed hands during mid-day trading, a decline of 19% from the average session volume of 26,074,252 shares. The stock had previously closed at $151.94. A number of equities analysts have recently issued reports on GOOG shares. Susquehanna raised their price target on Alphabet from $150.00 to $170.00 and gave the stock a \"positive\" rating in a research note on Wednesday, January 31st. Raymond James upped their price target on shares of Alphabet from $150.00 to $160.00 and gave the company an \"outperform\" rating in a research report on Wednesday, January 24th. Five investment analysts have rated the stock with a buy rating, According to data from MarketBeat, the stock presently has an average rating of \"Buy\" and a consensus target price of $146.33. View Our Latest Analysis on Alphabet The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The stock has a 50-day moving average of $144.89 and a 200 day moving average of $139.48. The stock has a market cap of $1.89 trillion, a PE ratio of 26.25, a price-to-earnings-growth ratio of 1.40 and a beta of 1.05. Alphabet (NASDAQ:GOOG - Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The firm had revenue of $86.31 billion during the quarter, compared to analysts' expectations of $85.28 billion. During the same quarter last year, the company posted $1.05 earnings per share. The firm's revenue was up 13.5% compared to the same quarter last year. As a group, sell-side analysts anticipate that Alphabet Inc. will post 6.77 earnings per share for the current year. In other Alphabet news, CAO Amie Thuener O'toole sold 425 shares of the stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the transaction, the chief accounting officer now owns 27,259 shares of the company's stock, valued at approximately $3,805,628.99. The sale was disclosed in a filing with the SEC, which is available at the SEC website. In other Alphabet news, Director John L. Hennessy sold 200 shares of the business's stock in a transaction that occurred on Wednesday, January 10th. The shares were sold at an average price of $143.49, for a total value of $28,698.00. Following the completion of the sale, the director now directly owns 6,784 shares of the company's stock, valued at $973,436.16. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, CAO Amie Thuener O'toole sold 425 shares of the company's stock in a transaction that occurred on Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the sale, the chief accounting officer now directly owns 27,259 shares of the company's stock, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. Insiders sold a total of 263,312 shares of company stock valued at $37,268,315 over the last three months. 12.99% of the stock is currently owned by company insiders. Hedge funds have recently bought and sold shares of the stock. Financial Advisors Network Inc. boosted its holdings in shares of Alphabet by 4.5% in the 1st quarter. Financial Advisors Network Inc. now owns 161 shares of the information services provider's stock worth $450,000 after purchasing an additional 7 shares in the last quarter. Turim 21 Investimentos Ltda. raised its stake in shares of Alphabet by 10.8% during the first quarter. Turim 21 Investimentos Ltda. now owns 82 shares of the information services provider's stock worth $229,000 after acquiring an additional 8 shares in the last quarter. West Michigan Advisors LLC lifted its holdings in shares of Alphabet by 3.7% in the 1st quarter. West Michigan Advisors LLC now owns 252 shares of the information services provider's stock worth $704,000 after acquiring an additional 9 shares during the last quarter. Somerville Kurt F boosted its stake in shares of Alphabet by 10.3% in the 1st quarter. Somerville Kurt F now owns 118 shares of the information services provider's stock valued at $330,000 after purchasing an additional 11 shares in the last quarter. Finally, Stonebridge Capital Advisors LLC grew its holdings in shares of Alphabet by 1.4% during the 1st quarter. Stonebridge Capital Advisors LLC now owns 1,182 shares of the information services provider's stock valued at $3,301,000 after purchasing an additional 16 shares during the last quarter. 27.26% of the stock is owned by institutional investors. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.Further ReadingFive stocks we like better than AlphabetWhat Are Dividend Champions? How to Invest in the Champions3 Value Stocks Too Small For Buffett’s PortfolioInvesting in Construction StocksFoot Locker Builds Up Another Head of Steam; Gains ImminentWhat is the Australian Securities Exchange (ASX) Disney Stock Catches 3 Upgrades In a Single Week Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Wondering what the next stocks will be that hit it big, with solid fundamentals? Click the link below to learn more about how your portfolio could bloom. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}