{
    "title": null,
    "date": "3/21/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-boosts-healthcare-efforts-152000634.html",
    "text": "Alphabet’s GOOGL division Google revealed a few of its latest AI-backed efforts to deepen its penetration into the multi-trillion healthcare industry at its annual health event, which took place in New York City.Reportedly, a new AI feature powered by the company’s advanced AI model called Gemini is being developed by Google Research and Fitbit. The feature will help train Fitbit users on their personal health by leveraging data collected from their wristbands.Further, the search giant intends to provide AI-powered screenings for tuberculosis, lung cancer and breast cancer in India in collaboration with Apollo Radiology International. This initiative, which is currently subject to regulatory approvals, is meant to deliver 3 million free scans over the next 10 years.Google is also making efforts to enhance health information on its search engine and YouTube.  Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote The latest initiatives are in sync with Alphabet’s aggressive efforts to revolutionize the healthcare industry with the help of AI.Apart from these endeavors, Google recently launched Vertex AI Search for Healthcare, a generative AI-powered tool intended for the healthcare industry. The tool utilizes generative AI to assist clinicians search for information from patient notes, scanned documents and other clinical data. The tool's understanding of medical terminology and specific data points provides transparency and reduces hallucinations.Further, the company’s launch of MedLM, a family of generative AI models designed for the healthcare industry, remains a major positive. These models offer medical documentation testing, drug development research and chatbot provider identification.Google intends to expand MedLM capabilities with MedLM for Chest X-rays to help with their classification for operational, screening and diagnostics use cases, and a Condition Summary feature to enhance task-specific API capabilities.The company also offers Healthcare Data Engine, which provides interoperable patient data and clinical insights in FHIR format.The above-mentioned endeavors will aid the company in capitalizing on the growing demand for generative AI in the healthcare industry.Per a Global Market Insights report, generative AI in the healthcare market is expected to reach $22.1 billion by 2032, witnessing a CAGR of 32.6% between 2024 and 2032. A Precedence Research Report shows that the market is expected to hit $21.74 billion by 2032, seeing a CAGR of 35.1% over 2023-2032. Alphabet, which currently carries a Zacks Rank #3 (Hold), has intensified the healthcare battle with its above-mentioned efforts for its peers like Amazon AMZN, Microsoft MSFT and Oracle ORCL, which are also making concerted efforts to expand their footprints in the promising healthcare space.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.In this regard, Amazon’s extended collaboration with Philips to improve digital workflow integration and AI/ML capabilities in pathology labs and healthcare organizations with the support of its cloud computing platform, Amazon Web Services, remains noteworthy.This partnership will enhance digital pathology solutions, enabling labs to efficiently manage and analyze growing data, optimize workflows and integrate with existing healthcare systems for holistic patient care.Meanwhile, Microsoft’s partnership with Epic, which is about developing and integrating generative AI into healthcare by combining the scale and power of Azure OpenAI Service with the latter’s electronic health record (EHR) software, is a positive.Microsoft Azure’s introduction of the latest capabilities to free up clinicians' information, including patient timelines and clinical report simplification using generative AI, enabling healthcare professionals to extract and organize unstructured data for better understanding, is noteworthy.Oracle recently enhanced its Health Data Intelligence suite by introducing a generative AI service to boost care management efficiency. The suite enables healthcare stakeholders to use data for patient health improvement, care delivery and operational efficiency. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Oracle Corporation (ORCL) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}