{
    "title": null,
    "date": "3/8/2024",
    "url": "https://investorplace.com/market360/2024/03/goog-stock-forecast-was-the-chatbot-backlash-overdone/",
    "text": " GOOG stock investors don't need to bail after the initial Gemini fail Advertisement Source: rvlsoft / Shutterstock.com What can you do when a “Magnificent Seven” company briefly falls out of favor? In the case of Google and YouTube parent company, Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL), the right response may be to buy and/or hold some GOOG stock shares. After all, a misstep doesn’t mean it’s the end of the road for Google and Alphabet. As we’ll see, Google has received a lot of press coverage lately, but it’s not positive. Some investors will view this as a problem, but others will see an opportunity. Currently, we’re assigning a “B” grade to Alphabet stock, and we don’t see an immediate need for investors to panic-sell their shares. Interestingly, GOOG stock ended January at almost exactly $155 before the sellers took over. Evidently, some stock traders didn’t like Alphabet’s financial results, though they really weren’t too objectionable. Indeed, it’s not such a bad result that Alphabet’s diluted EPS increased 27% from 2022 to 2023. Still, Alphabet’s results might not have been spectacular enough for some spoiled short-term stock traders. Also, Alphabet (or, more precisely, Google) recently got hit with some backlash over the company’s Gemini artificial intelligence chatbot. To be honest, Google’s Bard AI chatbot was a flop. Yet, Google didn’t just give up. The company rebranded Bard as Gemini, a more powerful generative AI chatbot for 2024. However, it appears that Gemini is initially encountering issues. We won’t delve into the controversial details, but let’s just say that Gemini has been accused of showing bias. Google CEO Sundar Pichai acknowledged the backlash, stating, “I know that some of its responses have offended our users and shown bias — to be clear, that’s completely unacceptable, and we got it wrong.” So, Alphabet and Google fumbled with Gemini just as it did with Bard. Clearly, Alphabet isn’t the gen-AI chatbot king right now. That’s why GOOG stock, even if it’s part of the “Magnificent Seven,” earns a “B” grade instead of an “A.” On the other hand, it’s possible that the market has already priced its consternation into Alphabet shares. Alphabet’s GAAP trailing 12-month price-to-earnings (P/E) ratio is 23.64x, which is pretty reasonable for a “Mag-7” member. Just maybe, the market overreacted to Alphabet’s aforementioned financial report and to the Gemini misstep. Remember, the company still has a wide moat in the search engine market. Plenty of people use Google Search regularly and don’t care about the latest Gemini controversy. According to Bloomberg, Alphabet and Google control over 90% of the search engine market. That’s not just a competitive moat; that’s an ocean between Alphabet and its rivals. Since we’re assigning GOOG stock a “B” grade now, we’re not recommending that you overload your portfolio with Alphabet shares. However, if you view the share-price discount as overdone, you might choose to take advantage of the buying opportunity. In time, Alphabet and Google might finally perfect their gen-AI chatbot technology. In the meantime, Google’s search engine moat remains undisputed. So, if you’ve been waiting for a discount with Alphabet stock, today’s a good day to consider buying a few shares. On the date of publication, neither Louis Navellier nor the InvestorPlace Research Staff member primarily responsible for this article held (either directly or indirectly) any positions in the securities mentioned in this article. Artificial Intelligence, Cloud, Communications, Media, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/03/goog-stock-forecast-was-the-chatbot-backlash-overdone/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Stocks to Buy Hot Stocks Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}