{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.fool.com/investing/2024/03/01/best-ai-stock-to-buy-2024-wall-street-not-nvidia/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Analysts at BMO Capital see Alphabet (GOOGL 0.04%) (GOOG 0.21%) as the company best positioned to benefit from the growing demand for generative artificial intelligence (AI). The firm reasons that Alphabet has a big head start on most peers because its Google subsidiary has been integrating machine learning into core products for more than two decades. Additionally, analysts at JPMorgan Chase have also selected Alphabet as a top pick in 2024, due in part to the recent launch of machine learning model Gemini. The firm believes Gemini will narrow the generative AI technology gap between Alphabet and OpenAI, the creator of ChatGPT. That information may surprise some readers, given that Nvidia is often considered the gold standard among AI stocks. But a little research reveals an interesting pattern. Opinions regarding the best AI investments vary widely among Wall Street analysts, so investors should put very little confidence in such speculation. Instead, owning a basket of AI stocks is the most prudent strategy. Here's why Alphabet deserves a place in such a basket. Alphabet reported fourth-quarter results that beat estimates on the top and bottom lines. Total revenue increased 13% to $86.3 billion, a sequential acceleration driven by particularly strong momentum in Google Cloud and YouTube subscriptions. The only blemish was that Google Advertising revenue narrowly missed expectations. Meanwhile, generally accepted accounting principles (GAAP) earnings soared 56% to $1.64 per diluted share due to stock buybacks and the company's ongoing focus on expense management. On that topic, CFO Ruth Porat outlined plans to further improve operating efficiency by prioritizing key product development opportunities, simplifying organizational structure, and slowing the pace of hiring. The chart below provides more detail on fourth-quarter revenue growth across Alphabet's four primary business segments. The fourth-quarter revenue in Alphabet's four primary business segments. Hedging gains revenue was excluded because it accounts for less than 1% of total revenue. Chart by author. Central to the investment thesis for Alphabet is leadership in digital advertising. Its Google subsidiary is the largest adtech company in the world, accounting for 28% of digital advertising revenue last year, according to Insider Intelligence. That strong market presence is due to its ownership of popular platforms like Google Search, YouTube, Android, and Chrome. In fact, Google has 15 products that each serve at least 500 million users, all of which let the company collect data that helps advertisers run more effective campaigns. Google is using artificial intelligence (AI) to make its advertising ecosystem more attractive to internet users and advertisers. The company is still tweaking its Search Generative Experience, which brings generative AI to Google Search to \"serve a wider range of information needs and answer new types of questions,\" according to CEO Sundar Pichai. Google has also added a chat-based interface (powered by generative AI) to its adtech software to help advertisers build more relevant campaigns with less effort. Google lost about 150 basis points of market share in digital advertising over the last two years, and the company is projected to lose another 120 basis points in the next two years, according to Insider Intelligence. But AI innovations could reduce or even reverse that trend. Google Cloud is the third-largest provider of cloud infrastructure and platform services (CIPS) after Amazon and Microsoft. To be clear, Google is a distant third, but its strength in data analytics and strategic product development is helping the company gain share. Google accounted for 11% of CIPS spending in the fourth quarter, up from 10% one year earlier and 9% two years earlier. The company is laser-focused on expanding its AI capabilities to maintain that momentum. Most notably, Google recently introduced Gemini, a multimodal model that \"surpasses state-of-the-art performance on a range of benchmarks,\" according to the company. Gemini is now the power source behind Search Generative Experience and the conversational elements of its adtech software, but Google Cloud customers can also use Gemini to build custom generative AI applications that span text, image, video, audio, and code. Additionally, Gemini can automate tasks across Google Workspace, a suite of office productivity software. That includes drafting text in Google Docs, creating images in Google Slides, and organizing data in Google Sheets. Those capabilities keep Google on par with Microsoft, which has a generative AI assistant called Microsoft 365 Copilot that automates similar tasks across applications like Word, PowerPoint, and Excel. Collectively, those AI products (in combination with future innovation) could help Google gain share in cloud computing and office productivity software, though the company certainly faces tough competition from its big tech peers. Going forward, digital ad spending is forecasted to increase at 7% annually through 2028, and cloud services spending is projected to grow at 11% annually during the same period, according to Statista. That gives Alphabet a good shot at high-single-digit or low-double-digit sales growth. Indeed, Wall Street analysts expect the company to grow sales at 9.9% annually over the next five years. That consensus estimate makes its current valuation of 5.8 times sales look reasonable, and the current multiple is a nice discount to the three-year average of 6.3 times sales. At that price, investors should feel comfortable buying a small position in Alphabet stock today, remembering that a basket of AI stocks is the most prudent way to benefit from AI. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Trevor Jennewine has positions in Amazon and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, JPMorgan Chase, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}