{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/natwest-group-plc-increases-position-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 NatWest Group plc boosted its holdings in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 239.0% during the 4th quarter, according to the company in its most recent disclosure with the SEC. The fund owned 100,793 shares of the information services provider’s stock after buying an additional 71,057 shares during the quarter. Alphabet accounts for about  5.9% of NatWest Group plc’s investment portfolio, making the stock its 3rd largest position. NatWest Group plc’s holdings in Alphabet were worth $14,080,000 as of its most recent filing with the SEC. Several other hedge funds have also recently added to or reduced their stakes in GOOGL. Bornite Capital Management LP acquired a new position in  Alphabet in the first quarter worth approximately $16,688,000.  Markel Corp grew its position in  Alphabet by 17.0% during the 1st quarter. Markel Corp now owns 15,500 shares of the information services provider’s stock worth $43,110,000 after purchasing an additional 2,250 shares in the last quarter.  United Bank grew its position in  Alphabet by 5.9% during the 1st quarter. United Bank now owns 2,033 shares of the information services provider’s stock worth $5,654,000 after purchasing an additional 113 shares in the last quarter.  Mirae Asset Global Investments Co. Ltd. grew its position in  Alphabet by 23.4% during the 1st quarter. Mirae Asset Global Investments Co. Ltd. now owns 323,918 shares of the information services provider’s stock worth $900,929,000 after purchasing an additional 61,427 shares in the last quarter.  Finally, Dakota Wealth Management grew its position in  Alphabet by 20.4% during the 1st quarter. Dakota Wealth Management now owns 9,279 shares of the information services provider’s stock worth $25,806,000 after purchasing an additional 1,570 shares in the last quarter. Institutional investors and hedge funds own  35.08% of the company’s stock. In other news, CAO Amie Thuener O’toole sold 425 shares of the business’s stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the sale, the chief accounting officer now directly owns 27,259 shares in the company, valued at $3,805,628.99. The sale was disclosed in a filing with the SEC, which is accessible through the SEC website. In other news, CAO Amie Thuener O’toole sold 425 shares of the business’s stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total value of $59,334.25. Following the sale, the chief accounting officer now directly owns 27,259 shares in the company, valued at $3,805,628.99. The sale was disclosed in a filing with the SEC, which is accessible through the SEC website. Also, CEO Sundar Pichai sold 22,500 shares of the business’s stock in a transaction dated Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total value of $3,347,550.00. Following the completion of the sale, the chief executive officer now owns 2,310,191 shares in the company, valued at $343,710,216.98. The disclosure for this sale can be found here. Insiders have sold a total of 279,659 shares of company stock worth $39,460,310 over the last three months. Corporate insiders own  0.88% of the company’s stock. GOOGL has been the subject of a number of research reports. JMP Securities lifted their target price on shares of Alphabet from $150.00 to $160.00 and gave the company a “market outperform” rating in a research note on Wednesday, January 31st. BMO Capital Markets raised their target price on Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Wedbush raised their target price on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a report on Friday. Barclays lowered their target price on Alphabet from $180.00 to $173.00 and set an “overweight” rating on the stock in a report on Wednesday, January 31st. Finally, Needham & Company LLC  reaffirmed a “buy” rating and issued a $160.00 target price on shares of Alphabet in a report on Wednesday, January 31st. Five analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have given a strong buy rating to the stock. According to MarketBeat, the company  has an average rating of “Moderate Buy” and a consensus price target of $155.48. View Our Latest Stock Report on GOOGL Shares of Alphabet stock opened at $150.77 on Friday. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a 12 month low of $99.74 and a 12 month high of $153.78. The business has a fifty day simple moving average of $143.02 and a 200 day simple moving average of $137.79. The stock has a market cap of $1.87 trillion, a PE ratio of 25.99, a price-to-earnings-growth ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The firm had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. During the same period in the previous year, the firm earned $1.05 earnings per share.  Research analysts predict that  Alphabet Inc. will post 6.77 EPS for the current year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 571 Shares in The Boeing Company (NYSE:BA) Acquired by BKM Wealth Management LLC Vanguard S&P 500 ETF (NYSEARCA:VOO) Shares Bought by Willis Johnson & Associates Inc. "
}