{
    "title": "Alphabet's Gemini Genius: Why AI Hiccups Won't Derail GOOG's Dominance",
    "date": "3/11/2024",
    "url": "https://www.tradingview.com/news/investorplace:6e4e9259a094b:0-alphabet-s-gemini-genius-why-ai-hiccups-won-t-derail-goog-s-dominance/",
    "text": "Alphabet GOOG continues to command a huge share of the global digital ad market, while the company’s cloud unit is growing rapidly, has become profitable, and should be boosted by the AI Revolution. Speaking of AI, Alphabet’s technology in that area is strong, and the firm seems committed to quickly and fully remedying problems that recently surfaced with its AI offering. Finally, the valuation of GOOG stock remains quite attractive. Given these points, I recommend that long-term investors looking for increased exposure to the Magnificent 7 buy GOOG stock. The World’s Leading Digital Ad Business and a Thriving Cloud Unit Alphabet’s share of the global digital ad marketis now 39%, almost double the level of the next contender, Meta Platforms META, according to Seeking Alpha columnist KM Capital. When it comes to digital ads, Alphabet has many, very strong brands, including the Google search engine, YouTube, Gmail, and the Chrome browser. Given the tremendous extent to which these platforms dominate their respective markets, their dominance will probably not be meaningfully eroded anytime soon. Google Cloud reported$9.1 billion of revenue last quarter, generating almost 11% of Alphabet’s total top line. Google Cloud’s sales jumped 26% year-over-year. Moreover, the unit’s operating income came in at an impressive $864 million, versus an operating loss of $186 million during the same period a year earlier. What’s more, the adoption of Google Cloud’s AI platform appears to be growing rapidly, as the number of developers accessing the offering soared six times in the second half of 2023 versus the first half. Also noteworthy is that “thousands of companies” have utilized Cloud’s “AI-powered collaborator,” Duet AI, CEO Sundar Pichai reported. Given this data, I’m confident that Cloud’s revenue and operating income growth will accelerate as its AI offerings proliferate. Strong AI Technology and a Willingness to Fix Problems The initial popularity of Cloud AI offerings indicates that Alphabet’s AI technology is strong. Also noteworthyis that the firm’s AI model, Gemini, “was engineered to understand and combine video, audio, text, images and code.” Further, Alphabet recently reported that the latest edition of Gemini can rapidly evaluate more information than any other AI model. In fact, the system “can (quickly) process “1 hour of video, 11 hours of audio, codebases with over 30,000 lines of code or over 700,000 words.” And it can quickly “understand, reason about and identify curious details” about a 402-page technical transcript about “Apollo 11’s mission to the moon.” Additionally, Gemini is now separated into multiple neural networks that specialize in different tasks, and it only activates the networks needed to complete each assignment. This unique attribute should make the system more efficient, both in terms of time and computing power. Also impressively, Gemini allows users to choose which parts of its answers about which they want the system to provide more information. They can also ask Gemini to make portions of its answers shorter or to “rephrase” the information. Gemini, however, recently became embroiled in a mini-scandal, as it provided “historically inaccurate images” that offended many people and made an even larger number of people question its accuracy. But to their credit, Alphabet’s leaders relatively quickly apologized about the missteps and have promised to fix the issues. That response was the complete opposite of the response by Disney DIS, which doubled and tripled down on its positions after receiving similar criticism in 2022. Therefore, I’m convinced that Alphabet, unlike Disney, will not suffer lasting damage from its issue. The Attractive Valuation of GOOG Stock GOOG stock has a forward price-earnings ratio of 20, which is quite low, since analysts, on average, expect its earnings per share to climb to $6.79 this year from $5.80 in 2023. On the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}