{
    "title": null,
    "date": "3/25/2024",
    "url": "https://www.tradingview.com/symbols/SWB-ABE0/ideas/page-121/",
    "text": "Indicators peaked last week and start falling . Earnings on Monday and could be good surprise after latest disappointed quarters but if earning shows bad figures then 1st target will be 1355 and can be dropped to 1320-1280-1230 . Expected bounce should lead to 1484 .. \n1484 is bottle neck if touched it and pullback this will be good short signal too. if closed... This #googl trade was my best trade in 2020. I bought 10 call contracts at 1290usd strike price in december, and my contracts expired at 17th of January. One of the greatest trades in my life.\n\nI guess now we're started a correction (small bear market) and this is where i am watching and planning for the next bullish trades. I am not looking for puts because we're... Stock has worked off overbought conditions quickly and ready to surge once again\nMoving average support remains strong \nAbove $1500 nice entry for target to 1-2-1 Fibonacci expansion target GOOG  is primed.\n\nWith MSFT, AAPL, TSLA, and AMZN all blowing out Q4 reports and launching the stocks higher, GOOG reports on Monday, and one might expect an anticipatory 'piling-in' process in front of the report by traders expecting GOOG to follow suit. The Ichimoku Cloud is showing a big green signal on trend as well. long position GOOGL will report earnings late this month, but has an early earnings run underway. It has 2 consecutive common gaps. The gap was on Professional Trader volume activity. 1. So see all my AMD notes, and you can follow along since the first AMD post and see how we tracked the stock, day by day, almost to the price point the next day or within days. We are the newest iteration of the Prediction Company.\n\n2. We are lightening up on notes and analysis, and it is based on flows, quantitative analysis, sentiment, AI, neural networks, and... Moving averages need to catch up.\nRSI at previous bull run highs.\nOutside upper Bollinger band.\nMultiple Fibonacci extension and expansion targets now resistance.\nAny pullback a buying opportunity, $1350 should be support. global chart of google GOOG  Bearish Crab AW wake up ppl, you cant have such a zoomed in perspective, zoom out and look at the macro picture\n\nif this was bitcoin, you guys would be all over it, dont fight the trend Just some random thoughts, i actually think they have so much dominance in the overall market it's very hard for them to go down but..\n\nJust seeing this chart could make it very easy.. \n\nSupport turn resistance -> Support turn resistance\n\n\nAlso: More like a question in case anyone reads this:\n\nWhy is volume continuously falling? Google breaks and Retest All time high.. Resistance Turned Support at 1280-1300. \nPlan to Long with SL below 1270 (-30)\nNext Targe 1400 (+100) , 1460, 1570\n\nGood Risk Reward Ratio after a nice consolidation above resistance at 1300 price is looking to make a move higher\ntrade with channel Through Fund Manager I am the owner of Robert Laszlo Abraham. What are you looking for in my name Nazi man. I have my biometric IDs with the FBI and the CIA. I have Russian Orthodox Jewish ancestors. Even if you wipe them out you have them stupid. Sellers have come into market for profit taking causing divergence, to trade the retracement GOOGL Broadening formation Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}