{
    "title": "Google vs Indian startups: Apps take next big step against Alphabet Inc",
    "date": "3/5/2024",
    "url": "https://www.hindustantimes.com/technology/google-vs-indian-startups-apps-take-next-big-step-against-alphabet-inc-urge-cci-to-take-action-101709597173811.html",
    "text": "Subscribe Now! Get features like After Google's strict action against certain Indian apps, startup companies have decided to approach the central antitrust body against the big tech company, urging them to order Google to reinstate these apps on the Google Play Store, amid the ongoing showdown. The Centre-run Competition Commission of India (CCI), India's antitrust watchdog, has been asked by Indian apps to take action against Alphabet Inc's Google, urging the company to reinstate apps it removed for policy violations. The commission has already spent months looking into startups' complaints that Google is not following a 2022 antitrust directive that prevents it from taking adverse measures against companies which use alternate billing systems. Google denies wrongdoing. Read more: Google's apology over Gemini results on PM: 'Sorry, the platform is unreliable' This counter move by Indian startups comes days after Google decided to remove several apps from the Play Store after sending a letter to 10 Indian startups over the dispute regarding the non-payment of service fees. While Google did not name anyone in its blog post, the next day, apps like Matrimony.com and Jeevansathi were removed. The Alliance of Digital India Foundation (ADIF) in its March 1 letter to the CCI said Google's decision to remove apps was a \"brazen move\" which was anti-competitive and the regulator should ask the company to reverse its decision. Google's move will cause \"irreparable harm to the entire market\", ADIF said in the letter, which is not public. Indian companies have been actively criticizing the delisting of multiple apps by Google, slamming the big tech company for charging a platform service fee for Play Store. India's IT minister on Saturday said such removal of apps by Google \"cannot be permitted\". Read more: Google's Gemini chatbot issue: Will Sundar Pichai resign? ‘He is running amok' The dispute centres on efforts by some Indian startups to stop Google from imposing a fee of 11%-26% on in-app payments, after the country's antitrust authorities ordered it not to enforce an earlier fee of 15%-30%. Startup executives on Monday met India's deputy IT minister Rajeev Chandrasekhar who told them he was concerned by the removal of the apps and that his ministry will write to Google to ensure they are reinstated, according to two people familiar with the talks. Read more: 9 of 10 affected Indian app developers get some apps back on Google’s Play Store Last week, multiple apps such as Matrimony.com, Bharat Matrimony, Jeevansathi, Truly Madly and others were removed from the Google Play Store over a dispute for not paying the service. The parent company of these apps and Google have been urged by Centre to participate in a round of meetings to resolve these issues. (With inputs from Reuters)   "
}