{
    "title": "It's Time for This \"Magnificent Seven\" Stock to Join Its Rivals and Start \nContributing to This $1.7 Trillion Payout",
    "date": "3/17/2024",
    "url": "https://www.fool.com/investing/2024/03/17/its-time-for-this-magnificent-seven-stock-to-join/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Last year, companies around the world paid a record $1.7 trillion in dividends to their shareholders, a 5% increase from the prior year. Leading the way were tech titans Microsoft (MSFT -0.17%) and Apple (AAPL -1.06%) at $20.7 billion and $14.9 billion, respectively. Dividend payments are likely to set a new record this year. One catalyst is that fellow tech titan Meta Platforms (META -1.68%) initiated a dividend, which should total more than $5 billion this year. It's now the fourth member, along with Nvidia, of the vaunted \"Magnificent Seven\" to join the bandwagon of dividend-paying stocks. Among the holdouts is Alphabet (GOOG 0.21%) (GOOGL 0.04%). It's high time for the search giant to start paying dividends. Here's why. Microsoft, Apple, and Meta Platforms can afford to pay massive dividends because they generate huge cash flows. Over the past six months, Microsoft has produced $49.4 billion in operating cash flow. It returned $19.5 billion to shareholders through dividend payments ($10.6 billion) and share repurchases ($8.8 billion). Apple is also a cash flow machine. It generated $39.9 billion in cash from operating activities in its fiscal first quarter. It paid $3.8 billion in dividends and repurchased $20.1 billion in stock. Meanwhile, Meta Platforms produced $40.8 billion in net cash from operating activities last year and used $20 billion to repurchase shares. Alphabet is just as good at generating cash as its dividend-paying Magnificent Seven peers. Last year, the search giant produced a prodigious $101.7 billion in net cash from operating activities. While the company didn't use any of that money to pay dividends, it did return $61.5 billion to shareholders through repurchases. However, the company could easily follow Meta's approach when it initiated its dividend earlier this year. CFO Susan Li commented on Meta's new dividend policy on the fourth-quarter earnings conference call: Aside from organic investments, returning capital to shareholders remains important to us. We believe our strong financial position and performance will enable us to invest in the business while also continuing to return capital to investors over time. We've historically done so through share repurchases, and while we expect to maintain an active share repurchase program, we are modestly evolving our approach going forward by returning a portion of capital through a regular dividend. Another reason tech titans Microsoft, Apple, and now Meta Platforms are paying dividends is that they have a lot of cash on their balance sheets. Magnificent Seven Dividend Stock Cash, Cash Equivalents, and Short-Term Investments Total Debt Outstanding Net Cash Position Apple $172.6 billion $108 billion $64.6 billion Microsoft $81 billion $74.2 billion $7 billion Meta Platforms $65.4 billion $18.4 billion $47 billion Data sources: Company websites. Data as of the end of 2023. Apple's net cash position alone could fund its current dividend outlay for more than four years, while Meta's would last nearly a decade. Alphabet has an equally enormous cash position. It ended last year with $110.9 billion of cash, equivalents, and marketable securities against only $13.3 billion in debt. Like its peers, Alphabet produces more cash than it needs to grow its business. The money it doesn't return to shareholders through buybacks is piling up on its balance sheet. While the company might be strategically holding cash to make a sizable acquisition, that seems unlikely, since mergers and acquisitions aren't a big part of its growth strategy. The company's biggest deal was its $12.5 billion acquisition of Motorola Mobility in 2012. Other notable deals were relatively smaller including Nest at $3.2 billion in 2014, Fitbit at $2.1 billion in 2021, and YouTube at $1.7 billion in 2005. Between that and the increased regulatory scrutiny of acquisitions in the tech sector, Alphabet probably won't use its cash position to make a big deal. That leaves returning it to shareholders as the most likely outcome. On one hand, it's hard to argue with its share repurchase program. Alphabet has reduced its outstanding shares by 10% over the past five years, second only to Apple in this group. Alphabet could buy back even more shares, which wouldn't be a bad idea, since it has the lowest forward P/E ratio in this group at 21. However, a dividend could broaden its appeal to more investors, which could boost its valuation. Meanwhile, paying a dividend would put cash in the pockets of long-term holders, not those selling shares to Alphabet as part of the repurchases. Microsoft and Apple pay their investors billions of dollars in dividends each year. Meta is joining them this year. It's time for Alphabet to get on board, too. Like its peers, it produces massive cash flows, which are piling up on its balance sheet. It really doesn't have much use for that money, other than returning it to investors. While its buyback is doing a good job, the company can easily squeeze in a dividend to provide its investors with a little income. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Matt DiLallo has positions in Alphabet, Apple, and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}