{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/mcglone-suttner-wealth-management-inc-makes-new-168000-investment-in-alphabet-inc-nasdaqgoog.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 McGlone Suttner Wealth Management Inc. purchased a new position in shares of  Alphabet Inc. (NASDAQ:GOOG – Free Report) during the fourth quarter, Holdings Channel reports. The fund purchased 1,194 shares of the information services provider’s stock, valued at approximately $168,000. Other large investors also recently added to or reduced their stakes in the company. Brave Asset Management Inc. increased its position in shares of  Alphabet by 0.6% during the fourth quarter. Brave Asset Management Inc. now owns 66,185 shares of the information services provider’s stock worth $9,327,000 after acquiring an additional 392 shares during the period.  Meadow Creek Wealth Advisors LLC purchased a new stake in shares of  Alphabet during the fourth quarter worth $498,000.  Syntegra Private Wealth Group LLC increased its position in shares of  Alphabet by 31.6% during the fourth quarter. Syntegra Private Wealth Group LLC now owns 2,190 shares of the information services provider’s stock worth $309,000 after acquiring an additional 526 shares during the period.  Navalign LLC increased its position in shares of  Alphabet by 3.3% during the fourth quarter. Navalign LLC now owns 8,155 shares of the information services provider’s stock worth $1,149,000 after acquiring an additional 260 shares during the period.  Finally, Francis Financial Inc. increased its position in shares of  Alphabet by 90.8% during the fourth quarter. Francis Financial Inc. now owns 4,203 shares of the information services provider’s stock worth $592,000 after acquiring an additional 2,000 shares during the period. 27.26% of the stock is currently owned by institutional investors and hedge funds. In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the firm’s stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the transaction, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at $3,805,628.99. The sale was disclosed in a filing with the SEC, which is accessible through the SEC website. In other Alphabet news, Director Frances Arnold sold 230 shares of the firm’s stock in a transaction dated Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total transaction of $35,433.80. Following the transaction, the director now owns 15,104 shares of the company’s stock, valued at $2,326,922.24. The sale was disclosed in a filing with the SEC, which is accessible through the SEC website. Also, CAO Amie Thuener O’toole sold 425 shares of the stock in a transaction dated Tuesday, January 2nd. The stock was sold at an average price of $139.61, for a total transaction of $59,334.25. Following the sale, the chief accounting officer now owns 27,259 shares of the company’s stock, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. Over the last 90 days, insiders have sold 263,312 shares of company stock valued at $37,268,315. 12.99% of the stock is currently owned by insiders. A number of research firms have recently weighed in on GOOG. Susquehanna upped their price objective on Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a research report on Wednesday, January 31st. Raymond James increased their target price on Alphabet from $150.00 to $160.00 and gave the company an “outperform” rating in a report on Wednesday, January 24th. Five analysts have rated the stock with a buy rating,  Based on data from MarketBeat, the stock presently has an average rating of “Buy” and an average target price of $146.33. Check Out Our Latest Analysis on Alphabet NASDAQ:GOOG opened at $152.26 on Friday. The firm has a market capitalization of $1.89 trillion, a PE ratio of 26.25, a price-to-earnings-growth ratio of 1.40 and a beta of 1.05. The business’s fifty day moving average price is $144.89 and its 200 day moving average price is $139.48. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a 12 month low of $100.29 and a 12 month high of $155.20. Alphabet (NASDAQ:GOOG – Get Free Report) last issued its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.60 by $0.04. The company had revenue of $86.31 billion for the quarter, compared to analyst estimates of $85.28 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business’s quarterly revenue was up 13.5% compared to the same quarter last year. During the same quarter last year, the company posted $1.05 earnings per share.  On average, sell-side analysts anticipate that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOG? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOG – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 271 Shares in NIKE, Inc. (NYSE:NKE) Acquired by Planned Solutions Inc. "
}