{
    "title": "Google to set up new UK data centre with $1bn investment",
    "date": "1/19/2024",
    "url": "https://www.verdict.co.uk/google-new-uk-data-centre/",
    "text": "In addition to the investment, Google is also preparing for additional job cuts. Tech giant Google has commenced construction on a new data centre in UK, marking a significant $1bn (£790m) investment in the country’s technological infrastructure. The facility, set to be situated on a 33-acre site in Waltham Cross, Hertfordshire, aims to bolster the reliability of digital services for Google Cloud customers and users within the UK. The gold standard of business intelligence. Find out more Google said the data centre will support widely-used digital services such as Google Cloud, Workspace, Search, and Maps. This move is part of Google’s broader commitment to investing in technical infrastructure, which is pivotal for the company’s artificial intelligence (AI) advancements and the growing demand for cloud services in the UK. Google has been present in the UK for more than 20 years, and it employs more than 7,000 people at the moment. The new data centre is expected to facilitate further expansion of Google’s operations in the UK and Europe. Access the most comprehensive Company Profiles\n            on the market, powered by GlobalData. Save hours of research. Gain competitive edge. Your download email will arrive shortly We are confident about the\n                        unique\n                        quality of our Company Profiles. However, we want you to make the most\n                        beneficial\n                        decision for your business, so we offer a free sample that you can download by\n                        submitting the below form This development is an extension of Google’s ongoing investments in the UK, which contribute to the local economy and technological innovation. These investments include the Grace Hopper subsea cable, a London-based innovation hub, a research collaboration with the University of Cambridge, and a grant for the Centre for Human-Inspired AI, among others. UK Prime Minister Rishi Sunak said: “The UK is a fantastic place to invest, and Google’s $1bn investment is testament to the fact that the UK is a centre of excellence in technology and has huge potential for growth. “Foreign investment creates jobs and grows all regions of our economy and investments like this will help to drive growth in the decade ahead. I will continue to back businesses to invest and innovate here in the UK.” Alphabet and Google CFO, president  and chief investment officer Ruth Porat said: “People and organisations worldwide rely on Google’s data centres daily for the digital services they use. “This new data centre will help meet growing demand for our AI and cloud services and bring crucial compute capacity to businesses across the UK while creating construction and technical jobs for the local community.” In parallel to the investment, Google is also preparing for additional job reductions. Since 10 January 2024, the company has laid off more than a thousand employees across various units. As reported by The Verge, Google CEO Sundar Pichai has indicated to staff that more cuts are anticipated at the Alphabet-owned entity this year. Give your business an edge with our leading industry insights. The gold standard of business intelligence. Find out more Give your business an edge with our leading industry insights. Give your business an edge with our leading industry insights.  Thematic Take (monthly) I consent to Verdict Media Limited collecting my details provided via this form in accordance with  Privacy Policy View all newsletters from across the GlobalData Media network. Decrypting the latest technology news Powered by © Verdict Media Limited 2024 "
}