{
    "title": "What Google CEO Sundar Pichai’s Dream Career As A Child Was",
    "date": "1/10/2024",
    "url": "https://www.news18.com/business/what-google-ceo-sundar-pichais-dream-career-as-a-child-was-8733312.html",
    "text": "Curated By:  Business Desk Local News Desk Last Updated: January 09, 2024, 12:59 IST Delhi, India Sundar Pichai was the captain of his school cricket team in Chennai. Billions of people across the globe dream of landing a job at Google. It is because of the high salary, superb work culture, and stress-free environment that the company offers its employees. Additionally, the infrastructure of Google offices around the world is top-class. Interestingly, the CEO of the company is an Indian named Sundar Pichai, who was born in Tamil Nadu. Pichai, an IIT graduate, however, never wanted to become an engineer. Sundar Pichai joined Google in 2004 and has been working with the company since then. Currently, he is the Chief Executive Officer of Google and its subsidiary Alphabet Inc. His annual salary is approximately Rs 1,663 crore, which means that his monthly salary is Rs around Rs 1,38,66,588. In April 2023, it was reported that the Google CEO received a total compensation of approximately USD 226 million (approximately Rs 1,854 crore) in 2022. This means that he earned Rs 5 crore per day. The man who earns Rs 5 crore per day never aimed to become an engineer and rather wanted to become a cricketer in his childhood. Pichai was the captain of his school cricket team in Chennai and won many tournaments for his team. According to reports, the Google CEO is a big fan of Sunil Gavaskar and master blaster Sachin Tendulkar. However, he said in an interview that he does not enjoy the T20 format. Sundar Pichai did his schooling from Jawahar Vidyalaya Senior Secondary School, Chennai. He got his degree in Metallurgical Engineering from IIT Kharagpur and went to Stanford University and Wharton School of Pennsylvania University for further studies. After being employed at Google in 2004, he led the various product management in the company and headlined innovation efforts. In October 2015, he was appointed as the CEO of Google. Later, in the year 2017, Pichai also became the Alphabet Board of Directors in 2017. "
}