{
    "title": "Netflix downgraded, Alphabet initiated: Wall Street's top analyst calls",
    "date": "1/9/2024",
    "url": "https://finance.yahoo.com/news/netflix-downgraded-alphabet-initiated-wall-150627659.html",
    "text": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly. Top 5 Upgrades: Bernstein upgraded Domino's Pizza (DPZ) to Market Perform from Underperform with a price target of $370, up from $330, as it believes 2024 will be the first \"normal\" year for restaurants since 2019. Despite continued skepticism on the pizza category outlook, the near-term setup for 2024 has turned attractive and there are no immediate catalysts that could materially pressure Domino's, the firm adds. Morgan Stanley upgraded Crowdstrike (CRWD) to Overweight from Equal Weight with a price target of $304, up from $203. The firm sees an improving demand outlook for Crowdstrike as accelerating cyberattacks, multiple new products and generative artificial intelligence tailwinds should drive estimates upside. BofA upgraded United Airlines (UAL) to Buy from Underperform with a price target of $56, up from $40, given strong balance sheet execution despite high capex, steady demand and what it calls a \"favorable valuation.\" MoffettNathanson upgraded Paramount (PARA) to Neutral from Sell with a $13 price target. The \"will they, won't they\" story of Warner Bros. Discovery (WBD), Paramount and Comcast (CMCSA) \"has captivated,\" says the firm, with consensus seeming certain that the media assets of at least two of these three companies \"will emerge out of 2024 hitched together in one way or another.\" Piper Sandler upgraded GoDaddy (GDDY) to Overweight from Neutral with a price target of $121, up from $100, on a lower discount rate and higher terminal free cash multiple. Top 5 Downgrades: Citi downgraded Netflix (NFLX) to Neutral from Buy with an unchanged $500 price target. Across 2024 and 2025, the Street has lofty expectations for Netflix, but 2024 revenue estimates may be a tad too high, the firm argues. Morgan Stanley downgraded PayPal (PYPL) to Equal Weight from Overweight with a price target of $66, down from $118. The company's product evolution and progress on key strategic imperatives, such as improving Branded Checkout and expanding Venmo, which are key to supporting faster than e-commerce growth, are taking longer than initially thought, the firm says. BofA downgraded JetBlue (JBLU) to Underperform from Neutral with a price target of $3, down from $6. The firm expects the most unit cost pressure from domestic airlines that have growth limitations such as JetBlue and Spirit Airlines (SAVE). BofA also downgraded Frontier Group (ULCC) to Neutral from Buy with a price target of $6, down from $8. HSBC downgraded Morgan Stanley (MS) to Hold from Buy with a price target of $96, up from $90. The firm has also cut earnings estimates notably for Morgan Stanley in recent months even as the share price has risen, leading to a material increase in the valuation despite a softening outlook for wealth management revenue. Deutsche Bank downgraded Wells Fargo (WFC) to Hold from Buy with an unchanged price target of $51. The firm expects a weak net interest income guide for 2024 given likely lower rates and continued sluggish loan growth. Top 5 Initiations: BMO Capital initiated coverage of Alphabet (GOOGL) with an Outperform rating and $170 price target, calling it the firm's 2024 Top Pick in Internet. Google has integrated machine learning into its core products since 2000 and the firm cites the company's leading position in AI in the U.S. and globally for its bullish view on the shares. BMO Capital initiated coverage of Amazon.com (AMZN) with an Outperform rating and $200 price target. AWS will \"lead the foundational and middle layer of the gen AI/ML stack,\" while secular Cloud tailwinds will continue in 2024 and beyond, the firm tells investors, adding that on the retail side of the business, Amazon is positioned to invest in smaller same-day buildings with lower capex needs. BMO also started coverage of eBay (EBAY) and Wayfair (W) with Market Perform ratings and price targets of $49 and $57, respectively. BMO Capital initiated coverage of Meta Platforms (META) with a Market Perform rating and $397 price target. The firm advises investors to maintain positions near term, realizing likely very near-term upside from numerous favorable Q4 tailwinds, but does not recommend allocating new funds in Meta given its concerns about unforeseen growth headwinds into the second half of 2024 and beyond. BMO also started coverage of Snap (SNAP) with an Outperform rating and $22 price target, and Pinterest (PINS) with an Outperform rating and $45 price target. BMO Capital initiated coverage of Netflix (NFLX) with an Outperform rating and $566 price target. The \"visionary\" co-CEOs Ted Sarandos and Greg Peters position Netflix well for \"the next evolution of content creation and advertising growth,\" while $17B of content investment this year will position it well for continued market share gains relative to traditional linear TV, the firm argues. BMO Capital initiated coverage of Electronic Arts (EA) with an Outperform rating and $160 price target. The firm says EA has one of the most valuable audiences in sports, and that it continues to believe takeover chatter will support industry share prices. BMO Capital also started coverage of DraftKings (DKNG), Roblox (RBLX), Uber Technologies (UBER) and DoorDash (DASH) with an Outperform rating and $120 price target, and Lyft (LYFT) and Instacart (CART) with Market Perform ratings and price targets of $15 and $26, respectively. Related Quotes "
}