{
    "title": "Shifting Market Dynamics, Ambitious Projects Shape Alphabet's Value",
    "date": "1/5/2024",
    "url": "https://finance.yahoo.com/news/shifting-market-dynamics-ambitious-projects-190125426.html",
    "text": "In 2023, an extraordinary phenomenon unfolded in the stock market: The Magnificent Seven, a group of top-tier stocks, experienced a remarkable surge in their value, ranging from a solid 50% gain to a staggering 240% climb. This impressive performance catapulted them into the spotlight as some of the market's most lucrative investments. Amid this financial whirlwind, a particular focus has been placed on Google parent Alphabet Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL). Savvy investors, delving into the nuanced world of financial metrics, have pointed out the company's forward price-earnings ratio is notably lower compared to its peers in the Magnificent Seven, raising concern. Alphabet's valuation portrays the market's anticipation of its future, influenced by pivotal factors such as the seismic shifts brought about by artificial intelligence-driven changes in online consumer behavior, Google's fluctuating share in the digital advertising market and the looming shadow of an antitrust lawsuit. Source: Analyst's compilation The market attributes a higher price-earnings ratio to Apple (NASDAQ:AAPL) and Microsoft (NASDAQ:MSFT), while Meta Platforms (NASDAQ:META) falls within a comparable range when juxtaposed with Alphabet. The price-earnings ratio is not an arbitrary figure that an investor can assign to determine value, as it has implicit cash flow assumptions. A business that generates a high return on invested capital has more potential to drive growth in cash flow. A high ROIC indicates a company's superior profitability and efficiency in capital allocation. This distinction becomes evident when comparing Apple and Microsoft to Google and Meta. Apple and Microsoft have consistently outperformed Google and Meta in terms of return on invested capital. Their last 10-year average ROICs stood at 25.90% and 16.6%, respectively, while Google and Meta's stood at 13% and 16.20%, respectively. As a result, the figures show the other three peer companies have outperformed Google in terms of profitability and capital efficiency. On the contrary, the other three companies in this group, Amazon (NASDAQ:AMZN), Nvidia (NASDAQ:NVDA) and Tesla (NASDAQ:TSLA) may not boast impressive ROIC, but their allure lies in higher growth potential, for which investors willingly pay a premium. Specifically, Nvidia and Tesla, being smaller in terms of revenue size, contribute to their distinct valuation dynamics. Meanwhile, Amazon consistently maintains a high price-earnings ratio due to investor optimism surrounding its expanding presence in the retail sector and dominance in the cloud business. However, the search giant's declining market share in digital ad revenue is generating concerns, introducing a nuanced landscape. Lastly, the increasing use cases of AI represent both an opportunity and a threat to its existing business model, while developments in anti-trust lawsuits add a layer of skepticism. Source: Analyst's compilation Alphabet recently outperformed expectations for its quarterly performance, beating earnings per share estimates by 6%, rebounding from a slowdown experienced in previous quarters. However, apprehensions persist, particularly concerning Google's search and overall ad revenue business. Lastly, its search revenue accounts for approximately 57% of total revenue and around 73% of total advertising revenue. Source: Analyst's compilation While you may consider it cyclical, the declining market share in digital ad revenue does pose a question of whether Alphabet is losing its long-established dominance in this space. Meta Platforms and Amazon continue to gain market share in the digital ad revenue market, while Google experiences a decline. Moreover, the way we retrieve information on the internet is changing. AI chatbots are supplanting many of the activities we traditionally performed on search engines. The company realizes the threat to search ad revenue, prompting it to actively address the challenge and make rapid strides in integrating AI across all its services. Source: InsiderIntelligence.com The recent launch of Gemini, a family of large language models by Google, seems exciting, as it can counter the threat of other LLMs like GPT-4, Claude and Llama. However, it still needs to solve the challenges in the existing business model, where search contributes the most to the business. Alphabet's cloud division has experienced impressive growth, yet it operates in a highly competitive landscape where Amazon and Microsoft dominate. Investors are dissatisfied with the recent slowdown in the growth of the cloud business, which decreased to 22.5% year over year during the third quarter from 37.6% a year prior. Alphabet's Google is under legal scrutiny amid allegations of employing questionable tactics to uphold its status as the world's foremost search engine. The U.S. Justice Department claims Google paid massive sums to companies like Apple to make it the default search engine on their devices. Google also admitted that it shares 36% of revenue with Apple for the search results on the iPhone. We could draw several scenarios from this lawsuit. The first scenario is that Google wins the case and stays the default search engine on devices like iPhones, and their partnership with Apple remains the same. There is another scenario that may go in favor of Google. If the DOJ compels Apple to display a choice screen where users can select their preferred search engine, a majority would likely choose Google, and the search giant would not have to pay anything to Apple. But the worst-case scenario would be that Apple develops its own native search engine that would be the default for its Safari browser on all devices, and users would not have any choice. Being a default search engine is a huge advantage because most people who put search queries on the browser address bar need to intuitively think about which search engine they post their queries in. Since Apple will be losing out on revenue from Google in this scenario, there is a possibility that it will try to come up with its own native search engine to recoup the lost revenue. Hence, this scenario could harm Google's search revenue as Safari, Apple's native browser, holds around 20% market share. Google's other bets include several projects. In the recent earnings call, the company mentioned Waymo (an autonomous driving technology company) onboarded more riders to its commercial ride-hailing service as it gradually added over 100,000 people from its San Francisco waitlist. At the same time, Wing, a drone delivery service owned by Google, has unveiled a strategic collaboration with Walmart (NYSE:WMT) to offer drone delivery services in the Dallas-Fort Worth area. While these developments are exciting, they have yet to reach a level of significance that would substantially impact the company's financials or long-term potential. Further, in the age of AI, how we retrieve information online is changing. While Google is responding to these changes, its predominant business model, centered around search engine queries, faces potential risks stemming from shifts in how users consume information. As we stand on the precipice of a new digital era, the shift from traditional search engines to AI-driven chatbots marks a pivotal change in consumer behavior. The relentless advancement of LLMs is poised to revolutionize how we seek information, potentially rendering traditional search queries obsolete. This evolution raises critical questions about the future of advertising in an AI-dominated landscape. While the full extent of these changes remains shrouded in the mists of the future, their potential impact on giants like Alphabet cannot be underestimated. For investors, concerns over these AI-induced shifts challenging the company's dominance in search revenue are justified and crucial in navigating the uncertain waters of technological progression. This article first appeared on GuruFocus. Related Quotes "
}