{
    "title": "Alphabet, Amazon and Microsoft face FTC probe into AI ‘investments and \npartnerships’",
    "date": "1/25/2024",
    "url": "https://www.marketwatch.com/story/alphabet-amazon-and-microsoft-face-ftc-probe-into-ai-investments-and-partnerships-b757c380",
    "text": "The Federal Trade Commission said Thursday it will look closely at the generative-artificial-intelligence investments and partnerships of Alphabet Inc. \n        GOOGL,\n        +0.04%\nGOOG,\n        +0.21%,\n       Amazon.com, Inc. \n        AMZN,\n        +0.31%,\n       Anthropic PBC, Microsoft Corp. \n        MSFT,\n        -0.17%\n       and OpenAI Inc. Microsoft has invested more than $10 billion in OpenAI, while Alphabet has agreed to plow up to $2 billion in Anthropic. “History shows that new technologies can create new markets and healthy competition. As companies race to develop and monetize AI, we must guard against tactics that foreclose this opportunity,” FTC Chair Lina  Khan said in a statement. “Our study will shed light on whether investments and partnerships pursued by dominant companies risk distorting innovation and undermining fair competition.” The agency cited section 6(b) of the FTC Act, which allows it to scrutinize corporate partnerships and investments with AI providers and their impact on the competitive landscape. The study allows the FTC to look into the AI companies separately from its law-enforcement arm and to make civil investigative demands, such as ordering companies to file specific reports and answer questions in writing about their businesses. Also read: The Sam Altman drama knocked Microsoft’s stock around. So why is its deal with OpenAI largely a secret to Wall Street? “Big Tech companies are using their dominance to insert themselves into AI companies and take advantage of AI being the technology of the moment,” Emily Peterson-Cassin of nonprofit social-welfare organization Demand Progress, said in a statement. The agency’s inquiry is the latest by federal regulators into the broad reach of Big Tech and its impact on the trillion-dollar tech economy. The FTC has aggressively pursued action against Amazon and Facebook parent Meta Platforms Inc. \n        META,\n        -1.68%\n       while the Justice Department has sued Alphabet and is expected to announce a case against Apple Inc. \n        AAPL,\n        -1.06%\n       as early as March. At the same time, the U.S. Senate is holding forums with AI leaders on the responsible growth of the technology and its implications for jobs, hiring practices, and the overall national economy. Late Thursday, Alphabet ended contractual work with Appen, the AI data firm that helped train Google’s chatbot Bard and Google Search results. “Under Lina Khan, the FTC is taking on the nuances of ‘partnerships’ vs. ‘acquisitions,'” says Thomas Smale, chief executive of FE International, tech M&A advisory firm. “Microsoft’s lawyers argue their deal with OpenAI is a partnership, not an acquisition, highlighting the complexities in current antitrust law applications. “The FTC’s aggressive stance raises questions: Will this deter broader tech investment in AI startups? Or is this just playing catch up? Either way, investors and deal makers have to factor this risk into their decision-making within this AI boom.” The company says the leaked data set seems to be from 2019 or earlier. Jon Swartz is a senior reporter for MarketWatch in San Francisco, covering many of the biggest players in tech, including Netflix, Facebook and Google. Jon has covered technology for more than 20 years, and previously worked for Barron's and USA Today. Follow him on Twitter @jswartz. Visit a quote page and your recently viewed tickers will be displayed here. "
}