{
    "title": "What Makes Alphabet (GOOG) an Attractive Long-Term Investment?",
    "date": "1/15/2024",
    "url": "https://finance.yahoo.com/news/makes-alphabet-goog-attractive-long-102426056.html",
    "text": "Tsai Capital Corporation, an investment management firm, released its fourth quarter 2023 investor letter. A copy of the same can be downloaded here. For the year ended December 31, 2023, the Tsai Capital Growth Equity Strategy gained 56.81%, gross of fees, and 55.07%, net of fees, as compared with a total return of 26.29% for the S&P 500 Index. Since its inception 24 years ago, the strategy gained 691%, before fees, and 472%, after fees, compared to a 401% total return for the index. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Tsai Capital Corporation featured stocks such as Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On January 12, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $144.24 per share. One-month return of Alphabet Inc. (NASDAQ:GOOG) was 7.77%, and its shares gained 55.43% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.795 trillion. Tsai Capital Corporation stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: \"Alphabet Inc. (NASDAQ:GOOG) ($140.93 – up 58.8% for the year. Recent high $143.95) Alphabet, led by Sundar Pichai, has a near monopolistic position in online search, with more than 90% of the global market and greater than 80% of the U.S. market. The company also owns YouTube, which it purchased in 2006, and is now the second most popular website globally, followed by Google Search. While there are valid concerns about disruption from Artificial Intelligence (AI) and large language models (LLM), and competition for YouTube, we believe the economic moats for both businesses remain intact. We also think the Google ecosystem, which benefits from strong network effects, will drive advertising revenue at a high single-digit rate for at least the next five years. Alphabet also owns one of the three major cloud companies (Google Cloud Platform) and has a number of private businesses that, while not profitable today, have the potential to become more valuable to shareholders over time. The company’s balance sheet is strong, with approximately $106 billion of net cash ($8.48/share), and free cash flow conversion remains excellent.\" A laptop and phone open to Google's services in an everyday setting. Alphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 163 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of third quarter which was 152 in the previous quarter. We discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared the list of best AI stocks for 2024. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.  Suggested Articles: 16 Best Mid-Cap Growth Stocks To Buy Now 11 Hot Oil Stocks To Buy Now 12 High Growth Monthly Dividend Stocks to Buy Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}