{
    "title": "Here's What May Spark the Next Big GOOG Stock Rally",
    "date": "1/14/2024",
    "url": "https://investorplace.com/market360/2024/01/heres-what-may-spark-the-next-big-goog-stock-rally/",
    "text": " There’s plenty to drive another big rally later this year for GOOG stock Advertisement Source: rvlsoft / Shutterstock.com Alphabet (NASDAQ:GOOGL,NASDAQ:GOOG) stock is up 55.7% over the past twelve months. As with other “Magnificent Seven” tech stocks, many investors are less confident of a 2023 repeat. Shares may gain slower in 2024, but it’s not the worst scenario. Many stocks that performed well last year are at risk of declining this year. GOOG stock isn’t in that category for two reasons. Continued steady earnings growth is expected in the upcoming quarters, and news about generative AI growth could boost Alphabet’s valuation. With this, read on, as I explain why. Over the past few quarters, a successful cost-cutting strategy, coupled with a rebound in digital advertising demand, resulted in a strong earnings rebound for Alphabet. For instance, last quarter, the tech giant reported overall earnings growth of 46.2% compared to the prior year’s quarter. In the quarters ahead, Alphabet’s earnings aren’t likely to rise to this degree, given how much of what drove this earnings rebound was of the “one and done” nature. That said, this doesn’t mean sluggish earnings growth ahead for GOOG stock. Forecasts call for the global ad spending to keep bouncing back, especially for the digital ad market. Now reaching the point of profitability, continued growth for Google Cloud (which last quarter came in at around 22.5%) may mean that this segment soon becomes a much more meaningful contributor to Alphabet’s bottom line. Alongside this, Alphabet, like its big tech brethren, continues to find new cost reduction opportunities. As of this writing, the company has announced another round of layoffs. While unfortunate for those affected, it is a promising sign for investors that the company, after shifting to a more bottom-line focused approach last year, is sticking to said new approach. Alphabet appears well-positioned to meet, or even beat, earnings forecasts. For 2024, present sell-side consensus calls for earnings of around $6.66 per share. That would represent around a 16% increase compared to 2023. Again, far less stellar than the earnings growth reported in recent quarters, but it’s likely sufficient for sustaining the current valuation of GOOG stock (around 25 times earnings). The prospect of shares gaining by around 16% this year (in tandem with increased earnings) isn’t anything to sneeze at. However, there’s something to get really excited about. This brings us to the second potential driver for GOOG: further progress with generative AI endeavors. Examples of Alphabet’s AI projects include its recently-released AI model Gemini, as well as its chatbot, Bard. In the months ahead, the company could further convey to investors that it has caught up to first movers in the space, and instead of being threatened by them, could give them a run for their money. If this happens, the market may re-rate shares. “Magnificent Seven” stocks perceived to have stronger generative AI catalysts currently trade at price-to-earnings (or P/E) ratios in the 30s or higher. For GOOG to hit $200 per share (representing a 39.2% jump from today’s prices), all it may take is for the company to meet earnings expectations, and experience a moderate level of multiple expansion (P/E ratio rises from around 25 to around 30). An earnings beat, coupled with a re-rating to a mid-30s P/E ratio, would cause a more spectacular leap this year. Don’t get me wrong. It’s not set in stone that things will play out this way. Even so, consider all of this food for thought, if more pessimistic views on GOOG have you thinking about exiting an existing position. Although another round of market volatility may create a better entry point, if you’ve been looking to initiate a position, now may be the time to do so. GOOG stock earns a B rating in Portfolio Grader. On the date of publication, neither Louis Navellier nor the InvestorPlace Research Staff member primarily responsible for this article held (either directly or indirectly) any positions in the securities mentioned in this article. Artificial Intelligence, Communications, Media, Streaming, Technology   Louis Navellier is one of Wall Street’s renowned growth investors. Providing investment advice to tens of thousands of investors for more than three decades, he has earned a reputation as a savvy stock picker and unrivaled portfolio manager. Article printed from InvestorPlace Media, https://investorplace.com/market360/2024/01/heres-what-may-spark-the-next-big-goog-stock-rally/. ©2024 InvestorPlace Media, LLC Market Analysis Stocks to Buy Stocks to Sell Stocks to Buy Hot Stocks Stocks to Sell Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}