{
    "title": "Layoffs continue at Google, people from its secret research lab Moonshot X \nterminated",
    "date": "1/23/2024",
    "url": "https://www.firstpost.com/tech/layoffs-at-google-continue-people-from-its-secret-research-lab-moonshot-x-terminated-13646782.html",
    "text": "Google’s Moonshot X or X, launched by Google co-founders Larry Page and Sergey Brin, is renowned for exploring groundbreaking solutions to significant challenges like climate change and connectivity. Now, they too are laying off people Alphabet’s innovative technology lab, known as X, is undergoing a strategic shift and laying off several employees as it seeks external funding to support its ventures. The division, recognized for pursuing ambitious projects, is in discussions with venture capitalists and other investors to secure funding. X aims to establish a new structure allowing its projects to spin out as independent startups with backing from Alphabet and external investors. Eric Teller, who leads X, communicated the changes to staff in an email obtained by Bloomberg. In the email, Teller stated, “We’re expanding our approach to focus on spinning out more projects as independent companies funded through market-based capital.” The restructuring involves layoffs, predominantly affecting support staff. The move aligns with X’s effort to emphasize lean teams, capital efficiency, and collaboration with a broader base of industry and financial partners. X, launched by Google co-founders Larry Page and Sergey Brin, is renowned for exploring groundbreaking solutions to significant challenges like climate change and connectivity. However, the lab has faced increasing pressure to transform speculative ventures into profitable businesses. The restructuring comes as part of Alphabet’s broader cost-cutting initiatives. The move to seek external funding is seen as a shift from X’s previous reliance on Alphabet for financial support. The lab has explored raising outside capital in the past, but concerns from Alphabet leadership hindered such efforts. X has engaged with various funding sources, including venture capital, family offices, sovereign wealth funds, private equity firms, and strategic investors. Alphabet has been taking steps to streamline its operations and reduce costs. This month, Google eliminated hundreds of jobs, focusing on teams such as hardware and engineering, as it sharpens its focus on artificial intelligence. The restructuring at X is expected to give the lab more flexibility in pursuing ambitious projects and taking moonshots independently. Teller emphasized the importance of continuing to invent breakthrough technologies to address pressing global challenges, stating, “Because the world needs moonshots more now than ever.” The changes at X coincide with Ruth Porat, Alphabet’s Chief Financial Officer, moving into a new role as president and chief investment officer, overseeing divisions that include X. (With inputs from agencies) Find us on YouTube is on YouTube Copyright @ 2024. Firstpost - All Rights Reserved "
}