{
    "title": "Google parent: Alphabet quarterly revenue misses analyst expectations",
    "date": "1/31/2024",
    "url": "https://www.afr.com/technology/google-used-to-bet-on-moonshots-ai-has-forced-it-back-to-basics-20240131-p5f19h",
    "text": "Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login When the artist formerly known as Google renamed its parent company Alphabet, the plan looked simple. Google’s advertising business would generate billions in profit that would be channelled to Alphabet’s “moonshot bets”, such as delivering the internet via hot air balloons and generating renewable power through advanced kites. But counterintuitively, AI has not encouraged Alphabet’s flights of fancy. Instead, it has forced the company back to earth, presaging how it might affect the broader economy. Alphabet and Google CEO Sundar Pichai is overseeing a company that is ditching its flights of fancy to focus on getting AI into its core business. David Rowe The news: Alphabet reported its fourth quarter results on Wednesday AEDT, reporting $US86.3 billion in revenue, up 13 per cent, and $US20.6 billion in profit, up 52 per cent. That beat analysts’ revenue forecasts, according to data from the London Stock Exchange Group, but Google’s advertising numbers disappointed Wall Street, sending shares down about 6 per cent at 9.45am. (Microsoft, the other major technology stock to report on Wednesday with a huge bet on AI, beat analysts’ earnings forecasts slightly, leaving its shares roughly flat.) Behind those headline numbers, Alphabet is retooling its business for AI. Hiring is slower, except for the engineers Google needs to improve its AI. The hot air balloon internet and power generating kites are long gone from the “moonshot bets”, but Alphabet flagged it was trying to get its remaining bets to find external capital. Staff in Google’s sales divisions have been reorganised, with substantial redundancies, including in Australia. The scale is huge: Alphabet plans to spend $US700 million on redundancy payments next quarter alone. But that all leaves more cash for AI long term. What’s driving it: The notion that chatbots would undermine Google’s search – and therefore advertising – dominance have so far proved alarmist. But that doesn’t mean the risk isn’t there if Google were to rest on its laurels. And so, at great cost, it is making more AI tools available in more parts of its business. More ads are auto-generated, more audiences are targeted automatically, and content displayed across Google platforms. Google is working to improve its own chatbots too. The cost? Alphabet spent $US11 billion ($16.7 billion) on capital expenses, up from $US7 billion in the same quarter last year, which overwhelmingly went to the data centres and servers it needs to run AI tools. Our take: ”We’re not restructuring because AI is taking away roles, that’s important here,” Google’s chief business officer, Philipp Schindler, said on Wednesday’s earnings call. That may be true in the sense that a machine is not replicating exactly what a Google ad salesperson once did. On net though, it’s clear that machines are doing more work selling ads for Google and people are doing less. That’s unfortunate for the salesperson, but it makes sense for Google, and the other companies that are in the similar position of leading their industries but facing AI disruption. No one wants to go the way of so many newspapers that failed to take the internet seriously 20 years ago. The Breakdown is a regular column that unpacks and explains big stories from the tech world. Copy link Copied Copy link Copied Subscribe to gift this article Gift 5 articles to anyone you choose each month when you subscribe. Already a subscriber? Login Follow the topics, people and companies that matter to you. Fetching latest articles The Daily Habit of Successful People "
}