{
    "title": "Despite Record Profits, Google Lays Off Over 1,000 Workers As Many Top \nDeepMind AI Scientists Leave To Start Their ...",
    "date": "1/24/2024",
    "url": "https://finance.yahoo.com/news/despite-record-profits-google-lays-150315339.html",
    "text": "A recent string of bad news has done nothing so far to harm the stock of Google parent company Alphabet Inc. (NASDAQ:GOOGL), which has been on a tear to start the new year while riding the broader tech-focused rally. Two senior scientists from DeepMind Technologies Ltd., an artificial intelligence (AI)-focused subsidiary of Alphabet, announced they were leaving the company to form their own startup. Rumors are that the scientists forming their new company are in talks to have a financing round of around $217 million to help build their AI model. This isn't the first time researchers from DeepMind left Alphabet to raise huge amounts of money on their own. An early-stage company called Mistral AI shared last month that it recently raised about $420 million in its second funding round in just seven months. Don't Miss: Funders on this alternative asset platform are earning more than 14% annualized consignment profit funding Pro consignment opportunities. This startup is accepting investors for as little as 25 cents – what’s the catch? Here is where your most successful angel investment may be hidden. While the scientists are leaving on their terms, many Google employees were not so lucky, as Google recently let go over 1,000 people. Worse yet, Google CEO Sundar Pichai circulated a memo to the company to expect more layoffs to come. Sundar described \"ambitious goals\" where Google will be \"investing in our big priorities this year.\" Most likely, these ambitious goals refer to AI. One can only speculate why the scientists are leaving, but it does not speak well to belief in Google's ability to continue innovating compared to cutting costs to drive profits. These leading AI scientists can work anywhere — not just Microsoft Corp.'s OpenAI, but also on their own ideas with outside funding. It's funding that might have been incubated in Google's own Moonshot Factory, formally called X Development. This is the same division that formed the self-driving car startup, Waymo. Posts by both current and former employees have publicly blasted the culture for lacking the ability to continue innovating. Google employee Diane Hirsh Theriault wrote a scathing summary of the leadership on her LinkedIn page, saying, \"From the C-suite to the SVPs to the VPs, they are all profoundly boring and glassy-eyed.\" Not only are there hints of a deteriorating culture, but recent product launches have also been marred in controversy. Trending: Copy and paste Mark Cuban’s startup investment strategy according to his colorful portfolio. Consider just before the end of the year when Google unveiled its largest and most capable AI model called Gemini. Taken at face value, the six-minute video demo was impressive. Gemini made tasks such as voicing aloud its description of a drawing of a duck seamless, showcasing its ability even to know the difference between visual pictures and physical objects. However, it soon became clear that the demo was not conducted in real-time, which is significant given the unknown length of time to get Gemini production-ready. This misleading launch followed a similar disappointing demo when Google unveiled Bard to compete with OpenAI's ChatGPT, which employees called \"rushed\" and \"botched.\" In that demo, Bard outputted incorrect information. Perhaps no other company needs to succeed more in the AI race than Google, which is at risk of its core Search business being disrupted — a division that generated 57% of its revenue in 2022. While cutting costs can drive profits in the short term for Google, investors would be wise to consider whether Google will be able to make the necessary changes and innovations to compete in a drastically changing landscape. Losing key employees and public confusion from misleading demos are not the positive developments investors might have hoped for, but regardless, there have been no signs of the stock slowing down. Many of these engineers have seen continued success after leaving the search engine giant. Artificial intelligence is the most funded category by venture capitalists, and many founders from big tech companies have gone on to raise billions. Even retail investors have begun pouring millions into artificial intelligence startups. On StartEngine, a leading equity crowdfunding portal, six companies are raising in the AI category, with WiGL Inc. leading those with over $7 million raised from more than 4,600 investors. Read Next: Average retirement income in America has been revealed – Will you make enough each month? Hedge funds intend to snatch all pre-IPO shares of future AI unicorns before you can. But there is one venture product investing on your behalf. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? ALPHABET (GOOGL): Free Stock Analysis Report This article Despite Record Profits, Google Lays Off Over 1,000 Workers As Many Top DeepMind AI Scientists Leave To Start Their Own Startups originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}