{
    "title": null,
    "date": "1/12/2024",
    "url": "https://www.investorsobserver.com/news/stock-update/is-alphabet-inc-class-a-googl-stock-worth-a-buy-friday-6",
    "text": "Alphabet Inc Class A (GOOGL) stock has risen 56.35% over the last 12 months, and the average rating from Wall Street analysts is a Strong Buy. InvestorsObserver’s proprietary ranking system, gives GOOGL stock a score of  76 out of a possible 100. \n\n\n\n\n\nThat rank is chiefly influenced by a long-term technical score of 84. GOOGL's rank also includes a short-term technical score of 82. \n\n\n\n\n\n\n GOOGL has an Overall Score of 76. Find out what this means to you and get the rest of the rankings on GOOGL!\nSee Full GOOGL Report\n\n\nWhat's Happening with GOOGL Stock Today\nAlphabet Inc Class A (GOOGL) stock is higher by 0.28% while the S&P 500 is down -0.16% as of 10:57 AM on Friday, Jan 12. GOOGL has risen $0.40 from the previous closing price of $142.08 on volume of 4,717,996 shares. Over the past year the S&P 500 has gained 19.82% while GOOGL has risen 56.35%. GOOGL earned $5.22 a per share in the over the last 12 months, giving it a price-to-earnings ratio of 27.31. \n\n Click Here to get the full Stock Report for Alphabet Inc Class A stock. Alphabet Inc Class A (GOOGL) stock has risen 56.35% over the last 12 months, and the average rating from Wall Street analysts is a Strong Buy. InvestorsObserver’s proprietary ranking system, gives GOOGL stock a score of  76 out of a possible 100. \n\n\n\n\n\nThat rank is chiefly influenced by a long-term technical score of 84. GOOGL's rank also includes a short-term technical score of 82. \n\n\n\n\n\n\n GOOGL has an Overall Score of 76. Find out what this means to you and get the rest of the rankings on GOOGL!\nSee Full GOOGL Report\n\n\nWhat's Happening with GOOGL Stock Today\nAlphabet Inc Class A (GOOGL) stock is higher by 0.28% while the S&P 500 is down -0.16% as of 10:57 AM on Friday, Jan 12. GOOGL has risen $0.40 from the previous closing price of $142.08 on volume of 4,717,996 shares. Over the past year the S&P 500 has gained 19.82% while GOOGL has risen 56.35%. GOOGL earned $5.22 a per share in the over the last 12 months, giving it a price-to-earnings ratio of 27.31. \n\n Click Here to get the full Stock Report for Alphabet Inc Class A stock. Subscribe to our daily morning update newsletter and never miss out on the need-to-know market news, movements, and more. Thank you for signing up! You're all set to receive the Morning Update newsletter Stock Price data may be delayed up to 15 minutes. Copyright © 2024. Portions of this content may be copyrighted by Fresh Brewed Media, Investors Observer, and/or O2 Media LLC. All Rights Reserved. Portions of this content protected by US Patent numbers 7,865,496, 7,856,390, and 7,716,116. Investing in stocks, bonds, option and other financial instruments involve risks and may not be suitable for everyone. Portfolio results are unaudited and based on varying investment expiration dates. Terms of Service | Privacy Policy "
}