{
    "title": "Why Is Alphabet (GOOGL) Down 2.7% Since Last Earnings Report?",
    "date": "2/29/2024",
    "url": "https://finance.yahoo.com/news/why-alphabet-googl-down-2-163040038.html",
    "text": "A month has gone by since the last earnings report for Alphabet (GOOGL). Shares have lost about 2.7% in that time frame, underperforming the S&P 500. Will the recent negative trend continue leading up to its next earnings release, or is Alphabet due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recent earnings report in order to get a better handle on the important drivers. Alphabet’s fourth-quarter 2023 earnings of $1.64 per share beat the Zacks Consensus Estimate by 2.5%. The figure grew 56.2% year over year.Revenues of $86.31 billion increased 13% year over year (13% at constant currency).Net revenues, excluding total traffic acquisition costs (“TAC”) (the portion of revenues shared with Google’s partners and amount paid to distribution partners and others who direct traffic to Google’s website), were $72.32 billion, which surpassed the consensus mark of $70.77 billion. The figure rose 14.6% from the year-ago quarter’s level.TAC of $13.99 billion was up 8.2% year over year.Top-line growth was driven by solid Search and YouTube’s performance. The growing cloud and Other Bets segments were a positive. Also, the improving advertisement business was a plus.However, Alphabet continued to witness sluggishness in Google Network ads, which remained a concern.Nevertheless, Alphabet’s growing investments in AI to boost its Search, YouTube and cloud business are likely to yield massive returns in the days ahead. This is expected to instill investor optimism in the stock in the days ahead. Alphabet reports revenues under Google Services, Google Cloud and Other Bets.Google Services:Revenues from the Google Services business increased 12.5% year over year to $76.31 billion, accounting for 88.4% of total revenues. The figure beat the Zacks Consensus Estimate of $74.95 billion.Under this business, search revenues from Google-owned sites increased 12.7% year over year to $48.02 billion, surpassing the Zacks Consensus Estimate of $47.84 billion.YouTube’s advertising revenues improved 15.5% year over year to $9.2 billion, while Network advertising revenues decreased 2.1% to $8.3 billion. While YouTube ad revenues came ahead of the Zacks Consensus Estimate of $9.1 billion, Network ad revenues were below the consensus mark of $8.5 billion.Total Google advertising revenues were up 11% year over year to $65.52 billion and accounted for 76% of the total revenues. The figure beat the consensus mark of $65.45 billion.Google subscriptions, platforms and devices revenues, formerly known as Google Other revenues, were $10.8 billion in the fourth quarter, up 22.7% year over year. The figure came ahead of the consensus mark of $9.7 billion.Google Cloud:Google Cloud revenues rose 25.7% year over year to $9.19 billion, accounting for 10.6% of the quarter’s total revenues. The reported metric surpassed the Zacks Consensus Estimate of $9.04 billion.Other Bets:Other Bets’ revenues were $657 million, up 190.7% year over year and accounted for 0.8% of the total fourth-quarter revenues. The figure beat the consensus mark of $298 million. EMEA (29% of total revenues): GOOGL generated $25.01 billion in revenues from the region, increasing 15% year over year.APAC (16.2% of total revenues): The region generated $13.98 billion in revenues, up 17% from the year-ago quarter’s level.Other Americas (6% of total revenues): The region generated $5.2 billion in revenues, up 11% on a year-over-year basis.United States (48.7% of total revenues): Alphabet generated $41.99 billion in revenues from the region, which increased 14% from the prior-year quarter’s level. Costs and operating expenses were $62.6 billion, up 8.2% year over year. As a percentage of revenues, the figure contracted 360 basis points (bps) from the year-ago quarter’s level.The operating margin was 27.5%, which expanded 360 bps year over year. Segment-wise, Google Services’ operating margin of 35% expanded 520 bps from the prior-year quarter’s level.Google Cloud reported operating income of $864 million compared with a loss of $186 million in the year-ago quarter.Other Bets reported a loss of $863 million compared with a loss of $1.24 billion in the prior-year quarter. As of Dec 31, 2023, cash, cash equivalents and marketable securities were $110.9 billion, down from $119.9 billion as of Sep 30, 2023.Long-term debt was $13.25 billion at the end of the reported quarter compared with $13.8 billion at the end of the previous quarter.Alphabet generated $19.92 billion of cash from operations in fourth-quarter 2023 compared with $30.7 billion in third-quarter 2023.GOOGL spent $11.02 billion on capex, netting a free cash flow of $7.9 billion in the reported quarter. How Have Estimates Been Moving Since Then? It turns out, estimates revision have trended upward during the past month. VGM Scores Currently, Alphabet has a nice Growth Score of B, however its Momentum Score is doing a bit better with an A. However, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy. Overall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in. Outlook Estimates have been trending upward for the stock, and the magnitude of these revisions looks promising. Notably, Alphabet has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}