{
    "title": null,
    "date": "2/18/2024",
    "url": "https://finance.yahoo.com/news/does-googles-chatgpt-beating-artificial-105000468.html",
    "text": "Goodbye, Bard. Hello, Gemini. There has been a changing of the guard in the artificial intelligence (AI) world. Alphabet's (NASDAQ: GOOG) (NASDAQ: GOOGL) Google unit hasn't just renamed its generative AI app that was initially launched last year in a bid to play catchup with OpenAI's wildly popular ChatGPT. It also replaced the underlying large language model (LLM) with its most powerful AI model so far -- Gemini. This new LLM comes in three sizes. Gemini Nano can run locally on devices. Gemini Pro powers the free version of the app that used to be called Bard. Gemini Ultra is the largest model with capabilities to handle highly complex tasks. It went head-to-head with GPT-4, the LLM underneath OpenAI's most advanced version of ChatGPT, and came out on top on most benchmarks. So far in 2024, Alphabet stock is up by a low single-digit percentage after skyrocketing 58% last year. But does Google's new ChatGPT-beating AI app make the stock a no-brainer buy now? Some might have been tempted to write Google off as an AI contender early last year. ChatGPT was sizzling hot. Google's chief rival, Microsoft, was integrating OpenAI's AI model throughout its product line. The unveiling of Bard didn't go so well after an embarrassing blunder. However, those who were more familiar with Google's AI expertise and resources knew better than to dismiss the company's prospects so prematurely. Gemini arguably proves that they were right. Gemini Ultra beat the best AI system available (in most cases, GPT-4) on 30 of 32 widely used benchmarks for LLMs. It's also the first AI model to score higher than human experts on the massive multitask language understanding (MMLU) test. This test includes 57 subjects ranging from ethics and history to math and physics. Meanwhile, Gemini Pro compared favorably with GPT-3.5, which powers the free version of ChatGPT. Alphabet CEO Sundar Pichai hinted in his company's third-quarter earnings call in October 2023 that Google could offer a subscription AI service. That's exactly what the company has done. Gemini Advantage (which uses the Ultra LLM) is now available through a monthly subscription of $19.99 in the U.S. There's also a free two-month trial period. After using Gemini Advantage alongside GPT-4 for several days, I don't think it will be a ChatGPT killer. Google's new AI app is better than GPT-4 in some cases, but not as good in others. I'm also uncertain about how big the near-term financial impact of Gemini Advantage subscriptions will be for Alphabet. The company raked in revenue of nearly $283 billion last year. To boost revenue by just 1%, Gemini Advantage would have to attract nearly 11.8 million subscribers. Google could reach and exceed this level over time, but I wouldn't place a huge bet that it will happen quickly. That said, I do suspect that Gemini will move the needle for Google or at least set the stage for doing so. One of the biggest pluses of the new AI model is its integration with other Google apps, including Google Maps, Google Flights, and YouTube. It will soon integrate with Gmail and Google's productivity apps such as Docs, Slides, and Sheets. This functionality should be a great foundation for Google to eventually turn Gemini into a full-blown autonomous agent. And I think there's a huge commercial opportunity for virtual AI agents. I also view the introduction of Gemini Ultra as good news for Google Cloud. The cloud platform's growth trajectory has slipped somewhat while Microsoft's cloud growth has accelerated thanks to its integration with GPT-4. Gemini could (and arguably should) boost Google Cloud's business. Now back to our original question: Does Google's new AI app make Alphabet stock a no-brainer buy? I have a nuanced answer. My take is that the launch of Gemini (whether we're talking about Nano, Pro, and Ultra or the Gemini Advantage subscription) doesn't by itself make Alphabet stock a no-brainer buy. It's too soon to know how the launch will boost the company's revenue and profits. However, Alphabet is nonetheless a no-brainer stock to buy, in my opinion. Gemini underscores just how committed the company is to remaining at the forefront of AI. Importantly, we're only seeing version 1.0 right now. Even more powerful versions will come down the road. I'm confident that AI will provide a massive long-term tailwind for Alphabet even if the company's search model must adapt along the way. The stock's valuation isn't unreasonable considering its prospects over the next decade and beyond. As we say hello to Gemini, I think we could also be saying hello to a bright future for Google. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet and Microsoft. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Does Google's New ChatGPT-Beating Artificial Intelligence (AI) App Make the Stock a No-Brainer Buy? was originally published by The Motley Fool Related Quotes "
}