{
    "title": "With EPS Growth And More, Alphabet (NASDAQ:GOOGL) Makes An Interesting Case",
    "date": "2/1/2024",
    "url": "https://finance.yahoo.com/news/eps-growth-more-alphabet-nasdaq-110021826.html",
    "text": "It's common for many investors, especially those who are inexperienced, to buy shares in companies with a good story even if these companies are loss-making. Sometimes these stories can cloud the minds of investors, leading them to invest with their emotions rather than on the merit of good company fundamentals. A loss-making company is yet to prove itself with profit, and eventually the inflow of external capital may dry up. If this kind of company isn't your style, you like companies that generate revenue, and even earn profits, then you may well be interested in Alphabet (NASDAQ:GOOGL). Even if this company is fairly valued by the market, investors would agree that generating consistent profits will continue to provide Alphabet with the means to add long-term value to shareholders. View our latest analysis for Alphabet Generally, companies experiencing growth in earnings per share (EPS) should see similar trends in share price. That makes EPS growth an attractive quality for any company. Shareholders will be happy to know that Alphabet's EPS has grown 26% each year, compound, over three years. As a general rule, we'd say that if a company can keep up that sort of growth, shareholders will be beaming. Careful consideration of revenue growth and earnings before interest and taxation (EBIT) margins can help inform a view on the sustainability of the recent profit growth. Alphabet maintained stable EBIT margins over the last year, all while growing revenue 8.7% to US$307b. That's progress. In the chart below, you can see how the company has grown earnings and revenue, over time. Click on the chart to see the exact numbers. You don't drive with your eyes on the rear-view mirror, so you might be more interested in this free report showing analyst forecasts for Alphabet's future profits. Since Alphabet has a market capitalisation of US$1.9t, we wouldn't expect insiders to hold a large percentage of shares. But we are reassured by the fact they have invested in the company. Notably, they have an enviable stake in the company, worth US$198b. Investors will appreciate management having this amount of skin in the game as it shows their commitment to the company's future. You can't deny that Alphabet has grown its earnings per share at a very impressive rate. That's attractive. This EPS growth rate is something the company should be proud of, and so it's no surprise that insiders are holding on to a considerable chunk of shares. On the balance of its merits, solid EPS growth and company insiders who are aligned with the shareholders would indicate a business that is worthy of further research. Once you've identified a business you like, the next step is to consider what you think it's worth. And right now is your chance to view our exclusive discounted cashflow valuation of Alphabet. You might benefit from giving it a glance today. Although Alphabet certainly looks good, it may appeal to more investors if insiders were buying up shares. If you like to see companies with insider buying, then check out this handpicked selection of companies that not only boast of strong growth but have also seen recent insider buying.. Please note the insider transactions discussed in this article refer to reportable transactions in the relevant jurisdiction. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}