{
    "title": "'Big Short' investor Michael Burry reveals bets on Amazon and Alphabet",
    "date": "2/15/2024",
    "url": "https://www.businessinsider.in/stock-market/news/big-short-investor-michael-burry-reveals-bets-on-amazon-and-alphabet/articleshow/107701307.cms",
    "text": "Liked the article? Share it with your friends... or copy link Michael Burry went on a shopping spree last quarter, buying stocks including Amazon and Alphabet, an SEC filing on Wednesday revealed. The investor of \"The Big Short\" fame bolstered his US stock portfolio from 13 positions to 25, which helped to more than double its total value (excluding options) from $44 million to $95 million. Scion Asset Management's new holdings included Oracle, Citigroup, CVS, MGM Resorts, Warner Bros Discovery, and Toast. The fund also boosted its stakes in Alibaba and JD.com, helping to make the two Chinese e-commerce titans its top two positions, worth nearly $6 million each. Meanwhile, Scion exited its bets on stocks like Crescent Energy, Stellantis, and Hudson Pacific Properties. Burry purchased bearish put options on BlackRock's iShares Semiconductor ETF in the third quarter of last year. His bet against the microchip fund, which now counts Nvidia as its largest holding with an over 10% weighting, was gone from his latest portfolio update. Scion's Big Tech purchases last quarter are particularly striking given Burry has previously predicted the tech-stock boom wouldn't last, and the highest-flying names in the market were headed for disaster. Burry's latest update caps off a busy 2023, during which he issued grim forecasts for the stock market and economy, bet against the S&P 500 and Nasdaq indexes, and scooped up bargains during the regional banking debacle. The value investor is best known for his massive wager against the mid-2000s housing bubble, which was immortalized in the book and movie \"The Big Short.\" He also grabbed headlines for investing in GameStop more than a year before the video game retailer became the poster child for the meme-stock frenzy in early 2021. The Scion boss is famous for his dire warnings and bleak predictions too. For instance, he sounded the alarm on the \"greatest speculative bubble of all time in all things\" in the summer of 2021, and cautioned that buyers of meme stocks and cryptocurrencies would be caught in the \"mother of all crashes.\" Advertisement "
}