{
    "title": "Stocks in motion: Alphabet drops as Microsoft signs another AI partnership",
    "date": "2/26/2024",
    "url": "https://www.marketscreener.com/news/latest/Stocks-in-motion-Alphabet-drops-as-Microsoft-signs-another-AI-partnership-46030655/",
    "text": "Log In   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België)   English (USA) English (UK) English (Canada) English (India) Deutsch (Deutschland) Deutsch (Österreich) Deutsch (Schweiz) Español Français (France) Français (Suisse) Italiano Nederlands (Nederland) Nederlands (België) By         Romain Fournier Why is it up? Why is it down? Here's a few comments on the unusual variations affecting stocks on the NYSE today. Only when they are reliable and documented: we avoid nonsense whenever possible! Variations are taken at the time of writing. Up: Li Auto's Strong Quarterly Performance Drives Stock Upward Li Auto shares surged approximately 16% after the Chinese electric vehicle manufacturer reported a significant increase in fourth-quarter earnings and vehicle deliveries. Adjusted earnings per American depositary share jumped to 4.23 renminbi ($0.60), up from 0.93 renminbi a year earlier, surpassing analyst expectations. Revenue soared to 41.73 billion renminbi, driven by a 185% increase in vehicle deliveries. The company's gross margin improved to 23.5%, reflecting production optimization. Li Auto also provided an upbeat delivery forecast for the first quarter of 2024, expecting to deliver between 100,000 and 103,000 vehicles. Domino's Pizza Shares Rise on Earnings Beat and Share Buyback Plan Domino's Pizza's shares gained over 5% following the announcement of better-than-expected fourth-quarter earnings and a $1 billion share buyback program. The company reported a slight increase in revenue to $1.4 billion and a net income of $4.48 per share, exceeding analyst estimates. U.S. same-store sales grew by 2.8%, and the company saw a global net store growth of 394 locations. Domino's positive performance and initiatives, such as its loyalty program revamp and delivery partnership with Uber Eats, have strengthened its market position. Frontier Communications Parent posts better-than-epected revenues Frontier Communications Parent reported a decrease in fourth-quarter net earnings to $0.07 per diluted share, down from $0.63 a year earlier, which was better than the expected loss of $0.17 per share by analysts. The stock jumped 11%. Revenue slightly declined to $1.43 billion, meeting analyst projections. Down: Insulet Corp Shares Drop on Weak Revenue Growth Forecast Insulet Corp's shares fell more than 6% after the medical device maker forecasted full-year revenue growth below analyst expectations. The company anticipates revenue growth between 12% and 17% for 2024, with the mid-point falling short of the estimated 16.6%. Despite a strong fourth-quarter performance with revenue jumping 37.9% to $509.8 million, the company's forecast for the first quarter also did not meet analyst estimates. Alphabet declines after Microsoft Partners with French AI Startup Mistral Alphabet dropped 3.5% after Microsoft announced a partnership with French startup Mistral AI to make the company's artificial intelligence models available through its Azure cloud computing platform. This multi-year deal includes Microsoft taking a minority stake in Mistral AI. The partnership is part of Microsoft's strategy to diversify its AI offerings and strengthen its Azure cloud services.  Romain Fournier  0 selected Weekly market update: Markets refuse to fall Weekly market update: Markets refuse to fall ETF of the week: Preferred Stocks, a mixed product between stocks and bonds Ethereum: Soon to be reclassified as a security? Crypto Recap Indian Oil, Panasonic Energy enter pact to make lithium cells Explainer-Turkey's local vote a test for Erdogan and rival Imamoglu Europe could lower rates ahead of Fed, ECB's Holzmann says Ex-Austria security official held on suspicion of spying Canada's mild winter disrupts key ice road to remote Arctic diamond mines US, Japan to call for deeper cooperation in AI, semiconductors, Asahi says China's March factory activity expands for first time in six months  Salvage crews work to lift first piece of collapsed Baltimore bridge China's manufacturing activity expanded slightly in March, official PMI shows Swatch buyers in China hesitate over higher prices, CEO says India opposition unites over pre-election arrest, blames PM Modi QatarEnergy to charter 19 LNG more vessels expanding fleet further A second Kobayashi Pharma Japan factory inspected over deaths Philippines' Marcos boosts maritime security as China tension rises Erdogan battles key rival in Turkey's local elections Explainer-Turkey's local vote a test for Erdogan and rival Imamoglu  Currency / Forex Commodities Cryptocurrencies Best financial portal +951% of historicalperformance More than 20 yearsat your side +     \n                    \n    950,000\nmembers Quick & easycancellation Our Expertsare here for you OUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 "
}