{
    "title": "Google's 'Most Advanced' AI Predicts These 3 Stocks Will Gain 3000%",
    "date": "2/4/2024",
    "url": "https://investorplace.com/2024/02/googles-most-advanced-ai-predicts-these-3-stocks-will-gain-3000/",
    "text": " Gemini's stock picks have big potential, but do they provide even bigger risk? Advertisement Source: Shutterstock Alphabet’s (NASDAQ:GOOG) Google recently unveiled its new “Gemini” artificial intelligence model, claiming it to be the company’s most advanced AI yet. This new model has been integrated into Google’s conversational AI assistant Bard, which was criticized for being underwhelming when it first launched. With the powerful Gemini under the hood, could Bard be poised to become an exceptionally useful AI? Previously, Bard demonstrated an ability to outperform both humans and other AI models at picking stocks. Now powered by Gemini, perhaps Bard can surface even better stock picks. However, we must be cautious not to imbue these AIs with mystical, oracle-like abilities when it comes to predicting the market. The truth is, no model or being, artificial or otherwise, has a crystal ball to foresee every peak and valley in the market. That said, advanced AI models can rapidly process mountains of data to highlight promising opportunities we may overlook. My stance is that rather than taking Bard’s stock suggestions as gospel, we should use them as a launching pad for our own research. As I’ve noted before, AI-managed funds lacking human intuition have tended to underperform. The key is to marry our instinct and judgment with the machine’s superior data processing to get the best results. Let’s do just that! Fastly (NYSE:FSLY) offers a global edge cloud platform, helping developers deliver fast, secure, and scalable digital experiences. Its offerings include content delivery, image optimization, video and streaming, and application security services. We’ve seen incredible appetite for cloud stocks in recent years as businesses rapidly digitize operations. Many trade at steep premiums, although FSLY stock has come back to earth. Shares now trade for around $20, much lower than the company’s $126 per share peak in 2020. But even after this decline, Fastly still trades at 5-times forward sales due to persistent unprofitability. Comparable companies often garner double-digit sales multiples, but analysts expect Fastly to approach breakeven profitability this year before seeing significantly earnings growth. Analysts peg Fastly’s forward price-earnings ratio below 10-times in five years, which will coincide with a sub-2-times forward price-sales multiple. So, while extreme multiple expansion has already taken place, I agree with Bard’s bullish stance given the company’s growth outlook. But can four-digit percentage returns realistically happen here? Fastly would likely need a decade or more of the same growth to provide 1,000%+ upside, based on my modeling. I’m optimistic about the business, but have tempered my expectations to triple-digit upside over a five to 10-year timeframe. Of course, it’s all about execution. Iif Fastly markedly outpaces projections, all bets are off! But from today’s vantage point, I wouldn’t bank on 10X+ gains in short order without a radical change of fortune. Still, Fastly warrants a spot on growth investor watchlists, in my view. Switching gears, Bill Holdings (NYSE:BILL) furnishes cloud-based financial operations software for small and medium sized businesses. The company’s offerings include accounts payable/receivable automation, supplier/customer connectivity, and security services catered to the e-commerce and fintech sectors. While not a pure-play cloud name, Bill has enjoyed growth tailwinds from digitization, similar to Fastly. Bills’ revenue climbed 32.7% year-over-year last quarter, with double-digit growth expected annually through 2028. Unlike Fastly, Bill is profitable today and should see earnings swell roughly in line with its top-line growth rate. Its balance sheet also seems healthy at first glance, with $2.65 billion in cash against $1.91 billion of debt. Thus, there’s no solvency worries here! So, I agree Bard made a reasonable buy call, but can we realistically target quadruple-digit returns? Probably not anytime soon. The company’s valuation isn’t nearly as stretched, with shares trading at 11-times forward earnings, so I don’t see multiples ballooning 10X. This stock’s upside likely comes from executing on the company’s growth strategy and expanding margins over time. Put it all together, and I wouldn’t set sights on 1,000% without a radical change in Bill’s growth trajectory or profitability. This is a nice business with plenty of tailwinds, but a limited probability of exponential gains from today’s valuation. Finally, we have ThredUp (NASDAQ:TDUP), an online used clothing and accessories resale marketplace. Users can order ThredUp clean-out bags, fill them with items to potentially sell or donate and ship them back. In this inflationary climate, ThredUp provides a nice outlet for price-conscious shoppers, which explains the company’s impressive 21% year-over-year revenue growth reported this past quarter. Margins also improved markedly, giving some credence to ThredUp’s path to profitability by 2027 to 2028. As Bard suggested, if looking for exponential upside, ThredUp fits the bill as a speculative play. Its 0.7-times price/sales multiple reflects unprofitability right now. So, plenty of upside remains if ThredUp is able to execute well. Considering thrift and resale are likely to continue to capture wallet share, ThredUp has enviable industry dynamics working in its favor alongside operational progress. Its recent 12% single-day drop offers a good entry point as well. Realistically, though, four-digit percentage upside seems unlikely even with favorable circumstances. Maybe with flawless execution amidst an ideal economic backdrop, I see 200% to 300% upside for TDUP stock over the next five or more years. Indeed, 1,000% returns may be a stretch in less than a decade. The company’s resale concept makes long-run sense; I just urge investors to moderate their return assumptions. On the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Omor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn. Artificial Intelligence, Cloud, Financial, Fintech, Software, Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/googles-most-advanced-ai-predicts-these-3-stocks-will-gain-3000/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}