{
    "title": "Where Will Alphabet Stock Be in 1 Year?",
    "date": "2/3/2024",
    "url": "https://www.fool.com/investing/2024/02/03/where-will-alphabet-stock-be-in-1-year/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Alphabet's (GOOG 0.21%) (GOOGL 0.04%) stock price dropped nearly 8% on Jan. 31 after the tech giant posted its fourth-quarter report. Its revenue rose 13% year over year to $86.31 billion, which exceeded analysts' estimates by $1.04 billion. Its adjusted EPS grew 56% to $1.64 and also cleared the consensus forecast by four cents a share. Those headline numbers looked healthy, but a lot of growth had already been priced into Alphabet's shares before the release of its earnings report. Even after its post-earnings pullback, its stock has still rallied about 45% over the past 12 months. So is Alphabet's stock finally due for a breather, or will it head even higher over the next year? Image source: Getty Images. Alphabet generated 76% of its revenue from Google's advertising business -- which houses its search, display, network, and YouTube ads -- in the fourth quarter. Google's subscriptions, platforms, and devices segment brought in 13% of its revenue, while 11% came from its cloud business. All three businesses posted accelerating revenue growth in the fourth quarter. Metric Q4 2022 Q1 2023 Q2 2023 Q3 2023 Q4 2023 Google Advertising Revenue Growth (YOY) (4%) 0% 3% 9% 11% Google Subscriptions, Platforms, and Devices Revenue Growth (YOY) 8% 9% 24% 21% 23% Google Cloud Revenue Growth (YOY) 32% 28% 28% 22% 26% Total Revenue Growth (YOY) 1% 3% 7% 11% 13% Data source: Alphabet. YOY = Year over year. As a result, Alphabet's year-over-year revenue growth accelerated for the fourth consecutive quarter. Its advertising business grew again as the robust growth of its search and YouTube ads offset the softness of its network ads, while a growing number of YouTube Premium and Music, YouTube TV, and Google One subscriptions drove the expansion of its subscriptions, platforms, and devices division. But more importantly, Google Cloud's growth accelerated again after experiencing a disappointing slowdown in the previous quarter. It attributed that reacceleration to the rollout of new artificial intelligence (AI) tools across its cloud-based services. However, Google Cloud is still growing slower than Microsoft's \"Azure and other cloud services\" division, which generated 30% year-over-year growth in its latest quarter while integrating fresh AI features into its ecosystem. That's worrisome because Google Cloud still ranks third in the cloud platform race with a 10% share of the market, according to Canalys. Azure holds 25%, while Amazon Web Services (AWS) leads the market with a 31% share. For the full year, Alphabet's revenue rose 9%. That represented a slight slowdown from its 10% growth in 2022, but analysts expect its revenue to rise 11% in 2024 and 10% in 2025. Alphabet's operating margin expanded three percentage points year over year to 27% in the fourth quarter. For the full year, its operating margin rose by a percentage point to 27%. That expansion was largely driven by the stabilization of its advertising business, the improving profitability of its cloud business -- which maintained positive operating margins through all four quarters of the year -- and several rounds of layoffs. It also reined in its spending at its \"other bets\" division, which houses its moonshot projects. During the conference call, CFO Ruth Porat said Alphabet would continue to \"durably reengineer\" its cost base to support its \"growth priorities\" -- which include YouTube Shorts, Google Cloud, and its AI services -- and that it would focus on \"removing layers to simplify execution and drive velocity.\" Analysts expect those strategies to boost Alphabet's operating margin to 29% in 2024 and 30% in 2025. They expect its EPS to grow 16% in both 2024 and 2025. At 21 times those forward earnings expectations, Alphabet looks a bit cheaper than Microsoft and Amazon, which trade at 36 and 44 times forward earnings, respectively. Alphabet's stock is still reasonably valued, but persistent concerns about its ability to keep pace with Microsoft in the AI race, expand its cloud infrastructure platform, and weather the regulatory threats for its core advertising business could limit its near-term gains. Elevated interest rates could also broadly drive investors away from top tech stocks again. That said, I believe Alphabet's stock will stabilize and gradually head higher through the end of 2024 as more investors appreciate its dominance of the search, advertising, and streaming video markets and the long-term growth potential of its AI and cloud services. It might not generate massive gains this year -- but it should remain a sound long-term investment. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon. The Motley Fool has positions in and recommends Alphabet, Amazon, and Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}