{
    "title": "Other Bets And X Moonshots Key Google Stock's Future",
    "date": "2/20/2024",
    "url": "https://www.investors.com/news/technology/other-bets-x-moonshots-future-google-stock/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     (© Gary Neill) Google is known for making big bets, from self-driving cars to home security to health care. But parent company Alphabet (GOOGL) is scrutinizing these expensive moonshots, which Google designates as \"Other Bets.\" And this could be good news for Google stock. The tech giant has piled up billions in operating losses from these ventures. As Google appears to double down on key areas like artificial intelligence, the company is recalibrating. It's pulling back from bold new projects with fuzzy revenue potential while focusing on initiatives that could bring more value. \"They may be looking to spin off some of these assets,\" Evercore ISI analyst Mark Mahaney told Investor's Business Daily. \"This may be a great capital markets challenge for Google. How do you take these assets and spin them off while getting an appropriate value for Google?\" According to Visible Alpha data, Google's Other Bets piled up $37.3 billion in operating losses since 2014 on revenue of just $7.3 billion. For Google, the good news is that financial results improved in 2023. Other Bets reported an operating loss of $4.1 billion last year on revenue of $1.5 billion. Deep-pocketed Alphabet has been able to put up with the losses. Its 2023 revenue rose 9% to $307.4 billion while operating income rose 12% to $84.29 billion. But as Google ramps up investments in critical areas like artificial intelligence to support its core digital advertising business, the company now is scaling back its pursuit of bold new projects. At the center of Google's efforts to spin out more projects as independent companies is Ruth Porat, its out-going chief financial officer. Google last year named Porat, a former Morgan Stanley technology investment banker, as the company's president and chief investment officer. Her new duties include overseeing Other Bets and the 'X moonshot factory,' as the company calls its division focused on innovations. Spinning off the Other Bets in an efficient way could benefit Google stock by allowing the company to share in potential growth without shouldering all of the expenses, Evercore ISI analyst Mahaney said. Google would likely retain an ownership stake in the new company. \"Accessing capital markets is part of Porat's background,\" Evercore ISI analyst Mahaney said. Google's Other Bets cover a range of markets. The company has invested in a broadband business, Google Fiber, as well as life sciences company Verily. Google is also a backer of self-driving cars trailblazer Waymo and industrial robotics software company Intrinsic. Its projects at the X moonshot factory include supply chain sensor developer Chorus, electric grid firm Tapestry, drug developer Isomorphic Labs and ocean protection organization Tidal. \"Alphabet is seeking to streamline both its internal R&D efforts and its investments in new technologies so that they have clearer revenue potential,\" Insider Intelligence analyst Jacob Bourne told Investor's Business Daily. On Google's fourth-quarter analyst call, Porat said: \"With regard to Other Bets, we've been working to sharpen our investment focus while capturing the upside, given compelling technology breakthroughs across the portfolio. For example, Alphabet's X has announced that it would be moving to spin out more projects as independent companies through external capital, giving X the opportunity to bring more focus to the breakthrough technologies it is working on to address some of the world's most pressing challenges.\" Google has not named a new CFO; Porat remains active in the role. One view of Google's moonshots is that some are less likely to graduate and become subsidiaries and part of the Other Bets structure. Asked if that's the case, X spokesperson Jodi Olson said in an email: \"No, not necessarily. This is about creating more possible growth paths for our moonshot projects.\" One of Google's latest moonshots was Mineral, which was added to the company's Other Bets in January 2023. Mineral aims to support \"sustainable\" agriculture with big data analysis tools. Mountain View, Calif.-based Google has long been focused on new ventures. But in 2015, Google reorganized, and its moonshots strategy became more clearly defined. With the restructuring, Google separated its core internet advertising business from so-called moonshots. In 2019, Larry Page stepped down as Alphabet CEO and Google Co-Founder Sergey Brin exited as company president. New Alphabet CEO Sundar Pichai took a fresh look at Other Bets financials, analysts say. Google shut down Loon, which aimed to provide internet access in remote areas using high-altitude balloons, in 2021. In March 2022, Google spun off its quantum-computing technology group as a separate company. Now called SandboxAQ, it partnered with Nvidia (NVDA) in November to pursue drug discovery projects. SandboxAQ has raised $500 million in venture capital. Porat was named chief investment officer in charge of the company's Other Bets portfolio in July last year, three months after Google announced a major AI-focused reorganization. Google announced in April 2023 that it was merging two major AI research organizations: Google DeepMind, which it acquired in 2014, and Google Brain, which was formed in 2011. Combining DeepMind and Brain reduced operating losses at Google's Other Bets and coincided with Google's heavier focus on generative AI. Among other AI competitors, Google is battling Microsoft (MSFT), Facebook-parent Meta Platforms (META) and Amazon.com (AMZN) for leadership in generative AI. Microsoft is the biggest investor in startup OpenAI, the leader in generative AI training models and owner of the ChatGPT app. Wall Street analysts polled by FactSet estimate Google's 2024 capital spending at $41 billion, up 25% from last year. Some analysts peg 2024 capital spending even higher, at $45 billion to $46 billion. Google stock fell on its fourth-quarter earnings report as the core advertising business slightly missed views amid worries over how the rise of generative AI will impact internet search. On Friday, Google stock slipped on a report that rival OpenAI plans to launch its own search tool. As a result, Google has less ability to afford ambitious Other Bets projects as well as X factory moonshots. So Porat is enforcing more commercial discipline at the Other Bets and X projects. But this doesn't mean the Silicon Valley company is giving up completely on its big bets approach, Bourne of Insider Intelligence said. \"Google will hesitate to shut down Other Bets and its moonshots altogether as they help foster a broader ecosystem of emerging tech knowledge and talent,\" he said. \"This strategic recalibration aligns with Alphabet's broader cost-cutting measures and emphasis on efficiency.\" The cost-cutting has taken its toll on some of Google's bets. When the company slashed 12,000 jobs in early 2023, both Verily Life Sciences and robotics software firm Intrinsic laid off workers. In January 2023, Verily Life Sciences laid off more than 200 employees, or about 15% of its workforce. \"We cannot do everything and have had to make some difficult choices,\" CEO Stephen Gillett said in a blog post. A big chunk of Google's Other Bets revenue comes from Verily and Google Fiber. Consumer smart home device maker Nest, acquired in 2014 for $3.2 billion, originally was part of Other Bets. But Alphabet moved Nest out of Other Bets in 2019. In Q4, Other Bets revenue suddenly jumped 190% from a year earlier to $657 million. In Google's Q4 earnings report, the company referred to a \"milestone\" involved in the revenue increase. (Google did not immediately respond to an IBD email asking if the milestone involved a Verily customer.) Founded as a Google X moonshot in 2015, Verily develops tools aimed at making the delivery of health care services easier and faster. Verily wasn't always successful. In 2018, the company announced that it was dropping a project that sought to develop glucose-measuring contact lenses for diabetes patients. But Verily has continued to grow. In September 2022, the company raised $1 billion in a funding round led by Alphabet. Outside investors include private equity firm Silver Lake and Singapore's Temasek fund. According to reports, Verily has been taking steps to wean itself off Google technical infrastructure. One of the most significant companies in Google's Other Bets strategy is drug developer Isomorphic Labs. In January, Isomorphic Labs. announced strategic research collaborations with Eli Lilly (LLY) and Novartis (NVS). The Lilly and Novartis collaborations will focus on small-molecule treatments and multiple targets. Isomorphic Labs, which uses artificial intelligence to help discover new drugs, will receive upfront cash and possible milestone payments. Another Other Bets health science company, Calico, has a deal with AbbVie to discover and develop therapies for patients with amyotrophic lateral sclerosis (ALS) and neurodegenerative disorders. Google Fiber, the company's U.S. broadband business, has been a major company initiative since it launched more than a decade ago. After some years of being out of the spotlight, the project is suddenly back in the news. Google Fiber has been rebranded GFiber in a move that could be a precursor to a spinoff. Reuters in early February reported that GFiber is seeking outside investment to expand its network. There's a precedent for such a move. AT&T (T) and financial asset management firm BlackRock in 2022 formed a joint venture called Gigapower. The venture is expanding fiber-optic network services outside of AT&T's traditional 21-state wireline service footprint. Google launched its broadband business in 2012 in Kansas, aiming to pressure cable TV firms such as Comcast (CMCSA) to improve high-speed internet speeds. Google's broadband business expanded to parts of 15 cities, including Salt Lake City and Austin. But Google hasn't disclosed how many subscribers the broadband business signed up. \"I think it is fair to say that some things worked and some things didn't in their first iteration,\" said Craig Moffett, analyst at MoffettNathanson, in an email. \"They've taken these past few years to sort out the lessons. Whether they remain inside of Alphabet or ultimately go off on their own, they will be a more focused organization for it.\" In 2022, Google suddenly said it was expanding to new markets again, with West Des Moines, Iowa, marking its first new state in five years. And, in 2023, GFiber touted plans to bring super high-speed 20 gigabit-per-second service to some of its markets. One possibility, analysts say, is that Google Fiber could seek funding from the federal government's Broadband Equity, Access and Deployment (BEAD program) to expand further. A well-known Google bet is Waymo. But the projected valuation of the self-driving car pioneer has plummeted since 2019, when buzz over autonomous vehicles was as hot as generative AI is these days. Based on funding rounds, Morgan Stanley at one point pegged Waymo's projected value at some $175 billion. Waymo and Tesla (TSLA) were expected to be leaders in AVs. The market for self-driving cars has run into big hurdles, both technologically and from regulators. The robotaxi is now viewed as much more limited. General Motors (GM) in November laid off near 25% of its Cruise self-driving-car unit workforce following a series of safety mishaps and operating permit suspensions. Earlier, Ford (F) and Volkswagen AG shut down their self-driving venture. Still, Waymo isn't throwing in the towel. Waymo offers for-hire cars in San Francisco and Phoenix. It's seeking approval from California regulators to expand into Los Angeles, where Waymo is already doing tests, and some suburbs in northern and southern parts of the state. Waymo is clearly one of the most well-known Google bets. There's been speculation that the self-driving car technology company is considering going public. Waymo has also been expanding its reach. Late last year, ride hailing giant Uber Technologies (UBER) announced a Waymo partnership that would give riders the option of \"a fully-autonomous ride\" in Phoenix. Roger Lanctot, director of automotive connected mobility at research firm Tech Insights, cited the potential commercial opportunities with self-driving vehicles. \"From the standpoint of automated driving, there are an array of opportunities. But most progress appears to be occurring in the commercial vehicle space, like hub-to-hub goods transportation,\" he told IBD. Lanctot added: \"There are plenty of other automation opportunities from factories and warehouses, mines and agriculture, to last-mile delivery. Commercialization of semi-autonomous driving is proceeding across the automotive industry, defining a clear path to monetization. That favors the Mobileye (MBLY) approach. As a result of a lack of integration of Waymo technology with mass-market vehicle deployments, Waymo's path to market is less clear.\" Mobileye's SuperVision platform features multiple high-resolution cameras and provides full, 360-degree visual coverage surrounding a vehicle. Mobileye bundles its computer vision chips and electronics with its own software and databanks gathered from vehicles. Pulling back from its Other Bets could allay investor worries about Google's spending, especially on capex, and the potential to lose focus. That eventually would be great news for Google stock, which has had a bumpy ride this year. The shares are ahead around 3% year-to-date. Google stock popped 58% in 2023 but still underperformed Meta and Amazon. As of Feb. 15, Google's Relative Strength Rating stood at 78 out of a best-possible 99, according to IBD Stock Checkup. Market-leading stocks are usually in the high 90s. What's more telling is that Google's Relative Strength line, which tracks the stock's performance vs. the S&P 500, last made a new high in October 2021. It's been lagging the broad market since then. This year hasn't been any better. The stock started gaining momentum as 2024 began. But gapping down to the 50-day moving average on Jan. 31 after earnings sapped that initial strength. Google rallied off that key moving average but tumbled back to it on Thursday. Look for Google to surpass its Valentine's Day high of 146.52 in strong volume. That could offer a lower-risk entry. Making bold bets has long been in Google's DNA. That strategy has paid off handsomely for the technology behemoth in the past, yielding the likes of YouTube and Android. Wall Street shouldn't expect Google to abandon its think-big approach to tech, especially at a time when the industry is going through new waves of disruption, led by AI. That's why Google's recent effort to fine-tune its innovation initiatives \"doesn't necessarily mean the categorical end of Other Bets and moonshot projects,\" Bourne of Insider Intelligence said. \"Instead, it means that the bar will be higher from a business perspective for any single product idea making the cut.\" Follow Reinhardt Krause on X, formerly called Twitter, @reinhardtk_tech for updates on artificial intelligence, cybersecurity and cloud computing. YOU MAY ALSO LIKE: IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Learn How To Time The Market With IBD's ETF Market Strategy Get Free IBD Newsletters: Market Prep | Tech Report | How To Invest AI Play Skyrockets As S&P 500 Tests 5,000, But It's A 'Lockout' Rally 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}