{
    "title": null,
    "date": "2/16/2024",
    "url": "https://investorplace.com/2024/02/follow-metas-lead-3-tech-stocks-that-should-also-debut-dividends/",
    "text": " Just because a company can afford to pay dividends doesn't mean it will Advertisement Source: jittawit21/Shutterstock.com Meta Platforms (NASDAQ:META) surprised the stock market recently by announcing it would pay its first-ever quarterly dividend. The owner of Facebook, Instagram, and WhatsApp said the payout will be 50 cents per share, or $2 per share on an annual basis. That works out to a yield of about 0.4% at current prices. It’s not earth-shattering but leaves room for lots of future growth. There was a time back in the 1990’s when very few tech stocks paid dividends. They were financing their growth and chose to plow their excess cash back into the business. Thirty years on and these are now more mature operations so you can find many tech companies paying dividends: Apple (NASDAQ:AAPL), Microsoft (NASDAQ:MSFT), and Cisco (NASDAQ:CSCO) all reward shareholders for owning the stock. Most tech companies still don’t pay dividends, but arguably many of them should. At the very least least they could afford to pay them. Here are three tech stocks that should follow Meta’s lead and initiate a dividend, but let’s see if they actually will. Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) is one of the first tech stocks that springs to mind that could pay shareholders a dividend. It ended 2023 with over $110 billion in cash, equivalents, and short-term investments on its balance sheet. The search giant also generated nearly $70 billion in free cash flow (FCF). Alphabet certainly has the financial wherewithal to initiate a payout but probably won’t. Currently, Alphabet chooses to use much of its excess cash to buy back shares. Just last year it spent $61.5 billion on repurchasing shares, equivalent to 88% of its FCF. Many businesses think buying back stock is a better use of their cash profits than dividends. That’s because they can be a more tax-efficient way to return value to shareholders. Although President Biden began taxing companies 1% on the stocks they repurchased beginning in 2022 it hasn’t deterred companies from repurchasing shares. Now the president wants to quadruple the tax to 4%. However, investors tend to prefer dividends because it is a tangible symbol of a company’s success. It is cash they can reinvest in the business themselves if they choose. Nevertheless, Alphabet doesn’t look likely to scratch that itch anytime soon. Similarly, Amazon (NASDAQ:AMZN) is unlikely to begin paying shareholders either for owning its stock. Like Alphabet, the e-commerce giant can afford a dividend, after having $87 billion in liquid assets available and producing $32 billion in FCF last year. But unlike Alphabet, Amazon was not buying back its stock, instead choosing to reinvest in the business. There are only a few things a company can do with its cash profits: pay dividends, buy back shares, pay down debt, engage in mergers and acquisitions or reinvest back into the business. Amazon is choosing to do the latter, spending virtually all of its profits across its varied businesses. Amazon is more than just e-commerce, it is also a cloud services company through Amazon Web Services. It also has physical retail stores, third-party marketplaces, digital advertising, streaming video and more. By putting its cash profits to work in each of these areas, it hopes to grow them into dominant forces, which it has in many instances. Amazon is the No. 1 destination for online sales and is the leading cloud service provider through AWS. Sometimes it fails spectacularly, like with its Fire Phone and Amazon Wallet. The key takeaway is Amazon is continually looking to grow and expand so it seems unlikely it will ever pay a dividend. On the surface customer relationship management specialist Salesforce (NYSE:CRM) does not have quite the same financial resources as either Alphabet or Amazon. It only has $12.5 billion in cash, equivalents, and short-term investments available to it. However, it did see a 19% increase over the past year of FCF, generating $6.3 billion in 2023. Although Salesforce could sustainably afford to pay a dividend, it instead chooses one of the other routes open to it for using its FCF: making acquisitions. Salesforce could be considered a serial acquirer, with significant acquisitions in the past few years. Notably, Slack was acquired for $27.7 billion in 2021, Tableau for $15.7 billion in 2019 and MuleSoft was bought the year before for $6.5 billion. Salesforce anticipates making many more acquisitions in the future. Because M&A activity is part and parcel of Salesforce’s DNA and it uses up the bulk of its cash profits, little remains for dividends. The CRM specialist becomes another in a long list of tech stocks that could, and maybe should prioritize a dividend over the paths they’ve chosen. However, Salesforce seems unlikely to take that path, and investors shouldn’t hold their breath waiting. On the date of publication, Rich Duprey did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Rich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets. Technology Dividend Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/02/follow-metas-lead-3-tech-stocks-that-should-also-debut-dividends/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}