{
    "title": "Google CEO Sundar Pichai reveals how he uses speed control feature in \nYouTube: 'Very curious'",
    "date": "2/11/2024",
    "url": "https://www.moneycontrol.com/news/trends/google-ceo-sundar-pichai-reveals-how-he-uses-speed-control-feature-in-youtube-very-curious-12241061.html",
    "text": "My Account Follow us on: Powered By hBits - Fractional Ownership & Investment In Commercial Real Estate Start generating passive income with up to 10% rental yield and an expected IRR of 18% Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now Alphabet and Google CEO Sundar Pichai has revealed that he usually speeds up videos on YouTube unless he's watching something that he really enjoys or needs to \"process deeply\". Pichai was responding to a post on X by popular American YouTuber Marques Brownlee. \"Very curious to see, I normally do 1x for things I enjoy and/or need to process deeply but otherwise do go faster,\" he wrote.very curious to see, I normally do 1x for things I enjoy and/or need to process deeply but otherwise do go faster https://t.co/7aJJEP8ogE — Sundar Pichai (@sundarpichai) February 9, 2024 Last July, Alphabet-owned YouTube began testing its 2x playback speed feature which was accessible to its Premium subscribers. Currently, it is available to all users. Here's how to speed up or slow down YouTube videos: For computersGo to a video.Hover over the player and click Settings.Click Speed.Select the speed at which you'd like the video to play. To fast forward:1.) Click and hold anywhere on the video to play it at 2 times the speed.2.) Release your click to stop fast-forwarding. For AndroidGo to a video.Tap the video once, then tap More.Tap Playback Speed.Select the speed at which you'd like the video to play. To fast forward or rewind a video by 10 seconds:To rewind, double-tap the left side of the video-screen.To fast-forward, double-tap the right side of the screen.To fast forward a video at 2 times speed:Tap and hold anywhere on the video.To stop fast forwarding, lift your finger. For iPhone and iPadGo to a video.Tap the video once, then tap More.Tap Playback Speed.Select the speed at which you'd like the video to play.To fast forward or rewind a video by 10 seconds:To rewind, double-tap the left side of the video screen.To fast-forward, double-tap the right side of the screen.To fast forward a video at 2 times speed:Tap and hold anywhere on the video.To stop fast-forwarding, lift your finger. Read more: Sundar Pichai on laying off 12,000 Google employees: 'Not the right way' Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free "
}