{
    "title": "Gemini AI inaccuracies: Google CEO Sundar Pichai admits company 'got it \nwrong'",
    "date": "2/28/2024",
    "url": "https://www.theweek.in/news/biz-tech/2024/02/28/gemini-ai-inaccuracies-google-ceo-sundar-pichai-admits-that-company-got-it-wrong.html",
    "text": "Says 'no AI is perfect especially at this emerging stage' A few days after Google announced that it is temporarily stopping its Gemini artificial intelligence chatbot from generating images of people and apologised for inaccuracies in historical depictions that the AI tool was coming up with, Google CEO Sundar Pichai admitted that the company has \"got it wrong\". According to media reports, in an internal memo, which was published by ‘The Verge’ the Google CEO noted that \"No Al is perfect, especially at this emerging stage of the industry’s development.\" Pichai said Google knows that the \"bar is high for us and we will keep at it for however long it takes\". \"Our teams have been working around the clock to address these issues. We're already seeing a substantial improvement on a wide range of prompts. And we’ll review what happened and make sure we fix it at scale.” Although he did not exactly mention the steps being initiated to rectify the issues with Gemini, Pichai said they will be \"driving a clear set of actions, including structural changes, updated product guidelines, improved launch processes, robust levals and red-teaming, and technical recommendations.\" We are looking across all of this and will make the necessary changes, he added. After Gemini users had posted screenshots on social media of historically white-dominated scenes with racially diverse characters that they say it generated, there were questions raised about whether the company is over-correcting for the risk of racial bias in its AI model, Google had said the company is already working to address issues with Gemini's image generation feature. Google had admitted that it was aware that Gemini is offering inaccuracies in some historical image generation depictions and added that the company is already working to address such issues. Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp *Articles appearing as INFOCUS/THE WEEK FOCUS are marketing initiatives Copyright © 2024 All rights reserved "
}