{
    "title": "GOOG Stock Is the Cheapest of the Magnificent 7. But Is It a Buy?",
    "date": "3/16/2024",
    "url": "https://investorplace.com/2024/03/goog-stock-is-the-cheapest-of-the-magnificent-7-but-is-it-a-buy/",
    "text": " There’s enough meat on the bone to push GOOG stock higher Advertisement There’s no denying it’s a cash-flow machine. YouTube is a big reason to remain interested. Source: IgorGolovniov / Shutterstock.com MarketWatch contributor Philip van Doorn recently did a good job explaining why Alphabet (NASDAQ:GOOG) is the Magnificent Seven’s biggest bargain. In fact, GOOG stock is the only one of the seven trading at a forward P/E (19.7) lower than the S&P 500. As van Doorn points out, the seven companies account for 28.7% of the SPDR S&P 500 ETF Trust’s (NYSEARCA:SPY) net assets. Perhaps the index is really just a bet on those seven, ignoring the other 496 stocks. If I could only buy one of the Mag 7, I’m not sure GOOG stock would be one despite its shares appearing cheap relative to the index and its peers. When a stock is cheap, there are usually reasons for the valuation. The markets are efficient at pointing out a company’s weaknesses. In the end, Alphabet is probably a bargain at current prices. However, before you buy, you might want to consider its weaknesses. In his article, van Doorn quotes Moffatt Nathanson analyst Michael Nathanson’s thoughts about the company. Nathanson is bullish about it, giving it a Buy rating with a $175 target price, 21% higher than where it’s currently trading. “Summing up, the analyst wrote that ‘the basic question is about Alphabet’s ability to harness their deep pool of world-class engineers and their long-term embrace [of] machine learning to build products that consumers want to use,’” van Doorn wrote on March 11. Given its innovation over the years, you would think AI should be a slam dunk for the company. Unfortunately, its corporate culture could be standing in the way of progress. Bashing Google’s corporate culture is not something new. As far back as March 2016, the company faced criticism from Wall Street, the media, and its own employees. Do a search about Google, Alphabet, and corporate culture, and virtually every year since, there’s been some sort of internal and external criticism of the company and its practices. “Alphabet and Google have faced accusations of maintaining a hostile and potentially discriminatory work environment over the years. Working in the technology industry has historically resulted in a skew toward male hires,” wrote the Daniels Fund, a charitable foundation set up by Bill Daniels, a pioneer in the U.S. cable industry. “The co-founders of the company have stepped down from day-to-day operations in order to allow a new CEO to take charge and build an ethical organizational culture,” the statement continued. In March, Inc. tech columnist Jason Aten discussed why Alphabet CEO Sundar Pichai may lose his job. It all revolves around poor corporate culture. Despite losing digital advertising market share over the past decade to Meta Platforms (NASDAQ:META) and Amazon (NASDAQ:AMZN), Google remains a cash flow gusher. In 2023, it generated $69.5 billion in free cash flow from revenue of $307.4 billion, a margin of 22.6%. So, warts and all, it generates nearly 23 cents in free cash flow per dollar of sales. That can buy a lot of AI innovation and product development. Of the Mag 7, Meta’s current forward P/E of 23.5 is 121% higher than its three-year average forward P/E. So, on a relative basis, it’s the most expensive. Its trailing 12-month free cash flow in 2023 was $43.9 billion, a 32.5% margin based on revenue of $134.9 billion, 990 basis points higher than Alphabet. Alphabet might be a free cash flow gusher, but it can’t keep up with Meta. If you look at the five others, I’m sure at least 2-3 also do better from an FCF margin. Meta’s gotten knocked around in the past couple of years, and yet it’s built a business that’s far more cash-flow friendly than Alphabet. All of the Mag 7 generate tremendous cash flow. However, only those that can quickly course-correct, as Meta CEO Mark Zuckerberg did in 2023 by cutting its metaverse expenses, will ultimately have the most valuable market caps. I use free cash flow yield to evaluate a stock’s relative value. Anything above 8% is value territory. Between 4% and 8% is fair value, and below 4% is overvalued. Alphabet’s current enterprise value is $1.66 trillion. Based on its free cash flow of $69.5 billion, its FCF yield is 4.2%. Meta’s, based on an enterprise value of $1.24 trillion and $43.9 billion, is 3.5%. It’s not surprising to note that META stock is up nearly 153% over the past year, three times the return of GOOG. I’d have to look at the other five companies to determine if they have an FCF yield higher than 4.2%. Nvidia’s (NASDAQ:NVDA) stock is up 263% over the past 52 weeks, but it most certainly isn’t one of them. I’d be much less enthusiastic about Alphabet’s chances if Google didn’t own YouTube. However, its founders were wise enough to pay $1.65 billion, a princely sum in 2006, providing a tremendous advertising growth vehicle over the next decade. A new CEO could solve some of the corporate culture issues. For this reason, and the ones I’ve mentioned, you should buy GOOG stock at current prices. It is the bargain of the seven. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. Artificial Intelligence, Cloud, Consumer Discretionary, Retail, E-Commerce, Communications, Media, Streaming, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/goog-stock-is-the-cheapest-of-the-magnificent-7-but-is-it-a-buy/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}