{
    "title": "Alphabet Inc. Cl A stock underperforms Thursday when compared to \ncompetitors despite daily gains",
    "date": "3/14/2024",
    "url": "https://www.marketwatch.com/data-news/alphabet-inc-cl-a-stock-underperforms-thursday-when-compared-to-competitors-despite-daily-gains-3780189d-6f88bf302495",
    "text": "Shares of Alphabet Inc. Cl A \n        GOOGL,\n        +0.04%\n       advanced 2.37% to $143.10 Thursday, on what proved to be an all-around poor trading session for the stock market, with the S&P 500 Index \n        SPX,\n        +0.11%\n       falling 0.29% to 5,150.48 and Dow Jones Industrial Average \n        DJIA,\n        +0.12%\n       falling 0.35% to 38,905.66. This was the stock's sixth consecutive day of gains. Alphabet Inc. Cl A closed $10.68 short of its 52-week high ($153.78), which the company achieved on January 29th. The stock demonstrated a mixed performance when compared to some of its competitors Thursday, as Microsoft Corp. \n        MSFT,\n        -0.17%\n       rose 2.44% to $425.22, Amazon.com Inc. \n        AMZN,\n        +0.31%\n       rose 1.24% to $178.75, and Meta Platforms Inc. \n        META,\n        -1.68%\n       fell 0.75% to $491.83. Trading volume (42.6 M) eclipsed its 50-day average volume of 31.0 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. Something unusual happened in the stock market this quarter: Both the S&P 500 and Cboe Volatility Index, better known as the Vix, rose. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}