{
    "title": "Is It Too Late to Buy Alphabet Stock?",
    "date": "3/3/2024",
    "url": "https://www.fool.com/investing/2024/03/03/is-it-too-late-to-buy-alphabet-stock/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Alphabet (GOOGL 0.04%) (GOOG 0.21%) stock has run like wildfire over the past year, riding the recovery of tech stocks, the rebound of digital advertising, and the accelerating adoption of artificial intelligence (AI). Share prices of the search leader gained 52% during the past 12 months, nearly double the 27% gains of the S&P 500. Investor confidence is on the upswing, fueled by the company's improving financial results, which suggests that the advertising market -- which represents the lion's share of Alphabet's revenue -- will continue to gain ground. Investors who sat out the recent rally are left asking themselves the quintessential investing question: Is a pullback coming, or should they buy Alphabet before the stock runs even higher? Let's see what the evidence suggests. Image source: Getty Images. Despite the bruising downturn of 2022 and the stock's recent run higher, there are still reasons to be optimistic. Google remains the worldwide search leader, with more than 91% of the market, according to data compiled by web traffic analytics provider StatCounter. This is the funnel that drives the digital advertising that provides nearly all of Alphabet's revenue. The company garnered an estimated 39% of worldwide digital ad revenue last year, according to online data provider Statista. Furthermore, digital ad spending is expected to spike in 2024, increasing 13% year over year, according to data compiled by Insider Intelligence. As the global leader, Alphabet is best positioned to ride that secular tailwind higher. The recovery in ad spending is already showing up in Alphabet's results. In the fourth quarter, Alphabet's revenue increased 13% year over year to $86.3 billion, accelerating from a 1% increase in the year-ago quarter. This suggests the advertising market is finally making a comeback, which could ultimately push Alphabet's stock higher. That's not the only potential catalyst that could drive gains for the company. The move to the cloud, a foundational part of the digital transformation, could also provide a boost. In the fourth quarter, Google Cloud remained the world's third-largest cloud infrastructure provider, with 10% of the market, trailing Amazon Web Services and Microsoft Azure, which controlled 31% and 26%, respectively, according to market analytics company Canalys. The role of cloud infrastructure services in providing generative AI to users has also been a hot topic, and Google Cloud is at the forefront of the conversation. Its Vertex AI service offers everything users need to get AI up and running, including 130 prebuilt foundation models to choose from. Users can also accelerate the development process to \"build, deploy, and scale AI-powered applications,\" according to the company. The most recent addition to its portfolio of products is Google Gemini, the company's \"largest and most capable AI model.\" The system was designed to understand and incorporate information from a multitude of sources, including audio, video, text, images, and even computer code. Tests suggest its premiere model, Ultra, \"exceeds current state-of-the-art results on 30 of the 32 widely used academic benchmarks\" used to assess AI performance. Alphabet is currently selling for roughly 24 times trailing earnings, a discount compared to the price-to-earnings (P/E) ratio of nearly 28 for the S&P 500. Furthermore, it's difficult to quantify the impact of generative AI. As the opportunity continues to unfold, Alphabet could be among the principal beneficiaries of this secular tailwind. As noted above, there are several growth drivers that could fuel an ongoing rally for Alphabet stock in the coming months and years. Given the opportunities ahead and its strong history of growth, I'd suggest now is the time to buy Alphabet stock while it's still on sale. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet, Amazon, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}