{
    "title": "Billionaires David Tepper and George Soros Both Own These \"Magnificent \nSeven\" Stocks. Should You?",
    "date": "3/2/2024",
    "url": "https://finance.yahoo.com/news/billionaires-david-tepper-george-soros-104900421.html",
    "text": "Few investors in history have been as successful as David Tepper and George Soros. Tepper's net worth stands close to $20.6 billion. Soros' net worth is roughly $6.7 billion today and was a lot more before he shifted $18 billion to his Open Society Foundation in 2018. Both men's fortunes were built largely as a result of shrewd hedge fund investments through the years. Tepper and Soros have quite different investing styles. They agree on some things, though. Both billionaire investors own these \"Magnificent Seven\" stocks in their respective hedge funds. Between Tepper's Appaloosa Management and Soros Fund Management, nearly all of the Magnificent Seven stocks are covered. The only outlier is Tesla, which neither hedge fund owns. However, there's not much overlap between Tepper's and Soros' portfolios. Tepper has made big bets on tech stocks. Unsurprisingly, he has invested in most of the Magnificent Seven. Meta Platforms ranks as his biggest holding, followed closely by Microsoft. He also still owns a significant position in Nvidia despite selling nearly 23% of his stake in the fourth quarter of 2023. Soros also owns quite a few tech stocks. But Meta, Microsoft, and Nvidia aren't in his Soros Fund Management portfolio. Apple stands alone as the only Magnificent Seven stock that Soros owns that isn't also owned by Tepper. That leaves two of the Magnificent Seven that are in both Tepper's and Soros' portfolios. Both billionaires own shares of Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) and Amazon (NASDAQ: AMZN). Amazon ranks as the third-largest position for Tepper's Appaloosa hedge fund. As of the end of 2023, it held 3.95 million shares of the e-commerce and cloud services company worth close to $600 million. Tepper increased his stake in Amazon by over 5.3% in the fourth quarter. Soros Fund Management isn't nearly as heavily invested in Amazon. At the end of last year, it owned a little under 557,000 shares, valued at $84.6 million. The hedge fund reduced its stake in Amazon during the fourth quarter of 2023 by 27%. Alphabet was Appaloosa's 10th-biggest holding at year-end. The hedge fund owned 2.3 million shares, worth a little over $324 million. But Tepper sold more than 16% of Appaloosa's stake in Alphabet during the fourth quarter. Soros' hedge fund also sold some of its position in Alphabet, reducing its stake by roughly 13%. But the stock still ranked as the fourth-largest holding in Soros' portfolio with 1.22 million shares, worth $170 million. I don't think other investors should buy Alphabet and Amazon just because Tepper and Soros have positions in the stocks. However, when two of the most successful investors on the planet both own the same stocks, it's probably a good idea to pay attention. Alphabet and Amazon should profit for years to come from the generative AI boom. Organizations across the world will almost certainly continue to shift their IT spending from on-premises to the cloud to develop AI apps. Amazon Web Services is the top cloud services provider, while Alphabet's Google Cloud is gaining ground. Both of these cloud platforms should grow much larger over the next decade and beyond. Each of these companies should also benefit from the rising adoption of self-driving cars, especially robotaxis. Alphabet's Waymo unit is a leader in autonomous driving technology. Amazon's Zoox also operates an up-and-coming robotaxi service. Those are just two big tailwinds for Alphabet and Amazon. I predict that both stocks will make investors a lot of money over the next several years. Those investors will likely include Tepper and Soros, but they could include you, too. Should you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet, Amazon, Apple, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Billionaires David Tepper and George Soros Both Own These \"Magnificent Seven\" Stocks. Should You? was originally published by The Motley Fool Related Quotes "
}