{
    "title": null,
    "date": "3/21/2024",
    "url": "https://investorplace.com/2024/03/3-tech-titans-trading-at-bargain-prices-your-chance-to-strike-gold/",
    "text": " In a bullish market, stocks rarely come at a discount - But here are some exceptions Advertisement Source: whiteMocca / Shutterstock It wasn’t long ago that high-interest rates were viewed as poison to most tech stocks. Consequently, the Street couldn’t stand the lion’s share of equities in the sector. However, that has changed in the midst of a bull market, and now many investors can’t buy shares fast enough. As a result, there aren’t that many tech stocks trading at bargain prices anymore. But there are still a sizeable number of such names. Here are three tech stocks trading at bargain prices that are poised to rally tremendously over the long term. Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) is reportedly in talks with Apple (NASDAQ:AAPL) about the tech giant using Google’s AI engine, Gemini, in its iPhones. Such a deal would be a tremendous game changer for Alphabet. It would generate needle-moving revenue for the firm, along with publicity worth many hundreds of billions of dollars. Gemini is capable of rapidly evaluating more information than any other AI model and quickly evaluating lengthy content. As usage of  Gemini increases with iPhone users having access to it, appreciation for the software’s strengths will increase. As a result of this increased exposure, a broader adoption across various platforms is likely to ensue, generating additional revenue streams for Alphabet. Moreover, I haven’t seen any data suggesting that Alphabet’s search engine is being undermined by the proliferation of AI, and the company’s YouTube website is flourishing. Additionally, its Google Cloud unit is growing rapidly and has become profitable. Despite these strong, positive catalysts, GOOG stock has a rather low, average forward price-earnings ratio of 21.8 times. IBM’s (NYSE:IBM) recently released WatsonX system is assisting other firms  in the training, testing and safe rolling out of AI technology. More specifically, WatsonX makes writing code more accessible for its customers, and is easily integrated with commonly used software. It can also easily create and store data for AI applications’ usage. In Q3 2023, the revenue generated by IBM’s data and AI-business segment rose by 6% versus the same period a year earlier, thanks to the proliferation of watsonx. Even more impressively, CEO Arvind Krishna noted an accelerated demand for AI, roughly doubling the business volume for WatsonX and generative AI from Q3 to Q4. IBM expects to generate an impressive $12 billion of free cash flow this year. The shares are currently changing hands at just 14.75 times that free cash flow target, definitely making IBM one of the tech titans trading at bargain prices. Until very recently, the Street loved to hate PayPal (NASDAQ:PYPL). However, I never understood the disdain for this PYPL. The company has a solid status as a fintech pure play. Additionally, it showed significant profitability, generating $6.68 billion of operating income last year, and growing its top line 9% YOY last quarter. Its new CEO is also determined to cut costs, and the stock itself has a low valuation. But a combination of irrational fears about Apple Pay suddenly taking tremendous market share from PayPal and the latter company’s profits not increasing as quickly as some on the Street would like caused the shares to tank from nearly $77 on April 14, 2023 to slightly over $50 on October 27. However, PayPal was the unfortunate recipient of irrational fears. There were concerns about Apple Pay taking tremendous amounts of market share from PayPal, which could result in profit stagnation. Thankfully, the stock option appears to be mounting a comeback, as the shares rose for seven consecutive sessions. It has seen almost 6% growth YTD. Analysts, on average, expect the company’s EPS to climb to $5.57 next year from $5.06 in 2024, but the shares have an extremely low forward price-earnings ratio of 12.3 times. On the date of publication, Larry Ramer did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. Artificial Intelligence, Cloud, Financial, Fintech, Software, Technology Undervalued Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/3-tech-titans-trading-at-bargain-prices-your-chance-to-strike-gold/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}