{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/brave-asset-management-inc-buys-392-shares-of-alphabet-inc-nasdaqgoog.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Brave Asset Management Inc. raised its stake in shares of  Alphabet Inc. (NASDAQ:GOOG – Free Report) by 0.6% in the 4th quarter, according to its most recent 13F filing with the Securities and Exchange Commission. The firm owned 66,185 shares of the information services provider’s stock after buying an additional 392 shares during the quarter. Alphabet comprises  2.6% of Brave Asset Management Inc.’s portfolio, making the stock its 11th biggest position. Brave Asset Management Inc.’s holdings in Alphabet were worth $9,327,000 as of its most recent filing with the Securities and Exchange Commission. Several other institutional investors also recently modified their holdings of the stock. Tolleson Wealth Management Inc. bought a new position in shares of  Alphabet during the 2nd quarter valued at about $411,000.  Westshore Wealth LLC lifted its holdings in shares of  Alphabet by 31.2% during the 2nd quarter. Westshore Wealth LLC now owns 15,700 shares of the information services provider’s stock valued at $1,887,000 after purchasing an additional 3,730 shares in the last quarter.  Washington Trust Bank lifted its holdings in shares of  Alphabet by 33.0% during the 3rd quarter. Washington Trust Bank now owns 7,359 shares of the information services provider’s stock valued at $970,000 after purchasing an additional 1,826 shares in the last quarter.  Woodley Farra Manion Portfolio Management Inc. lifted its holdings in shares of  Alphabet by 20.0% during the 2nd quarter. Woodley Farra Manion Portfolio Management Inc. now owns 5,986 shares of the information services provider’s stock valued at $724,000 after purchasing an additional 996 shares in the last quarter.  Finally, CNB Bank lifted its holdings in shares of  Alphabet by 6.6% during the 3rd quarter. CNB Bank now owns 27,723 shares of the information services provider’s stock valued at $3,655,000 after purchasing an additional 1,710 shares in the last quarter. 27.26% of the stock is currently owned by institutional investors and hedge funds. NASDAQ:GOOG opened at $152.26 on Friday. The firm has a market capitalization of $1.89 trillion, a price-to-earnings ratio of 26.25, a price-to-earnings-growth ratio of 1.40 and a beta of 1.05. Alphabet Inc. has a twelve month low of $100.29 and a twelve month high of $155.20. The stock’s 50 day moving average price is $144.89 and its two-hundred day moving average price is $139.48. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet (NASDAQ:GOOG – Get Free Report) last posted its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping the consensus estimate of $1.60 by $0.04. The firm had revenue of $86.31 billion for the quarter, compared to analyst estimates of $85.28 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business’s quarterly revenue was up 13.5% on a year-over-year basis. During the same quarter in the previous year, the firm earned $1.05 EPS.  Equities research analysts expect that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. In related news, Director Frances Arnold sold 230 shares of the business’s stock in a transaction that occurred on Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total transaction of $35,433.80. Following the transaction, the director now directly owns 15,104 shares of the company’s stock, valued at approximately $2,326,922.24. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. In other Alphabet news, CFO Ruth Porat sold 48,077 shares of the company’s stock in a transaction on Friday, March 8th. The stock was sold at an average price of $137.22, for a total value of $6,597,125.94. Following the transaction, the chief financial officer now directly owns 1,777,106 shares of the company’s stock, valued at approximately $243,854,485.32. The sale was disclosed in a legal filing with the SEC, which is accessible through this link. Also, Director Frances Arnold sold 230 shares of the company’s stock in a transaction on Tuesday, January 30th. The shares were sold at an average price of $154.06, for a total value of $35,433.80. Following the completion of the transaction, the director now directly owns 15,104 shares in the company, valued at $2,326,922.24. The disclosure for this sale can be found here. In the last three months, insiders have sold 263,312 shares of company stock valued at $37,268,315. 12.99% of the stock is owned by insiders. Several equities research analysts have commented on the company. Raymond James boosted their target price on Alphabet from $150.00 to $160.00 and gave the company an “outperform” rating in a research note on Wednesday, January 24th. Susquehanna boosted their target price on Alphabet from $150.00 to $170.00 and gave the company a “positive” rating in a research note on Wednesday, January 31st. Five investment analysts have rated the stock with a buy rating,  Based on data from MarketBeat, the company  has an average rating of “Buy” and an average target price of $146.33. Get Our Latest Stock Report on GOOG (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOG? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOG – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 271 Shares in NIKE, Inc. (NYSE:NKE) Acquired by Planned Solutions Inc. "
}