{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/mezzasalma-advisors-llc-sells-73-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Mezzasalma Advisors LLC lessened its holdings in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 0.1% in the fourth quarter, according to its most recent 13F filing with the Securities and Exchange Commission. The institutional investor  owned 91,048 shares of the information services provider’s stock after selling 73 shares during the quarter. Alphabet accounts for approximately  6.9% of Mezzasalma Advisors LLC’s portfolio, making the stock its 4th largest position. Mezzasalma Advisors LLC’s holdings in Alphabet were worth $12,718,000 at the end of the most recent quarter. A number of other hedge funds and other institutional investors also recently made changes to their positions in GOOGL. Vanguard Group Inc. boosted its holdings in shares of  Alphabet by 1,919.4% in the 3rd quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock worth $45,628,484,000 after buying an additional 453,413,389 shares during the last quarter.  State Street Corp lifted its holdings in  Alphabet by 1,900.6% during the third quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock valued at $20,770,809,000 after purchasing an additional 206,300,042 shares during the last quarter.  Moneta Group Investment Advisors LLC lifted its holdings in  Alphabet by 111,197.8% during the fourth quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock valued at $15,036,178,000 after purchasing an additional 170,267,122 shares during the last quarter.  Price T Rowe Associates Inc. MD lifted its holdings in  Alphabet by 1,759.2% during the third quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock valued at $11,106,502,000 after purchasing an additional 109,870,525 shares during the last quarter.  Finally, Norges Bank purchased a new stake in  Alphabet during the fourth quarter valued at about $8,335,063,000. 35.08% of the stock is owned by hedge funds and other institutional investors. GOOGL stock opened at $150.77 on Friday. The company has a market capitalization of $1.87 trillion, a PE ratio of 25.99, a price-to-earnings-growth ratio of 1.36 and a beta of 1.04. Alphabet Inc. has a one year low of $99.74 and a one year high of $153.78. The company’s 50 day moving average price is $143.02 and its two-hundred day moving average price is $137.79. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, topping the consensus estimate of $1.60 by $0.04. The firm had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same period last year, the firm posted $1.05 earnings per share.  As a group, analysts predict that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. In related news, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction on Wednesday, March 20th. The shares were sold at an average price of $148.78, for a total value of $3,347,550.00. Following the transaction, the chief executive officer now directly owns 2,310,191 shares of the company’s stock, valued at $343,710,216.98. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. In related news, insider John Kent Walker sold 28,281 shares of Alphabet stock in a transaction on Thursday, December 28th. The shares were sold at an average price of $141.40, for a total value of $3,998,933.40. Following the transaction, the insider now directly owns 25,002 shares of the company’s stock, valued at $3,535,282.80. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. Also, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction on Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the completion of the transaction, the chief executive officer now directly owns 2,310,191 shares in the company, valued at $343,710,216.98. The disclosure for this sale can be found here. Over the last ninety days, insiders have sold 279,659 shares of company stock valued at $39,460,310. 0.88% of the stock is currently owned by corporate insiders. Several equities research analysts have commented on GOOGL shares. Wedbush upped their price objective on shares of Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a report on Friday. Wells Fargo & Company increased their price target on shares of Alphabet from $141.00 to $144.00 and gave the stock an “equal weight” rating in a report on Monday, March 18th. BMO Capital Markets increased their price target on shares of Alphabet from $170.00 to $178.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. Susquehanna increased their price target on shares of Alphabet from $150.00 to $170.00 and gave the stock a “positive” rating in a report on Wednesday, January 31st. Finally, Wolfe Research increased their price target on shares of Alphabet from $170.00 to $180.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. Five investment analysts have rated the stock with a hold rating, twenty-six have issued  a buy rating and two have assigned  a strong buy rating to the company’s stock. Based on data from MarketBeat.com, Alphabet currently has a consensus rating of “Moderate Buy” and a consensus price target of $155.48. Get Our Latest Analysis on GOOGL (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Cedar Brook Financial Partners LLC Has $2.50 Million Holdings in Alphabet Inc. (NASDAQ:GOOGL) Whittier Trust Co. of Nevada Inc. Sells 32,669 Shares of Albemarle Co. (NYSE:ALB) "
}