{
    "title": "Alphabet (NASDAQ:GOOGL) Trading 0% Higher",
    "date": "3/29/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-percent-advance-2024-03-29/",
    "text": "Alphabet Inc. (NASDAQ:GOOGL - Get Free Report) was up 0% on Friday . The stock traded as high as $151.43 and last traded at $150.93. Approximately 24,485,390 shares traded hands during trading, a decline of 29% from the average daily volume of 34,518,160 shares. The stock had previously closed at $150.87. Several equities analysts have recently weighed in on GOOGL shares. Wolfe Research increased their price target on Alphabet from $170.00 to $180.00 and gave the company an \"outperform\" rating in a report on Wednesday, January 31st. Susquehanna upped their price objective on Alphabet from $150.00 to $170.00 and gave the stock a \"positive\" rating in a research note on Wednesday, January 31st. Redburn Atlantic upped their price objective on Alphabet from $150.00 to $165.00 and gave the stock a \"buy\" rating in a research note on Wednesday, January 31st. Citigroup upped their price objective on Alphabet from $153.00 to $168.00 and gave the stock a \"buy\" rating in a research note on Wednesday, January 31st. Finally, BMO Capital Markets upped their price objective on Alphabet from $170.00 to $178.00 and gave the stock an \"outperform\" rating in a research note on Wednesday, January 31st. Five investment analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have issued a strong buy rating to the stock. According to MarketBeat.com, Alphabet presently has a consensus rating of \"Moderate Buy\" and a consensus price target of $155.48. Check Out Our Latest Research Report on GOOGL The company has a current ratio of 2.10, a quick ratio of 2.10 and a debt-to-equity ratio of 0.05. The business has a 50-day moving average price of $143.67 and a 200-day moving average price of $138.21. The firm has a market cap of $1.88 trillion, a P/E ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. Alphabet (NASDAQ:GOOGL - Get Free Report) last posted its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping analysts' consensus estimates of $1.60 by $0.04. The business had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same quarter in the prior year, the company earned $1.05 EPS. On average, equities analysts forecast that Alphabet Inc. will post 6.77 EPS for the current fiscal year. In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction dated Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total value of $3,152,475.00. Following the completion of the sale, the chief executive officer now directly owns 2,422,691 shares in the company, valued at $339,443,236.01. The transaction was disclosed in a document filed with the SEC, which is available at this link. In other news, Director Frances Arnold sold 230 shares of the stock in a transaction dated Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total value of $35,433.80. Following the transaction, the director now directly owns 15,104 shares of the company's stock, valued at $2,326,922.24. The sale was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, CEO Sundar Pichai sold 22,500 shares of the stock in a transaction dated Wednesday, January 3rd. The shares were sold at an average price of $140.11, for a total value of $3,152,475.00. Following the completion of the transaction, the chief executive officer now directly owns 2,422,691 shares in the company, valued at $339,443,236.01. The disclosure for this sale can be found here. Over the last ninety days, insiders sold 263,312 shares of company stock worth $37,268,315. 0.88% of the stock is owned by insiders. Several hedge funds and other institutional investors have recently bought and sold shares of the stock. Live Oak Investment Partners purchased a new position in shares of Alphabet in the fourth quarter valued at approximately $26,000. Vermillion & White Wealth Management Group LLC purchased a new position in Alphabet during the fourth quarter worth approximately $30,000. Sanctuary Wealth Management L.L.C. purchased a new position in Alphabet during the fourth quarter worth approximately $34,000. VitalStone Financial LLC lifted its position in Alphabet by 1,900.0% during the second quarter. VitalStone Financial LLC now owns 280 shares of the information services provider's stock worth $34,000 after buying an additional 266 shares in the last quarter. Finally, Turim 21 Investimentos Ltda. purchased a new position in Alphabet during the third quarter worth approximately $38,000. 40.03% of the stock is owned by institutional investors and hedge funds. Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.See AlsoFive stocks we like better than AlphabetWhat is a Low P/E Ratio and What Does it Tell Investors?3 Value Stocks Too Small For Buffett’s Portfolio5 Top Rated Dividend Stocks to ConsiderFoot Locker Builds Up Another Head of Steam; Gains ImminentWhat is a buyback in stocks? A comprehensive guide for investorsDisney Stock Catches 3 Upgrades In a Single Week Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Which stocks are likely to thrive in today's challenging market? Click the link below and we'll send you MarketBeat's list of ten stocks that will drive in any economic environment. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}