{
    "title": "Google co-founder says company 'definitely messed up' on Gemini's image \ngeneration",
    "date": "3/4/2024",
    "url": "https://au.finance.yahoo.com/news/google-co-founder-says-company-232249625.html",
    "text": "Google co-founder Sergey Brin admitted the tech giant \"definitely messed up\" with the image generation feature of its new artificial intelligence tool, Gemini, addressing the issue after backlash over the model's bias against White people. During a speaking engagement at Silicon Valley's AGI House, Brin was asked about Gemini right out of the gate, given that Google pulled the plug on the feature last month while it continues working to fix the issues. \"We definitely messed up on the image generation,\" Brin said, acknowledging that Gemini \"definitely, for good reasons, upset a lot of people on the images you might have seen.\" GOOGLE GEMINI: FORMER EMPLOYEE, TECH LEADERS SUGGEST WHAT WENT WRONG WITH AI CHATBOT Brin co-founded Google with Larry Page in 1998 and stepped down as president of its parent company, Alphabet, in 2019, but he remains on the board and has been involved with Gemini's development. Brin remains one of the company's top stockholders and owns more than 360 million shares. \"We haven't fully understood why it leans left in many cases,\" he told the audience. \"That's not our intention. But if you try it, starting over this last week, it should be at least 80% better, of the test cases that we've covered.\" READ ON THE FOX BUSINESS APP OHIO SENATOR DEMANDS GOOGLE ‘BREAKUP’ AMID GEMINI DEBACLE: ‘ONE OF THE MOST DANGEROUS COMPANIES IN THE WORLD’ Google halted Gemini's image generation feature nearly two weeks ago after users on social media flagged that it was creating inaccurate historical images that sometimes replaced White people with images of Black, Native American and Asian people. Google CEO Sundar Pichai told employees last week that the company is working \"around the clock\" to fix Gemini's bias, calling the images generated by the model \"completely unacceptable.\" The company reportedly plans to relaunch Gemini AI's ability to generate images of people in the next few weeks.  Original article source: Google co-founder says company 'definitely messed up' on Gemini's image generation Microsoft and OpenAI are working on plans for a data center project that could cost as much as $100 billion and include an artificial intelligence supercomputer called \"Stargate\" set to launch in 2028, The Information reported on Friday.  Rapid adoption of generative artificial intelligence technology has led to sky-rocketing demand for AI data centers capable of handling more advanced tasks than traditional data centers.  The Information reported that Microsoft would likely finance the project, which is expected to be 100 times more costly than some of the biggest existing data centers, citing people involved in private conversations about the proposal. Ever wondered what goes down at a tantric sex class? Here's your chance to find out. Trade 24 hours a day on the world's most popular platform. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. An American living down under has shared his views on one “weird” rule Australia has at Easter time. Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ...  An alleged plant thief who continued to come back to the same house has been stopped by the efforts of one very determined plant owner and technology. Daylight saving is coming to an end soon, here’s what you need to do to ensure you don’t sleep past your alarm. Network Ten is seeking to reopen Bruce Lehrmann’s defamation trial, two days before the judge was to hand down his decision.  Does bloody conquest, dark ritual or mercenary money explain a gold covered helmet found buried in a field? \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\" The person who wrote on the road has been called a \"top bloke\" by motorists. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 EXCLUSIVE: Eden Harper’s close friend has called out Jayden Eynaud after he was spotted looking very cosy with Lauren Dunn at a club. Read more. If you like your scrambled eggs soft and creamy, then there's one ingredient you need to start adding to your dish. Celebrity chefs swear by it. Fears that Putin could emulate Stalin by trying to further consolidate Eastern bloc  Saturday Night Live went with Donald Trump’s hawking of Bibles for its cold open, with James Austin Johnson returning as the former president to make the pitch. It was another case of the show trying to satirize something that hardly needs rewriting. “That’s right, it’s Easter. The time of year when I compare myself to … The four men accused of a deadly terror attack on Moscow’s Crocus City concert hall last week were quickly identified by Russian authorities as being from Tajikistan, a former Soviet republic in Central Asia. The NSW schoolgirl has not been seen since being dropped at school on Thursday morning.  Married At First Sight’s breakout star Lucinda Light has wowed fans on social media after she unveiled a surprising new look. Read more. Ukrainian president says Easter shows ‘life can prevail’ ‘When a person chooses a lifestyle, they have to deal with whatever comes with it’ "
}