{
    "title": "Google: Strong Buy - The Cheapest Trillionaire (NASDAQ:GOOG)",
    "date": "3/17/2024",
    "url": "https://seekingalpha.com/article/4678767-google-strong-buy-cheapest-trillionaire",
    "text": "Ole_CNX  Ole_CNX Having recently written a piece about the 4 Strongest Balance Sheets in the market, my analysis was Google (NASDAQ:GOOGL)(NASDAQ:GOOG) had the strongest of them all. I have been accumulating Google at these prices and believe the AI image generator flub has presented us with a buying opportunity of one of America's best businesses. If 2025 analyst numbers come in on the high end [which we'll take a look at later], then this is not only GARP, it is GARCP [growth at a cheap price]. Google has a monster of a balance sheet with over $100 Billion in cash and equivalents paired up with only $11 Billion in long-term debt. This is a self-funding machine that has some nice catalysts in the pipeline. Waymo in my opinion is one of those. The possibility of acquiring TikTok, which is looking fairly certain will be forced to sell its U.S. operations, is another. Anyone who has experienced YouTube shorts knows that much of it is recycled and reposted TikTok content. Google won't be the only bidder should the Senate pass the proposal to force the sale of TikTok, but they have the strongest balance sheet to close the deal should regulators allow it. While we know that the FTC's Lina Kahn has now gained a reputation for being anti-tech and anti-merger, there's no way that Congress is passing this legislation believing that a company outside of these major tech firms will have the ability to comfortably close a deal on TikTok. The Gemini image generator started producing racially biased images through Gemini image requests a few weeks back. This is truly where the downtrend in Google began when we consider the company's strong fundamentals and cheap price when compared to Microsoft(MSFT). I have experienced both ChatGPT and Gemini. Both provide very similar, quick responses to complex questions. While I have not experienced the image generators, I don't see how a non-revenue generating experimental program could endanger the business and warrant a sell-off. I found it a buying opportunity. I am still not familiar with individuals who now prefer Bing's search engines due to the incorporation of ChatGPT. I am aware these individuals exist, but they are in select circles. Revenue sources from FactSet:  Alphabet investor relations We'll leave out other bets as the growth rates pertaining to actual dollar values are negligible. The ads and fees business continues to add solid top-line growth and Google Cloud continues to grow at an even higher rate. While these are all cloud-based services, anyone who uses Google's collaborative services knows that what they offer is becoming comparable to Microsoft's (MSFT) suites of enterprise software. So while pundits worry about Bing eating into Google Services revenue, Google Cloud is assuredly taking some of Microsoft's business as well. Within the Google Services segment is Google Play, the equivalent of the app store for Apple. Vicariously through open-source Android Google inserts all of its apps on Android using phones, basically all phones, not iPhones for the sake of the US market. Similarly to Apple, Google charges an average of 15% commissions for sales of Apps through Google Play. If we believe the narrative that other phone offerings from Samsung in particular offer features that may sway more users toward Android operating phones, then Google also becomes a cellular device service growth story by way of not being on iPhones[Google Play]. Speaking of which, Google has to pay Apple around $18 Billion a year to be a default search engine on their devices. As Samsung and even Google's own Pixel sales grow, this is less cash Google will need to cough up if users move to other devices as they will natively be default on their own Android OS. Data by YCharts While Google is not as far off its highs as some other Mag 7 names like Apple (AAPL) or Tesla (TSLA), it is deservedly so as Google has better [cheaper] fundamentals than either of those names. This is the case where you have a stagnant price in a steady EPS and free cash flow compounder where the company grows into a deal without much downside share price action. FWD P/E Ratios Data by YCharts I'll point out that I am in the high-end estimate camp later in the article and view Google's forward 2025 P/E ratio more in the realm of 15 X with an expected 20+% growth rate. Getting a company like this at a GAAP PEG 1 or lower is not easy, you can probably count the historical opportunities on one hand. Price versus EPS and Revenue Growth Data by YCharts I continue to emphasize the importance of implementing the 10-year comparison of EPS and revenue growth to share price growth. In quality companies, they should track each other and in hot names, share price appreciation will outpace these two metrics indicating higher levels of \"overbought\" conditions the more share price gets ahead of earnings and revenue growth rates. Peter Lynch started every case study measuring these metrics, aiming to buy when EPS and revenue were ahead of share price appreciation or at least on par with one another. While he never explicitly said, to chart these, being that the average Joe couldn't do so in the 1980s and 1990s, we now all have the toolsets at our fingertips. Google EPS growth is trending ahead of share price growth, very indicative of value especially amongst the Mag 7 where this is a rarity. Data by YCharts Over a 10-year history, Google's free cash flow per share growth has been fantastic. At over 500%, the company now generates $56.8 Billion in free cash flow TTM. This is right around the amount that Microsoft produces TTM [$58.6 Billion levered]. The biggest difference is the multiple. Microsoft trades at 50 X TTM free cash flow and Google at 30 X. Data by YCharts Google MRFY 10K Google MRFY 10K We can see the above corner-to-corner down trend in shares outstanding over the past 3 years. Last year alone Google retired 528 million shares with $62.2 Billion in buybacks. Data by YCharts This was the cleanest balance sheet I came across amongst the Fab 7. $110 Billion in cash and short-term investments and $11.87 Billion in Long Term Debt. $31 Billion more in long-term investments with large enough investments in other publicly traded companies that now require them to file a 13F. Here are Google's publicly listed liquid holdings: Whalewisdom Whalewisdom Seeking Alpha Seeking Alpha Analysts have a high end 2025 EPS estimate of $9.07 a share, I'm in the high-end camp. From my article evaluating the 4 best of the Fab 7 balance sheets, I came up with the following valuation: Even giving ourselves a 20% margin of safety leaves us with a glide path to buy under $151. Seeking Alpha Seeking Alpha Google has beat the EPS expectations every quarter FY 2023. I have no reason to believe they can not continue this trend, especially with a balance sheet that allows them to buy back shares to the accounting department's calculus and over $40 Billion in R&D expense which could be pared back to increase operating income. Waymo While Waymo continues to be an expensive research project, it is functional. Tesla(TSLA) owners praise self-driving taxis as the \"holy grail\" that will soon be the next leg up in revenue growth. Well, Google is already putting its product into action and can attach its apparatus to any vehicle, they don't need a production line to spit out Waymo vehicles. Waymo uses lidar versus camera-based self-driving systems on Tesla's vehicles. Lidar at this scale to be this accurate creates an ugly visual presentation, but so far, it seems to work. With now over 40 million miles of self-driving under Waymo's belt, the company has gained approval to operate in a few complex major metros around the US. This includes: While the routes are somewhat limited within those cities, you can view riders being picked up and dropped off in driverless taxis now. I have watched several of these videos and have noticed improvements in the experience as time has gone by. They even now have an \"emergency\" pullover button in case a rider is distressed or thinks something is wrong. When this pays off as a revenue growth generator is difficult to anticipate, but I see evidence of the product working. This is an area where real AI is being put to work. TikTok TikTok looks to be finally headed for a forced sale. Who will buy it is the question. With YouTube shorts already being a slew of regurgitated TikTokers, the fit just seems all too perfect and Google is ready. If regulators let Google purchase the company, this could be a revenue driver for years to come. This would be an amazing bolt-on for Google and they have the cash to pull this off. While there will be competition, if all it comes down to is who has the most powerful balance sheet and price is not the limiting factor, then Google should win. AI, Gemini, and others AI is being demonstrated through the success of Waymo. Google has a vast ocean of data being the default web browser, GPS and search engine [including YouTube] on most Western computers and handheld devices. With the strong shift in R&D focus by all of these mega cap tech companies to artificial intelligence, Google has a data advantage over others in this space. Data centers & Google Cloud The cloud continues to be the fastest grower on the top line and more and more data will be moved to the cloud as external hard drives on desktops become a thing of the past. Browse your local Best Buy and you'll find that Chromebooks are an amazing deal for quality versus cost. The caveat is little to nil internal storage. Most everything works through the Google Cloud. As students from College to Elementary School adopt Chromebooks as their go-to work spaces, the cloud should only grow and eat into some of Microsoft's software business. All the analysts are going to be watching Google's services performance. If the armor gets dented and the company dips below double-digit growth rates, we're all going to get an earful. That being said, the stock will probably still be cheap even if the search engine moat begins to deteriorate and Microsoft absorbs some business comparatively. However, that sort of performance will send the stock lower unless the cloud grows at an even faster rate than current. Regulatory risk is always an issue with the trillionaire club. Interjecting a good set of analogies from Gautam Baid's popular book The Joys of Compounding which has a wealth of amazing quotes to live by: I like the following two as it relates to the information arbitrage disconnect between numbers and reality: The true scarce commodity of the near future will be human attention.- Satya Nadella and In an information-rich world, the wealth of information means a dearth of something else: a scarcity of whatever it is that information consumes. What information consumes is rather obvious: it consumes the attention of its recipients. Hence a wealth of information creates a poverty of attention and a need to allocate attention efficiently among the overabundance of information sources that might consume it. -Herbert Simon. Here the numbers gives us one set of facts and the narrative around AI, which none of us truly understand, gives us another. Yes, we may understand the functions of AI, but no one really understands where the true revenue and profit compounders will ultimately emanate from. The race to prove AI functionality to elevate stock prices in lieu of true profit generation purpose pushed Google into an error. The error created a narrative but the numbers are the true story. Allocate your attention more efficiently as an investor. Of the Fab 7, I have been adding only to Amazon (AMZN) and Google. Google is the most fairly valued being that you don't need to perform any mental gymnastics to come up with a fair valuation. If they keep growing at this rate and hit FY 2025 numbers, the price today equates to a sub-PEG 1 stock, the only one by my calculation in the Fab 7. Strong buy. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL, GOOG, AMZN, MSFT, AAPL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The information provided in this article is for general informational purposes only and should not be considered as financial advice. The author is not a licensed financial advisor, Certified Public Accountant (CPA), or any other financial professional. The content presented in this article is based on the author's personal opinions, research, and experiences, and it may not be suitable for your specific financial situation or needs. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}