{
    "title": "Bath Savings Trust Co Sells 562 Shares of Alphabet Inc. (NASDAQ:GOOGL)",
    "date": "3/18/2024",
    "url": "https://www.defenseworld.net/2024/03/18/bath-savings-trust-co-sells-562-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 18th, 2024 Bath Savings Trust Co decreased its holdings in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 0.3% during the 4th quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The firm owned 199,806 shares of the information services provider’s stock after selling 562 shares during the quarter. Alphabet makes up  approximately  3.1% of Bath Savings Trust Co’s holdings, making the stock its 8th biggest holding. Bath Savings Trust Co’s holdings in Alphabet were worth $27,911,000 as of its most recent filing with the Securities & Exchange Commission. Several other institutional investors and hedge funds have also recently bought and sold shares of GOOGL. DE Burlo Group Inc. grew its position in  Alphabet by 520.0% in the 2nd quarter. DE Burlo Group Inc. now owns 96,498 shares of the information services provider’s stock worth $11,551,000 after purchasing an additional 80,934 shares during the last quarter.  Montag A & Associates Inc. grew its position in  Alphabet by 2.1% in the 2nd quarter. Montag A & Associates Inc. now owns 129,511 shares of the information services provider’s stock worth $15,502,000 after purchasing an additional 2,670 shares during the last quarter.  West Tower Group LLC bought a new position in  Alphabet in the 2nd quarter worth about $88,000.  Fisher Asset Management LLC grew its position in  Alphabet by 1.4% in the 2nd quarter. Fisher Asset Management LLC now owns 42,725,279 shares of the information services provider’s stock worth $5,114,215,000 after purchasing an additional 579,305 shares during the last quarter.  Finally, Ballast Advisors LLC grew its position in  Alphabet by 9.6% in the 3rd quarter. Ballast Advisors LLC now owns 15,747 shares of the information services provider’s stock worth $2,061,000 after purchasing an additional 1,385 shares during the last quarter. Institutional investors and hedge funds own  35.08% of the company’s stock. In other Alphabet news, Director John L. Hennessy sold 300 shares of the stock in a transaction that occurred on Tuesday, March 12th. The shares were sold at an average price of $139.51, for a total value of $41,853.00. Following the completion of the sale, the director now owns 9,291 shares in the company, valued at approximately $1,296,187.41. The transaction was disclosed in a legal filing with the SEC, which can be accessed through this link. In other news, Director John L. Hennessy sold 300 shares of the stock in a transaction on Tuesday, March 12th. The shares were sold at an average price of $139.51, for a total transaction of $41,853.00. Following the transaction, the director now owns 9,291 shares in the company, valued at approximately $1,296,187.41. The sale was disclosed in a document filed with the SEC, which is accessible through the SEC website. Also, CFO Ruth Porat sold 48,077 shares of the stock in a transaction on Friday, March 8th. The stock was sold at an average price of $137.22, for a total transaction of $6,597,125.94. Following the transaction, the chief financial officer now owns 1,777,106 shares in the company, valued at approximately $243,854,485.32. The disclosure for this sale can be found here. Insiders sold a total of 279,159 shares of company stock worth $39,220,185 in the last quarter. 0.88% of the stock is currently owned by corporate insiders. Several research firms have commented on GOOGL. Needham & Company LLC  restated a “buy” rating and issued a $160.00 target price on shares of Alphabet in a research report on Wednesday, January 31st. Tigress Financial increased their price objective on shares of Alphabet from $172.00 to $176.00 and gave the company a “strong-buy” rating in a report on Tuesday, November 21st. Mizuho increased their price objective on shares of Alphabet from $155.00 to $170.00 and gave the company a “buy” rating in a report on Wednesday, January 17th. Wedbush  reiterated an “outperform” rating and issued a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Finally, Wolfe Research increased their price objective on shares of Alphabet from $170.00 to $180.00 and gave the company an “outperform” rating in a report on Wednesday, January 31st. Five research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have issued  a strong buy rating to the company. Based on data from MarketBeat.com, the stock currently has an average rating of “Moderate Buy” and an average price target of $154.58. View Our Latest Research Report on Alphabet GOOGL stock opened at $141.18 on Monday. Alphabet Inc. has a 12-month low of $95.50 and a 12-month high of $153.78. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The company has a market cap of $1.76 trillion, a price-to-earnings ratio of 24.34, a PEG ratio of 1.29 and a beta of 1.04. The company has a 50 day moving average of $142.32 and a two-hundred day moving average of $137.37. Alphabet (NASDAQ:GOOGL – Get Free Report) last released its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The company had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. During the same quarter in the prior year, the firm earned $1.05 EPS.  On average, equities analysts anticipate that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.    Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Microsoft Co. (NASDAQ:MSFT) Stock Position Decreased by Vanguard Group Inc. Boston Common Asset Management LLC Trims Position in Alphabet Inc. (NASDAQ:GOOGL) "
}