{
    "title": null,
    "date": "3/8/2024",
    "url": "https://www.fool.com/investing/2024/03/08/buy-hot-growth-stocks-before-they-take-off/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More The market's foreseeable future isn't entirely clear. Oh, last quarter's earnings were generally good -- Factset reports the S&P 500's profits were up an average of 3% in Q4. But inflation remains elevated, and the yield curve remains inverted. Both can portend a recession. Political uncertainty isn't exactly great for stock market stability either. Some growth stocks, however, are capable of moving independently of the broad market. They don't necessarily rally when most other stocks do, and they often log gains when the overall market is struggling. To this end, here's a closer look at three growth stocks that haven't been red-hot performers recently, but could take off soon. You may want to consider jumping in at these prices while you still can. Sarepta Therapeutics (SRPT -0.59%) isn't exactly a household name, but understandably so. Its market cap of $11.3 billion doesn't make it a heavyweight. Its lack of profits thus far leaves lots of investors disinterested as well. This is one of those cases, however, in which you have to look forward rather than backward. Profits are coming, and soon. As the name suggests, Sarepta Therapeutics is a biopharma company. It makes a handful of drugs, but its focus is using gene therapy to treat muscular dystrophy. Demand is strong. Its fourth-quarter top line improved 55% year over year, capping off full-year sales growth of 36% thanks to 2023's launch of its newest drug, Elevidys. All told, the pharma company did $1.1 billion worth of business last year. As was noted, that still wasn't enough growth to produce a full-year profit. Read the proverbial fine print, though. Sarepta did produce a non-GAAP profit for the third quarter of last year and swung to a GAAP profit in the fourth quarter. It's expected to remain in the black this year as well, with analysts calling for per-share earnings of $2.47 versus last year's loss of $5.80. Next year's bottom line is expected to reach $10.50 per share, once sales of all of its recently approved therapies reach their full stride. So why hasn't the stock reflected any of this impending profit progress? Well, it did. It just did so more than five years ago, when its gene therapies first started showing real promise as treatments for muscular dystrophy. Investors weren't quite sure how to price it in the meantime, as hopes became reality. With GAAP profits now on the radar, don't be surprised to see the stock start performing more reliably. Shares are currently priced at less than 12 times next year's projected earnings. Last year was a disaster for Enphase Energy (ENPH 0.98%) stockholders. Shares tumbled from their late-2022 peak near $339 to October's low of $74 after its top line was more than cut in half. Ditto for earnings. But this is another case in which you must take a step back and look at the bigger picture before jumping to any long-term conclusions. If you're not familiar with it, Enphase manufactures solar power equipment -- just not the equipment you're most likely to think of first. Rather than solar panels, Enphase Energy makes microinverters that convert sunlight collected by solar panels into usable electricity. The company adds value to this much-needed solution by also offering battery-based power storage, a means of managing its systems to work in conjunction with utility-provided electricity, and even electric vehicle charging stations. It's got large-scale solutions for businesses too. Solar's been a pretty reliable market. That is, until last year. Between the end of certain tax incentives, higher interest rates, and economic lethargy, demand for residential and small-scale solar power technology -- which often comes at a steep upfront cost -- plummeted. There's a light at the end of the tunnel, though. Solar power continues to become more cost-effective, and the world's feeling at least slightly less nervous about the condition of the economy. The evidence? The Solar Energy Industries Association reports residential solar power system installations in the U.S. were up 35% year over year during the third quarter of last year, with a record-breaking 210,000 new panels put in place. The recovery could remain choppy, mind you. The Solar Energy Industries Association still believes the domestic residential solar market won't begin a meaningful rebound until 2025. In this vein, Enphase Energy's top line is expected to fall another 28% in 2024. From 2025 through 2028, however, the domestic residential solar business should grow at an average annual pace of 10%, with overseas markets following suit. Enphase's revenue is expected to soar by 40% in the first of those years, kicking off what should be an impressive stretch. Of course, the stock could start moving in anticipation of that rebound well before it actually takes shape. Last but not least, add Google parent Alphabet (GOOG 0.21%) (GOOGL 0.04%) to your list of growth stocks to buy before something lights a fire under them. You may recall, Alphabet's fourth quarter was, while respectable, not exactly thrilling. Advertising revenue -- the company's core business -- rolled in at $65.5 billion versus expectations of $65.9 billion. YouTube's underwhelming contribution to overall advertising revenue was the key culprit for the shortfall, even if pales in comparison to Alphabet's search ad business. And it wasn't the first time in 2023 the company came up short one way or another. That's a big reason the stock trades roughly where it was two years ago. You may want to take a closer look at Alphabet's actual numbers, though. They're still pretty darn good. For instance, although relatively disappointing, YouTube's ad revenue for the fourth quarter of 2023 was still up 15.5% year over year. Overall advertising revenue was up nearly 11% in Q4. Better yet, Google Cloud's operating income widened to a record-breaking $864 million, with more such growth on the way. Indeed, with the exception of the second quarter of 2020 (when the pandemic was taking an obvious toll on the global economy), the fourth quarter of 2023 would have been the 44th consecutive quarter Alphabet reported at least some degree of year-over-year revenue growth. That consistent growth is not apt to end this year or next year, either. The analyst community is calling for sales growth of 11.3% this year to be followed by growth of 10.4% next year. Per-share profits are projected to grow even more. So why is the stock struggling so much? Good question. The most plausible answer is investors are seeing the glass as being half empty rather than half full, swayed by a little too much pessimistic rhetoric. Just for the record, analysts aren't swayed. They're maintaining their consensus buy rating, just as they're maintaining their consensus price target of $164.40 per share. That's 24% above the stock's current price. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. James Brumley has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet and Enphase Energy. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}