{
    "title": "Why Jeff Bezos's latest bet spells trouble for Google",
    "date": "3/9/2024",
    "url": "https://www.telegraph.co.uk/business/2024/03/09/google-search-ai-chatbots-gemini-jeff-bezos/",
    "text": "Tech giant risks killing its golden goose as it fights off the challenge of AI chatbots It is one of Silicon Valley’s legendary investments. In 1998, a 34-year-old Jeff Bezos gave $250,000 (£196,000) to a pair of Stanford University students who had developed a new type of search engine. At the time, it was a risky bet. Most people browsed the web by using “portals” like Yahoo or by remembering their favourite sites; it was not obvious that searches would be a profitable business. But when Google went public in 2004, Bezos’s stake was worth $280m. If he had held on to it, it would now be worth billions. So in January, when the Amazon founder invested in a company seeking to take Google’s place in the food chain, people sat up and took notice. Bezos took part in a $74m investment in Perplexity, a San Francisco start-up that aims to answer queries with artificial intelligence rather than a list of links. Type a question into the app – how to roast a chicken – and it will confidently answer with a couple of sentences and a few bullet points, rather than the list of links that made Google famous. Aravind Srinivas, Perplexity’s chief executive, is yet to meet the world’s richest man: he says the two will be catching up soon. But he is fond of quoting a Bezos-ism: “Your [profit] margin is my opportunity.” Srinivas is betting that just as Google swept away Yahoo as the once-dominant website rested on its laurels, his company will hasten the downfall of the search engine. “Google is perceived as the de facto place for information and knowledge on the internet,” he says. “That’s going to change.” Perplexity has around 1m people using it at least once a day, including tech VIPs like Jensen Huang, the chief executive of Nvidia and Tobi Lütke, the boss of ecommerce site Shopify. That is barely a dent in the billions of Google users, and the search giant is richer than ever: both the company’s profits and its share price hit an all-time high earlier this year. But the rise in “answer engines” – AI chatbots that can respond to a query with a succinct answer – has set alarm bells ringing within Google. Last week, co-founder Sergey Brin said he had “come out of retirement” in part to address the rise of systems such as ChatGPT, run by the Microsoft-backed start-up OpenAI. The logic behind using AI bots rather than search is straightforward: when most people search the web, they are looking for answers, rather than a particular website. Why be forced to click through a series of links for the thing you are looking for when you could have a simple but comprehensive response? But web users may not simply be attracted to simpler alternatives – Google may also be turning them off. In January, researchers appeared to confirm what users have complained about for years: Google’s search results appear to be getting worse. German academics found that results from Google as well as rival search engines Bing and DuckDuckGo had become steadily polluted by “search engine-optimised but low-quality content”. Many of the websites that appeared at the top of search results were designed purely to earn fees from sending users to websites like Amazon, instead of being genuinely useful. The researchers said the problem was likely to increase as AI made it effortless to write Google-optimised web pages instantly. The problem is largely a consequence of Google’s success. When the search engine was founded, the web was an untamed wild west of people publishing websites for their own enjoyment. Now, so much of the web’s traffic flows through Google that the economic incentives to rise to the top of search results trump everything else. The company has sought to respond. Last week it announced an update to its search algorithm that it said would address spam and “low-quality” sites, reducing them in search results by around 40pc. Nor has Google ignored the AI threat, developing its own Gemini chatbot. But in recent weeks the company has been caught in a storm over its results, after its image generation feature was found drawing black Nazi soldiers. The bigger problem is that moving away from its classic search engine threatens to kill the golden goose. Even as Google has invested billions in other pursuits in recent years, its search engine still accounted for the majority of its $307bn in revenues last year. AI chatbots have obstacles compared to search. The extra computing power required means that it often takes a few seconds for queries to be answered. It also remains to be seen how the bots will be profitable: Perplexity, for example, has no adverts, but charges users $20 a month for a more powerful “Pro” version. But some analysts are betting that this can be overcome. Last month the research company Gartner predicted that the number of internet searches would fall by 25pc by 2026. Srinivas is determined to seize the moment. Reports last week suggested that Perplexity was again raising funds at a $1bn valuation, meaning Bezos’s investment will have almost doubled in a couple of months. “It’s a tremendous time,” Srinivas says. “The most powerful, profitable business in the history of capitalism is being disrupted because we all want back our time and we don’t want to be taken advantage of anymore.” "
}