{
    "title": "Google's Push To Hurry Up Was The Culprit Behind Gemini's Image Mess: Report",
    "date": "3/5/2024",
    "url": "https://www.tradingview.com/news/benzinga:493796ede094b:0-google-s-push-to-hurry-up-was-the-culprit-behind-gemini-s-image-mess-report/",
    "text": "Google’s Gemini scandal has been linked to rushed product shipping and internal misalignment, days after co-founder Sergey Brin and CEO Sundar Pichai admitted the company made a mistake. What Happened: Insiders at Alphabet Inc.'s GOOG GOOGL Google have confessed that the Gemini responses, which were problematic, managed to bypass testing due to a hurried shipping process, reported The Verge. Interestingly, the Gemini app’s photo generation feature isn’t powered by the Gemini model but by an older text-to-photo model. This was a quick fix to speed up the feature’s launch. See Also: ‘Would You Open Source The Manhattan Project’: Vinod Khosla And Marc Andreessen Clash Over Musk’s OpenAI Lawsuit Moreover, there appears to be a misalignment between the research team led by Demis Hassabis and the search organization under Prabhakar Raghavan. While the former is in charge of building the underlying models, the latter is responsible for integrating them into user-facing products. Pichai has hinted at “structural changes” in a recent employee memo, which could potentially address this issue. Why It Matters: The Gemini scandal is not the first time Google’s hasty approach to product launch has been scrutinized. Google co-founder Brin publicly admitted to rushing the Gemini image generator without proper testing. This followed an admission by Pichai that the Gemini AI errors were “completely unacceptable.” The Gemini AI had been generating historically inaccurate images, leading to widespread criticism. This included misrepresentations of Google's own co-founders, among others. Internal discord and lack of alignment within Google’s teams have been a concern for quite some time now, with former employees criticizing Pichai’s leadership and claiming low employee morale. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Neither Sundar Pichai Nor Sergey Brin—This Ex-Employee Warned Google 5 Years Ago That AI Was Coming For Their Search Engine Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo courtesy: Google © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}