{
    "title": "Alphabet (GOOGL) Boosts Android Tablets With Gmail Update",
    "date": "1/19/2024",
    "url": "https://www.zacks.com/stock/news/2212903/alphabet-googl-boosts-android-tablets-with-gmail-update",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    January 19, 2024 ITRI Quick QuoteITRI NVDA Quick QuoteNVDA GOOGL Quick QuoteGOOGL ANET Quick QuoteANET Better trading starts here. You follow Analyst Blog - edit You follow Zacks Equity Research - edit Zacks Equity Research Analyst Blog Alphabet (GOOGL Quick QuoteGOOGL  -  Free Report)     is strengthening Gmail capabilities on Android on the back of feature updates.In this regard, Gmail on Android tablets now features a navigation rail and a floating bar for conversations, with the Google Chat home screen redesign featuring three tabs and updated widgets.Further, the new navigation rail feature shrinks the inbox/message list without affecting the message body.Alphabet is expected to gain solid traction across Android tablet users on the back of its latest move.  Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the Gmail update, Alphabet introduced a Gboard update, which now provides a physical keyboard toolbar on Android tablets, improving the experience for Bluetooth or USB keyboard users by optimizing apps for large-screen devices.Alphabet also unveiled Google Drive's large-screen optimizations, with a clear trend toward incorporating the website UI onto Android tablets and foldables.The company also redesigned Docs, Sheets and Slides for Android tablets and foldables, featuring a modernized visual design with a pill-shaped Material 3 toolbar for font and formatting.Another update enables Chrome to load a website's desktop mode on \"premium\" Android tablets with at least 8 GB of RAM and a 10-inch or larger display. All the above-mentioned endeavors will likely strengthen Alphabet’s Android offerings. This, in turn, will boost its Google Services segment, which remains the key growth catalyst for Alphabet. Its shares have rallied 54.2% in the past year compared with the Zacks Computer & Technology sector’s growth of 53.6%.Notably, Google added new features to its Google Messages app, including a \"plus\" shortcut, offering Android users a redesign, including a left-facing compose field and an emoji shortcut, along with Magic Compose, a new Gallery icon and a plus menu at the right.Alphabet also added a Sports widget to its Google app, providing a comprehensive view of teams' upcoming, live or past matches.Further, the widget boasts features like a Knowledge Graph card, resizing for enhanced visibility, a “Last updated” notification feature, and separate sections for “Your games” and “Trending games.”The company’s growing endeavors to strengthen the Google Services offerings are expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, which has risen by 5 cents in the past 30 days. Currently, Alphabet carries a Zacks Rank #3 (Hold).Some better-ranked stocks in the broader technology sector are Arista Networks (ANET Quick QuoteANET  -  Free Report)    , NVIDIA (NVDA Quick QuoteNVDA  -  Free Report)     and Itron (ITRI Quick QuoteITRI  -  Free Report)    , each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Arista Networks shares have returned 116.5% over the past year. The long-term earnings growth rate for ANET is pegged at 19.77%.Shares of NVIDIA have returned 240.6% over the past year. The long-term earnings growth rate for NVDA is currently projected at 13.5%.Shares of Itron have gained 22.3% over the past year. The long-term earnings growth rate for ITRI is currently projected at 23%. Itron, Inc. (ITRI) - free report >> NVIDIA Corporation (NVDA) - free report >> Alphabet Inc. (GOOGL) - free report >> Arista Networks, Inc. (ANET) - free report >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}