{
    "title": "2 Top Stock-Split Stocks to Buy for 2024",
    "date": "1/11/2024",
    "url": "https://www.fool.com/investing/2024/01/11/2-top-stock-split-stocks-to-buy-for-2024/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Stock splits don't automatically boost a stock -- but they still could help you pick out a top player to buy by pointing you toward companies with track records of success. Companies generally launch a split after performing well, with the idea that more growth lies ahead. By offering current stockholders more shares, the company lowers the price of each individual share without touching overall market value. This makes the stock more accessible to a broader range of investors. History shows us that investors haven't necessarily piled into stock-split players right away, so a split itself won't trigger gains. But over time, the companies that have been successful often continue to deliver when it comes to growth, and that makes them winners over and over again. Want in on that action in 2024 and beyond? Then consider these two stock-split players to buy right now. Image source: Getty Images. Amazon (AMZN 0.31%) shares soared past $3,500 back in 2021, and the company split its stock a year later. Some near-term challenges -- including the pressure of higher costs due to interest-rate hikes -- got in the way of its post-split performance. But the company set to work on its cost structure and reignited earnings growth, and its shares climbed in the double digits last year. Despite the gain, the stock still trades at about half of what it traded for a couple of years ago in relation to forward earnings estimates.  AMZN PE Ratio (Forward) data by YCharts. Considering Amazon's long-term prospects, this looks like a deal to me. Why am I so optimistic about the stock? For a few reasons. First, Amazon is a leader in two markets growing in the double digits -- e-commerce and cloud computing -- so it's well positioned to benefit from this growth over time. Second, the company is ensuring this dominance, thanks to its work on serving customers well in both businesses. For example, in e-commerce, Amazon has put into place infrastructure to gain in delivery speed, which should keep customers coming back. And in cloud computing, Amazon Web Services has built up its artificial intelligence (AI) services, offering clients easy ways to apply this hot technology to their businesses. Finally, Amazon's cost-structure improvements should serve it well over time -- whether the economy is weak or strong. The company has already shifted from losses and cash outflows during a difficult 2022 to profit and billion-dollar inflows of cash a year later. All of this means now and into the future, Amazon could deliver a lot more gains in earnings and share price. Alphabet (GOOG 0.21%) (GOOGL 0.04%) also split its stock in recent times after many years of earnings growth and top share performance.  GOOG data by YCharts. Today, we don't have any reason to believe the company's dominance in its market, earnings growth, and stock market gains will stop. By maintaining decent growth through difficult economic times, Alphabet showed its strength -- and its shares may even be ready to extend last year's gains. One big reason to like this company has to do with its leadership in the internet search market. Most of us are used to \"Googling it\" when we don't know the answer to a question. It's become part of our routine, and that has led Alphabet's Google to a 91% share of the search market. What's key here is this brand strength has become Alphabet's moat, or competitive advantage. It will be very difficult for a competitor to grab a significant share and unseat this top player. Importantly, this market share doesn't just give Alphabet bragging rights but is key to the company bringing in revenue. Thanks to the company's search position, advertisers flock to Alphabet to advertise -- so when you search on Google, you'll see an ad that may be linked to something you would like to buy. Alphabet's investment in AI today to make search better and better should serve as the element that seals the deal with advertisers for the long term -- and that's more good news for the company and investors. Finally, Alphabet's cloud computing business may not be as big as Amazon's, but it's high growth -- with revenue climbing in the double digits in the most recent quarter. Today, you can pick up shares of this technology powerhouse for only 21 times forward earnings estimates. And that looks dirt cheap considering Alphabet's earnings and market-share track record -- and the likelihood of all of that growth continuing over the long term. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adria Cimino has positions in Amazon. The Motley Fool has positions in and recommends Alphabet and Amazon. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}