{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.businessinsider.com/tech-new-normal-constant-layoffs-job-cuts-google-amazon-meta-2024-1",
    "text": "       When Google announces earnings in a couple of weeks, it will announce that it made tens of billions of dollars in profit last year. This week, Google is announcing that it's going through a wave of layoffs. That's on the heels of major cuts the company made last year, though this year's are much smaller, it says. What's going on? Google CEO Sundar Pichai has told employees that he's making the most recent cuts to free up resources to make new investments and because he wants to \"[remove] layers to simplify execution and drive velocity in some areas.\" All of that may be true, but it's also CEO-speak. A shorter, plain-English version might look like this: \"We're a really big company that makes a lot of money and Wall Street wants us to make more. Cuts are a part of that.\" And if that's happening at Google — a company worth close to two trillion dollars — you can expect to see it at other Big Tech companies, too. See, for instance, Amazon, which also made huge cuts last year and went through another smaller round this month. Meta did the same thing: Two big rounds of cuts last year (and another the year before that) and a (much) smaller round this month. And there's a very good chance this could become the new normal. Related stories That's for two reasons: We live in a post-ZIRP world, and that's not going to change. The long-running tech boom happened alongside a long-running period of low/no-interest rates, and the two are very much connected. Now that we're out of the zero-interest-rate-policy era, investors are much more interested in profits than growth, which is affecting every part of the tech industry, from startups to the biggest public companies. (Tech observer Gergely Orosz has a very nice summary here.) If you're a small and/or unprofitable company, you're in real trouble since it's going to be hard to get your hands on more money to stay afloat. But even giant companies that mint money, like Google and Meta, are under pressure to show Wall Street that they can keep their profit margins intact, especially if they're also making giant investments in projects like AI. This leads to the second point: Big Tech is really big and really old For a long time, Silicon Valley's brightest stars grew at a crazy pace. But that run is over, and they're all well into middle age now: Google, for instance, is powered by the search ad business it created more than two decades ago. YouTube, its next biggest business, started way back in 2005. All of the biggest tech companies would like to have something shiny and new to show off to investors — another growth story. But when you're that size, it's very hard to move the needle. Maybe that will turn out to be the AI boom, though some of the enthusiasm we saw last year for that tech has been tempered. But in any case: Absent a truly breakthrough product, Big Tech is going to look like any other big, established industry — one that periodically lays off workers. On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Read next Jump to "
}