{
    "title": "Google reports positive Q4 earnings, only to see stock price fall",
    "date": "1/31/2024",
    "url": "https://mediaincanada.com/2024/01/31/google-reports-positive-q4-earnings-only-to-see-stock-price-fall/",
    "text": "Google’s parent company Alphabet announced solid Q4 earnings on Tuesday, however its advertising sales failed to impress Wall Street. After the report was released, the tech giant saw its shares drop nearly 6%. Alphabet reported 13% revenue growth, and its sales of $86.31 billion beat the average estimate going into the report, which was $85.33 billion, and earnings per share beat estimates by 5 cents. The company also beat expectations in its cloud business, reporting a 25% growth. Alphabet’s only less-than-stellar result was in Google’s ad business, which delivered $65.52 billion in revenue, trailing estimates of $65.94 billion. “Our results reflect strong momentum and product innovation continuing into 2024,” said CEO Sundar Pichai. “Subscriptions, which reached $15 billion in annual revenue, are up 5x since 2019. Subscriptions is growing strongly, powered by YouTube Premium and Music, YouTube TV and Google One. Cloud which crossed $9 billion in revenues this quarter and saw accelerated growth driven by our Gen AI and product leadership.” Pichai also shared the company’s excitement about Gemini, which launched in December 2023, and is Google’s “largest and most capable AI model.” “Gemini is the first realization of the vision we had when we formed Google DeepMind, bringing together our two world-class research teams,” said Pichai. “It’s engineered to understand and combine text, images, audio, video and code in a natively multimodal way and it can run on everything from mobile devices to data centers.” Later this week, fellow industry titans, Meta, Apple and Amazon will announced their latest earnings. AI, Aphabet, Gemini, Google, Q4, Sundar Pichai Comments are closed. "
}