{
    "title": "Google DeepMind scientists in talks to leave and form AI startup",
    "date": "1/20/2024",
    "url": "https://telecom.economictimes.indiatimes.com/news/internet/google-deepmind-scientists-in-talks-to-leave-and-form-ai-startup/107001972",
    "text": "The team has held discussions with potential investors about a financing round that may exceed €200 million ($220 million) — a large sum, even for the buzzy field of AI. A pair of scientists at Google DeepMind, the Alphabet Inc. artificial intelligence division, have been talking with investors about forming an AI startup in Paris, according to people familiar with the conversations. The team has held discussions with potential investors about a financing round that may exceed €200 million ($220 million) — a large sum, even for the buzzy field of AI, the people said. Laurent Sifre, who has been working as a scientist at DeepMind, is in talks to form the company, known at the moment as Holistic, with fellow DeepMind scientist Karl Tuyls, said the people, asking not to be identified discussing private information. They said the venture may be focused on building a new AI model. \n\nAdvt\n\n\n\n\n\nSifre and Tuyls didn’t respond to multiple requests for comment. A DeepMind representative declined to comment on the startup plans. The two have given notice to leave the company, a person familiar with the situation said, asking not to be identified because the information is private. Sifre was a co-author of the 2016 DeepMind research on Go, a seminal work that showed a computer system beating masters of the ancient game for the first time, which sparked an international frenzy over AI. Tuyls has worked on research into game theory and multi-agent reinforcement learning, a branch of AI that explores interactions between autonomous actors, often through video games.Both Sifre and Tuyls are widely considered leaders in their field, and the unusually large financing round being discussed is further evidence of strong investor interest in the technology. That’s particularly true in France, where venture capitalists and business tycoons have poured funds into startups emerging from Parisian universities and the AI hubs of Silicon Valley firms. Mistral AI, an OpenAI rival whose chief executive officer also worked for DeepMind, formed in early 2023 and had raised two sizable rounds by the year’s end to earn a valuation around $2 billion. Kyutai, a nonprofit AI research lab, was formed in November with €300 million in initial funding. \n\nAdvt\n\n\n\n\n\nThe new French startup under discussion is different from Holistic AI, an enterprise software business based in London. By commenting, you agree to the Prohibited Content Policy By commenting, you agree to the Prohibited Content Policy News See whats happening in Telecom sector right now Exclusive Read and get insights from specially curated unique stories from editorial Leaders Speak Business leaders sharing their insights Events Explore and discuss challenges & trends in India's leading B2B events Awards Recognise work that not only stood out but was also purposeful Webinars Join leaders & experts for roundtables, conferences, panels and discussions Subscribe to our Daily Newsletter  By continuing you agree to our Privacy Policy & Terms & Conditions Advertise With Us We have various options to advertise with us including Events, Advertorials, Banners, Mailers, etc. Download ETTelecom App Save your favourite articles with seamless reading experience Get updates on your preferred social platform Follow us for the latest news, insider access to events and more. About Us Contact Us Newsletters "
}