{
    "title": "Google: All-Time Highs Approach (NASDAQ:GOOG)",
    "date": "1/4/2024",
    "url": "https://seekingalpha.com/article/4661157-google-all-time-highs-approach",
    "text": "Google CEO Sundar Pichai Testifies In Company\"s Antitrust Trial In D.C. Drew Angerer/Getty Images News Google CEO Sundar Pichai Testifies In Company\"s Antitrust Trial In D.C. Drew Angerer/Getty Images News Alphabet Inc. (NASDAQ:GOOG), otherwise known as “Google,” took a minor beating today, January 4th, opening down 0.3%. It did a little better than the overall NASDAQ 100-Index (NDX), which was down 0.37% at the open. It was a relatively bearish few hours for a stock that has mostly been outperforming these last 12 months. Nevertheless, Google has had a great year over the last 12 months. It returned to positive and high earnings growth after a stagnant 2022, launched a new Pixel Phone, and made major strides in artificial intelligence (“AI”). Google’s position at the end of last year was much better than its position at the start of it. After ChatGPT made generative AI the be all and end all of the tech world, Microsoft (MSFT) made big moves in the space. Google was much slower to adapt, creating the impression that it was falling behind. It did eventually launch a chatbot of its own, Bard, but was seen as playing catch up with Microsoft. At one point, Microsoft CEO Satya Nadella boasted that he had made Google “dance,” meaning react to his moves. That was then, this is now. Bard’s reputation has improved dramatically, and the new GPT-powered Microsoft Bing has failed to take market share from Google Search. It also didn’t hurt that the company’s last earnings release beat expectations and showed a return to growth. As a result of developments like these, Google stock has risen, having gained 55% over the last 12 months. And today? Google has plenty of advantages; not just one moat, but several of them. Google Search has a 90% market share in search engines, with Bing still far behind even after adding generative AI to its search engine. YouTube is the second most popular social media platform in the world, and its premium ad-free service has 28 million subscribers. Android is the #1 smartphone operating system in the world by installs, and the #2 by revenue. It has a cloud business that just recently became profitable. Finally, it has a suite of office tools that compete with Microsoft Office – including the app that this article was written on – Google Docs. As I wrote in a recent Tweet, Google has at least five products that are among the top ones in their categories. The company has 9 products with more than a billion users. Basically, this is a company with a lot of firepower. Not only that, but it’s a highly profitable company. In the trailing 12 month (“TTM”) period, Google had a 56% gross margin, a 27% EBIT margin, a 22% net margin, and a 25% return on equity. These are among the highest margins and returns on equity you’ll find in big tech. Nevertheless, Alphabet stock remains fairly cheap compared to the average big tech name. When you look at Google’s margins, growth rates and multiples, it’s hard not to arrive at the conclusion that its \"quality\" is at least on par with that of Microsoft (MSFT) and Apple (AAPL) only without the steep price tag. At today’s prices, MSFT and AAPL trade at 35.5 and 30 times earnings, respectively, while Google trades at 26 times earnings. Certainly, Google is no deep value name, but it appears to be the cheapest of its peers, while having comparable margins, and significantly better growth than Apple has. When I last wrote about Google, I rated it a \"buy,\" on the grounds that it was highly profitable, growing, and ahead of the competition. Today, I like the stock even more. Although it has risen quite a bit since I last wrote about it (it's now near all-time highs), it put out a very strong earnings release in the interim period, one that showed 11% revenue growth and 41% earnings growth. Additionally, there are signs that the upcoming earnings release (expected February 1st) will be strong, which I will touch on shortly. For all of the aforementioned reasons, I now consider Google stock a strong buy, rather than just a buy. Before getting into the things I like about Google, I should address the elephant in the room; namely, legal risk. This has been often cited as a reason why Google trades at a discount to its peers. It’s pretty common for big tech companies to get sued or fined – sometimes successfully – but Google is dealing with a number of legal issues at once. Just recently, the company settled a lawsuit that sought a $5 billion payout. It isn’t known whether the agreed on amount was $5 billion, but it was likely substantial given that it was a class-action dealing with an issue that affected millions of users. One lawyer got $20 million from Google for his clients, who were tracked despite being in \"incognito mode.\" Then there’s the ongoing DOJ lawsuit, which is based on the claim that Google is using monopoly power to muscle smaller companies out of the market. This one does not seek a large sum of money (it just wants Google to pay the costs involved in taking it to court), but it will force Google to stop connecting its various advertising and software services to one another, and stop preferring itself on its own platforms. It would likely end Google’s deal with Apple, in which the former pays the latter $18 billion a year to be the default search engine on IOS devices. Finally, there is the €2.6 billion fine levied by the European Union, which has been upheld on appeal. Google will likely have to pay that one out. Ditto with an earlier €4 billion fine from the EU. The fact that these fines are so numerous gives pause, but this should all be put into perspective. Google did nearly $20 billion in earnings last quarter. According to Seeking Alpha Quant, it did $70 billion in free cash flow (\"FCF\") in the trailing 12 month period. The fines are a setback, sure, but they are not that large as a percentage of the company’s profit, whether you measure that by GAAP earnings or FCF. Having thoroughly discussed the biggest risk facing Google, I can now move on to the reasons why I remain bullish despite that risk factor. First, as mentioned in the introduction, the company’s competitive position is extremely strong, with high market shares in several product categories. The Google Search moat in particular is very wide: Microsoft couldn’t gain share in search even after adding GPT to its search engine. Second, the company has incredibly high margins. In its most recent quarter, it did $76.6 billion in revenue, $21 billion in EBIT, and $20 billion in net income. Those figures give a 27% EBIT margin and a 26% net margin, both excellent. Seeking Alpha Quant’s figures for the trailing 12 month period largely agree: it says the EBIT margin is 27% and the net margin is 22%. Third, the company’s valuation is not extreme when compared to Google’s peer companies. Below you’ll find the multiples for tech companies that are close to Google’s size, along with Google’s own multiples. The table clearly shows that Google is the cheapest of the bunch. Google Apple Microsoft Amazon (AMZN) P/E (adjusted) 27 30 35 76 P/sales 5.9 7.5 12.6 2.75 P/book 6.3 46 12.4 8.3 P/CFO 16.3 25.9 29 21.4 Basically, Amazon and Google are neck-and-neck on the number of categories they win on, each nabbing two. Google beats the other three stocks in every single category, while Amazon loses to all of the other three on the P/E metric. That could be considered a tie-breaker. Another tiebreaker is Quant’s ranking: Seeking Alpha Quant rates Google a \"D\" on value, Amazon an \"F.\" Neither score is great, but Google’s is higher. The bottom line on Google in 2024 is that it’s just as good as the rest of big tech, while being far cheaper than its competitors. At a time when the entire NASDAQ 100-Index is trading at over 30 times earnings, Google is at a comparatively modest 26. It’s no deep value name, but it’s less crazy than most of the big tech companies today. I think Google will set a new all-time high relatively soon, and potentially rise from there. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOG, MSFT either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}