{
    "title": "Alphabet (GOOGL) Boosts Chrome App With Material You Redesign",
    "date": "1/2/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-boosts-chrome-app-143000788.html",
    "text": "Alphabet’s GOOGL is bolstering its search engine on the back of new feature updates of the Chrome browser, which has been a key growth driver for the company. Alphabet’s shares have rallied 16.5% in the past six months compared with the Zacks Computer & Technology sector’s growth of 10.3%.    In regard to advancing Chrome, Google’s recent Material You redesign for Chrome’s New Tab Page on Android remains noteworthy.The Chrome app on Android now boasts a thicker search bar, similar to Google Search, and features bolder hint text, distinct voice microphone and Lens icons and a smaller Google logo. The 4x2 grid of frequently visited sites is rounded.These features are expected to boost traffic on the Chrome browser. Moreover, Alphabet is expected to gain solid traction across Android users on the back of its latest move. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the latest move, Alphabet added 120 features to Google Chrome, including Tab Groups for easy access on other desktop devices and Safety Check, which automatically runs in the background to alert users when saved passwords are compromised or harmful extensions are installed.Earlier to this, Google introduced Material You redesigns for desktop Chrome. The redesign features rounded corners, taller tab strips, bookmarks and a new icon for site controls and information in the Omnibox.The company unveiled in-browser price insights across Chrome, allowing users to predict future price changes. The feature also features a 90-day price history graph, price drop emails and a new Shopping list folder.Google is set to introduce an AI-powered “Help me write” feature to Chrome for Desktop use. This new AI feature will be available in Chrome's autofill popup, providing context on text content rather than relying solely on the prompt.Also, the company is developing a new feature called \"Create Theme with AI\" for Chrome, which allows users to create custom themes using AI. The feature enables users to select a subject, art style, mood and color options for their theme. Alphabet’s growing endeavors to bolster its Google Chrome app will boost Google’s Search revenues. This, in turn, is expected to bolster the Google Services segment that accounts for the majority of GOOGL’s total revenues.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, which has risen by 5 cents in the past 30 days. Currently, Alphabet carries a Zacks Rank #2 (Buy).Some other top-ranked stocks in the broader technology sector are Camtek CAMT, KT KT and Everbridge EVBG, each carrying a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Camtek shares have returned 98% in the past six months. The long-term earnings growth rate for CAMT is pegged at 12.26%.Shares of KT have returned 17.7% in the past six months. The long-term earnings growth rate for KT is currently projected at 6.75%.Shares of Everbridge have lost 10.7% in the past six months. The long-term earnings growth rate for EVBG is currently projected at 47.04%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report KT Corporation (KT) : Free Stock Analysis Report Camtek Ltd. (CAMT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Everbridge, Inc. (EVBG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}