{
    "title": "Bite Of The Big Apple: iPhone Secures Top Spot In 2023 Global Smartphone \nShipments, Beats Samsung After 1",
    "date": "1/16/2024",
    "url": "https://www.benzinga.com/news/24/01/36636022/bite-of-the-big-apple-iphone-secures-top-spot-in-2023-global-smartphone-shipments-beats-samsung-afte",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Apple Inc. AAPL has defied the overall slowdown in the global smartphone industry to emerge as the \"biggest winner\" and claim the throne, beating Samsung Electronics Co Ltd. SSNLF. What Happened: Apple has grabbed the crown of the world's biggest smartphone maker, comfortably beating Samsung to the punch and ending its 13-year reign at the top, according to data from IDC. Apple has also become the world's top smartphone maker in annual rankings for the first time after launching the iPhone 17 years ago in 2007. “While we saw some strong growth from low-end Android players like Transsion and Xiaomi in the second half of 2023, stemming from rapid growth in emerging markets, the biggest winner is clearly Apple,” said Nabila Popal, research director with IDC’s Worldwide Tracker team. See Also: If You Invested $1000 In Apple When iTunes Was Launched 23 Years Ago Today, Here’s How Much You’d Have Apple is the only tier-one company in the top four to report shipment growth during 2023. Transsion ranked fifth and reported a 30.8% increase in shipments, but it serves the entry-level segment under brands like Tecno, Itel, and Infinix. Two factors contributed to Apple's rise to the top – its sustained performance amidst a slowdown in the overall smartphone industry and Samsung's sharp fall during the year. While Apple's shipments increased 3.7% year-on-year in 2023 to 234.6 million units, Samsung's shipments registered a sharp decline of 13.6% in the same period to 226.6 million units. Xiaomi saw a 4.7% decline during the year, with 145.9 million units shipped, while Oppo witnessed a 9.9% fall to 103.1 million units. Overall, the total smartphones shipped during 2023, according to IDC data, stood at 1.17 billion units, down 3.2% from 2022. According to the analytics firm, this is the lowest full-year volume in a decade. The Secret Behind Apple's Rise: Apple's iPhone shipments have remained resilient over the past few months despite a challenging macroeconomic environment. The secret to this, according to IDC, is the growing preference for premium devices. \"Apple’s ongoing success and resilience is in large part due to the increasing trend of premium devices, which now represent over 20% of the market,\" Popal added, noting that aggressive trade-in offers and interest-free financing plans have fueled this growth, too. Another factor that contributed to Samsung's decline is Huawei's resurgence and increased competitive intensity from companies like Alphabet Inc.'s GOOG GOOGL Google, OnePlus, among others, both in the top-end as well as the foldable phones space. However, not everyone is optimistic about Apple's iPhone shipments in the near future. Apple has already suffered three downgrades in the first fortnight of 2024. The analysts at Jefferies have also sounded a note of caution, predicting a continued slide in iPhone sales in China in 2024. One of the reasons behind this is the Chinese ban on iPhones, coinciding with Huawei's new Mate 60 series. The growing pressure on Apple in China has also resulted in a rare iPhone discount from the company. According to Reuters, Apple is offering a discount of nearly $70 in China. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Apple’s Walled Garden Might Soon Open Gates For European iPhone And iPad Users To Sideload Apps Image Credits – Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}