{
    "title": "The Morning After: Alphabet cuts jobs at its moonshot labs",
    "date": "1/23/2024",
    "url": "https://www.engadget.com/the-morning-after-alphabet-cuts-jobs-at-its-moonshot-labs-121537179.html",
    "text": "Mere days after Alphabet and Google CEO Sudar Pichai warned of more job attrition this year, the company is shedding more staff, at its moonshot lab. Alphabet is also restructuring X (not to be confused with what used to be called Twitter) to make it easier to spin out projects with backing (read: money) from outside investors. X division head Astro Teller told staff in a memo that the company was “expanding our approach to focus on spinning out more projects as independent companies funded through market-based capital.” X has attempted to tackle bigger-picture challenges and problems worldwide, like climate change, the future of the internet and cybersecurity, but it hasn’t found consistent success through its spinoff businesses. The company hopes this could refocus heady ideas into those with a future. — Mat Smith ​​You can get these reports delivered daily direct to your inbox. Subscribe right here! ​​ The second-gen AirPods Pro are cheaper than ever right now The best MacBooks for 2024 Awesome Games Done Quick 2024 raises $2.5 million for cancer research How Disney’s A Real Bug’s Life docu-series turns insects into giants iOS 17.3 is available to install now, and while it’s not shaking things up too much, it does have Stolen Device Protection. The feature first popped up in the developer beta of iOS 17.3, and it’s actually pretty handy. If someone steals your iPhone or iPad, and you’re updated to OS 17.3, you can lock them out of the system by forcing Face ID or Touch ID access. This works even if they have your passcode. The update also has AirPlay hotel support, optimized crash detection and collaborative playlists on Apple Music — something I’ve been waiting for since my iOS 17 preview. Continue reading. NVIDIA has finally leased a beta version of its RTX Remix tool. This software is for modders and can add ray tracing and AI-upscaled textures to older games. For those who know what they’re doing, it’s capable of end-to-end remastering of just about any DirectX 8 or 9 game from the past. NVIDIA has released a list of compatible games — classics like Call of Duty 2, Hitman 2: Silent Assassin, Garry’s Mod, Freedom Fighters and Need for Speed Underground 2. Continue reading. Apple's newest TV series follows an astronaut, played by Noomi Rapace, after an emergency return to Earth. According to the trailer, it will be filled with unreliable narrator twists and turns — and it’s in HDR, so it should really pop on that new Vision Pro headset. Watch here. "
}