{
    "title": "Microsoft Stock (NASDAQ:MSFT): The Long-Term Bull Case Has Been Reaffirmed",
    "date": "2/7/2024",
    "url": "https://markets.businessinsider.com/news/stocks/microsoft-stock-nasdaq-msft-the-long-term-bull-case-has-been-reaffirmed-1033043270",
    "text": "Software behemoth Microsoft (NASDAQ:MSFT) now leads as the most valuable stock in the world with a market cap of $3.08 trillion. Less than six months ago, when I wrote about Microsoft, it was already nearing its all-time high, and I reaffirmed my bullish stance. Since then, the stock has gained another whopping 28%. At this juncture, I reassert my bullish stance because I believe MSFT is ready to embark on another decade of supernormal returns supported by multiple growth catalysts. On January 30, Microsoft reported upbeat Q2 results for the sixth consecutive quarter, driven by robust cloud computing momentum and strong growth across all segments. Adjusted earnings of $2.93 per share handily beat analysts’ estimates of $2.77. Also, the figure was 26.3% higher than last year’s figure of $2.32 per share. Revenues came in at $62.02 billion, jumping 17.7% year-over-year and surpassing analysts’ estimates of $61.1 billion. All eyes were waiting for the Cloud segment’s numbers, and investors were not disappointed. The Intelligent Cloud business segment, which includes Azure Cloud, SQL Server, and Windows, among others, grew 20% year-over-year to $25.8 billion, beating expectations. Notably, Azure and other cloud services reported revenue growth of 30% (28% in constant currency), again much ahead of Wall Street’s expectations. Despite the upbeat Q2 print, Microsoft gave out an outlook that came in below expectations. Q3 revenues are expected to range between $60 billion and $61 billion versus the consensus estimate of $60.93 billion. AI and cloud computing will continue to complement and spur demand for each other. Further, the cloud optimization observed in 2023 due to recessionary fears is now over, and cloud computing is once again experiencing significant growth across the industry, as evidenced by reports from various companies. For instance, Amazon’s (NASDAQ:AMZN) AWS now reportedly stands at the cusp of a $100 billion annual run rate.  As noted above, the company saw robust growth in its Intelligent Cloud business, specifically Azure. More importantly, six percentage points of Azure’s growth came from AI-related services. Furthermore, the AI-related growth rate has doubled since the previously reported quarter. Azure AI includes AI training and other AI-related services. It’s noteworthy that Azure AI now boasts 53,000 customers, with one-third being newly acquired over the past 12 months, and it’s estimated to be an over $3 billion run rate business. This once again emphasizes the huge opportunity AI presents in the coming years. It is clear that AI will continue to drive the growth story for the “Magnificent Seven.” It’s no wonder then that not just Microsoft but peers like Meta (NASDAQ:META), Amazon, and Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) are increasing their investments toward AI capabilities in a big way. For the recently reported December quarter, MSFT reported a 69% jump in CapEx (including finance leases) to $11.5 billion. Further, MSFT’s well-known collaboration with OpenAI’s ChatGPT puts the company in a very enviable AI position, much ahead of its peers. CEO Satya Nadella stated his optimism on AI, saying, “We’ve moved from talking about AI to applying AI at scale… we’re winning new customers and helping drive new benefits and productivity gains across every sector.” Therefore, AI will continue to incrementally contribute to revenues and earnings as its adoption across sectors continues to grow manifold. On a separate note, during Q2, MSFT closed its biggest acquisition ever — the long-due proposed acquisition of gaming software rival Activision Blizzard (NASDAQ:ATVI) for $69 billion. The deal will add to MSFT’s diversified revenue stream. Further, Microsoft 365 Copilot is showing steady adoption, and the company remains optimistic about its growing contribution to revenue in the coming years.  Despite being the most valuable stock in the world, Microsoft’s valuation isn’t as expensive as one would think. At first glance, It may look expensive, trading at a P/E of 36x currently. Nonetheless, I believe the premium is justified, given its favorable industry-leading market position, robust margins, diversified revenue stream, and huge exposure to high-growth AI and cloud businesses. For the sake of comparison, online retail and cloud computing giant Amazon is trading at a P/E of 58.5x, while social networking company Meta Platforms is trading at a 31.9x P/E. Surprisingly, MSFT stock hasn’t seen any significant upward movement despite upbeat Q2 earnings, mainly due to weaker-than-expected guidance. However, Wall Street analysts continue their bullish stance, with a majority having raised their price targets on the stock post-earnings. Overall, the stock commands a Strong Buy consensus rating based on 32 Buys, one Hold, and one Sell. Microsoft stock’s average price target of $469.45 implies 13.4% upside potential from current levels. Microsoft stock has returned around 1,200% over the past decade. I believe it will continue to generate attractive long-term returns with its leadership position in the world of AI & computing, coupled with a well-diversified portfolio and an impressive track record of solid execution. AI and cloud computing will be the frontrunners in driving outstanding growth in the next 10 years. Hence, I will buy the stock at current levels with a bullish long-term outlook. Disclosure Indices Commodities Currencies Stocks "
}