{
    "title": "Meta Just Announced a Dividend. Could Alphabet Be Next?",
    "date": "2/9/2024",
    "url": "https://www.fool.com/investing/2024/02/09/meta-announced-dividend-could-alphabet-be-next/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Meta Platforms (META -1.68%) stunned investors on Thursday with a blowout fourth-quarter earnings report. The social media giant breezed past estimates on the top and bottom lines and offered better-than-expected guidance for the first quarter, forecasting another round of 25% year-over-year revenue growth. By the end of trading on Friday, the stock had jumped 20.3%, adding more than $200 billion in market cap. That's the biggest single-day market cap gain for an individual U.S. stock in history. One reason for those gains is that Meta announced its first-ever dividend. Management said it would pay a $0.50 per share quarterly dividend on March 26 to shareholders of record on Feb. 22. That gives the stock a dividend yield of 0.4% at the current share price. The dividend was a surprise since there had been little expectation that Meta would initiate a regular payout especially as the company was facing challenges just a few quarters ago with revenue and profits declining. On Meta's earnings call, chief financial officer Susan Li explained the move, saying that returning capital to shareholders remains important to the company, and \"We believe our strong financial position and performance will enable us to invest in the business while also continuing to return capital to investors over time.\" Looking at Meta's finances, the decision seems like a no-brainer. Meta has $65 billion in cash and marketable securities, and it just finished a year when it generated $39.1 billion in net income and $44 billion in free cash flow. Historically, the company has returned capital to shareholders through share buybacks, and it returned $20 billion that way in 2023. However, rewarding them with a dividend makes sense as it gives existing shareholders a way to benefit from that return without selling the stock. The dividend will cost the company approximately $5 billion a year. With Meta initiating a dividend, it's only natural to ask which of the big tech stocks will be next, and one of Meta's peers seems like an obvious choice: Alphabet (GOOG 0.21%) (GOOGL 0.04%). Image source: Getty Images. In many ways, Alphabet is like a larger version of Meta Platforms (formerly Facebook). The Google parent is the older of the two companies, and the two companies have been ranked No. 1 or No. 2 in digital advertising since the industry's early days. Alphabet also seems to have more cash than it knows what to do with. It finished 2023 with $111 billion in cash and marketable securities, more than it had in total liabilities. Last year, the company generated $73.8 billion in net income and $69.5 billion in free cash flow. There's been no discussion of an Alphabet dividend, and it's not something that activist investors have demanded, but it is something the tech giant could clearly afford if it chose to pay one. In addition to the direct cash distribution, there's another less obvious benefit to paying a dividend. For companies like Alphabet and Meta, which generate boatloads of cash each quarter, paying a dividend also acts as a guardrail on spending and a pledge to shareholders that they are getting some share of profits. In the case of these two companies, it seems like they could use a guardrail. Besides their highly profitable advertising businesses, both companies lose billions on moonshot projects each year. Alphabet classifies these as \"other bets,\" which include its Waymo autonomous vehicle business; Verily life sciences business; and Google Fiber broadband business, among others. Meta's money-losing business is Reality Labs, its new segment focused on AI and the metaverse. Google is also notorious for over-hiring, overspending on projects, and being plagued by risk aversion. For example, the company has an internal term for developing technologies that it saves for later (\"pantry mode\"), which explains the company's cautiousness in AI. A commitment to returning cash to shareholders through dividends would not only reward investors, but it would also help give the company some needed discipline on expenses. It's not surprising that Meta's decision to start paying a dividend came after its highly successful \"Year of Efficiency,\" and CEO Mark Zuckerberg's declaration that \"We operate better as a leaner company.\" That realization dovetails with its decision to initiate a dividend as well. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jeremy Bowman has positions in Meta Platforms. The Motley Fool has positions in and recommends Alphabet and Meta Platforms. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}