{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.businessoutreach.in/gfiber-alphabets-internet-business-is-seeking-outside-investment",
    "text": "By AakanshaTuesday February 6, 2024 In an effort to accelerate its growth into new locations, Alphabet has informed Reuters that it intends to pursue outside funding for GFiber, the subsidiary that provides internet and Wi-Fi access in select areas of the United States. The parent company of Google owns GFiber, which is in competition with major ISPs like Comcast, Verizon Communications, and AT&T. Since announcing 14 years ago that it will use fibre-optic lines to increase internet speeds 100-fold, GFiber has spread to 15 states, beginning in Kansas where it was introduced in 2012. GFiber told Reuters that it had tripled its customer base in the last six years, though it did not disclose the overall number of subscribers. In 2023, agreements were reached to expand its services to over 25 new cities. However, the business still has to contend with competition from established players and lacks internet service in many areas of the country, including six of the ten most populated cities, including New York. Ruth Porat, president and chief investment officer of Alphabet, told Reuters in a statement that “this next step of raising external capital will enable them (GFiber) to scale their technical leadership, expand their reach, and provide better internet access to more communities.” Regarding the amount of money that GFiber was hoping to raise and the valuation that it was aiming for, Alphabet declined to comment. An insider familiar with Alphabet’s endeavours claims that GFiber has already engaged an investment bank to begin the process of selling the company’s equity. The insider, who requested to remain anonymous, stated that GFiber’s ultimate goal is to be independent of Alphabet. In a statement, Dinni Jain, CEO of GFiber, said, “We are now ready to scale this much faster.” One of Alphabet’s “Other Bets,” or companies besides Google that are still in the early phases of development or commercialization, is GFiber. Among them are the self-driving car startup Waymo and the health company Verily, both of which have raised capital from outside investors. According to Alphabet’s annual report, the Other Bets lost $4.1 billion in 2023 despite bringing in $1.5 billion, mostly from internet and healthcare-related services. Alphabet sought to “sharpen our investment focus, while capturing the upside given compelling technology breakthroughs across the portfolio” of Other Bets, according to Porat, who also holds the position of chief financial officer. Porat made this announcement to analysts last week. She stated at the time that one such company, Alphabet’s moonshot section known as X, was also seeking outside funding to launch other initiatives. According to Porat, Alphabet is typically trying to reform its cost base. The business recently announced employment cuts, just like other tech companies. Regarding if GFiber’s fundraising initiative was connected in any way to Alphabet’s broader cost-efficiency initiative, it chose not to comment.       March 28, 2024 March 28, 2024 March 28, 2024 Heated up increasingly by more startups across multiple sectors that are coming out of India’s startup ecosystem, Indians are no longer content with consuming products passively. The role of MeitY Business March 30, 2024 SydeLabs, a Bengaluru-based AI security and risk management business, has raised $2.5 million in a seed fundraising round headed by RTP Global, with participation from Picus Capital and many well-known Business March 30, 2024 Skyflow, a data privacy business, raised $30 million in an expansion of its Series B fundraising round headed by Khosla Ventures, with participation from existing investors such as Mouro Capital, Business March 30, 2024 In a letter to the DoT, Jio urged that the companies should be repaid the amount paid for spectrum purchases through an auction if FWA for satellite communication players is Business March 30, 2024 As AI assistants become increasingly common in our daily lives, protecting user privacy and ensuring safe interactions have become top priorities for technology companies. In a move to strengthen security Business March 29, 2024 Byju Raveendran stated in an email addressed to shareholders that the board of BYJU is contemplating making the offer in spite of resistance from investors pursuing “uncalled for legal actions.” Business March 29, 2024 Business Outreach is a premier platform for CXOs worldwide to exchange their ideas and insights with their peers. Our edition was launched with the goal of providing a focused approach towards the global market and bringing together technology buyers across various industries on a single platform. This enables the sharing of experience and knowledge, providing our readers with a well-rounded perspective on different market segments and their technology adoption curve. Additionally, we showcase technological innovations through groundbreaking enterprise solutions for the respective segments, providing our international readers with a valuable resource for staying ahead of the curve in their industries. Print | Digital A Product of The Publicity Dude Media  © 2024 Business Outreach All Rights Reserved. "
}