{
    "title": "Michael Burry's 2024 Portfolio: 5 New Stock Picks",
    "date": "2/26/2024",
    "url": "https://www.insidermonkey.com/blog/michael-burrys-2024-portfolio-5-new-stock-picks-1264468/?singlepage=1",
    "text": "This article presents an overview of Michael Burry’s 2024 Portfolio: 5 New Stock Picks. For a detailed overview of such stocks, read our article, Michael Burry’s 2024 Portfolio: 12 New Stock Picks. Michael Burry’s Stake: $4,889,150 Michael Burry’s Scion Asset Management bought a $4.9 million stake in Alphabet Inc Class C (NASDAQ:GOOG) during the fourth quarter of 2023. Burry bought Alphabet Inc Class C (NASDAQ:GOOG) despite concerns regarding Alphabet Inc Class C’s (NASDAQ:GOOG) search business, as a latest Gartner report predicted that by 2026 search volumes would drop by 25% as people are beginning to use AI chatbots to search for answers to their queries. Insider Monkey’s database of 933 hedge funds shows that 214 hedge funds had stakes in Alphabet Inc Class C (NASDAQ:GOOG). The FPA Crescent Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: “Alphabet Inc. (NASDAQ:GOOG) continued going from strength to strength during 2023 despite concerns that competition may infringe on the company’s dominant position in Search. Thus far, Alphabet has continued to hold its own, and we look forward to seeing how the company incorporates further AI developments across the Alphabet ecosystem. Lastly, we are hopeful that the impending arrival of a new CFO will bring a renewed focus on efficiency – an area where we believe Alphabet has ample room for improvement.” Michael Burry’s Stake: $5,132,400 CVS Health Corp (NYSE:CVS) ranks fourth in our list of the top stocks in Michael Burry’s 2024 portfolio. Scion Asset Management acquired a $5.1 million stake in CVS Health Corp (NYSE:CVS) during the fourth quarter of 2023. CVS Health Corp (NYSE:CVS) recently posted strong Q4 results but slashed its 2024 outlook, citing medical costs. In its fourth quarter 2023 investor letter, Vltava Fund stated the following regarding CVS Health Corporation (NYSE:CVS): “Not every transaction creates value. Some transactions destroy company value. An example of such transaction is CVS Health Corporation (NYSE:CVS)’s acquisition of Oak Street Health in early 2023. This acquisition cost CVS $10.6 billion, and, based on metrics cited by the company itself, it seems to us that it was a waste of money for the most part. Unfortunately, CVS has its own history of overpriced acquisitions. The last one prior to that was in 2018, when CVS bought health insurer Aetna for $69 billion. We had assumed that CVS management, which has since changed, would recognise that mistake and learn from it. We were wrong. The acquisition of Oak Street Health is both disappointing and a warning to us. We now have a company in our portfolio whose capital allocation we consider to be poor and that should not be there. Unfortunately, the situation is complicated by the fact that the CVS stock is now very cheap and therefore we are reluctant to dispose of it just yet. We probably will do so, however, when the opportunity arises.” Michael Burry’s Stake: $5,144,000 Michael Burry bought 100,000 shares of Citigroup Inc (NYSE:C) during the last quarter of 2023. The total worth of these shares was $5.1 million. Piper Sandler recently upgraded Citigroup Inc (NYSE:C) stock to Overweight from Neutral. Piper Sandler thinks the pullback in the stock is an attractive entry point for investors. Patient Capital Management stated the following regarding Citigroup Inc. (NYSE:C) in its fourth quarter 2023 investor letter: “Citigroup Inc. (NYSE:C), run by Jane Fraser since 2021, is on a multi-year journey to reorganize the business and reach return on tangible common equity of 11-12% by 2025-2026 (and higher further out). Citigroup is finally taking the hard actions necessary, cutting unprofitable departments, taking out middle management layers, and reducing overall headcount. We have high confidence Citi will hit its targets.” Michael Burry’s Stake: $5,271,500 Michael Burry’s Scion Asset Management opened a $5.3 million position in Oracle during the fourth quarter of 2023. Oracle Corp (NYSE:ORCL) is one of the least shorted stocks on the Wall Street right now. Insider Monkey’s database of 933 hedge funds shows that 100 hedge funds had stakes in Oracle Corp (NYSE:ORCL) as of the end of the fourth quarter of 2023, up from 88 funds in the previous quarter. Madison Sustainable Equity Fund stated the following regarding Oracle Corporation (NYSE:ORCL) in its fourth quarter 2023 investor letter: “Oracle Corporation (NYSE:ORCL) reported a disappointing second quarter due to supply constraints. Cloud revenue was below expectations as Oracle made planning decisions to accommodate some large-scale Oracle Cloud Infrastructure (OCI) clients that take longer to bring online. We continue to believe that Oracle has a unique position in Generative AI workloads and continue to like its position and strategy.” Michael Burry’s Stake: $5,413,600 Tennessee-based HCA Healthcare Inc (NYSE:HCA) came on Michael Burry’s radar as Scion bought a new $5.4 million stake in HCA Healthcare Inc (NYSE:HCA) during the last quarter of 2023. In January, HCA Healthcare Inc (NYSE:HCA) increased its dividend by 10%. Diamond Hill Large Cap Strategy made the following comment about HCA Healthcare, Inc. (NYSE:HCA) in its Q3 2023 investor letter: “Health care facilities operator HCA Healthcare, Inc. (NYSE:HCA) and medical device company Abbott Laboratories were also among our bottom contributors. Despite solid fundamental performance, HCA Healthcare experienced some share price weakness during Q3. This appears to be more a result of short-term noise and sell-side expectations rather than any significant operational or financial issues.” Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below. You can also look at the 12 Most Promising Cancer Stocks According to Analysts and the 12 Most Promising Clean Energy Stocks According to Analysts. NYSE:CNYSE:CVSNYSE:MGMNYSE:ORCLNASDAQ:GOOGNASDAQ:AMZNCitigroup Inc. (NYSE:C)Oracle Corp (NYSE:ORCL)Cvs Health Corp (NYSE:CVS)Hca Healthcare Inc. (NYSE:HCA)Alphabet Inc Class C (NASDAQ:GOOG)Michael Burry's 2024 Portfolio: 5 New Stock Picks12 Most Promising Cancer Stocks According to Analysts12 Most Promising Clean Energy Stocks According to AnalystsShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}