{
    "title": "Why The 28% Return On Capital At Alphabet (NASDAQ:GOOGL) Should Have Your \nAttention",
    "date": "2/23/2024",
    "url": "https://finance.yahoo.com/news/why-28-return-capital-alphabet-120014897.html",
    "text": "If we want to find a stock that could multiply over the long term, what are the underlying trends we should look for? Firstly, we'd want to identify a growing return on capital employed (ROCE) and then alongside that, an ever-increasing base of capital employed. Ultimately, this demonstrates that it's a business that is reinvesting profits at increasing rates of return. With that in mind, the ROCE of Alphabet (NASDAQ:GOOGL) looks great, so lets see what the trend can tell us. For those that aren't sure what ROCE is, it measures the amount of pre-tax profits a company can generate from the capital employed in its business. To calculate this metric for Alphabet, this is the formula: Return on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities) 0.28 = US$88b ÷ (US$402b - US$82b) (Based on the trailing twelve months to December 2023). Therefore, Alphabet has an ROCE of 28%. That's a fantastic return and not only that, it outpaces the average of 8.0% earned by companies in a similar industry. View our latest analysis for Alphabet In the above chart we have measured Alphabet's prior ROCE against its prior performance, but the future is arguably more important. If you're interested, you can view the analysts predictions in our free analyst report for Alphabet . Investors would be pleased with what's happening at Alphabet. The numbers show that in the last five years, the returns generated on capital employed have grown considerably to 28%. The company is effectively making more money per dollar of capital used, and it's worth noting that the amount of capital has increased too, by 62%. So we're very much inspired by what we're seeing at Alphabet thanks to its ability to profitably reinvest capital. To sum it up, Alphabet has proven it can reinvest in the business and generate higher returns on that capital employed, which is terrific. And a remarkable 156% total return over the last five years tells us that investors are expecting more good things to come in the future. In light of that, we think it's worth looking further into this stock because if Alphabet can keep these trends up, it could have a bright future ahead. While Alphabet looks impressive, no company is worth an infinite price. The  intrinsic value infographic for GOOGL helps visualize whether it is currently trading for a fair price. Alphabet is not the only stock earning high returns. If you'd like to see more, check out our free list of companies earning high returns on equity with solid fundamentals. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}