{
    "title": "Sundar Pichai admits ‘unacceptable’ errors in Gemini after it produces \ncontroversial imagery",
    "date": "2/29/2024",
    "url": "https://indianexpress.com/article/technology/artificial-intelligence/sundar-pichai-gemini-unacceptable-errors-9187734/",
    "text": "Google’s Gemini AI image generation tool previously received plenty of flak and became the subject of memes, particularly on Twitter, for ‘historical accuracies’ and misrepresenting people. It got so bad that the search engine giant was forced to snatch away the ability to produce images from the AI chatbot. This week, Google CEO Sundar Pichai addressed these missteps of the company’s new AI image generator, Gemini, acknowledging the “unacceptable” errors and affirming Google’s commitment to fixing the problems. In an internal memo published by Semafor, Pichai wrote that “no AI is perfect” but said the company would continue refining Gemini “for however long it takes.” He remained upbeat about Gemini’s future, saying the team has already seen “substantial improvement” in many areas. The image generation capabilities of Gemini, formerly known as Bard, have been paused since users noticed it was churning out historically inaccurate pictures, like images of Vikings and Founding Fathers depicted as people of colour. This sparked backlash on social media, with many critics decrying the “woke” programming. Google SVP Prabhakar Raghavan clarified this was not intentional wokeness on the company’s part but rather a series of tuning errors. He revealed in a blog post published February 23 that, essentially, Gemini was calibrated to allow for diversity in generated images but failed to exclude inappropriate contexts for that diversity. Over time, Raghavan explained, Gemini also became more cautious, sometimes refusing reasonable prompts out of an abundance of sensitivity. This aligns with reports that Gemini declined to generate images of white people in some cases. Gemini’s image generator will return after fixes, Google says, including “structural changes, updated product guidelines, improved launch processes, robust evals and red-teaming.”  BSEB will declare the Bihar Board 10th exam results 2024 today at 1:30 pm. Around 16.4 lakh students took the offline exams from February 15 to 23, with strict measures in place to prevent cheating. A press conference will be held at the board's headquarters to announce the toppers' names.    "
}