{
    "title": null,
    "date": "2/2/2024",
    "url": "https://www.marketwatch.com/story/amazon-on-track-to-be-worth-more-than-alphabet-for-the-first-time-in-16-months-4e19ca57",
    "text": "Earnings season is causing a reshuffling among the ranks of the largest U.S. companies. Amazon.com Inc. \n        AMZN,\n        +0.31%\n       overtook Alphabet Inc. \n        GOOG,\n        +0.21%\nGOOGL,\n        +0.04%\n       and become the third-largest U.S. public company upon Friday’s close, after its results were well received by Wall Street and Alphabet’s earlier in the week got panned. Amazon edged out Alphabet only barely, with a closing market cap of $1.785 trillion compared with $1.777 trillion for Alphabet, according to Dow Jones Market Data. Read: Amazon says the ‘magic words.’ They could spur a $110 billion market-cap boost. The e-commerce giant hadn’t been valued above the Google parent company since Sept. 30, 2022, according to Dow Jones Market Data. That was also the last time Amazon was the third-largest by market cap. Wall Street found plenty to like in Amazon’s latest report, including drastic improvement in operating income, upbeat commentary on the cloud and momentum within the retail business. Meanwhile, Alphabet’s earnings were met with a chillier reception as the company talked up heavy spending plans linked to its artificial-intelligence ambitions. The very top of the market-cap ranks has changed up as well lately, though admittedly with less of a tie to earnings. Microsoft Corp.’s \n        MSFT,\n        -0.17%\n       closing valuation surpassed Apple Inc.’s \n        AAPL,\n        -1.06%\n       on Jan. 12 for the first time since November 2021. While the two traded around the top spot in January, Microsoft has been sitting there since Jan. 25. Don’t miss: Microsoft earnings may have offered a big bullish clue about cloud growth Microsoft also rests alone in the $3 trillion club, with Apple, the only other U.S. company to ever claim membership, having fallen out of it. See also: Apple just did something unusual. Can it help the stock amid growth woes? Terns Pharma is due to release data from an early-stage trial of an obesity treatment in pill form in the second half. Positive data would send the stock higher. Emily Bary is a MarketWatch news editor based in New York. Emily Bary is a MarketWatch news editor based in New York. Visit a quote page and your recently viewed tickers will be displayed here. "
}