{
    "title": null,
    "date": "2/19/2024",
    "url": "https://cyprus-mail.com/2024/02/19/nvidia-market-cap-threatens-alphabet-after-overtaking-amazon/",
    "text": "March 27, 2024 March 26, 2024 March 26, 2024 March 26, 2024 March 27, 2024 March 24, 2024 March 23, 2024 March 22, 2024 March 20, 2024 March 8, 2024 March 3, 2024 March 2, 2024 March 27, 2024 March 26, 2024 March 25, 2024 March 25, 2024 March 22, 2024 March 21, 2024 March 21, 2024 March 20, 2024 March 20, 2024 March 15, 2024 March 15, 2024 March 9, 2024 February 26, 2024 February 24, 2024 Nvidia (NVDA.O) eclipsed Google-parent Alphabet (GOOGL.O) as the third most valuable US company on Wednesday, just after overtaking Amazon (AMZN.O) and as investors looked to the dominant AI chipmaker’s upcoming quarterly report. The Santa Clara, California company’s stock rose 2.46 per cent, putting its value at $1.825 trillion, while Alphabet’s stock climbed 0.55 per cent, leaving it with a value of $1.821 trillion. Nvidia has been a top beneficiary of technology companies’ race to build AI into their products and services, and the latest gain in its stock came a day after it ended a session with a market capitalization above Amazon’s for the first time in two decades. Amazon’s market capitalization was $1.776 trillion after its stock rose 1.39 per cent on Wednesday. Nvidia controls about 80 per cent of the high-end AI chip market, a position that has boosted its stock price 47 per cent this year after it more than tripled in 2023. Customers face shortages of Nvidia’s top-of-the-line components while AI developers face months-long waiting lists to use its processors through cloud-computing providers. Technology-related companies, including Microsoft (MSFT.O) and Meta Platforms (META.O), have also rallied to record highs on AI optimism. Nvidia’s quarterly report next Wednesday will be among Wall Street’s most closely watched of the week. Analysts expect another blowout quarter and outlook, and anything less could deflate Wall Street’s AI rally, some investor warned. “The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session,” said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa. Susquehanna analyst Christopher Rolland on Wednesday increased his price target for Nvidia’s stock to $850 from $625, saying he expects strong quarterly results and guidance. Nvidia shares were last at $739. An early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly-listed company, according to LSEG. Analysts, on average, see Nvidia’s January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400 per cent to $11.38 billion. Nvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG. Sign up to the Cyprus Mail Newsletter We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. Please read this Cookie Policy carefully as it contains important information on who we are and how we use cookies on our website. This policy should be read together with our Privacy Policy  which sets out how and why we collect, store, use and share personal information generally, as well as your rights in relation to your personal information and details of how to contact us and/or the supervisory authorities in case you have any complaint. This Cookie Policy applies to the access and use of the Cyprus Mail Website hosted at https://cyprus-mail.com/ (hereinafter referred to as the “Website”), which is operated by NEO CYMED PUBLISHING LIMITED (hereinafter the “Company”, “we” or “us”). Our Company strives to protect personal data and apply high standards of conduct when it comes to privacy issues. We ensure that we provide our employees and staff with the appropriate training to handle personal data promptly and in accordance with the laws. Furthermore, we endeavour to ensure that any parties with whom we co-operate apply the same high standards when it comes to data protection and privacy as we do. Cookies A cookie is a small text file which is placed onto your device (e.g. computer, smartphone or other electronic device) when you use our Website. We use cookies on our Website. These help us improve your experience and at the same time help us to support our security features i.e. detect for malicious visitors, recognize you and your device and store some information about your preferences or past actions. For example, we may monitor . This information helps us to identify trusted web traffic, generate statistical and analytical data on how our visitors use our Website, our reach and click on links. We also uses cookies to personalize your online experience. Some of this data will be aggregated or statistical, which means that we will not be able to identify you individually. For further information on our use of cookies, including a detailed list of your information which we and others may collect through cookies, please see below. For further information on cookies generally, including how to control and manage them, visit the guidance on cookies published by the Office of the Commissioner of Personal Data Protection in Cyprus, or www.allaboutcookies.org/. Consent to use cookies and changing settings We will ask for your permission (Consent) to place cookies or other similar technologies on your device, except where they are essential for us to provide you with a service that you have requested (enabling basic functions like page navigation and access to secure areas of the Website) and ensure the security of our website and users. You may withdraw any consent provided regarding the use of cookies or manage any other cookie preferences by clicking on the Cookie Settings icon at the bottom end of any page on our Website. You can then adjust the sliders regarding the cookies as per your preferences. It may be necessary to refresh the page for the updated settings to take effect. For more information on how you can change your preferences via browser settings please see ‘How to turn off all cookies and consequences of doing so’ below. It may be necessary to refresh the page for the updated settings to take effect. Our use of cookies Categories of Cookies: The table below provides more information about the cookies we use and why: Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites Read https://policies.google.com/technologies/partner-sites  Third party access to the cookies The cookies we use will only be accessed by us and those third parties named in the table above for the purposes referred to in this Cookie Policy. Those cookies will not be accessed by any other third party. How to turn off all cookies and consequences of doing so If you do not want to accept any cookies, you may be able to change your browser settings so that cookies (including those which are essential to the services requested) are not accepted. If you do this, please be aware that you may lose some of the functionality of our Website. How to contact us Please contact us if you have any questions about this Cookie Policy or the information we hold about you. If you wish to contact us, please send an email to [email protected],  write to us at 195, Arch. Makariou III, Neocleous House, 1st-5th floor, 3030, Limassol, Cyprus, or call us at ++357 22818585. Changes to this policy This policy was last updated on 4/7/2023. We may change this policy from time to time, when we do so we will inform you via notification on our Website.   Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Please enable Strictly Necessary Cookies first so that we can save your preferences! "
}