{
    "title": null,
    "date": "2/18/2024",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/02/37196510/greatest-jiu-jujutsu-in-the-history-of-capitalism-vc-investor-worries-then-hopes-fo",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW As the artificial intelligence revolution takes shape, industry watchers see a looming battle for supremacy.  In an episode of the bi-weekly BG2POD podcast aired on Feb. 8, co-hosts Brad Gerstner and  Bill Gurley discussed about innovators’ dilemma and how AI's phase change may affect the biggest names in tech. Innovators’ Dilemma: The innovators’ dilemma Alphabet, Inc. GOOGL GOOG is facing currently is that almost the entirety of its profits come from an advertising model around 10 blue links, said Gerstner, founder of technology-focused investment firm Altimeter Capital. “That is just at its core seems somewhat at odds with what Perplexity is doing, what ChatGPT is doing in the age of answers,” he said. Box co-founder Aaron Levie, who joined as the guest in the episode, weighed on the differences  between Google and the likes of Perplexity and ChatGPT. “The big problem is like you go to a search box, you type in search and they give you a lot results and Perplexity and ChatGPT are just totally different product interfaces, and so they can’t clearly make the Google homepage just do that,” he said. Gerstner pointed out that, in 1999, Google was just a different interface to the portals that existed at the time. He also expressed surprise at why Yahoo, which had an existing business model that required it to sell real estate, didn’t just copy Google then. See Also: Best Artificial Intelligence Stocks Can Google Dominate AI? Gurley, the co-host, said he sees Google facing a horrific problem. Firstly, Google’s user interface is subject to disruption, he said. Secondly, Google is making its users’ lives harder by providing several links with the most pertinent one a user is looking for buried at the bottom, he asserted. “Their business model is to throw their customers in a cage match and let them compete with each other to the death,” Gurley said. Gerstner expressed doubts regarding Google’s success with this approach. “Even the people who invented the damn Blue Lake model don’t believe that that is where this thing end,” he said. “And all I’m saying is the idea that Google can replicate a 99% monopoly and take all of that pool of profits with it, into this new world after letting ChatGPT become the verb, at least at the start, for what this new world is, it just, you know, that to me is almost impossible to believe.” Gerstner noted that the consensus view is that Google is going to dominate the new tech the way it dominated the world of search. “If they pull that off, I hope I am a shareholder along the way,” he said. “That will be one of the greatest jiu jujutsu in the history of capitalism,” he added. In a post on X, Gerstner delved into the pushbacks for Google. Sergey Brin and Larry Page, who co-founded Google, knew at that time the 10 blue links were merely a waypoint en route to answers. But as query growth slowed, ad loads increased, raking in dollars, he said. “Now the whole $GOOG machine is geared to more paid clicks, which must actually be attacked to win at answers,” Gerstner said. He also recommended that OpenAI, the company behind the hugely popular ChatGPT chatbot, change the name of the company to ChatGPT and “singularly focus on winning the consumer prize en route to AGI,” and leaving the enterprise side of the business to partner Microsoft. “The battle to be my trusted assistant/my answer engine – is a multi-trillion prize,” he said. Alphabet’s Class C shares ended Friday’s session down 1.51% at $141.76, according to Benzinga Pro data. Read Next: OpenAI Sets Sights On Something Its Backer Microsoft Failed To Do: Beat Google At Web Search Photo: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}