{
    "title": "Analysts review Alphabet Inc's rating – Knox Daily",
    "date": "3/27/2024",
    "url": "https://knoxdaily.com/2024/03/27/analysts-review-alphabet-incs-rating/",
    "text": "In a filing, Alphabet Inc revealed its Chief Executive Officer Pichai Sundar unloaded Company’s shares for reported $3.35 million on Mar 20 ’24. In the deal valued at $148.78 per share,22,500 shares were sold. As a result of this transaction, Pichai Sundar now holds 2,310,191 shares worth roughly $350.46 million. Then, HENNESSY JOHN L sold 500 shares, generating $74,750 in total proceeds. Upon selling the shares at $149.50, the Director now owns 8,791 shares. Before that, HENNESSY JOHN L sold 300 shares. Alphabet Inc shares valued at $41,853 were divested by the Director at a price of $139.51 per share. As a result of the transaction, HENNESSY JOHN L now holds 9,291 shares, worth roughly $1.41 million. A number of analysts have revised their coverage, including BofA Securities’s analysts, who remained covering the stock and in late January has reiterated a ‘”a Buy”‘ rating for it. Credit Suisse also remained covering GOOG and reiterated its “an Outperform” recommendation on October 11, 2022. MKM Partners maintained its rating on July 18, 2022. It rated GOOG as “a Buy”. On Tuesday, Alphabet Inc [NASDAQ:GOOG] saw its stock jump 0.36% to $151.70. Over the last five days, the stock has gained 2.56%. Alphabet Inc shares have risen nearly 7.64% since the year began. Nevertheless, the stocks have risen 43.03% over the past one year. While a 52-week high of $155.20 was reached on 01/29/24, a 52-week low of $100.28 was recorded on 03/05/24. SMA at 50 days reached $144.61, while 200 days put it at $135.39. A total of 19.29 million shares were traded, compared to the trading of 15.11 million shares in the previous session. The 24-hour chart illustrates a support level at 150.75, which if violated will result in even more drops to 149.81. On the upside, there is a resistance level at 152.92. A further resistance level may holdings at 154.15. The Relative Strength Index (RSI) on the 14-day chart is 64.47, which indicates neutral technical sentiment, while the Moving Average Convergence Divergence (MACD) stands at 6.77, which suggests price will go up in the next trading period. Percent R suggests that price movement has been bullish at 7.30%. Stochastics %K at 92.93% indicates the stock is a selling. A steep rise in short interest was recorded in Alphabet Inc stocks on Feb 29, 2024, dropping by -2.25 million shares to a total of 34.87 million shares. Yahoo Finance data shows the prior-month short interest on Jan 31, 2024 was 37.12 million shares. There was a decline of -6.45%, which implies that there is a negative sentiment for the stock. The most recent change occurred on July 13, 2022 when Cowen resumed its ‘”an Outperform”‘ rating for the stock and retained the price target to $3000. © 2023  All rights Reserved. Knox Daily We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. "
}