{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/15625-shares-in-alphabet-inc-nasdaqgoogl-purchased-by-chickasaw-capital-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Chickasaw Capital Management LLC bought a new position in shares of  Alphabet Inc. (NASDAQ:GOOGL – Free Report) in the fourth quarter, Holdings Channel reports. The firm bought 15,625 shares of the information services provider’s stock, valued at approximately $2,183,000. Several other institutional investors and hedge funds also recently made changes to their positions in the business. Live Oak Investment Partners acquired a new position in  Alphabet in the fourth quarter valued at about $26,000.  VitalStone Financial LLC raised its position in shares of  Alphabet by 1,900.0% in the 2nd quarter. VitalStone Financial LLC now owns 280 shares of the information services provider’s stock valued at $34,000 after acquiring an additional 266 shares during the period.  Sanctuary Wealth Management L.L.C. bought a new position in  Alphabet during the 4th quarter worth approximately $34,000.  Turim 21 Investimentos Ltda. acquired a new position in  Alphabet during the third quarter valued at approximately $38,000.  Finally, Meritage Group LP increased its stake in  Alphabet by 1,061.5% in the third quarter. Meritage Group LP now owns 302 shares of the information services provider’s stock valued at $40,000 after purchasing an additional 276 shares in the last quarter. Institutional investors own  35.08% of the company’s stock. GOOGL stock opened at $150.77 on Friday. The company has a market cap of $1.87 trillion, a PE ratio of 25.99, a price-to-earnings-growth ratio of 1.36 and a beta of 1.04. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. Alphabet Inc. has a 52 week low of $99.74 and a 52 week high of $153.78. The business has a 50-day simple moving average of $143.02 and a 200 day simple moving average of $137.79. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, beating the consensus estimate of $1.60 by $0.04. The company had revenue of $86.31 billion during the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same period in the previous year, the company earned $1.05 EPS.  Sell-side analysts anticipate that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. In other news, insider John Kent Walker sold 28,281 shares of the firm’s stock in a transaction that occurred on Thursday, December 28th. The shares were sold at an average price of $141.40, for a total value of $3,998,933.40. Following the sale, the insider now directly owns 25,002 shares in the company, valued at approximately $3,535,282.80. The transaction was disclosed in a filing with the SEC, which is available at the SEC website. In other Alphabet news, CFO Ruth Porat sold 48,077 shares of the company’s stock in a transaction dated Friday, March 8th. The stock was sold at an average price of $137.22, for a total value of $6,597,125.94. Following the completion of the transaction, the chief financial officer now owns 1,777,106 shares of the company’s stock, valued at approximately $243,854,485.32. The sale was disclosed in a legal filing with the SEC, which is available through the SEC website. Also, insider John Kent Walker sold 28,281 shares of Alphabet stock in a transaction dated Thursday, December 28th. The shares were sold at an average price of $141.40, for a total value of $3,998,933.40. Following the sale, the insider now directly owns 25,002 shares in the company, valued at $3,535,282.80. The disclosure for this sale can be found here. In the last quarter, insiders have sold 279,659 shares of company stock valued at $39,460,310. 0.88% of the stock is currently owned by corporate insiders. Several equities analysts have recently issued reports on GOOGL shares. Royal Bank of Canada  reissued an “outperform” rating and issued a $155.00 price target on shares of Alphabet in a report on Wednesday, January 31st. Truist Financial cut their price objective on Alphabet from $160.00 to $158.00 and set a “buy” rating on the stock in a report on Wednesday, January 31st. Rosenblatt Securities reduced their price target on shares of Alphabet from $174.00 to $172.00 and set a “buy” rating for the company in a report on Wednesday, January 31st. StockNews.com raised shares of Alphabet from a “buy” rating to a “strong-buy” rating in a research report on Wednesday, December 20th. Finally, Barclays dropped their price target on Alphabet from $180.00 to $173.00 and set an “overweight” rating on the stock in a research note on Wednesday, January 31st. Five investment analysts have rated the stock with a hold rating, twenty-six have issued  a buy rating and two have issued  a strong buy rating to the company’s stock. According to MarketBeat, the stock  has a consensus rating of “Moderate Buy” and a consensus target price of $155.48. Get Our Latest Research Report on Alphabet (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Fortitude Family Office LLC Acquires Shares of 209 Yum! Brands, Inc. (NYSE:YUM) Advisor Resource Council Buys Shares of 20,025 Invesco KBW High Dividend Yield Financial ETF (NASDAQ:KBWD) "
}