{
    "title": "Could The Market Be Wrong About Alphabet Inc. (NASDAQ:GOOGL) Given Its \nAttractive Financial Prospects?",
    "date": "3/9/2024",
    "url": "https://finance.yahoo.com/news/could-market-wrong-alphabet-inc-120013219.html",
    "text": "With its stock down 7.2% over the past month, it is easy to disregard Alphabet (NASDAQ:GOOGL). However, a closer look at its sound financials might cause you to think again. Given that fundamentals usually drive long-term market outcomes, the company is worth looking at. Specifically, we decided to study Alphabet's  ROE in this article. Return on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. Simply put, it is used to assess the profitability of a company in relation to its equity capital. See our latest analysis for Alphabet The formula for ROE is: Return on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity So, based on the above formula, the ROE for Alphabet is: 26% = US$74b ÷ US$283b (Based on the trailing twelve months to December 2023). The 'return' is the yearly profit. Another way to think of that is that for every $1 worth of equity, the company was able to earn $0.26 in profit. Thus far, we have learned that ROE measures how efficiently a company is generating its profits. We now need to evaluate how much profit the company reinvests or \"retains\" for future growth which then gives us an idea about the growth potential of the company. Generally speaking, other things being equal, firms with a high return on equity and profit retention, have a higher growth rate than firms that don’t share these attributes. Firstly, we acknowledge that Alphabet has a significantly high ROE. Second, a comparison with the average ROE reported by the industry of 8.7% also doesn't go unnoticed by us. This probably laid the groundwork for Alphabet's moderate 18% net income growth seen over the past five years. As a next step, we compared Alphabet's net income growth with the industry, and pleasingly, we found that the growth seen by the company is higher than the average industry growth of 7.8%. Earnings growth is an important metric to consider when valuing a stock. The investor should try to establish if the expected growth or decline in earnings, whichever the case may be, is priced in. Doing so will help them establish if the stock's future looks promising or ominous. Is GOOGL fairly valued? This infographic on the company's intrinsic value  has everything you need to know. Alphabet doesn't pay any dividend, meaning that all of its profits are being reinvested in the business, which explains the fair bit of earnings growth the company has seen. In total, we are pretty happy with Alphabet's performance. Particularly, we like that the company is reinvesting heavily into its business, and at a high rate of return. Unsurprisingly, this has led to an impressive earnings growth. That being so, a study of the latest analyst forecasts show that the company is expected to see a slowdown in its future earnings growth. Are these analysts expectations based on the broad expectations for the industry, or on the company's fundamentals? Click here to be taken to our analyst's forecasts page for the company. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}