{
    "title": "Trade of the Day: Alphabet Stock Reaches Technical Support Worth Respecting",
    "date": "3/23/2024",
    "url": "https://www.aol.com/trade-day-alphabet-stock-reaches-123707606.html",
    "text": "Advertisement For premium support please call: As momentum stocks — plenty of them in the large cap technology space — continue to drop, some names such as  Alphabet (NASDAQ:GOOGL, NASDAQ:GOOG) are starting to reach good support areas through the lens of technical analysis, where a bounce could occur. In recent weeks I have routinely been asked by investors what I consider to be the biggest risk to this market. My answer is twofold; 1. From a big-picture perspective, the slowing in corporate profits and thus the late-stage of the business cycle that we find ourselves should keep stocks from rising at prevailing rates. Indeed, they may trot sideways to lower through a multi-quarter lens. InvestorPlace - Stock Market News, Stock Advice & Trading Tips 2.  From more of a market structure perspective much of the gains in the U.S. stock market the first nine months of 2018 came from a few mega-cap technology stocks. Those stocks have such a large weighting in the broader indices, and thus in most U.S. investor’s portfolios, that even a “normal” corrective move of 10%-20% could have larger reverberations than usual across the stock market. Click to Enlarge Moving averages legend: red – 200 week, blue – 100 week, yellow – 50 week Both of the above two points should be concerning to investors, but that does not mean that the more active types of traders and investors can’t find opportunity for meaningful bounces in the nearer-term time frames. 7 Winning Stocks to Buy in November for 2019 To wit, looking at the multiyear weekly chart of GOOGL stock, we see that as a result of its 20% or so decline from the July highs to the recent lows, it has arrived at a crossroads of support. I call those types of support areas “confluence support,” which in this case now is made up of horizontal support as well as multiyear diagonal support as marked by the two gray lines. While a bounce and seller exhaustion or a bullish reversal has yet to take place, this to me looks like an opportune spot to buy some GOOGL stock for a trade. Click to Enlarge Moving averages legend: red – 200 day, blue – 100 day, yellow – 50 day On the daily chart, we see a little closer how this confluence ares of support lines up. Also note that from a momentum perspective, using the daily MACD oscillator in black at the bottom of the chart, we see what is called positive divergence, where the price has continued to struggle but momentum may have made a temporary low in late October. I have yet to see a real wash-out type of selling in GOOGL stock, but if tech stocks are to get any kind of bounce soon into year-end then buying some around the $1,000-$1,050 area with a next upside target closer to $1,120 looks like a good trade setup to me. Position size for this trade in my eye should be conservative given that we have yet to see real wash out selling or a bullish reversal. Once we see such price action one could consider adding to this long position. Get FREE ACCESS to Serge’s renowned Stock Market Scanner with actionable trade ideas. Get it HERE. 2 Toxic Pot Stocks You Should Avoid 7 Winning Stocks to Buy in November for 2019 7 Autonomous Vehicle Stocks to Consider Now 7 Biotech ETFs to Consider for 2019 Compare Brokers The post Trade of the Day: Alphabet Stock Reaches Technical Support Worth Respecting appeared first on InvestorPlace. Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement "
}