{
    "title": "Google Employees Will Get Smaller Pay Bumps This Year",
    "date": "3/14/2024",
    "url": "https://www.businessinsider.com/google-employees-compensation-pay-salary-refreshers-equity-stock-2024-3",
    "text": "       It's the time of year when Google employees discover how much of a pay bump they're getting. For many, this year comes with a bit of a shock. Google has reduced the size of the compensation packages it's handing out to staff this year, with some employees even seeing a reduction in their overall pay, they learned this month. Compensation packages are made up of base salary, bonuses, and equity grants. Once a year, following performance reviews, employees learn how their packages should increase over the next year. One employee said the refreshers this year were \"noticeably smaller than what Google has historically offered.\" The person said they and other colleagues saw base pay increases lower than 3% (while in previous years, they may have seen 8% to 10%). \"And that's with a decent performance rating,\" the person added. One manager said some employees who received an \"outstanding\" rating even saw their total compensation drop. This has happened in cases where the employee received little or no raise in base salary, little or no change to their bonus, and lower equity rewards than before, the manager said. Related stories \"Managers have a smaller sum to make adjustments on,\" the manager added, referring to the pot of cash that can be dispersed to employees. In his Command Line newsletter, Alex Heath previously reported that Google managers had been told they would be doling out less money than in previous years. These employees, whose identities Business Insider has confirmed, spoke on condition of anonymity so they could speak freely. Tamani Jayasinghe, a Google spokesperson, told BI that the company was adjusting equity awards to better reflect the pace of growth and competitive rates across locations. She said salaries would increase for most Googlers. \"Similar to last year, the vast majority of Googlers will receive a compensation increase this year — which includes a salary increase, equity grant, and a full bonus,\" Jayasinghe said. \"We continue to offer extremely competitive pay across salary, equity, leave, and a broader suite of benefits.\" While most may see an increase in compensation, Googlers say the amount they've seen this year is notably smaller. One employee said they were told by their manager that the cuts reflected the \"new economic reality.\" \"Base increases are extremely low,\" one manager said. \"The lowest I have ever seen in my decade tenure at Google.\" This is all happening during a rocky time at the company, which has carried out several rounds of layoffs since the start of the year. Like some other tech giants, Google is trying to tighten its belt and trim head count in areas it no longer sees as a priority. Googlers are among some of the best-paid employees in tech. Still, these compensation changes won't help morale when it's already pretty low. \"Some people are even getting flat comp refreshes, which almost never happened before,\" another employee told BI. \"I got just about an inflation raise,\" they added. Are you a current or former Googler with a tip? You can contact Hugh Langley through the encrypted messaging apps Signal and Telegram (628-228-1836) or email. On February 28, Axel Springer, Business Insider's parent company, joined 31 other media groups and filed a $2.3 billion suit against Google in Dutch court, alleging losses suffered due to the company's advertising practices. Read next Jump to "
}