{
    "title": "Google: Your AI Search Stops Here (undefined:GOOG)",
    "date": "3/2/2024",
    "url": "https://seekingalpha.com/article/4675446-google-your-ai-search-stops-here",
    "text": "Ole_CNX  Ole_CNX Each year we pick a Big Tech stock we think will outperform its peers. In November 2022, we picked Meta (META) as our stock of 2023. For 2024, our pick is Alphabet. I believe Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) has been over-punished for its flaccid response to AI, as Meta was for its stupidity regarding the Metaverse and headsets. Alphabet still sits on cash volcanoes (as does Meta), and if 2023 was AI Star Wars, 2024 will be AI The Empire Strikes Back. Note: Stock picking is fun, and you can learn by doing it, but the research is clear — buy low-cost index funds. Anyway... Google Search is likely the best (most lucrative) business model of this millennium. The company’s monopoly on search garners a 24% net profit - on 91% of the $190 billion search business. Google redeploys some of these earnings to dig moats, offering free apps for email, word processing, videos, mobile OS, and mapping which protect the Red Keep (search) from marauders. Despite this, its parent company, Alphabet, is the cheapest stock (by P/E ratio) in the Magnificent 7. Its shares have risen 144% in the past five years, bettering only Amazon (AMZN), and behind Meta’s 198%, Microsoft’s (MSFT) 261%, Apple’s (AAPL) 313%, Tesla’s (TSLA) 964%, and Nvidia’s (NVDA) 1,900% increases. The market views businesses with a naked eye, and what it sees in Alphabet is a great company hamstrung by the Innovator’s Dilemma.   The thesis of Clayton Christensen’s The Innovator’s Dilemma, published in 1997, is based on a world of hard disk drives and film photography, but it’s stood the test of time. Christensen’s argument is successful companies doom themselves not by making mistakes, but by doing everything right: Incumbency is the most potent blessing a firm can enjoy, right up until the moment it becomes a curse. AI has pulled that moment forward for Alphabet. Google was once the innovator, offering markedly better search results. Early Search was part of a richly appointed “on-ramp” to the internet. Instead Google gave users a blinking cursor to type a query, and then 10 blue links to the most relevant webpages. When it offered advertising, it was similarly bare-bones, with only promoted links, no javascript “experiences” or animated characters wandering around the screen. This lo-fi experience was attractive to users, because the links were relevant, and to advertisers, because it was targeted. The company siphoned traffic from the more robust competitive offerings. By the time market leaders such as Yahoo!, Alta Vista, AOL, and Excite understood what was happening, Google had blown past them. And it kept iterating. The company’s culture has attracted what may be the greatest density of high IQs in business history. Google, until last year, felt unassailable. And then, suddenly, it was vulnerable. Christensen foresaw this, in general terms, in his analysis of how an innovative firm succeeds at the expense of market leaders. Market leaders make their money providing customers with the best product, not by throwing half-baked, partially serviceable technology at them, even if in the long term that technology may become more popular. Their reputation for quality and reliability is among their most valuable assets, and their sales and marketing investments are made to attract and maintain the largest customers. This creates the opportunity for an innovator to operate on the fringes of an industry, with a product that’s subpar in some ways but has greater long-term potential. One of Christensen’s key insights was that this opportunity isn’t the result of any error by the market leader, but a function of market leadership itself. Thus, the dilemma forms when the innovator becomes the boss. A classic example is Kodak (KODK). Kodak dominated the photography industry for decades, delivering the highest-quality film and paper to the most demanding and profitable customers. It wasn’t ignorant of digital photography; the company actually pioneered the category, developing the first digital camera in the 1970s, and it offered a variety of digital cameras for sale throughout the 1990s - including one model that cost $20,000 and sold less than 1,000 units. Kodak didn’t go all-in on digital, however, because digital offered considerably lower-quality than film and had different virtues, and because the company’s business model was built around selling consumable film. Most discouraging, its best customers had no use for it. Kodak left the digital field to innovators who offered cameras that produced inferior images, but these firms found favor in other, neglected parts of the market. As these companies innovated, the product got better, and Kodak was caught behind what Christensen describes as an S-curve of innovation. New technology is initially unreliable and of low quality, and many early improvements generate little consumer value. But if those improvements continue, like financial savings, they compound. The result is a better product that has so much momentum that the incumbent is caught flat-footed. This is the steep slope in the middle of the S-curve, and whoever gets there first has a huge advantage. Think people camping outside Apple stores to get the latest iPhone every year. Kodak couldn’t justify pivoting toward digital photography in the sluggish, flat part of the curve, since there was no ROI at that point. But Canon, Pentax, Nikon, and others with less to lose kept plugging away. In the late ’90s, they hit the acceleration phase of the S-curve and left Kodak behind. Kodak recorded revenue of $16 billion in 1996; in 2023, $1.2 billion.   And here’s the interesting part: Kodak management may not have been as dumb as we think. The military assesses officers after combat based on the quality of their decisions given the circumstances, and what the officer knew moment to moment. Skimping digital may have been Kodak’s best decision at that moment. Had it been more aggressive with digital cameras of the lousy quality that its competitors were manufacturing in the ’90s, it would have struggled to meet shareholder expectations for its margins, tarnished its brand reputation for quality, and risked losing core business market share to competitors. Sure, the move to digital cameras seems obvious... now.   Alphabet is in a strikingly similar situation as Kodak 30 years ago - its supremacy is under threat from a technology it developed but has failed to capitalize on. In 2017, Google researchers released a paper on AI titled “Attention Is All You Need,” proposing a neural network that could analyze unprecedented volumes of text and produce logical, comprehensible responses. Called a “transformer” model, this is the framework of modern generative AI - ChatGPT and most other major AI models are derived from insights developed at Google. Like Kodak, Google didn’t ignore the tech it had developed: It built AI into its search product, fleshing out the bare-bones results page with summaries of webpages, biographical capsules, and other features. But all of this was range-bound to the core paradigm of a search box and a results page. That left a void in the market, a multitrillion-dollar black hole, which ChatGPT filled in 2022. Firms including Perplexity, Anthropic, and Inflection AI rushed in as well. Why search when you can just get there (i.e., the answer)? Why limit your dialog to one question when you can have a conversation? Why limit search to searching - why not include creativity, tasks, and communication?   If Google had released the same ChatGPT product as OpenAI in early 2022, it would have been ridiculed and experienced a PR disaster. At launch, ChatGPT couldn’t solve simple math problems, was easily tricked into providing information about building bombs and making jokes about sexual assault, etc. Little-known OpenAI could get away with that; Google couldn’t. In fact, when Google launched Bard, Alphabet lost $100 billion in market cap because the chatbot gave incorrect answers in the promotional video. And the company has been ridiculed in the media for its fumbled Gemini rollout of an AI that’s so politically sensitive. The multitrillion-dollar question is who gets to the steep part of the S-curve first - or whether OpenAI and its peers have already reached it. Because once ChatGPT (or Perplexity or Claude or a model we haven’t seen yet) hits escape velocity, the history of innovation tells us the race is over. A bad sign for Alphabet: Of the original eight researchers who wrote that AI “Attention” paper, only one still works at Google. Six others founded their own companies, and one joined OpenAI. Something that’s speed-balled Christensen’s theory in this era is the amount of capital available to the defectors. Generative AI and AI-related startups raised more than $50 billion in 2023, led by Open AI. Over 70 rounds of $100+ million raises occurred last year. These companies aren’t immediately direct competitors of Google; they’re coming at the search game obliquely. ChatGPT doesn’t fill every role that Google’s product offers, but it begins to nibble at the periphery, just as Google has been gnawing at all media for two decades. A former Google employee who founded their own AI startup recently said, “The pirates have their boats in the ocean, and we are coming.” What happens now? When a public company with these tectonic assets lags the stock returns of its peers, that’s the bat signal for an activist. Activists typically acquire 5% to 10% of a company’s shares and publicly advocate for board seats, proposing change. When it works, the outside perspective and energy invigorates management (sometimes by firing them) and stirs the giant from its slumber. Alphabet in many ways is a classic activist target - it’s still a dominant company with enormous growth potential but what feels like, almost overnight, an insular management team rendered flat-footed during a paradigm shift. However, the gates an activist would need to breach are well-fortified. Alphabet has a multiclass stock structure. As with many things Alphabet, it’s more complicated than it probably needs to be - three classes, including two that trade publicly. But the bottom line is that Larry and Sergey together control the company through their ownership of Class B shares, and no third party can acquire enough shares to override them.   The lack of voting power is not an insurmountable obstacle. Ultimately, an activist investor gains influence based on the strength of their argument and plan, not the size of their stake. And Alphabet can be saved. Thanks to the growth of two other members of the Magnificent 7, Nvidia and Microsoft, most of the attention is on AI hardware and AI models. These are important and have been lucrative for their makers. But the third leg of the AI stool - where I believe the war will be won/lost - is the data that LLMs have access to for their models and applications. Data used for training models, and data to feed them so they can find patterns and create value. Nobody - no government, no church, no supernatural being - has more data than Alphabet. Google Search crawls nearly the entire public internet and serves the majority of search results. YouTube hosts a billion videos and knows your viewing preferences. The post you’re reading right now was researched using Google Search and Google Chrome and written in Google Docs. An estimated 1.8 billion people use Gmail, a billion people use Google Maps, and 500 million store their schedule in Google Calendar. This vast store of data is Alphabet’s deepest moat, and the company’s bridge to the future. This sort of data has become currency: Reddit (RDDT), the Associated Press, Tumblr, WordPress — anyone with a full data center — have all monetized their (much smaller) pools of data for LLM training. Tesla will tell you that the biggest advantage it has in self-driving AI is the fleet — specifically, the years of real-world driving data that Teslas have sent back to HQ for processing by the company’s AI systems. But building better models isn’t how Alphabet can leapfrog OpenAI. It’s by customizing models that are purpose-built on its proprietary data sets. Alphabet’s data flex is not that it knows more about the world, but about you. AI built on top of the Google suite could anticipate our needs and handle all the plumbing and bureaucracy to fulfill them. A quick scan of my Gmail and calendar yields that I am speaking at TED in April (my flex). A Gemini AI scan will reveal the airline, class, hotels, and activities I’ll engage in when I’m there on the West Coast. Google understands the patterns and preferences of my life, and all the income streams stemming from it. I’ll be at SXSW next week. Alphabet (again) knows when I’m going, where I like to stay in Austin, and that I’ve been considering ketamine therapy. It also knows, from public postings, who else will be there, so it could begin turning my calendar from a defensive weapon (don’t be late) to an offensive weapon (Alert: you have a two-hour window on Sunday; should we book ketamine therapy at Kuya or lunch with Scott Burns/Liz Plank/Chris Williamson, who will also be in Austin?). As with investing and careers, the real ROI for Gemini isn’t in sexy apps that produce video in the style of Kurosawa, but apps that make your life easier and less expensive. Pro tip: It’s the boring stuff that makes you rich. OpenAI can’t do this, nor can Microsoft. In fact, there’s only one other company on Earth that has anywhere close to this 360-degree data on its customers: Apple. And Apple’s AI entry, Siri, has been a dud. Opting for Google’s payola rather than building its own search engine may have been billions-wise and trillions-foolish. The team in Cupertino is likely well back on the flat part of the S-curve. On the other hand, another news item out of the Valley this week: Apple just shuttered its autonomous driving project and is redirecting the top people from that venture into AI. Gentlemen, start your S-curves. In my first book, The Four, I equated Google to God. We no longer pray, but query. You trust Google more than any priest, rabbi, mentor, boss, or coach. Go(d)ogle knows if you’re thinking about terminating a pregnancy or considering hormone therapy. The market has focused on the infrastructure (Nvidia) and technology (OpenAI) of AI. Soon, it will turn its gaze to the differentiating feature of AI’s application, the content fed into LLMs. And, despite Google’s stumbles, the market will recognize that this sweet crude of data sits on what are still the most active cash volcanoes on the planet. So, what happens? I don’t know. Perhaps I should pray/search/prompt on it. Original Post Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}