{
    "title": null,
    "date": "3/13/2024",
    "url": "https://www.marketwatch.com/data-news/alphabet-inc-cl-a-stock-outperforms-competitors-on-strong-trading-day-a9e48d3e-890cfddf6b40",
    "text": "Shares of Alphabet Inc. Cl A \n        GOOGL,\n        +0.04%\n       inched 0.93% higher to $139.79 Wednesday, on what proved to be an all-around mixed trading session for the stock market, with the Dow Jones Industrial Average \n        DJIA,\n        +0.12%\n       rising 0.10% to 39,043.32 and the S&P 500 Index \n        SPX,\n        +0.11%\n       falling 0.19% to 5,165.31. This was the stock's fifth consecutive day of gains. Alphabet Inc. Cl A closed $13.99 below its 52-week high ($153.78), which the company reached on January 29th. The stock outperformed some of its competitors Wednesday, as Microsoft Corp. \n        MSFT,\n        -0.17%\n       fell 0.04% to $415.10, Amazon.com Inc. \n        AMZN,\n        +0.31%\n       rose 0.66% to $176.56, and Meta Platforms Inc. \n        META,\n        -1.68%\n       fell 0.84% to $495.57. Trading volume (23.2 M) remained 7.8 million below its 50-day average volume of 31.0 M. Editor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet.  See our market data terms of use. Trading in General Electric’s power-generation spinoff began this week. The spinoff itself takes place on April 2. So far, trading has hewed pretty close to Wall Street estimates. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Supported by world-class markets data from Dow Jones and FactSet, and partnering with Automated Insights, MarketWatch Automation brings you the latest, most pertinent content at record speed and with unparalleled accuracy. Visit a quote page and your recently viewed tickers will be displayed here. "
}