{
    "title": null,
    "date": "3/21/2024",
    "url": "https://finance.yahoo.com/news/alphabets-nasdaq-googl-20-cagr-110029995.html",
    "text": "When you buy a stock there is always a possibility that it could drop 100%. But on the bright side, you can make far more than 100% on a really good stock. For example, the Alphabet Inc. (NASDAQ:GOOGL) share price has soared 153% in the last half decade. Most would be very happy with that. It's even up 6.4% in the last week. On the back of a solid 7-day performance, let's check what role the company's fundamentals have played in driving long term shareholder returns. See our latest analysis for Alphabet In his essay The Superinvestors of Graham-and-Doddsville Warren Buffett described how share prices do not always rationally reflect the value of a business. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS). During five years of share price growth, Alphabet achieved compound earnings per share (EPS) growth of 22% per year. This EPS growth is reasonably close to the 20% average annual increase in the share price. Therefore one could conclude that sentiment towards the shares hasn't morphed very much. Indeed, it would appear the share price is reacting to the EPS. You can see below how EPS has changed over time (discover the exact values by clicking on the image). We know that Alphabet has improved its bottom line lately, but is it going to grow revenue? Check if analysts think Alphabet will grow revenue in the future. It's nice to see that Alphabet shareholders have received a total shareholder return of 44% over the last year. That's better than the annualised return of 20% over half a decade, implying that the company is doing better recently. Given the share price momentum remains strong, it might be worth taking a closer look at the stock, lest you miss an opportunity. Before forming an opinion on Alphabet you might want to consider these 3 valuation metrics. If you like to buy stocks alongside management, then you might just love this free list of companies. (Hint: insiders have been buying them). Please note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Related Quotes "
}