{
    "title": "Google: Don't Be Too Late To The Party! (NASDAQ:GOOGL)",
    "date": "1/8/2024",
    "url": "https://seekingalpha.com/article/4661516-google-do-not-be-too-late-to-the-party",
    "text": "Shutthiphong Chandaeng/iStock via Getty Images  Shutthiphong Chandaeng/iStock via Getty Images Alphabet (NASDAQ:GOOGL) has built itself a powerhouse of a business, establishing a foothold in many diverse industries, creating one of the largest and best global ecosystems. Their diverse offerings, including Google Search, Google Cloud, YouTube, and Google Services (Maps, Drive, Gmail, etc.), provide customers with a vast array of products and seamless integration. To simplify, Alphabet has four main products or services that give them a strong moat: How GOOGL Makes Money (Google Search) How GOOGL Makes Money (Google Search) Beyond the significant advantage Alphabet's diverse brands and products have built, I've recently become more interested in the company due to its seemingly low valuation. GOOGL currently trades at 23 times this year's earnings, becoming even cheaper on a forward basis. Analysts expect earnings per share (EPS) to grow by 25% this year and continue in the mid-teens for the next two years. Sales are also projected to grow in the low to mid-teens over the next three years. For a company of Alphabet's size and pricing power, seeing this kind of sustained growth makes its current valuation quite attractive, especially compared to many others. But don't just take my word for it. Take a look at the graphic below. Comparing GOOGL's P/E ratio and forward projections to those of the other \"Magnificent 7\" companies, it's clearly one of, if not the most, undervalued and potentially lucrative bargain in the group, alongside Mark Zuckerberg's (META). GOOGL Forward P/E Comps (Seeking Alpha) GOOGL Forward P/E Comps (Seeking Alpha) Not only does the stock appear undervalued, but let's be honest, I suspect many of the analyst estimates for GOOGL's growth are overly conservative. We're still in the early stages of witnessing AI's full potential and how companies will harness and monetize it. However, one thing is clear: GOOGL possesses cutting-edge technology and immense resources. Their cash war chest sits at almost $120 billion, with only $30 billion in debt – most of it secured at exceptionally low interest rates. While you might have noticed a slight dip in their cash reserves lately, this reflects their increased investments in future-oriented technologies. GOOGL Cash on Hand (Koyfin) GOOGL Cash on Hand (Koyfin) Their high-cash-flow business, currently yielding a respectable 4.4% free cash flow (FCF) yield, allows them to invest heavily in R&D and AI, far exceeding the capabilities of many competitors. This abundance of resources fuels my conviction that not only will Google's existing products and services like YouTube, Cloud, and Search continue to excel, but they will also retain the necessary resources, technology, and loyal customer base to remain relevant and dominant players in the tech landscape and our lives for decades to come. Therefore, I rate GOOGL a strong buy at its current price point in the mid $130s and encourage investors not to miss out on its potential for further growth. Last year, we saw GOOGL rally from its lows in the mid-$80s, and I believe this year could bring new all-time highs. Don't Miss out on the Party. It's not too late to Buy. Let's briefly touch on the fundamentals, specifically focusing on capital allocation in this case. We all know that GOOGL's balance sheet is a rock star – overflowing with cash and liquidity, practically debt-free and unburdened by restraints. That's not the concern here. Just take a look at their margins compared to industry peers – GOOGL is a genuine cash cow. GOOGL Margins (Seeking Alpha) GOOGL Margins (Seeking Alpha) The main point of contention, and where much of the criticism around GOOGL emerges, is the question of how they allocate their vast cash generation. Alphabet relentlessly invests in new projects like Waymo and YouTube Shorts across various fields. While this fuels technological advancement and the potential for the next game-changer, it also leads to substantial, and some might argue, wasteful cash expenditures. One of the most anticipated actions from Alphabet, desired by many investors, is the initiation of a dividend. Companies like Apple (AAPL), Microsoft (MSFT), and Nvidia (NVDA) all distribute dividends, albeit not game-changing in size. However, it offers investors a sense of security and capital return. I firmly believe that the day GOOGL announces a dividend, the stock will see a significant increase, likely exceeding 5%. For now, investors will keep a close eye on project and product announcements, alongside the other major avenue of capital return to shareholders: share repurchases. GOOGL Shares Outstanding (Koyfin) GOOGL Shares Outstanding (Koyfin) Management has demonstrably reduced the share count by over 10% in the past five years. They've strategically utilized their abundant cash flow to repurchase shares at favorable prices, effectively shrinking the outstanding share base. This commitment to shareholder value was further underlined by the $70 billion share buyback program announced in April 2023. Ample capacity remains within the program for further repurchases, which would contribute to accelerated EPS growth. With the cloud business becoming increasingly profitable, ad spending rebounding, and ongoing share count reduction, I see compelling long-term reasons to favor GOOGL. For long-term investors seeking stability and consistent value creation, GOOGL presents strong case for a \"buy-and-hold\" approach. While no investment is entirely risk-free, the company's strong fundamentals and proactive capital allocation strategy offer a high degree of confidence for those seeking long-term growth. The average analyst price target for GOOGL on the street sits around $158, with individual estimations ranging from $155 (Pershing and Koyfin) to $161 (Morningstar). This consensus suggests a fair value somewhat higher than the stock's historical all-time high of just above $151 per share. These projections resonate with me. Using the company's forward earnings estimates and its historical valuation range, I independently calculated my own next twelve-month (NTM) price target for GOOGL. My base-case scenario yields a fair value of $152, representing a current discount of approximately 12%. Furthermore, at the current price of $136, the stock boasts a compelling 6.4x risk-to-reward ratio. In light of the recent pullback from $142, I believe this presents a valuable opportunity for long-term investors seeking both value and growth. GOOGL NTM Price Target Scenario Table (Author Calculations Based on Analyst Estimates From Data on S.A.) GOOGL NTM Price Target Scenario Table (Author Calculations Based on Analyst Estimates From Data on S.A.) While my base case price target of $152 is my initial focus, it's the bull case scenario that truly excites me. I believe it's only a matter of time before GOOGL's substantial investments and pioneering work in AI bear fruit, finally receiving the market's full recognition and appreciation. While surpassing the historical high at $152 would be a significant milestone, achieving the $170s holds even greater potential, fueled by resurgent ad spending, accelerating cloud growth, and the broader tech landscape's inevitable migration to the cloud. To delve deeper into GOOGL's growth potential, I constructed a simplified Discounted Cash Flow (DCF) model, projecting a longer-term price target for the next three plus years. Given GOOGL's substantial future cash flow generation and significant runway for opportunity, my current long-term (3+ years) price target sits at $198 per share, implying a 42% discount from current levels. This could even be revised upwards if Alphabet delivers on its potential to become the leading provider of best-in-class AI services, which I firmly believe they have the ability to achieve. Therefore, I reiterate my strong buy rating on GOOGL. As the saying goes, it's better to be late than never, and I believe there's still significant value to be unlocked in this tech powerhouse. While I believe Alphabet is unlikely to face complete extinction, the stock does carry some risks that could lead to a decline in its price and market capitalization. Firstly, there's the risk of legal challenges related to antitrust and monopoly concerns. The ongoing investigations by the Justice Department and state attorneys general pose a significant threat to GOOGL. The recent loss to Epic Games in the app store antitrust lawsuit serves as a stark reminder of this risk, particularly in light of Apple's successful defense against Epic in their own case. Furthermore, the sheer size and diversification of Alphabet's ecosystem, encompassing numerous industries, has fueled calls for its potential breakup. While I, like many others, favor preserving the integrity of mega-caps like GOOGL, AMZN, and MSFT, the potential for regulatory intervention remains a concern. Alphabet Overview (Google Search) Alphabet Overview (Google Search) Beyond the potential for legislative and regulatory challenges, Alphabet also faces intense competition from various fronts. Mega-cap tech giants like META, AMZN, and MSFT pose significant threats, while smaller startups and niche players can disrupt in specific fields. While Alphabet's substantial cash reserves provide an edge over many newcomers, they can't guarantee immunity against innovative products and technologies emerging from elsewhere. Another key risk factor, as we briefly mentioned earlier, is capital allocation. Poor discipline in allocating resources and pursuing unsuccessful ventures can erode investor confidence and trigger a stock price decline. Shareholders expect efficient cash management and high return on invested capital (ROIC). While share repurchases are likely to continue, questions remain around potential dividend initiation, investments in AI and autonomous vehicles, and the overall effectiveness of capital allocation decisions. Ultimately, investors will make their voices heard if they disagree with Alphabet's approach – the market has a way of scrutinizing these choices. I firmly believe Alphabet (GOOGL) is a strong buy and deserves consideration for inclusion in most portfolios. While many investors likely have indirect exposure through index funds, I recommend actively adding GOOGL as an individual holding. Their dominance in numerous industries – search, advertising, cloud, streaming, hardware, and more – has yielded impressive margins and robust cash flow. In fact, their cash reserves are so considerable compared to their debt and overall balance sheet that they could passively invest in risk-free assets and comfortably generate returns sufficient to cover interest or simply maintain parity with inflation. Despite this financial strength, GOOGL's stock has been somewhat overlooked, partly due to Microsoft and OpenAI's ChatGPT and Alphabet's own cautious approach to releasing their advanced AI developments. However, they've been diligently refining their own AI product, BARD, and consistently updating investors on its progress and potential for integration across their ecosystem. I strongly believe the time will soon come when Alphabet is fully rewarded for its cutting-edge technology and diverse product portfolio. Ultimately, their dedication to innovation will undoubtedly translate into financial success, reflected in their bottom line. If GOOGL appears undervalued now, just wait until the world truly witnesses their capabilities. Avoid the fear of missing out (FOMO) – take a closer look at GOOGL and consider adding it to your portfolio. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Jake Blumenthal is a Registered Investment Advisor and Portfolio Analyst with Meridian Wealth Management, a SEC Registered Investment Advisor. The views and opinions expressed in the following content are solely those of Jake Blumenthal and do not necessarily reflect the views and opinions of his employer, Meridian Wealth Management. The content provided is for informational purposes only and should not be considered as financial advice or a recommendation to engage in any investment or financial strategy. Readers are encouraged to conduct their own research and consult with a qualified financial professional before making any investment decisions. Meridian Wealth Management does not endorse or take responsibility for any content shared by Jake Blumenthal outside of his official duties at the company. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}