{
    "title": "Bet On Google's 'Alpha Bets' (NASDAQ:GOOG)",
    "date": "1/16/2024",
    "url": "https://seekingalpha.com/article/4663105-bet-on-google-alpha-bets",
    "text": "Alex Wong  Alex Wong Google (NASDAQ:GOOG) (NASDAQ:GOOGL) is a company that needs no introduction. Search engine juggernaut, owner of YouTube, Android, Gmail, Google Maps/Docs/Sheets/Slides/Meet/Drive, and countless other products that billions of people around the globe use on a daily basis, the company is as well known to investors as it is to consumers (the only difference being the average consumer probably can't tell you how \"Alphabet\" is related to Google). Its business performance over the last decade can only be described as \"crushing it\": Google 10-year financials (quickfs.net) Google 10-year financials (quickfs.net) Compounding revenues at +17.6% and earnings per share at +17.1% over the past ten years, Google has only ever had one down year in operating profits: 2022, then quickly rebounding in force in 2023, posting +11% revenues and +46% EPS year-over-year last quarter. Despite these stellar results, Google has been the worst performing major tech stock of the decade (despite still handily beating the S&P 500): Data by YCharts The reason is because Google's competitive advantages have been well appreciated by Wall Street since the very beginning, as such, it has always enjoyed a premium valuation, leaving less room for outperformance from the stock. In contrast, the other constituents of today's Magnificent 7 were all doubted for various reasons in the early 2010s: Apple's (AAPL) iPhone can't sustain its sky-high margins, it will be commoditized like every other hardware product. Microsoft (MSFT) is a dinosaur that will get left behind in the age of mobile computing (remember FAANG? Microsoft wasn't even in it!). Amazon's (AMZN) P/E is too high. Facebook (META) can't monetize. Tesla (TSLA) and Nvidia (NVDA) don't even need to be mentioned, no one back then knew what they would become ten years later (even Cathie Wood didn't buy Tesla until Q4 2016). But Google was different. Google was the stock everyone knew would crush it, and then they proceeded to crush it even more than everyone predicted. Yet, as one of my favorite SA analysts Logan Kane observed in his December article, today Google is tied with Meta for being the cheapest of the Mag 7 in terms of price to forward earnings. What happened?! Long story short: OpenAI and ChatGPT. The AI revolution is here, and for the first time in history, there is a reason for Google investors to feel fear. Although Google has been investing in artificial intelligence research earlier and at greater scale than its big tech rivals, OpenAI came out of nowhere to beat it to the punch bringing large language models to market. Google's search castle, long perceived as unassailable, now has a credible threat on the horizon, and it is fast approaching. AI is not tangential to Google's business: it is its heart and soul. Google's mission from the start was achieving AGI (artificial general intelligence), not creating a search engine. Search was just a stepping stone to that ambition, a way of organizing all the web's information that would make AGI possible. When I met [Larry] Page, I said, 'Larry, I don’t get it. What’s the future of search for free? I don’t see where you’re going with this.' And Larry said, 'We are not really interested in search. We are making an AI.' So from the very beginning, the mission for Google was not to use AI to make their search better, but to use search to make an AI.\" - Kevin Kelly, founding editor of Wired Steven Levy recounts a similar view in his 2011 book about Google: Google had massive goals, and the entire company channeled its values from the founders. Its mission was collecting and organizing all the world’s information - and that’s only the beginning. From the very start, its founders saw Google as a vehicle to realize the dream of artificial intelligence in augmenting humanity. To realize their dreams, Page and Brin had to build a huge company.\" - Steven Levy, In the Plex: How Google Thinks, Works, and Shapes Our Lives It is far too early to say OpenAI won and Google lost: the AI race is just starting, and Google may very well be the one taking home the gold in the end. In fact, given the depth of Google's AI expertise, it is probably the company most likely to win it all. Yet, market consensus is that even if Google wins, it might lose. If chatbots become smart enough to answer all your questions, will people still need web search? What will happen to Google's advertising business built atop its search empire, responsible for 57% (Search only) to 69% (Search + Network) of 2022 revenues (with an even higher share of operating profits given search's best-in-class margins)? Will the chatbot business be profitable enough to replace the ads business it cannibalizes, when even Google insiders think AI has no moat given the rise of open-source models? No one knows the answers to these questions right now, which is why there has been a storm cloud over Google's stock and it hasn't bounced off its lows quite as hard as competitors like Microsoft and Meta, who are also players in the AI game, but whose core businesses don't face an existential threat from AI. Microsoft today is what Google was ten years ago: the richly valued, invincible conglomerate whose only possible future is growth, growth, and more growth. Google now stands in 2013 Microsoft's spot: the dinosaur, slow and lumbering, trying to catch up to a younger, faster company in OpenAI. But recall: 2013 Microsoft was the best performing stock of the group ten years later, and 2013 Google the worst. It was the stock everyone underestimated that produced the most alpha in the end, because it reaped the double whammy of both earnings growth and multiple re-rating. No one thought Google would ever become the underdog. That it has may be an opportunity for Google investors to buy in cheap, if Google can navigate its business challenges and spark new growth drivers as effectively as Microsoft and Amazon did in cloud computing, and Apple in iOS services over the past decade. Although Google Search is seeing its first real threat in LLMs, Google's other ventures, the company's highest potential moonshots, Alphabet's \"Other Bets\", or \"alpha bets\" as I call them, have been experiencing a confluence of tailwinds over the last few months. Waymo, Google's self-driving car subsidiary, just had its biggest competitor commit a potentially fatal blunder in October. Waymo and General Motors' (GM) Cruise were the #1 and #2 companies in the autonomous vehicle space, with Waymo being awarded a $30B valuation in 2020 and Cruise raising funding at the same valuation a year later. Both companies achieved the milestone of 1 million fully autonomous miles driven on public roads last January. Unfortunately for Cruise, on October 2nd, one of its robotaxis collided with a San Francisco woman who was first struck by a hit-and-run driver, dragging her 20 feet before coming to a stop. California's Public Utilities Commission alleged that Cruise tried to cover up its role in the accident by erroneously informing regulators the vehicle came to a complete stop at the moment of impact and withholding video evidence for two weeks. The California DMV suspended Cruise's permit to operate, the company paused all robotaxi activities nationwide, and co-founders Kyle Vogt and Dan Kan both resigned. General Motors CEO Mary Barra later announced to shareholders that funding for the unit will be cut \"substantially\" moving forward. Cruise is now staring down a $1.5M fine for the alleged cover-up pending a February 6th hearing. Guidehouse Insights, a consulting firm that publishes an annual ranking of AV platforms, only has 4 companies in the \"leaders\" category for 2023: Waymo, Mobileye (MBLY), Baidu (BIDU), and Cruise. Israel's Mobileye currently focuses more on advanced driver assistance systems than L4 autonomy; it is also majority owned by Intel (INTC), which saw operating profits decline -90% in 2022 before flipping to losses in 2023, raising the question of how much it can really afford to invest in self-driving tech at the expense of its main CPU and semiconductor chip businesses. Baidu is Chinese. Cruise will likely lose its leadership status in the 2024 rankings after the October fiasco. Which means Waymo, the \"grandma of robotaxis,\" is now the undisputed king (queen?) of AV platforms in the US. Guidehouse Insights 2023 AV Rankings (Business Insider) Guidehouse Insights 2023 AV Rankings (Business Insider) According to Chief Product Officer Saswat Panigrahi, Waymo is making 10,000+ fully autonomous trips every week in Phoenix and San Francisco, with Phoenix being the \"largest contiguous AV area in the world.\" The company is now seeking to scale to Los Angeles, Austin, and Buffalo. McKinsey projects autonomous driving to become a $350 billion industry by 2035, with $200B of that in L4 systems, for a CAGR of +16.5% from today's base (which currently generates $50B in L1-L2 revenues and $0 in L4 revenues). Given the massive barriers to entry and stringent regulatory landscape, the AV market is likely to be dominated by a small handful of winners, of which Waymo will almost certainly be one. Google's Pixel smartphone is another business that is rapidly picking up steam. During a sluggish year for smartphones, the Pixel was the only brand to experience year-over-year growth in North America during Q2 2023, achieving +50% units shipped compared to rivals Samsung (-27%) and Apple (-20%). Google's overall share of the North American smartphone market experienced even greater +100% year-over-year growth, rising from 2% to 4% (NA's current undisputed leaders are Apple at 54% and Samsung at 24%). On the other side of the world, the Pixel has become wildly popular in Japan, now its biggest market (exceeding even the US), with Google gaining at Apple's expense: Counterpoint Research Counterpoint Research My current smartphone is a Google Pixel; having also used iPhones in the past, I can testify that the Pixel is really good at delivering the simple, clean, and intuitive user experience that Apple is famous for. I love my Samsung devices too, but they came loaded with bloatware and took some getting used to, with a few mind-boggling features like dimming the screen to an unreadable level at 5% battery (a feature that can't be turned off!). Evidence of the Pixel's growing fanbase can be seen on Reddit, with r/Google Pixel achieving 1M subscribers, versus 320K for r/Samsung, and 3.9M for r/iPhone. Canalys reports that Google Pixel shipments have quadrupled since 2020: Canalys Canalys Meanwhile, Apple's decision to bring the RCS messaging standard to the iPhone in November after being strong-armed into opening up its ecosystem by EU regulators will be huge for Android vendors. Once that software update goes live this year, cross-platform messages from Android to Apple devices will no longer look, to put it frankly, horrible. Android to iPhone messages can now benefit from modern features like seamless group chats, high quality video, end-to-end encryption, and read receipts. This will only replace the archaic SMS/MMS standards, not iMessage; if you're getting bullied for sending green bubbles instead of blue bubbles, this news probably won't make a difference in the short term. In the long run though, improving the fidelity of Android to iOS messaging should reduce the green bubble stigma and Apple's lock-in effect. Samsung and Google have been fighting for this for years (Android.com even has a webpage to shame Apple into adopting RCS!), and Apple has finally caved. Up until now, being \"like the iPhone\" was the highest honor to which any smartphone vendor not named Apple could aspire, but Google may have an ace up its sleeve to elevate the next generation Pixel above even the iPhone: the incoming \"Pixie\" AI assistant, powered by Gemini, Google's answer to GPT-4. Gemini Ultra is currently state-of-the-art, surpassing GPT-4 in 30 of 32 benchmarks. AI is one domain where Apple is unquestionably playing catch-up to Google and Microsoft, and it remains to be seen whether Cupertino's finest can close the gap. In the near-term, Pixie is expected to be way, way smarter than Siri when it debuts, giving the Pixel a unique, differentiating value proposition that even the iPhone can't match. Google appears to have overcome its past reticence to compete directly against its Android partners, finally adopting the attitude of \"the only way to do something right is to do it yourself,\" as Android phone-makers like Samsung keep losing market share to Apple. Apple's $2.9 trillion market cap shows how much money there is to be made in victory. For Google, the Pixel represents not just another revenue stream, but a way to secure and grow its entire ecosystem of products and services on mobile by controlling the gateway. The Information reports that the mindset at Google HQ is now: \"We're going to take on the iPhone.\" The Pixel and Waymo are two of Google's most promising other bets that have gained rapid traction this past year. These along with Google Cloud may become the businesses that drive the next chapter of Google's growth. Even if chatbots do end up making web search obsolete, they won't do so overnight: it'll be a long and slow process, brought by incremental improvements in AI performance. Even Sam Altman says we've reached a point of diminishing returns where you can't make models smarter anymore simply by making them bigger. Although Google's other businesses are still in their infancy, the good news is they have time to grow before AI comes to challenge Google's advertising empire. Data by YCharts Google may be the cheapest of the Mag 7 today, but if history is any indication, that might mean it'll be the best performing one over the next ten years. Narratives can change fast in tech: as seen in the chart above, as recently as five years ago, Google had the highest P/E of the \"mature tech stocks\" group (so excluding Nvidia, Tesla, and Amazon). If Google was afforded a valuation in line with the peer group average today, it would sport a P/E of 32.18, pricing the C shares at $167.90 or a +16% premium to last week's closing price. I think this is a fair price target for the company given its high probabilities of success across multiple product lines in ultra-lucrative markets like cloud, mobile, and autonomous driving. Let's not forget about AI either: Google has been the AI partner of choice so far for brick-and-mortar enterprises, partnering with McDonald's (MCD) and Wendy's (WEN) to bring generative AI to the restaurant industry. The AI risks to Google are real, but so are the opportunities. Super-investors have been making their bets: Google is a high-conviction holding in funds like Li Lu's Himalaya Capital (40% weight) and Bill Ackman's Pershing Square (18% weight). Seeking Alpha's Quant Ratings is in consensus, rating Google stock a 4.98 out of 5 and a Strong Buy. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL, MSFT, AMZN, BIDU either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}