{
    "title": "Alphabet shares flirt with record high on AI hype",
    "date": "1/23/2024",
    "url": "https://www.bnnbloomberg.ca/alphabet-shares-flirt-with-record-high-on-ai-hype-1.2026054",
    "text": "Are you looking for a stock? Try one of these Are you looking for a stock? Try one of these More More Most Popular Content Latest Videos {{ video.Name }} The information you requested is not available at this time, please check back again soon. Jan 24, 2024  Subrat Patnaik, Bloomberg News The stock symbol {{StockChart.Ric}} does not exist Alphabet Inc. shares surged Wednesday and briefly eclipsed the company’s all-time high close in intraday trading as optimism surrounding its artificial intelligence capabilities boosts the stock. Shares of the Mountain View, California-based firm rose 1.1 per cent to close at US$148.70 per share. In intraday trading, the stock gained as much as 1.9 per cent to $149.86 surpassing the current closing high of $149.84 recorded in November 2021. The company is now valued at roughly $1.9 trillion, according to data compiled Bloomberg.  The frenzy for artificial intelligence has spurred an ongoing rally in the Magnificent Seven tech behemoths, helping Alphabet cement its position as the third most valuable U.S. company behind Apple Inc. and Microsoft Corp. Earlier this month, analyst Brian Pitz of BMO Capital Markets initiated coverage on the search giant’s stock with an outperform recommendation and dubbed it his top pick for 2024, given the firm’s leading position in AI. While Google has invested heavily in developing cutting-edge technology for years, critics widely perceived it to be falling behind in the emerging field of generative AI, primarily to OpenAI and Microsoft. In response, Google released Gemini in December, an AI model that underpins its chatbot Bard and which the company says can surpass OpenAI’s GPT-4 in certain benchmarks. Analysts have been optimistic about the speed at which Google was incorporating AI into its products and services. Related Stephen Takacsy's Top Picks: March 28, 2024 Andrew Moffs' Top Picks: March 27, 2024 Stan Wong's Top Picks: March 26, 2024 "
}