{
    "title": "Alphabet Spent $1.8B Exiting Leases In 2023, Turns Focus To AI",
    "date": "1/31/2024",
    "url": "https://www.bisnow.com/san-francisco/news/office/alphabet-cuts-office-leases-early-focuses-investment-in-ai-122656",
    "text": "Alphabet, the parent company of Google, paid $1.8B in 2023 to get out of leases globally, incurring $269M in accelerated rent and depreciation last year. During the fourth quarter alone, Alphabet paid $1.2B to end office leases early, according to the company's Q4 earnings results, released Tuesday. The moves are a reversal for the company from its pre-pandemic days, when it gobbled up real estate near its Mountain View, California, headquarters and elsewhere in the state and the country. In 2018, Alphabet’s real estate empire was equivalent to 14 of San Francisco's 1.4B SF Salesforce towers, the San Francisco Chronicle reported. Google also had plans to develop a huge mixed-use development on 84 acres in the Diridon Station area in downtown San Jose. The company hit the brakes on that effort last year, the San Jose Spotlight reported, due in part to market conditions. Alphabet has given up office space in both Mountain View and Los Angeles, per CoStar, reversing commitments the company made early in 2023, as Bisnow reported. The company has conducted several rounds of layoffs in the last two years, with the most recent coming earlier this month. Despite financial hits from leaving its leases, Alphabet recorded a strong Q4 in 2023, as the company focuses on AI and innovation investments. The company’s Q4 consolidated revenues were $86B, up 13% from this time last year, although shares sank in after-market trading Tuesday and early trading Wednesday on missed expectations from Google's ad business. “We remain committed to our work to durably re-engineer our cost base as we invest to support our growth opportunities,” President and Chief Investment Officer Ruth Porat said in a news release. On the earnings call, Porat said the company will continue to end new deals for office space and invest in higher growth areas, CoStar reported. Success! You are subscribed to the Bisnow San Francisco Newsletter. or click here to copy link to clipboard LOGIN TO BISNOW We're not asking for your money. This is not a step\n                        towards a paywall. Our news is free and we intend to keep it that way. Enter your email below. We will email you a link to reset your password. Use the form below to reset your password. Company Info Newsletters Other Stuff © Copyright 2024 Bisnow. All Rights Reserved  Upcoming regulations in the European Union require us to show this pop-up and ask you to agree to keep using Bisnow.com. We want to take 15 seconds to tell you what's going on: Sound good? Just hit yes and continue on your way. "
}