{
    "title": "Google Dealt A Blow In $2.6B EU Antitrust Fine As Court Advisor Suggests \nDismissing Appeal - Alphabet (NA",
    "date": "1/11/2024",
    "url": "https://www.benzinga.com/news/24/01/36590820/google-dealt-a-blow-in-2-6b-eu-antitrust-fine-as-court-advisor-suggests-dismissing-appeal",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Alphabet Inc.'s GOOG GOOGL Google has stumbled upon a hurdle in its bid to overturn a $2.6 billion fine imposed by the European Union (EU). What Happened: Advocate General Juliane Kokott of the EU's Court of Justice suggests that Google’s appeal against the fine should be dismissed, reported Bloomberg. The Sundar Pichai-led search giant was penalized back in 2017 for unjustly favoring its own shopping services, a move seen as exploiting its dominance in the general search services market. In what was a record back then, the European Commission came down heavily on Google, fining it $2.6 billion. It also pushed Google to modify the way it displayed shopping search results, which could be an advantage to its rivals. This was one of several EU rulings that led to total fines of $9.5 billion for Google between 2017 and 2019, including penalties for abusing its mobile operating system and advertising operations. See Also: Coughing Up Billions: The Pricey Ride of Google’s Fine Spree Since 2017 Despite the adverse outcome, Google expressed that it would “review the opinion” and anticipated the final ruling. \"Irrespective of the appeal, we continue to invest in our remedy, which has been working successfully for several years, and will continue to work constructively with the European Commission,\" Google said in a statement. The European Commission has also launched a fresh probe into Google's potential monopoly over digital advertising. Why It Matters: This is not the first time Google has faced hefty fines – the company has been penalized over $10.63 billion worldwide since 2017. These fines stem from antitrust and anti-competition norms violations to patent and privacy breaches. The latest in this list was a $15 million fine for infringing two patents held by Personal Audio LLC. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: ITC Wants Apple Ban Reinstated, Calls Apple’s Arguments ‘Weak And Unconvincing’ Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. Photo: Courtesy Jonny Gios via Unsplash © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}