{
    "title": "Alphabet spinoff gobbles up B.C.'s Good Chemistry",
    "date": "1/9/2024",
    "url": "https://www.biv.com/news/technology/alphabet-spinoff-gobbles-bcs-good-chemistry-8294864",
    "text": "Sign In Register A spinoff of Alphabet (Nasdaq:Goog) – SandboxAQ – today announced it has acquired Good Chemistry -- a spinoff of Vancouver’s 1Qbit -- that specializes in using computational chemistry to accelerate drug discovery and materials design. SandboxAQ's acquisition of Good Chemistry is being described as a talent acquisition. “Acquiring Good Chemistry adds 25 computational and quantum chemists, AI and software engineers, and quantum computing scientists to SandboxAQ - along with significant domain expertise from working with Dow Chemical and other,” SandboxAQ notes in a press release. The financial terms of the deal were not disclosed, although the Wall Street Journal said \"sources with knowledge of the acquisition\" put the value of the deal at US$75 million. Good Chemistry founder and CEO Arman Zaribafiyan will become SandboxAQ’s head of product for AI simulation platforms. “The company’s computational and quantum chemists, AI software developers, machine-learning engineers, and quantum computing scientists will join the existing SandboxAQ simulation teams,” the press release stated. Zaribafiyan and his team of 25 scientists will remain in Vancouver. Far from seeing the sale of yet another Canadian startup to an American company as a loss for Canada, it should be seen as a gain, Zaribafiyan said. “I don’t see this as a loss for Canada,” Zaribafiyan told BIV News. “I see this as a gain, as -- through this joining of forces -- we are actually taking a Canadian company and Canadian talent and opening it up to a global scale and a global reach.” “We actually think there’s a benefit for us to do more in Canada, because of this acquisition,\" added Nadia Carlsten, vice president of product at SandboxAQ. \"So it’s very much Sandbox now being more involved in Canada, as opposed to Good Chemistry being less involved in Canada. The company’s not moving, the people are not moving, but what we can expect is more investment into the Canadian eco-system from Sandbox.” SandboxAQ is a spinout of Alphabet (Google). It is a software as a service (SaaS) company in the AI and quantum technology space. Good Chemistry was a spinout of another Vancouver company, 1Qbit, which specializes in AI for quantum computing. Good Chemistry specializes in quantum chemistry simulation for designing materials and drugs. Its QEMIST Cloud platform uses machine learning, quantum computing and “emerging algorithms in quantum chemistry.” One of its “engineering firsts” that caught SandboxAQ's attention was its simulation of per- and polyfluorinated alkyl substances (PFAS) – also known as “forever molecules” – compounds that are very useful to modern society but which pose environmental concerns because of their persistence in the environment. Simulating these molecules may be an important first step in understanding how to deal with them. “The fact that they were able to do that (simulation), and have many engineering firsts in the cloud, definitely caught my attention as it being a very mature and solid product,” Carlsten said. “We’re already working with a lot of companies and organizations in the bio-pharma space…and having this talent is just going to be able to accelerate that.\" [email protected] twitter.com/nbennett_biv © 2024 Business in Vancouver "
}