{
    "title": "Alphabet’s Wing supersizes delivery drones to tow big orders",
    "date": "1/17/2024",
    "url": "https://techcrunch.com/2024/01/17/alphabets-wing-supersizes-delivery-drones-to-streamline-big-orders/",
    "text": "Wing, the drone-powered delivery company operated by Alphabet, intends to introduce a larger craft capable of towing heavier packages to customers. The news comes on the heels of Walmart’s decision to expand its drone deliveries in the Dallas-Fort Worth area, so it’s no wonder Wing is working to upgrade its stock; the outfit is one of the two firms facilitating Walmart’s drone delivery effort, alongside Zipline. Walmart said last week that a quarter of the items in its larger Supercenter stores don’t meet the current size and weight requirements for delivery by drone. That’s not all that surprising — Wing’s current drones can only handle packages weighing up to a modest 2.5 pounds. Wing’s larger drones, however, will handle “up to 5 pounds in a standard cardboard box,” the company told TechCrunch. They await approval from the U.S. Federal Aviation Administration. Image Credits: Screenshot by Harri Weber for TechCrunch Notably, Amazon’s delivery drones also have a five-pound weight cap. The online shopping giant aims to expand its drone-delivery effort into the U.K. and Italy in 2024. Meanwhile, Wing said it aims to bring its own supersized craft to market within the next year. “It’s always been our vision to implement a multi-modal drone delivery model,” Wing CEO Adam Woodworth said in a statement. “We are currently focused on launching the new plane and our Aircraft Library design philosophy enables us to test and build new drones based on customer and partner need,” Woodworth added. To the CEO’s point, he’s talked about expanding Wing’s fleet before. When Wing drones arrive at their destination, they don’t land; instead, they lower solitary packages down on a wire before setting them onto the ground. So far, Wing claims it has completed 350,000 deliveries in three continents. In the U.S., the company says it has more than 1,000 crafts registered. "
}