{
    "title": "Pinterest's Google Partnership 'A Positive Surprise': 7 Analysts Provide Q4 \nTakeaways",
    "date": "2/9/2024",
    "url": "https://markets.businessinsider.com/news/stocks/pinterest-s-google-partnership-a-positive-surprise-7-analysts-provide-q4-takeaways-1033051787",
    "text": "Shares of Pinterest Inc (NYSE:PINS) tanked in premarket trading on Friday, despite the company reporting upbeat earnings for its fourth quarter. The results came amid an exciting earnings season. Here are some key analyst takeaways from the release. Check out other analyst stock ratings. Roth Capital Partners: Pinterest’s stock came under pressure in after-hours trading on Thursday, after the company reported a revenue miss for the fourth quarter and announced its first-quarter revenue guidance “below high-end buyside expectations,” Kulkarni said in a note. He added, “1Q EBITDA & front-end loaded 2024 margin commentary likely spooked high-end expectations.” The two positive surprises from Pinterest were its getting Google (NASDAQ:GOOGL)(NASDAQ:GOOG) on board as an advertising partner overseas and monthly active users (MAUs) coming in above expectations, the analyst further stated.  Wedbush: Pinterest reported mixed results for the fourth quarter, with revenue short and adjusted EBITDA ahead of Street expectations, Devitt said in a note. “Expectations were elevated heading into the print,” he added. Although revenue growth disappointed, management has “firmly communicated that the impact of recent product and partnership developments will materialize over multiple quarters,” the analyst wrote. “Further, Pinterest announced a new third-party ad integration with Google, which should help improve monetization in international markets,” he further stated. Piper Sandler: Pinterest missed Q4 revenue expectations and management indicated that “weakness in F&B late in the quarter drove a 100bps headwind that continues into 1Q,” Champion wrote in a note. He added, however, that the company signed a new traffic partnership with Google\nPinterest’s first-quarter guidance calls for around 250 to 500 basis points of sequential acceleration in revenues, the analyst stated. “New product and DR tailwinds outweigh any temporary vertical-specific headwinds,” he added. JPMogan: Although Pinterest missed revenue expectations, it reported strong user growth and product innovation, Anmuth said. “We expect mgmt to remain focused on operational discipline, but to also invest in R&D (primarily hiring talent for AI) and S&M (B2B marketing to attract advertisers),” the analyst wrote. “Seasonally, we believe 1Q should have the highest margin expansion of the year due to comps and as hiring picks up,” he added.  Stifel: “PINS announced that its second 3P ad demand integration partner is Google, which is currently ramping, with the goal of tapping into its under-monetized International markets,” Kelley wrote in a note. The analyst added that the company’s Amazon (NASDAQ:AZMN) integration was “progressing nicely,” with room for improvement, and that “both 3P integrations are expected to contribute to revenue growth in 1Q24.” Baird: “Q4 results and Q1 guidance missed elevated expectations,” Sebastian said. “Importantly, however, we don't see any structural issues to change the narrative,” he added. The analyst stated that the company seems to be on track for “mid-teens CAGR and healthy margin expansion over the next 3-5 years through a combination of user growth, increasing monetization, and key partnerships with Amazon and Google, among others.” Goldman Sachs: Pinterest reported “solid” results for the fourth quarter, with upside in MAUs and adjusted EBITDA, Sheridan said. Digital ad revenues came more in-line with prior estimates “against market expectations that had risen significantly in the last few weeks across the sub-sector,” he added.  “In addition, the forward revenue guide implies some slight re-acceleration in Q1 as the company continues to make progress in its mix of product initiatives toward more shoppable content, direct response/bottom-funnel ad budgets and partnerships aiding in wider scaled monetization,” the analyst further wrote. PINS Price Action: Shares of Pinterest declined by 8.52% to $37.27 in the premarket session on Friday. Now Read: Is Tesla Still A Magnificent 7 Stock? EV Maker Could Get Bumped By These Companies Image: Shutterstock Indices Commodities Currencies Stocks "
}