{
    "title": "Guardian Capital LP Sells 13548 Shares of Alphabet Inc. (NASDAQ:GOOGL)",
    "date": "2/28/2024",
    "url": "https://www.americanbankingnews.com/2024/02/28/guardian-capital-lp-sells-13548-shares-of-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by ABMN Staff on Feb 28th, 2024 Guardian Capital LP cut its stake in Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 13.4% in the 3rd quarter, HoldingsChannel.com reports. The institutional investor owned 87,704 shares of the information services provider’s stock after selling 13,548 shares during the quarter. Guardian Capital LP’s holdings in Alphabet were worth $11,477,000 as of its most recent SEC filing. Several other institutional investors and hedge funds have also bought and sold shares of GOOGL. Vanguard Group Inc. lifted its holdings in Alphabet by 1,919.4% in the third quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock worth $45,628,484,000 after buying an additional 453,413,389 shares during the period. State Street Corp lifted its holdings in Alphabet by 1,900.6% in the third quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock worth $20,770,809,000 after buying an additional 206,300,042 shares during the period. Moneta Group Investment Advisors LLC lifted its holdings in Alphabet by 111,197.8% in the fourth quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock worth $15,036,178,000 after buying an additional 170,267,122 shares during the period. Price T Rowe Associates Inc. MD increased its stake in shares of Alphabet by 1,759.2% during the third quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock valued at $11,106,502,000 after purchasing an additional 109,870,525 shares in the last quarter. Finally, Norges Bank bought a new position in shares of Alphabet during the fourth quarter valued at approximately $8,335,063,000. 35.08% of the stock is currently owned by hedge funds and other institutional investors. Shares of Alphabet stock opened at $138.88 on Wednesday. The company’s fifty day simple moving average is $142.98 and its 200-day simple moving average is $136.80. The stock has a market capitalization of $1.74 trillion, a PE ratio of 23.94, a P/E/G ratio of 1.33 and a beta of 1.06. Alphabet Inc. has a 1-year low of $89.32 and a 1-year high of $153.78. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet (NASDAQ:GOOGL – Get Free Report) last released its earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. The company had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $70.77 billion. During the same quarter in the previous year, the company earned $1.05 EPS. As a group, equities analysts anticipate that Alphabet Inc. will post 6.78 earnings per share for the current year. A number of equities analysts have weighed in on the stock. Redburn Atlantic raised their target price on shares of Alphabet from $150.00 to $165.00 and gave the company a “buy” rating in a research note on Wednesday, January 31st. BMO Capital Markets raised their target price on shares of Alphabet from $170.00 to $178.00 and gave the company an “outperform” rating in a research note on Wednesday, January 31st. KeyCorp raised their target price on shares of Alphabet from $153.00 to $165.00 and gave the company an “overweight” rating in a research note on Monday, January 29th. Mizuho raised their target price on shares of Alphabet from $155.00 to $170.00 and gave the company a “buy” rating in a research note on Wednesday, January 17th. Finally, Tigress Financial raised their target price on shares of Alphabet from $172.00 to $176.00 and gave the company a “strong-buy” rating in a research note on Tuesday, November 21st. Five investment analysts have rated the stock with a hold rating, twenty-seven have issued a buy rating and two have given a strong buy rating to the company’s stock. Based on data from MarketBeat, the company has a consensus rating of “Moderate Buy” and a consensus price target of $153.65. Get Our Latest Report on GOOGL In related news, Director Frances Arnold sold 230 shares of Alphabet stock in a transaction on Tuesday, January 30th. The shares were sold at an average price of $154.06, for a total transaction of $35,433.80. Following the transaction, the director now owns 15,104 shares in the company, valued at approximately $2,326,922.24. The transaction was disclosed in a filing with the SEC, which can be accessed through this link. In other Alphabet news, insider John Kent Walker sold 48,076 shares of Alphabet stock in a transaction on Tuesday, February 20th. The shares were sold at an average price of $142.20, for a total value of $6,836,407.20. Following the sale, the insider now directly owns 12,725 shares in the company, valued at approximately $1,809,495. The sale was disclosed in a legal filing with the SEC, which is accessible through this hyperlink. Also, Director Frances Arnold sold 230 shares of Alphabet stock in a transaction on Tuesday, January 30th. The shares were sold at an average price of $154.06, for a total transaction of $35,433.80. Following the completion of the sale, the director now owns 15,104 shares in the company, valued at $2,326,922.24. The disclosure for this sale can be found here. In the last quarter, insiders have sold 208,350 shares of company stock worth $29,602,709. 0.88% of the stock is owned by corporate insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Alphabet Inc. (NASDAQ:GOOGL) Stake Boosted by Rodgers Brothers Inc. Visionary Wealth Advisors Has $2.05 Million Position in Alphabet Inc. (NASDAQ:GOOGL) "
}