{
    "title": "Google Stock: Making Great Progress In The Cloud (NASDAQ:GOOG)",
    "date": "2/23/2024",
    "url": "https://seekingalpha.com/article/4672875-google-making-great-progress-in-the-cloud",
    "text": "Delmaine Donson/E+ via Getty Images Delmaine Donson/E+ via Getty Images These days, there are two massive players in the cloud computing market. One of them is Amazon (AMZN) with its AWS services, and the other is Microsoft (MSFT) with Azure. Although these two players dominate the market, this is a large and growing industry that has room for a few other big entities. Unfortunately, one firm that did not do a good job entering into this space early on was Google parent, Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL). However, not all hope is lost when it comes to this space. Back in June of 2023, I wrote a bullish article about Alphabet and its Google Cloud service. I talked about how rapidly revenue is growing, with growth at that time outpacing its larger rivals. While the cloud space has been a cash cow for Amazon and Microsoft in recent years, it was only recently, as of the time of that article's publication, that Alphabet was able to turn a profit in this space. The good news is that profits continue to expand and that margins still remain quite small compared to what else is out there. Add on top of this major investments that Alphabet looks set to make in this space this year, and I do believe that investors have plenty to remain optimistic about. Historically speaking, Alphabet has been known as a company that's dedicated to online search. While that has been its past, management has made a concerted effort over the past few years to grow its burgeoning cloud business. This has taken the form of what is now known as Google Cloud, which includes the company's Google Cloud Platform, Google Workspace, and other similar and related enterprise services. For context, the Google Cloud Platform generates revenue from all of the traditional cloud related services that you would expect. This includes data storage and hosting, analytics, cybersecurity, and more. In exchange for these services, the business gets paid either subscriptions or consumption-based fees. Meanwhile, Google Workspace Generates revenue from subscriptions for cloud-based communication and other tools, with examples being Gmail, Docs, Drive, and more. In my original article on the topic, I made the case that Alphabet stands to benefit from the advent of AI because robust cloud ecosystems are necessary for large language models to truly thrive. And on top of this the cybersecurity offerings and other technologies that make AI possible and secure, and the company will benefit most not necessarily from creating its own AI services, but instead from facilitating the creation and use of them. As I stated in that article quite clearly, the real value comes from owning the ecosystem that allows AI to proliferate. Author - SEC EDGAR Data Author - SEC EDGAR Data During the 2023 fiscal year, for which data was recently reported, Google Cloud performed particularly well. Revenue for that segment came in at $33.09 billion. That's 25.9% above the $26.28 billion in revenue generated one year earlier. In fact, on its own, if we exclude the 'Google Search & other' category and revenue that Google gets from subscriptions, platforms, and devices, Google Cloud was the largest set of operations for the business as a whole. Was even larger than the ad revenue from YouTube and the revenue from the Google Network. Add on top of this the fact that, with the exception of the very small 'Other Bets' segment, Google Cloud was the fastest growing of the company's revenue sources, and it truly was the hero of the year. For all of this massive size, one problem that had faced the company for a long time was that Google Cloud continued to lose money. Back in 2020, it generated a loss of $5.61 billion. The good news is that every year since then, the picture has gotten a bit better. By 2022, losses were down to $1.92 billion. But then, in 2023, that picture changed. The company went from a loss of $1.92 billion to a profit of $1.72 billion. This came about even as the company experienced higher compensation costs because of a rise in headcount. The improvements, management said, came not from higher pricing necessarily. Rather, it was because of overall higher revenue, much of which was likely caused by a growth in demand. But of course, there was a reduction in costs associated with a change in the useful lives of the firm's servers and some of its network equipment. Author - SEC EDGAR Data Author - SEC EDGAR Data Regardless of the cause, the segment is now doing quite well from a profitability perspective. If we break up the data into quarterly figures, we can actually see significant margin improvement from one quarter to the next. Starting with the first quarter of the 2022 fiscal year, we can see that every quarter through the final quarter of 2023, with the exception of the second quarter of last year, saw a measurable improvement in the segment profit margin of Google Cloud. By the end of the 2023 fiscal year, the profit margin for the unit had risen to 9.40%. That allowed the overall profit margin for the segment for the year to hit 5.19%. Author - SEC EDGAR Data Author - SEC EDGAR Data In the grand scheme of things, the profit margin achieved by the segment so far was fairly small compared to the massive amount of profit, about $95.86 billion, that Google Services generated. But to see the unit go from being a drag on the company's bottom line to being helpful is definitely bullish. It helps that this is a massive industry with tremendous upside potential. According to one source, for instance, the global public cloud space was estimated to be worth $591.79 billion in 2023. That represents an increase of 20.7% from the $490.33 billion it was responsible for in 2022. For obvious reasons, nobody knows exactly what the future holds. But according to one analysis conducted by McKinsey, it was estimated that there could be up to $3 trillion worth of EBITDA generated per annum by 2030 from the cloud. So if anything, we are still in the fairly early stages of this massive transition. One of the downsides to banking on Alphabet is that there are two other major players in this space. Using the most recent data available, between Alphabet, Amazon, and Microsoft, Alphabet has only about 13.1% of revenue being generated. Microsoft is at 34.9%, while Amazon's AWS is at 52%. The good news is that while Alphabet's share of the revenue between the three firms is still down from what it was back in 2021, it has shown a recovery from the less than 12% that it stood out in 2022. So market share is something the company can retain by all simultaneously achieving growing profit margins. Of course, capturing this kind of upside will not come cheap. The company has been spending a tremendous amount of money on growth initiatives in recent years. In 2022, the firm allocated $31.5 billion toward capital expenditures. This grew to $32.3 billion in 2023. Management did not say how much capital expenditures dedicated specifically to the cloud space were. But they did say, when talking about 2024, that their investment will focus on things like technical infrastructure, which would include servers, network equipment, and data centers, as well as other similar assets. And in its investor conference call, the firm said that capital expenditures this year will be 'notably larger' than they were last year. We have no way of knowing what kind of range to expect. But when I hear that, I think at least $35 billion. Some estimates peg it as much as $45 billion. In the event that management can continue to grow while also continuing to expand profit margins, upside for shareholders could be quite nice. Between the three firms, it has the lowest profit margin. But second on that list is Amazon. In 2023, AWS generated a profit margin of 18.77%. Even getting up to that level would result in $6.21 billion in pretax profits for Alphabet off of the revenue generated in 2023. Now fast forward to a world where revenue eventually hits or exceeds $100 billion, which is definitely not out of the question when you consider the market opportunity we discussed already, and we're talking about some real cash that adds to the value of the company. Based on the data provided, I must say that I am relatively bullish about Alphabet in the long run. What the company is doing in the cloud space is impressive and recent progress has been remarkable. The firm still has plenty of progress that it needs to make up before it gets to where it truly needs to be. But for those focused on the long haul, the wait might very well be worth it. So far, my bullish call on the business has played out well. Since I rated it a 'buy' in June of last year, shares have seen upside of 18.5%. That's decently higher than the 15.8% seen by the S&P 500. So long as management can continue to do well, I expect this outperformance to continue. And because of that, I have decided to keep the company rated a 'buy' for now. Crude Value Insights is an exclusive community of investors who have a taste for oil and natural gas firms. Our main interest is on cash flow and the value and growth prospects that generate the strongest potential for investors. You get access to a 50+ stock model account, in-depth cash flow analyses of E&P firms, and a Live Chat where members can share their knowledge and experiences with one another. Sign up now and your first two weeks are free! This article was written by Daniel is an avid and active professional investor. Analyst’s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}