{
    "title": null,
    "date": "2/13/2024",
    "url": "https://www.livemint.com/technology/tech-news/sundar-pichais-morning-routine-revealed-google-ceo-does-this-first-thing-in-the-morning-11707795337333.html",
    "text": "While most of us would like to start our day by exercising or reading a book to calm our minds, Google CEO Sundar Pichai doesn't. Instead, the 51-year-old executive begins his day by visiting a niche tech aggregator website called Techmeme. However, Picha is not alone in his love of Techmeme, as other tech executives have shown their admiration for the site in the past, including Meta CEO Mark Zuckerberg, Microsoft's Satya Nadella and former Twitter CEO Dick Costolo, who have all confessed to being readers of the site. Techmeme was started in 2005 by former Intel engineer Gabe Rivera as an automated news site that rounded up links from mainstream outlets and obscure technology blogs. Explaining the reasoning behind Techmeme's popularity in an interaction with BusinessInsider, Rivera said, “Techmeme is the first read for execs in tech everywhere because we're dead set on providing the 'executive summary' experience they demand. For instance, importance-ranked, highly detailed headlines, alongside a density of links providing context and a sense of reach. No trivialities or clickbait. And of course, no popups, videos, or intrusive ads,\" Other aspects of Sundar Pichai's morning routine: Notably, Pichai had also revealed many aspects of his morning routine in an interview with Recode in 2016. Back then, Pichai said that he woke up every morning around 6:30 or 7 am and read the physical copy of Wall Street Journal and online version of the New York Times along with his tea to get his day started. Pichai had also said that he is very particular about getting his protein and has an omellete along with a toast in the morning.\n  Bard renamed to Gemini: In other news, Google CEO Sundar Pichai recently also revealed the reason behind changing the name of Google Bard chatbot to Gemini in an interaction with CNBC. He said, \"For us, Gemini is our approach overall in terms of how we are building our most capable and safe AI model and Bard was the most direct way that people could interact with our models so it really made sense to just evolve it to be Gemini because you are talking directly to the underlying Gemini model when you use it.\"\n    \n    \n\n\n\n\nYou may be interested in\n\n\n\n\n\n\n\n\n\n\n\n\n     \n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Chip(per) ambitions: Why India needs its wafer fabs          Dholera chip fab: India's leap into electronics manufacturing          Mint Primer| Google vs Indian startups row: its global implications          Ask me anything: Inside the race to build desi GPTs          A Google Maps competitor in India's tech revolution          ‘Need another technology leap for AI to start reasoning like humans’          Govt's ₹1-trillion deep tech fund: why we need it, and is it enough?          Telepathy: Would you allow a chip implant in your brain?          Budget 2024: India's digital public infra now a new 'factor of production'          Rights issue caps Byju's wild ride from top startup to throwaway valuation       Explore Premium  \n\n\n                Catch all the  Technology News and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 13 Feb 2024, 09:55 AM IST\n\t\nTopics You May Be Interested In \n sundar pichai \n google ceo \n google ceo sundar pichai \n ceo of google \n sundar pichai morning routine \n sundar pichai google \n gemini \n sundar pichai salary \n sundar pichai net worth Notably, Pichai had also revealed many aspects of his morning routine in an interview with Recode in 2016. Back then, Pichai said that he woke up every morning around 6:30 or 7 am and read the physical copy of Wall Street Journal and online version of the New York Times along with his tea to get his day started. Pichai had also said that he is very particular about getting his protein and has an omellete along with a toast in the morning. Bard renamed to Gemini: In other news, Google CEO Sundar Pichai recently also revealed the reason behind changing the name of Google Bard chatbot to Gemini in an interaction with CNBC. He said, \"For us, Gemini is our approach overall in terms of how we are building our most capable and safe AI model and Bard was the most direct way that people could interact with our models so it really made sense to just evolve it to be Gemini because you are talking directly to the underlying Gemini model when you use it.\"\n    \n    \n\n\n\n\nYou may be interested in\n\n\n\n\n\n\n\n\n\n\n\n\n     \n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Chip(per) ambitions: Why India needs its wafer fabs          Dholera chip fab: India's leap into electronics manufacturing          Mint Primer| Google vs Indian startups row: its global implications          Ask me anything: Inside the race to build desi GPTs          A Google Maps competitor in India's tech revolution          ‘Need another technology leap for AI to start reasoning like humans’          Govt's ₹1-trillion deep tech fund: why we need it, and is it enough?          Telepathy: Would you allow a chip implant in your brain?          Budget 2024: India's digital public infra now a new 'factor of production'          Rights issue caps Byju's wild ride from top startup to throwaway valuation       Explore Premium  \n\n\n                Catch all the  Technology News and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 13 Feb 2024, 09:55 AM IST\n\t\nTopics You May Be Interested In \n sundar pichai \n google ceo \n google ceo sundar pichai \n ceo of google \n sundar pichai morning routine \n sundar pichai google \n gemini \n sundar pichai salary \n sundar pichai net worth In other news, Google CEO Sundar Pichai recently also revealed the reason behind changing the name of Google Bard chatbot to Gemini in an interaction with CNBC. He said, \"For us, Gemini is our approach overall in terms of how we are building our most capable and safe AI model and Bard was the most direct way that people could interact with our models so it really made sense to just evolve it to be Gemini because you are talking directly to the underlying Gemini model when you use it.\"    Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}