{
    "title": "Nvidia surpasses Alphabet to claim third spot in Wall Street`s valuation \nrace",
    "date": "2/15/2024",
    "url": "https://www.wionews.com/business-economy/nvidia-surpasses-alphabet-to-claim-third-spot-in-wall-streets-valuation-race-690433",
    "text": "According to a Reuters report, the dominant AI chipmaker's stock witnessed a 2.46 per cent surge, securing a market value of $1.825 trillion, just ahead of Alphabet's $1.821 trillion, marking a pivotal moment in the dynamic tech industry. In a significant shake-up on Wall Street, Nvidia has emerged as the third most valuable US company, surpassing Google-parent Alphabet. According to a Reuters report, the dominant AI chipmaker's stock witnessed a 2.46 per cent surge, securing a market value of $1.825 trillion, just ahead of Alphabet's $1.821 trillion, marking a pivotal moment in the dynamic tech industry. Nvidia's ascent to the third position comes on the heels of overtaking Amazon's market capitalisation, illustrating its growing dominance in the technology sector. The Santa Clara-based company has been a key beneficiary of the technology industry's push to integrate artificial intelligence into products and services, with its stock price rising by 47 per cent this year alone. The company's control over approximately 80 per cent of the high-end AI chip market has been a major factor in its stock's stellar performance. Investors have shown a keen interest in Nvidia's stock, especially after it concluded a session with a market capitalisation higher than Amazon's for the first time in two decades. However, with success comes challenges, as customers face shortages of Nvidia's top-of-the-line components, and AI developers grapple with lengthy waiting lists to access its processors through cloud-computing providers. Nvidia's stock surge reflects the broader trend in technology-related companies reaching record highs fuelled by optimism surrounding artificial intelligence. Other industry giants, such as Microsoft and Meta Platforms, have also rallied to unprecedented levels. Investors and analysts are now eagerly awaiting Nvidia's upcoming quarterly report, scheduled for the next Wednesday, which is poised to be one of the most closely watched of the week on Wall Street. Analysts anticipate another strong quarter and positive outlook, emphasising that any deviation from these expectations could potentially dampen the current AI rally on Wall Street. Jake Dollarhide, CEO of Longbow Asset Management, warned, \"If Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session.\" Susquehanna analyst Christopher Rolland expressed optimism regarding Nvidia's future, increasing the price target for the company's stock to $850 from $625. Rolland cited expectations of robust quarterly results and guidance as the basis for the upward revision. As of now, Nvidia shares are trading at $739. In the broader context of the tech industry's valuation, Microsoft currently leads the pack after overtaking Apple to become the world's most valuable company with a market value exceeding $3 trillion. Notably, Saudi Aramco retains its position as the world's third most valuable publicly-listed company. Analysts predict Nvidia's January fiscal quarter revenue to more than triple to $20.37 billion, primarily driven by the soaring demand for its top-tier AI chips. Adjusted net profit is expected to surge over 400 per cent, reaching $11.38 billion. While Nvidia's current price-to-earnings ratio stands at around 34, up from 24 in early January, it reflects a significant decline from the over 50 ratio observed a year ago. (With inputs from Reuters) "
}