{
    "title": null,
    "date": "2/2/2024",
    "url": "https://www.benzinga.com/news/24/02/36904118/meta-breaks-the-mold-time-for-tesla-amazon-and-alphabet-to-join-the-magnificent-seven-dividend-party",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Meta Platforms, Inc. META announced on Thursday its initiation of a quarterly cash dividend, with a maiden dividend of 50 cents per share scheduled to be paid on March 26 to Class A and Class B shareholders of record as of Feb. 22. This declaration contributed to a 15% surge in Meta shares during after-hours trading. What’s Behind The Dividend? The decision to offer a dividend comes nearly 12 years after Meta, previously known as Facebook, conducted its initial public offering on May 18, 2012, at a price of $18 per share. A dividend, being an optional shareholder return, is at the discretion of the company’s board. It represents a fixed payment distributed to shareholders in proportion to their shareholdings, excluding loss-making companies. Typically, companies pay dividends to attract income-oriented investors seeking a stable income stream to navigate stock market uncertainties. However, growth-focused investors often favor companies that reinvest profits into promising projects for better long-term growth. Tech companies, particularly those in high-growth sectors, often refrain from paying dividends based on this rationale. Analyzing the reasons behind Meta’s dividend decision, Future Fund‘s Gary Black noted that the company closed the quarter with $64.5 billion in cash and generated $43 billion in free cash flow in 2023. He estimated that a $2 per share dividend would consume approximately $5 billion annually from its cash reserves. Black compared Meta’s revenue growth to Tesla, Inc. TSLA, pointing out that Meta’s 2024 guidance of 25%-34% growth exceeded the consensus estimate of 18%-20%, while Tesla was forecasted for over 16% growth. Black stated, “META's $43B in FY'23 FCF and $65B cash position convinced the $META Board to initiate a $2/share dividend and add $50B to the buyback.” In addition to the dividend announcement, Meta revealed a new repurchase authorization of $50 billion in shares, supplementing the $30.93 billion pending from a prior authorization. See Also: Best High Dividend Paying Stocks ‘Mag 7’ Dividend Payers & Hold-Outs: Meta now joins the ranks of “Magnificent 7” counterparts, such as Apple, Inc. AAPL, Nvidia Corp. NVDA, and Microsoft Corp. MSFT, in adopting a dividend policy. Apple declared a cash dividend of 24 cents per share on Thursday. Microsoft has been a consistent dividend payer, distributing both quarterly and annual dividends, along with occasional special dividends. Source: Microsoft Nvidia paid a quarterly cash dividend of 4 cents per share in late December. The dividend yields for Apple, Microsoft, and Nvidia stand at 0.15%, 0.74%, and 0.025%, respectively. Assuming Meta maintains a 50-cent dividend for all four quarters, its dividend yield would be 0.51%. However, Tesla, Amazon, Inc. AMZN, and Alphabet, Inc. GOOG GOOGL have yet to establish a dividend policy. How Likely The Hold-Outs Join The Party: According to Black’s analysis, all three companies are financially sound, with substantial cash reserves and healthy free cash flows in 2023: Despite their financial strength, Tesla, Amazon, and Alphabet may opt for reinvesting profits over dividend payments due to their respective business models and capital-intensive nature. For example, Tesla, operating in a capital-intensive industry, has faced pressure to preserve cash for operational needs. When the company’s stock came under pressure in 2022 amid CEO Elon Musk‘s Twitter buy and stock sales to fund the acquisition, shareholders, including Black, clamored for the company to initiate a buyback. Historically, Apple initiated dividend payments only after Steve Jobs‘ departure, indicating a potential shift in priorities under new leadership. The iPhone maker, interestingly, is a major contributor to Berkshire Hathway CEO Warren Buffett's dividend income. With its consistent dividend payouts and aggressive stock buyback program, Apple is expected to add approximately $878.9 million to Berkshire’s dividend coffers this year. With Musk currently entangled in a legal battle over his compensation package, he may lean towards convincing investors of the potential for stock price appreciation rather than prioritizing dividend payouts, given the current market challenges. Alphabet emphasized in its recent 10-K filing that “the primary use of its capital remains long-term business growth investment,” signaling a commitment to reinvestment for future expansion. The Invesco QQQ Trust QQQ ended Thursday’s session up 1.18% at $421.88, according to Benzinga Pro data. Read Next: Apple Q1 Earnings Beat Estimates As Cupertino Snaps 4-Quarter Revenue Decline Streak; Stock Slides On China Weakness (UPDATED) Image via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}