{
    "title": "Google, Reddit enter $60M per year AI deal: Reuters",
    "date": "2/22/2024",
    "url": "https://finance.yahoo.com/video/google-reddit-enter-60m-per-174625174.html",
    "text": "According to a report from Reuters, Alphabet (GOOG, GOOGL) has entered a deal with social media platform Reddit to license its content to train Google's AI models. The deal is valued at $60 million per year. Yahoo Finance Tech Editor Dan Howley joins the Live show to discuss the details behind the deal and what it means for both companies moving forward. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino - Well, taking a look at Reddit content that might be used to train Google's AI models. That's according to a report from Reuters. And sources say the contract is worth about $60 million a year. To break this down for us, Yahoo Finance reporter Dan Howley is here. So Dan, this is interesting timing. I mean, we know that Reddit is supposed to have its IPO offering at some point soon. But what do we know about this tie up here? DANIEL HOWLEY: Yeah. This is basically, obviously, another revenue stream for Reddit to try to mine here that's $60 billion-- sorry, $60 million a year. And I think for them, it's something that is an opportunity to ensure that their data just isn't being mined for generative AI training. It's something that a number of sites have brought up. Have said that we don't want our data used or have agreed to having their data used. Some are fighting lawsuits about it, some are jumping in wholeheartedly. I know, obviously, Reuters is one of them as well that's getting into the AI game. And you know, it's going to be something that a lot of sites are going to have to eventually come to terms with. Now, when it comes to Reddit, it's different than a media company. They're a social network. Having their content mined is a little bit different than what you would get from something like our site, for instance, right? Where you're getting live news. They're writers on there who may or may not want their content taken and used for training or an overall company that may or may not want its data taken and used for training. But for Reddit, it seems that this is a way to train on, essentially, the zeitgeist, right? This is where people go to talk about everything from sports to-- well, there's the Wall Street bets, to games, movies. A lot of talk about \"Dune\" right now, \"Dun 2.\" I never saw the first \"Dune.\" I think I have to do that this weekend, maybe. Although I had a friend that said it was terrible. I don't know. Anyway, Reddit is used for any number of things. And I think this is a way for, obviously, it to be used, that kind of content to be used in mind. And maybe give a broader spin to generative AI learnings. Perhaps, provide more pop culture content for training, but it's certainly going to be something that's far different than what you would get from a standard news site. And because it's social media, not everything on there is factual. - Dan, what does this mean for Google? I mean, they need all the data they can get. I mean, how valuable is the data coming through from Reddit? DANIEL HOWLEY: Yeah. I mean, look. They absolutely need as much data as possible. They say that their current high-end model Gemini is as good, if not better in certain circumstances, than OpenAI's latest version of GPT. And so if they can further train up what they have to offer as far as Gemini, that's absolutely huge. And you know, it's Google. They have, basically, all the data under the sun. Why would they need more? Well, the more data you pump into these things, the \"smarter\" they get. \"Smarter\" in quotes. They're not actually smart. But you know, I think when it comes to something like Google, they're fighting a big war here with Microsoft over who is the AI leader. They're the ones that created the transformer models to begin with at Google. But Microsoft really kind of stole the lead when it had invested in OpenAI, ChatGPT for consumers around November of last year-- or sorry, in 2022. And they've just been off to the races since then, putting it into all of their products. And Google is doing that as well. They're catching up. I have a version of Chrome that's running generative AI when I do a regular Google search. But when you hear about AI at this point, it's all Microsoft, Microsoft, Microsoft. So if Google can grab any advantage at all, it's going to try to do that. And this is part of that attempt to gain an advantage. Related Quotes "
}