{
    "title": "3 AI Stocks That Wall Street Thinks Are Near Their Peaks",
    "date": "2/10/2024",
    "url": "https://www.fool.com/investing/2024/02/10/3-ai-stocks-that-wall-street-thinks-near-peak/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Investing in top artificial intelligence (AI) stocks has generally been very profitable for investors. But as these stocks rise in value, some have started to question whether their valuations are overpriced. Even if you're bullish on AI's long-term potential, the risk is that you may be paying too heavy of a premium on some of them. Three AI stocks that may be due for declines, according to Wall Street, are Palantir Technologies (PLTR -6.12%), Meta Platforms (META -1.68%), and Alphabet (GOOG 0.21%) (GOOGL 0.04%). Here's a look at how these businesses are doing, and whether investors should expect a drop in their valuations this year. Palantir is a data analytics company that has been one of the hottest AI stocks to own. Last year, its shares skyrocketed 167%. The tech stock isn't trading at its 52-week highs anymore but according to the consensus analyst price target of $13.18, the stock is due for more of a decline. There have been concerns in the past about the company's reliance on government contracts, and whether its growth in that area will remain strong. But there are also reasons to remain bullish on the stock's long-term potential. It may only be a matter of time before the stock is added to the S&P 500 as Palantir is now a consistently profitable company, while also generating strong growth. And demand for AI is still in its early stages. With Palantir launching an AI platform last year and deploying AI bootcamps, it could be on the cusp of much more growth in the future, potentially paving the way for an even higher stock price. On Monday, the company reported its latest earnings numbers, where Palantir posted a profit for a fifth consecutive period. Revenue totaling $608 million was also up 20% year over year. With its growth continuing to be strong, Palantir isn't a stock I'd expect to fall in value this year as it may only be a matter of time before analysts upgrade their price targets. Shares of Meta Platforms popped last week after the company reported another strong quarter. Revenue of just over $40 billion for the last three months of the year was up 25% year over year and the company's net income tripled to just over $14 billion. It was impressive, but investors should remember the company was also going up against some soft comparables from a year ago. This time last year, the social media giant reported a 4% revenue decline, and its net income of $4.7 billion was down a whopping 55%. While the more recent results look impressive, investors shouldn't forget the soft numbers it was going up against to begin with. Wall Street's price targets for Meta average just over $491, which would mean analysts still think the stock can go up a little higher. But there may not be a whole lot of upside left here. The company is pivoting more toward AI and making use of next-gen technologies to improve the effectiveness of its ads. But while the stock has potential, Meta isn't an investment I'd put in my portfolio as it's still losing billions on the metaverse (Reality Labs) and its growth rate looks a bit inflated. With plenty of competition from TikTok and the U.S. government potentially taking a tougher regulatory stance on Facebook in the future, it's already a risky stock to buy even before you factor in its elevated price. Meta is a stock I'd expect will give back some gains as the year goes on as it may have already peaked. Alphabet, the company that owns Google, YouTube, and the Bard chatbot, is arguably one of the more promising AI stocks to own. AI can enhance the company's existing assets by making its searches smarter and more intuitive. It will also create a new revenue stream through Bard Advanced, a subscription service that will give users access to the chatbot's most advanced features. But Wall Street believes the stock may be at a peak, at least in the near term, with a price target of just $140.75 -- right around where it's trading today. Alphabet, however, could still generate much more growth in the future due to AI, which is why it may still not be too late to invest in this tech giant. It's coming off a year where revenue totaled $307 billion and increased by 9%. Profits also rose by 23% to $74 billion. Trading at a fairly average 21 times its estimated future profits, Alphabet may be a potential bargain buy of these three stocks based on its potential, which is why I don't think it's heading lower this year. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. David Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, and Palantir Technologies. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}