{
    "title": null,
    "date": "2/16/2024",
    "url": "https://www.forbes.com/sites/greatspeculations/2024/02/16/beating-sp-500-by-37-since-the-start-of-2023-where-is-alphabet-stock-headed/",
    "text": "Alphabet Inc. and Google CEO Sundar Pichai speaks with France's Minister for Economy and Finances ... [+] Bruno Le Maire (R) during the inauguration of a Google Artificial Intelligence (AI) hub in Paris on February 15, 2024. (Photo by ALAIN JOCARD / AFP) (Photo by ALAIN JOCARD/AFP via Getty Images) Alphabet (Google)’s stock (NASDAQ\nNDAQ\n: GOOG) has gained around 66% since the start of 2023 as compared to the 29% rise in the S&P500 index over the same period. That said, at its current price of $147, the stock is trading 9% below its fair value of $162 – Trefis’ estimate for Google’s valuation. Amid the current financial backdrop, GOOG stock has seen extremely strong gains of 60% from levels of $90 in early January 2021 to around $145 now, vs. an increase of about 30% for the S&P 500 over this roughly 3-year period. However, the increase in GOOG stock has been far from consistent. Returns for the stock were 65% in 2021, -39% in 2022, and 59% in 2023. In comparison, returns for the S&P 500 have been 27% in 2021, -19% in 2022, and 24% in 2023 - indicating that GOOG underperformed the S&P in 2022. In fact, consistently beating the S&P 500 - in good times and bad - has been difficult over recent years for individual stocks; for other heavyweights in the Communication Services sector including META, NFLX, and DIS, and even for the megacap stars TSLA, MSFT, and AMZN. In contrast, the Trefis High Quality Portfolio, with a collection of 30 stocks, has outperformed the S&P 500 each year over the same period. Why is that? As a group, HQ Portfolio stocks provided better returns with less risk versus the benchmark index; less of a roller-coaster ride as evident in HQ Portfolio performance metrics. Given the current uncertain macroeconomic environment with high oil prices and elevated interest rates, could GOOG face a similar situation as it did in 2022 and underperform the S&P over the next 12 months - or will it see a strong jump? The technology giant outperformed the street estimates in the fourth quarter of 2023, with revenues increasing 13% y-o-y to $86.3 billion. It was primarily driven by an 11% growth in the Google\nGOOG\n advertising (including Google search, YouTube ads, and Google network) segment, followed by higher income in Google Cloud and Google subscription, platform & devices categories. On the expense front, total expenses as a % of revenues decreased in the quarter, leading to an operating margin of 27%. Overall, the net income increased 52% y-o-y to $20.7 billion. The company’s top line grew 9% y-o-y to $307.4 billion in FY 2023. It was mainly due to growth in Google Search & other, Google Cloud, and Google Subscription, platform & devices divisions. Notably, Google search contributes more than 55% of the total revenues. Further, the operating margin slightly improved over the same period, leading to a net income of $73.8 billion – up 23% y-o-y. Moving forward, we expect the same trend to continue in Q1, Overall, Google’s revenues are estimated to touch $342.2 billion in FY2024. Further, its net income margin is likely to see a slight improvement in the year, resulting in a net income of $83.1 billion. This coupled with an annual EPS of $6.76 and a P/E multiple of just below 24x will lead to a valuation of $162. GOOG Return Compared With Trefis Reinforced Portfolio Invest with Trefis Market Beating Portfolios See all Trefis Price Estimates  "
}