{
    "title": "Alphabet \"Other Bets\": In Search Of Google's Hidden Gems",
    "date": "2/4/2024",
    "url": "https://fourweekmba.com/google-bets/",
    "text": "The Leading Source of Insights On Business Model Strategy & Tech Business Models The Leading Source of Insights On Business Model Strategy & Tech Business Models Of Google’s (Alphabet) over $307.39 billion in revenue for 2023, Google also generated for the first time, well over 1.5 billion dollars in revenue from its bets, which Google considers potential moonshots (companies that might open up new industries). Google’s bets also generated a loss for the company of over $4 billion in the same year. In short, Google is using the money generated by search and betting it on other innovative industries, which are ramping up in 2023.   Table of Contents\nToggle\nEnter Google “other bets.”What is Access?What is Calico?What is CapitalG?What is GV?What is Nest?What is Verily?What is Waymo?What is X?Inside Google, other bets’ financialsAn inside look at the overall Google business modelSummary and conclusions: What if one of the other bets will be the next hit in tech and business?Key HighlightsRelated To Google\nEnter Google “other bets.”\nGoogle’s other bets comprise a list of eight companies that span from life science to self-driving companies:\n\nAccess.\nCalico.\nCapitalG.\nGV.\nNest.\nVerily.\nWaymo.\nX.\n\nCompared to total Google’s turnover, “other bets” represented less than 1% of its overall revenues for 2021.\nHowever, if we imagined it as a spin-off of Google, that would be a startup worth looking at.\nIn particular, Google has invested so far in eight bets. Some of those bets might fail.\nYet some others might not only grow exponentially in the next years. They might also transform Google’s business model.\nWhy is this important at all?\nI argue that the business model resides in how a company thinks. Even though a company is made of principles that keep it together.\nThe commercial forces behind a business model are so strong that they eventually prevail over the rest.\nGoogle uses a hidden revenue generation pattern and an advertising business model.\nNo doubt, this represents a cash cow for the organization. However, the future of Google might look quite different.\nRemembering that a business model is never just about monetization is also important.\nIn fact, for a business model to work in the long run, it has to embrace the company’s principles.\nAs specified in the Alphabet annual report, “throughout Alphabet, we are also using technology to try and solve big problems across many industries. Alphabet’s Other Bets are early-stage businesses, and our goal is for them to become thriving, successful businesses in the medium to long-term. To do this, we make sure we have a strong CEO to run each company while also rigorously handling capital allocation and working to make sure each business is executing well.”\nNot by chance, Google defined them as “bets.”\nEarly-Stage businesses naturally come with considerable uncertainty.\nThe interesting part? Some of them are already generating revenue.\nRead Next: Business Model Innovation\nWhat is Access?\nAccess is the Alphabet subsidiary that runs Google Fiber, which offers super-high-speed broadband access over fiber optic cables to new cities. Access provides Google Fiber in 12 US metropolitan areas and offers its Webpass wireless service in another eight.\n\nWhat is Calico?\nCalico is a research and development company whose mission is to harness advanced technologies to increase our understanding of the biology that controls lifespan. In short, it \nAs explained on the Calico website, these are the guiding principles:\n\nINNOVATION: We believe tackling aging and increasing healthspan can only succeed with cutting-edge science and transformative technology and that both are fueled by intellectual freedom and creativity\nINTEGRITY: We expect everyone to be honest, ethical and trustworthy\nCOURAGE: We aim high, make tough decisions and take smart risks\nACCOUNTABILITY: We value taking personal responsibility and look inward first when things do not go well\nCOLLABORATION: We understand that working together can expand possibilities and capabilities\nGENEROSITY OF SPIRIT: We strive to be kind and considerate, respect each other’s individuality and perspectives and graciously share both ideas and credit\n\nWhat is CapitalG?\nCapital G is the growth equity investment arm of Google that supports an investment portfolio of companies by providing tactical advice across key functional areas such as engineering, product, sales, and marketing. By working closely with growth-stage companies, CapitalG argues that its pattern recognition enables it to draw learnings and help our portfolio scale effectively.\nThe portfolio of companies like Airbnb, Duolingo, Robinhood, Lyft and many others:\n\nWhat is GV?\nGV or Google Ventures is the venture capital arm of Google, which invested in more than 300 companies that push the edge of what’s possible. From fields of life science, healthcare, artificial intelligence, robotics, transportation, cybersecurity, and agriculture. \nIt branches in five main areas:\n\nConsumer: with companies like Uber, Medium, Nest and many others\nLife science and health: with projects like 23andMe\nData and AI\nEnterprises: slack, stripe, HubSpot\nRobotics and hardware\n\nWhat is Nest?\nNest’s mission is to create a set of smart home devices. Nest recently expanded its connected home product line by introducing the Nest Thermostat E and a new home security solution that includes the Nest Hello video doorbell, Nest Cam IQ outdoor security camera, and the Nest Secure alarm system.\nIt comprises products like:\n\nNest Learning Thermostat\nNest Thermostat E\nNest Temperature Sensor\nNest Protect\nNest Hello\nNest Cam Indoor\nNest Cam Outdoor\nNest Cam IQ indoor\nNest Cam IQ outdoor\nNest Secure\nNest × Yale Lock\n\nWhat is Verily?\nVerily develops tools to collect and organize health data, then creating interventions and platforms that put insights derived from that health data to use for more holistic care management. With three guiding product design principles: start with the user, simplify care, and lead on security and privacy.\nThe company monetizes by selling its R&D services. Verily has also made significant progress on critical programs, like the launch of its Project Baseline study with Duke University and Stanford Medicine, and received an $800 million investment in 2017 from Temasek to accelerate its strategic programs.\nWhat is Waymo?\nWaymo began as the Google self-driving car project in 2009. Waymo is now an independent self-driving technology company with a mission to make it safe and secure for everyone to get around—without the need for anyone in the driver’s seat.\nWaymo continues to progress the development and testing of its technology and now has a fleet of vehicles in Phoenix, Arizona, driving without a person behind the wheel.\nWhat is X?\nX is Google’s arm which is aimed at solving hard problems by creating new radical technologies. Some of the projects that came our from X comprise Verily, one of Google’s “other bets.” Other projects consisted of delivery drones, internet balloons, and cybersecurity. A few other projects in development are smart glasses, free-space optics, and learning robots.\nAs explained on X website:\n\nGoogle founders Larry Page and Sergey Brin always believed in investing some of the company’s resources in hard, long-term problems. In 2010, a new division forms to work on moonshots: sci-fi sounding technologies that aim to make the world a radically better place.\n\nInside Google, other bets’ financials\n\nOther Bets revenues consist primarily of revenues and sales from:\n\nInternet and TV services;\nLicensing and R&D services;\nand Nest branded hardware.\n\nOther Bets is a combination of multiple operating segments that are not individually material. As we’ve seen Other Bets includes businesses such as Access, Calico, CapitalG, GV, Nest, Verily, Waymo, and X.\nRevenues for Other Bets are derived primarily through the sales of internet and TV services through Fiber, sales of Nest products and services, and licensing and R&D services through Verily.\n\nIn 2022, over $6 billion went toward maintaining those not profitable bets yet. \nThat isn’t a cheap bet for Google, sustaining those other bets with the money coming primarily from its advertising networks.\nYet, those same revenues are getting spent to renew the whole business model in the coming years.\nAn inside look at the overall Google business model\nGoogle (now Alphabet) primarily makes money through advertising. The Google search engine, while free, is monetized with paid advertising. In 2023, Alphabet generated over $175B from Google search, $31.51B billion from the Network members (Adsense and AdMob), $31.31B billion from YouTube Ads, $33B from Google Cloud, and $34.69B billion from other sources (Google Play, Hardware devices, and other services). And $1.53B from its other bets.\nWhat, instead, will be the role of the other bets?\nSummary and conclusions: What if one of the other bets will be the next hit in tech and business?\n\nMost of Google’s resources are skewed toward the core business model of Google. \nA small chunk is also used to maintain the operations of bets that Google placed in several future industries. \nPerhaps, in 2022, those other bets’ costed the company over $6 billion.\nYet, those bets show also where Google sees the future developing in the coming decade, and they might imply a whole new business model. \n\nKey Highlights\n\nIntroduction to Google’s “Other Bets”:\n\nGoogle’s “other bets” refer to a group of startup investments and ventures that Google considers potential moonshots, aimed at exploring and creating new industries.\nThese bets represent a small portion of Google’s overall revenue but are strategic investments for future innovation.\n\n\nComponents of “Other Bets”:\n\nGoogle’s “other bets” consist of eight companies or initiatives:\n\nAccess (Google Fiber)\nCalico (biotech research)\nCapitalG (growth equity investment)\nGV (venture capital)\nNest (smart home devices)\nVerily (health data and interventions)\nWaymo (self-driving technology)\nX (radical technology solutions)\n\n\n\n\nDiversity and Transformation of Business Model:\n\nGoogle’s strategy involves using revenues generated by its core advertising business (search and ads) to invest in these “other bets.”\nWhile these bets currently represent a small portion of Google’s revenue, they could potentially transform the company’s business model by opening up new industries and revenue streams.\n\n\nImportance of Business Model and Principles:\n\nThe article emphasizes that a company’s business model is more than just monetization; it’s about aligning with the company’s principles and values.\nGoogle’s “other bets” reflect its willingness to invest in innovative projects that align with its long-term vision.\n\n\nAlphabet’s Perspective on “Other Bets”:\n\nAlphabet, Google’s parent company, views “other bets” as early-stage businesses with the goal of becoming successful in the medium to long term.\nThe report highlights that these bets are labeled as “bets” because they come with inherent uncertainty due to their early-stage nature.\n\n\nOverview of Some “Other Bets”:\n\nBrief descriptions of a few of the “other bets” are provided, including Access (Google Fiber), Calico (biotech), CapitalG (growth equity), GV (venture capital), Nest (smart home devices), Verily (health data), Waymo (self-driving), and X (radical technologies).\n\n\nFinancial Impact and Future Potential:\n\nThe article acknowledges that while some “other bets” may fail, others could grow exponentially and transform Google’s business model.\nThe financial data shows that while Google invested over $6 billion in these bets in 2022, they are strategic for Google’s long-term innovation and industry expansion.\n\n\nReinventing the Business Model:\n\nThe article highlights that the focus on “other bets” demonstrates Google’s vision to renew its business model for the future.\nThe “other bets” could represent the next hits in the tech and business world, potentially redefining Google’s trajectory in the coming years.\n\n\n\nHandpicked related articles: \n\nTypes of Business Models You Need to Know\nBusiness Strategy Examples\nWhat Is Business Model Innovation And Why It Matters\nWhat Is Blitzscaling And Why It Matters\nThe Five Key Factors That Lead To Successful Tech Startups\n\nOther business models:\n\nWho Owns Google?\nHow Does Twitter Make Money?\nHow Does DuckDuckGo Make Money?\nHow Amazon Makes Money\nHow Does Netflix Make Money?\nHow Does PayPal Make Money?\nHow Does WhatsApp Make Money?\nThe Power of Google Business Model in a Nutshell\nHow Does Facebook Make Money? \n\nRelated To Google\nWho Owns Google\nGoogle is primarily owned by its founders, Larry Page and Sergey Brin, who have more than 51% voting power. Other individual shareholders comprise John Doerr (1.5%), a venture capitalist and early investor in Google, and CEO, Sundar Pichai. Former Google CEO Eric Schmidt has 4.2% voting power. The most prominent institutional shareholders are mutual funds BlackRock and The Vanguard Group, with 2.7% and 3.1%, respectively.\nHow Does Google Make Money\nGoogle (now Alphabet) primarily makes money through advertising. The Google search engine, while free, is monetized with paid advertising. In 2023, Alphabet generated over $175B from Google search, $31.51B billion from the Network members (Adsense and AdMob), $31.31B billion from YouTube Ads, $33B from Google Cloud, and $34.69B billion from other sources (Google Play, Hardware devices, and other services). And $1.53B from its other bets. \nGoogle Business Model\nGoogle is an attention merchant that – in 2022 – generated over $224 billion (almost 80% of revenues) from ads (Google Search, YouTube Ads, and Network sites), followed by Google Play, Pixel phones, YouTube Premium (a $29 billion segment), and Google Cloud ($26.2 billion).\nGoogle Other Bets\nOf Google’s (Alphabet) over $307.39 billion in revenue for 2023, Google also generated for the first time, well over 1.5 billion dollars in revenue from its bets, which Google considers potential moonshots (companies that might open up new industries). Google’s bets also generated a loss for the company of over $4 billion in the same year. In short, Google is using the money generated by search and betting it on other innovative industries, which are ramping up in 2023. \nGoogle Cloud Business\nIn 2023, Alphabet’s (Google) Cloud Business generated over $33 billion within Alphabet’s Google overall business model, and it was also profitable, with over $1.7 billion in profits. Google Cloud is instrumental to Google’s AI strategy. \nHow Big Is Google?\nGoogle is an attention merchant that – in 2023 – generated $237.85 billion (over 77% of its total revenues) from ads (Google Search, YouTube Ads, and Network sites), followed by Google Play, Pixel phones, YouTube Premium (a $31.5 billion segment), and Google Cloud (over $33 billion).\nGoogle Traffic Acquisition Costs\nThe traffic acquisition cost represents the expenses incurred by an internet company, like Google, to gain qualified traffic – on its pages – for monetization. Over the years, Google has been able to reduce its traffic acquisition costs and, in any case, to keep it stable. In 2023 Google spent 21.39% ($50.9 billion) of its total advertising revenues ($237.8 billion) to guarantee its traffic on several desktop and mobile devices across the web.\nYouTube Business Model\nYouTube was acquired for almost $1.7 billion in 2006 by Google. It makes money through advertising and subscription revenues. YouTube advertising network is part of Google Ads, and it reported more than $31B in revenues by 2023. YouTube also makes money with its paid memberships and premium content. \nGoogle vs. Bing\nIn 2023, Google’s search advertising machine, generated over 175 billion dollars. Whereas Microsoft’s Bing generated 12.2 billion dollars. Thus, as of 2023, Google’s search advertising machine is over 14x larger than Microsoft’s search advertising machine.\nGoogle Profits\nGoogle makes most of its money from advertising. Indeed total advertising revenue represented nearly 78% of Google’s (Alphabet) overall revenues for 2023. Google Search represented nearly 57% of Google’s total revenues. Google generated $307.39B in revenues in 2022, and $73.79B billion in net profits.\nGoogle Revenue Breakdown\nIn 2023, Google generated $307.39 billion, comprising $175B in Google Search, $31.51B in YouTube ads, and $31.31B in Google network revenue. $34.69B in other revenue, $33B in Google cloud, $1.53B in other bets.\nGoogle Advertising Revenue\nIn 2023, Google generated 237.85B in revenue in advertising, which represented over 77% of its total revenues of  $ 307.39 B. In 2022, Google generated $224.47B in revenues from advertising, which represented almost 80% of the total revenues, compared to $282.83B in total revenues. Therefore, most of the revenues from Alphabet, the mother company of Google, come from advertising.\nApple vs. Google\n\nGoogle Employees Number\nAt the end of December 2022, Google had over 190,000 employees.  On January 20, Google announced the layoff of 12,000 employees within the company, thus bringing the number of total employees by December 2023 to 182,502 full-time employees.\nGoogle Revenue Per Employee\nGoogle generated $1,684,332 per employee in 2023, compared to $1,486,779 per employee in 2022. As of January 2023, as the company announced a mass layoff, it brought back its revenue per employee at $1,586,880, still behind the peak in 2021, for $1,840,330.\nYouTube Ad Revenue\nBy 2023, YouTube generated $31.51 billion in advertising revenue. \nMain Free Guides:\n\nBusiness Models\nBusiness Competition\nBusiness Strategy\nBusiness Development\nDigital Business Models\nDistribution Channels\nMarketing Strategy\nOrganizational Structure\nPlatform Business Models\nRevenue Models\nTech Business Models\nBlockchain Business Models Framework\n\nRead next:\n\nGoogle Business Model\nHow Does Facebook Make Money? \nHow Does DuckDuckGo Make Money? \nAmazon Business Model\nNetflix Business Model\nSpotify Business Model\n\n\n\n\n\nRelated\nMore ResourcesAlphabet's Google Q3 2021 Financial Snapshot: The…Google Subsidiaries: The List Of Companies Owned By…What Is a Hidden Revenue Business Model? Google's…Google (Alphabet) Q3 2022 SummaryHidden CurriculumGoogle Search revenue How Much Money Does Google Make From Search?What is Search Labs? Table of Contents Google’s other bets comprise a list of eight companies that span from life science to self-driving companies: Compared to total Google’s turnover, “other bets” represented less than 1% of its overall revenues for 2021. However, if we imagined it as a spin-off of Google, that would be a startup worth looking at. In particular, Google has invested so far in eight bets. Some of those bets might fail. Yet some others might not only grow exponentially in the next years. They might also transform Google’s business model. Why is this important at all? I argue that the business model resides in how a company thinks. Even though a company is made of principles that keep it together. The commercial forces behind a business model are so strong that they eventually prevail over the rest. Google uses a hidden revenue generation pattern and an advertising business model. No doubt, this represents a cash cow for the organization. However, the future of Google might look quite different. Remembering that a business model is never just about monetization is also important. In fact, for a business model to work in the long run, it has to embrace the company’s principles. As specified in the Alphabet annual report, “throughout Alphabet, we are also using technology to try and solve big problems across many industries. Alphabet’s Other Bets are early-stage businesses, and our goal is for them to become thriving, successful businesses in the medium to long-term. To do this, we make sure we have a strong CEO to run each company while also rigorously handling capital allocation and working to make sure each business is executing well.” Not by chance, Google defined them as “bets.” Early-Stage businesses naturally come with considerable uncertainty. The interesting part? Some of them are already generating revenue. Read Next: Business Model Innovation Access is the Alphabet subsidiary that runs Google Fiber, which offers super-high-speed broadband access over fiber optic cables to new cities. Access provides Google Fiber in 12 US metropolitan areas and offers its Webpass wireless service in another eight.  Calico is a research and development company whose mission is to harness advanced technologies to increase our understanding of the biology that controls lifespan. In short, it As explained on the Calico website, these are the guiding principles: Capital G is the growth equity investment arm of Google that supports an investment portfolio of companies by providing tactical advice across key functional areas such as engineering, product, sales, and marketing. By working closely with growth-stage companies, CapitalG argues that its pattern recognition enables it to draw learnings and help our portfolio scale effectively. The portfolio of companies like Airbnb, Duolingo, Robinhood, Lyft and many others:  GV or Google Ventures is the venture capital arm of Google, which invested in more than 300 companies that push the edge of what’s possible. From fields of life science, healthcare, artificial intelligence, robotics, transportation, cybersecurity, and agriculture. It branches in five main areas: Nest’s mission is to create a set of smart home devices. Nest recently expanded its connected home product line by introducing the Nest Thermostat E and a new home security solution that includes the Nest Hello video doorbell, Nest Cam IQ outdoor security camera, and the Nest Secure alarm system. It comprises products like: Verily develops tools to collect and organize health data, then creating interventions and platforms that put insights derived from that health data to use for more holistic care management. With three guiding product design principles: start with the user, simplify care, and lead on security and privacy. The company monetizes by selling its R&D services. Verily has also made significant progress on critical programs, like the launch of its Project Baseline study with Duke University and Stanford Medicine, and received an $800 million investment in 2017 from Temasek to accelerate its strategic programs. Waymo began as the Google self-driving car project in 2009. Waymo is now an independent self-driving technology company with a mission to make it safe and secure for everyone to get around—without the need for anyone in the driver’s seat. Waymo continues to progress the development and testing of its technology and now has a fleet of vehicles in Phoenix, Arizona, driving without a person behind the wheel. X is Google’s arm which is aimed at solving hard problems by creating new radical technologies. Some of the projects that came our from X comprise Verily, one of Google’s “other bets.” Other projects consisted of delivery drones, internet balloons, and cybersecurity. A few other projects in development are smart glasses, free-space optics, and learning robots. As explained on X website: Google founders Larry Page and Sergey Brin always believed in investing some of the company’s resources in hard, long-term problems. In 2010, a new division forms to work on moonshots: sci-fi sounding technologies that aim to make the world a radically better place.  Other Bets revenues consist primarily of revenues and sales from: Other Bets is a combination of multiple operating segments that are not individually material. As we’ve seen Other Bets includes businesses such as Access, Calico, CapitalG, GV, Nest, Verily, Waymo, and X. Revenues for Other Bets are derived primarily through the sales of internet and TV services through Fiber, sales of Nest products and services, and licensing and R&D services through Verily.  In 2022, over $6 billion went toward maintaining those not profitable bets yet. That isn’t a cheap bet for Google, sustaining those other bets with the money coming primarily from its advertising networks. Yet, those same revenues are getting spent to renew the whole business model in the coming years. What, instead, will be the role of the other bets? Handpicked related articles: Other business models: Who Owns Google How Does Google Make Money Google Business Model Google Other Bets Google Cloud Business How Big Is Google? Google Traffic Acquisition Costs YouTube Business Model Google vs. Bing Google Profits Google Revenue Breakdown Google Advertising Revenue Apple vs. Google Google Employees Number Google Revenue Per Employee YouTube Ad Revenue Main Free Guides: Read next:   Copyright © 2024  FourWeekMBA Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading "
}