{
    "title": null,
    "date": "2/18/2024",
    "url": "https://finance.yahoo.com/news/arm-holdings-next-nvidia-smashing-112500854.html",
    "text": "There is only one Nvidia (NASDAQ: NVDA), the world's unequivocal leader in high-performance graphic processing units (GPUs) and data center hardware and software powering large swaths of the economy and the rise of artificial intelligence (AI). But several companies are also doing incredible things, like Arm Holdings (NASDAQ: ARM). Arm's stock is up over 100% in February (as of Feb. 12), as shown below, but many investors aren't familiar with the company. I'll discuss what Arm does, its financials, and its stock below. First, here is what Arm does not do. Arm does not actually make any semiconductors (or \"chips\"). Arm sells the \"architecture\" for companies like Nvidia, Apple (NASDAQ: AAPL), Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL), Qualcomm (NASDAQ: QCOM), Microsoft (NASDAQ: MSFT), Taiwan Semiconductor (NYSE: TSM), and Samsung (OTC: SSNL.F). The list goes on, but you get the idea. I can almost guarantee that you used an Arm-based product today because 99% of all smartphones have CPUs built with Arm technology. Here's how it works. Arm designs the specifications for chips that are energy-efficient, high-powered, and meet its customers' specifications for the end market. The company buys the design from Arm (saving millions or billions on research and development) and pays Arm a license fee. Then, it pays Arm a royalty fee for each unit sold. As of Arm's most recent quarter, 280 billion units have shipped since its inception, including 7.7 billion in the quarter. Because of the low-power, high-performance nature of Arm chips, Apple replaced Intel (NASDAQ: INTC) chips in its Macs with Arm-based chips, and Arm is used by Amazon Web Services (AWS)(NASDAQ: AMZN) server chips. Arm's superior technology is exciting investors as it increases its adoption, including in growing markets like Automotive. Arm stock is not without risks. The company receives 20% of its revenue from China. This creates geopolitical headaches. The industry is highly competitive, and Arm is exposed to economic slowdowns because it generates more than half of its sales from mobile phones and consumer electronics. But results are encouraging. Total revenue was $824 million in the third quarter of fiscal year 2024, a 14% year-over-year (YOY) increase. Operating income was $338 million on an impressive 41% margin. Arm also has an enviable business model. Since it doesn't make the chips, its capital expenditures (equipment purchases) are very low, creating more free cash flow (FCF). Thirty cents of every revenue dollar went into the company's pocket last quarter. What really excited investors last quarter probably wasn't the 14% increase in sales, though. It was the $2.4 billion remaining performance obligation, as shown below. RPO is similar to a backlog. It represents contracts signed that will produce revenue in future quarters. RPO was up 38% YOY last quarter, building on the significant jump in the fiscal second quarter. This is clear evidence of increased adoption of Arm technology. Arm stock experienced a meteoric rise after third-quarter earnings, pushing the valuation metrics off the charts. Its price-to-sales (P/S) and forward price-to-earnings (P/E) ratios stand at 124 and 52, respectively. Compare this to high-flying Nvidia's 40 and 35, and you can see that Arm stock will probably return to Earth soon. Investors should be cautious about buying at this level while looking for a better entry point. Arm has a tremendous future. Should you invest $1,000 in Arm Holdings right now? Before you buy stock in Arm Holdings, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Arm Holdings wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 12, 2024 John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Bradley Guichard has positions in Alphabet, Amazon, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short February 2024 $47 calls on Intel, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Is Arm Holdings the Next Nvidia After Smashing Earnings Estimates? was originally published by The Motley Fool Related Quotes "
}