{
    "title": "Google co-founder Brin’s family office to open in Singapore",
    "date": "2/3/2024",
    "url": "https://tech.hindustantimes.com/tech/news/google-co-founder-brin-s-family-office-to-open-in-singapore-71612364813808.html",
    "text": "Copyright © HT Media Limited  All rights reserved. The family office of Google co-founder Sergey Brin is setting up a branch in Singapore, joining the rush of uber-wealthy clans toward the Southeast Asian financial hub. Bayshore Global Management, the California-based firm that services Brin, established an office in Singapore late last year, according to documents filed with the corporate regulator. Deputy Chief Investment Officer Marie Young was appointed as a director of the unit. Brin is the world's ninth richest person, with a net worth of $86.5 billion, according to the Bloomberg Billionaires Index. He is the latest tycoon to take advantage of Singapore's low taxes, high security and generous incentives for family offices, which manage the lives and wealth of the super-rich. Hedge fund boss Ray Dalio is opening one in the country while vacuum cleaner maker James Dyson's Weybourne Group Ltd. is already there. Brin co-founded search giant Google -- now a unit of Alphabet Inc. -- with Larry Page in 1998. As the company expanded globally, Singapore became a regional hub and the pair reportedly visited the city in 2016 to meet its leaders and learn about its development. While the men have stepped away from active management of the company, they still own super-voting shares giving them control. Bayshore's Singapore filings show its primary activity will be family office related. The office takes its name from North Bayshore -- the section of Mountain View, California where Google has its headquarters. Its Singapore unit is held through a holding company named Parachute Capital (SGP) Pte., which also lists Young as a director. Representatives for Alphabet and Bayshore didn't immediately reply to requests for comment. Young didn't reply to an email seeking comment. The move comes as Singapore's government seeks to attract the world's wealthiest people to its shores. The jobs and training they offer to locals are key drivers behind tax incentives and a global investor program that gives ultra-rich individuals a pathway to permanent residence. About 200 single-family offices are estimated to be managing assets worth about $20 billion in the city as of October. Singapore has become a relatively stable base for those looking for an Asian outpost, particularly as rival hub Hong Kong faces political tensions that could lead to an exodus of cash. Family offices in Asia have outperformed their global peers thanks to their bigger exposure to Chinese stocks and tech companies, according to UBS Group AG. It's not just Western business executives who are setting up family offices in Singapore. Shu Ping, the billionaire co-founder of Chinese hotpot empire Haidilao International Holding Ltd., opened one there, while a surge in Asian wealth is fueling family office demand at DBS Group Holdings Ltd. Catch all the Latest Tech News, Mobile News,  Laptop News, Gaming news, Wearables News , How To News, also keep up with us\non Whatsapp channel,Twitter, Facebook, Google News, and Instagram. For our latest videos,\nsubscribe to our YouTube channel. 71612364813808 "
}