{
    "title": "AI optimism drives Nvidia stock past Amazon, market cap poised to overtake \nAlphabet soon too | Mint",
    "date": "2/14/2024",
    "url": "https://www.livemint.com/companies/news/ai-optimism-drives-nvidia-stock-past-amazon-market-cap-poised-to-overtake-alphabet-soon-too-11707886270407.html",
    "text": "Chip-maker Nvidia is poised to surpass Google's parent Alphabet as the third most valuable company on Wall Street, as per reports. The expectation comes after the Santa Clara-based artificial intelligence (AI) chipmaker's market capitalisation reached $1.78 trillion on February 13, eclipsing Amazon's $1.75 trillion for the first time in two decades. On February 13, Nvidia's shares slipped by 0.17 percent, closing at $1.78 trillion, while Amazon's stock declined by 2.15 percent, resulting in a market value of $1.75 trillion. Google-owner Alphabet also saw a dip of 1.62 percent, with its market capitalisation settling at $1.81 trillion. The gap seems surmountable, especially as demand for Nvidia's AI chips remains high. Also Read | Nvidia overtakes Amazon in market value of $1.78 trillion Why is Nvidia Soaring?The surge in Nvidia's stock is attributed to the insatiable demand for its accelerators powering AI tasks. Nvidia has become a major player in the technology sector's push to integrate AI into products and services. The company's graphics processors are in high demand, and at present Nvidia controls around 80 percent of the high-end AI chip market.\n    Big Tech players such as Meta Platforms are investing billions of dollars in Nvidia's products. However, the heightened demand for its graphics processors has resulted in shortages of its components.\n   Also Read | Lyft shares rocket 60% then level to 17% on margin correction, stock still up on positive forecasts\n   Lead times for Nvidia's premium H100 processor have decreased, but the overall demand remains considerably higher than the available supply, according to Mizuho analyst Vijay Rakesh.\n   Largely the company growth has come as Nvidia dominates around 80 percent of the high-end AI chip market, which has contributed to a 46 percent increase in its stock value this year, following a more than threefold surge in 2023. The optimism around AI has also propelled technology-related companies such as Microsoft and Meta to record highs.\n   Also Read | Instacart to cut 250 jobs as slowing ad business counters upbeat Q1 forecast\n Wall Street Responds to Nvidia's Red-Hot RallyIn 2024, Nvidia's remarkable performance has led several Wall Street firms to raise their price targets.\n   UBS Group AG and Mizuho Securities joined others, including Morgan Stanley, Bank of America Corp., and Goldman Sachs Group Inc., in adjusting their price targets ahead of the company's February 21 earnings announcement.\n   This week, UBS increased its target to $850 from $580, also revising its earnings per share estimates upward. Mizuho raised its target to $825 from $625, emphasising the persistently high demand for Nvidia's H100 AI accelerators. Vijay Rakesh of Mizuho described the stock as the top choice for AI investments.\n   Also Read | Q3 Results Today: M&M, NMDC, Muthoot Finance, Natco Pharma, ABFRL, and more to post earnings on February 14\n   The company's shares have surged by 46 percent this year, adding approximately $560 billion in market value.\n Market Position and Analyst ExpectationsNvidia with its market share stronghold has outperformed its big-tech counterparts. Despite the stock's rise, analysts struggle to keep pace, with the average 12-month price target of $690 lagging behind the closing price on February 13.\n   Analysts attribute Nvidia's success to the ongoing AI boom, with massive capital expenditures in data centres. The company has gained over $600 billion in market value in the new year, outpacing its growth in the last seven months of 2023.\n   Also Read | Jeff Bezos sells 24 million Amazon shares worth over $4 billion in 4 trading days\n   In the competitive landscape of AI-driven technologies, Nvidia continues to make strides, posing a formidable challenge to established market leaders. The company's upcoming earnings report on Feb. 21 will be closely watched as it navigates the dynamic tech market.\n (With inputs from Bloomberg and Reuters)\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Beer is at the beginning of an era of growth in India: Heineken CEO          The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 14 Feb 2024, 10:47 AM IST\n\t\nTopics You May Be Interested In \n business \n company \n Nvidia \n Nvidia market cap \n Amazon \n Alphabet \n Google \n stock \n AI \n artificial intelligence \n Wall Street The surge in Nvidia's stock is attributed to the insatiable demand for its accelerators powering AI tasks. Nvidia has become a major player in the technology sector's push to integrate AI into products and services. The company's graphics processors are in high demand, and at present Nvidia controls around 80 percent of the high-end AI chip market. Big Tech players such as Meta Platforms are investing billions of dollars in Nvidia's products. However, the heightened demand for its graphics processors has resulted in shortages of its components. Also Read | Lyft shares rocket 60% then level to 17% on margin correction, stock still up on positive forecasts Lead times for Nvidia's premium H100 processor have decreased, but the overall demand remains considerably higher than the available supply, according to Mizuho analyst Vijay Rakesh. Largely the company growth has come as Nvidia dominates around 80 percent of the high-end AI chip market, which has contributed to a 46 percent increase in its stock value this year, following a more than threefold surge in 2023. The optimism around AI has also propelled technology-related companies such as Microsoft and Meta to record highs. Also Read | Instacart to cut 250 jobs as slowing ad business counters upbeat Q1 forecast Wall Street Responds to Nvidia's Red-Hot RallyIn 2024, Nvidia's remarkable performance has led several Wall Street firms to raise their price targets.\n   UBS Group AG and Mizuho Securities joined others, including Morgan Stanley, Bank of America Corp., and Goldman Sachs Group Inc., in adjusting their price targets ahead of the company's February 21 earnings announcement.\n   This week, UBS increased its target to $850 from $580, also revising its earnings per share estimates upward. Mizuho raised its target to $825 from $625, emphasising the persistently high demand for Nvidia's H100 AI accelerators. Vijay Rakesh of Mizuho described the stock as the top choice for AI investments.\n   Also Read | Q3 Results Today: M&M, NMDC, Muthoot Finance, Natco Pharma, ABFRL, and more to post earnings on February 14\n   The company's shares have surged by 46 percent this year, adding approximately $560 billion in market value.\n Market Position and Analyst ExpectationsNvidia with its market share stronghold has outperformed its big-tech counterparts. Despite the stock's rise, analysts struggle to keep pace, with the average 12-month price target of $690 lagging behind the closing price on February 13.\n   Analysts attribute Nvidia's success to the ongoing AI boom, with massive capital expenditures in data centres. The company has gained over $600 billion in market value in the new year, outpacing its growth in the last seven months of 2023.\n   Also Read | Jeff Bezos sells 24 million Amazon shares worth over $4 billion in 4 trading days\n   In the competitive landscape of AI-driven technologies, Nvidia continues to make strides, posing a formidable challenge to established market leaders. The company's upcoming earnings report on Feb. 21 will be closely watched as it navigates the dynamic tech market.\n (With inputs from Bloomberg and Reuters)\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Beer is at the beginning of an era of growth in India: Heineken CEO          The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 14 Feb 2024, 10:47 AM IST\n\t\nTopics You May Be Interested In \n business \n company \n Nvidia \n Nvidia market cap \n Amazon \n Alphabet \n Google \n stock \n AI \n artificial intelligence \n Wall Street In 2024, Nvidia's remarkable performance has led several Wall Street firms to raise their price targets. UBS Group AG and Mizuho Securities joined others, including Morgan Stanley, Bank of America Corp., and Goldman Sachs Group Inc., in adjusting their price targets ahead of the company's February 21 earnings announcement. This week, UBS increased its target to $850 from $580, also revising its earnings per share estimates upward. Mizuho raised its target to $825 from $625, emphasising the persistently high demand for Nvidia's H100 AI accelerators. Vijay Rakesh of Mizuho described the stock as the top choice for AI investments. Also Read | Q3 Results Today: M&M, NMDC, Muthoot Finance, Natco Pharma, ABFRL, and more to post earnings on February 14 The company's shares have surged by 46 percent this year, adding approximately $560 billion in market value. Market Position and Analyst ExpectationsNvidia with its market share stronghold has outperformed its big-tech counterparts. Despite the stock's rise, analysts struggle to keep pace, with the average 12-month price target of $690 lagging behind the closing price on February 13.\n   Analysts attribute Nvidia's success to the ongoing AI boom, with massive capital expenditures in data centres. The company has gained over $600 billion in market value in the new year, outpacing its growth in the last seven months of 2023.\n   Also Read | Jeff Bezos sells 24 million Amazon shares worth over $4 billion in 4 trading days\n   In the competitive landscape of AI-driven technologies, Nvidia continues to make strides, posing a formidable challenge to established market leaders. The company's upcoming earnings report on Feb. 21 will be closely watched as it navigates the dynamic tech market.\n (With inputs from Bloomberg and Reuters)\n\nMilestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!\n\n\n Related Premium Stories         Beer is at the beginning of an era of growth in India: Heineken CEO          The pandemic broke co-living’s back. Startups need a reset          CarDekho in talks to raise $100-150 million          Brookfield's big sale has many investors interested          Bankruptcy rescues have soared this year. Here is why          When Cupid stepped up to Tourism Finance, and walked back          It's going to get harder to swing a promotion          Vedanta plans a demerger; banks are thinking of debt          Accenture secures $1.1 billion GenAI projects in Sep-Feb          Healthify maps a global run amid profit chase       Explore Premium  \n\n\n            Catch all the Corporate news and Updates on Live Mint.\n        Download The Mint News App to get Daily Market Updates & Live Business News.\n    \nMore\nLess\n \n\t\tPublished: 14 Feb 2024, 10:47 AM IST\n\t\nTopics You May Be Interested In \n business \n company \n Nvidia \n Nvidia market cap \n Amazon \n Alphabet \n Google \n stock \n AI \n artificial intelligence \n Wall Street Nvidia with its market share stronghold has outperformed its big-tech counterparts. Despite the stock's rise, analysts struggle to keep pace, with the average 12-month price target of $690 lagging behind the closing price on February 13. Analysts attribute Nvidia's success to the ongoing AI boom, with massive capital expenditures in data centres. The company has gained over $600 billion in market value in the new year, outpacing its growth in the last seven months of 2023. Also Read | Jeff Bezos sells 24 million Amazon shares worth over $4 billion in 4 trading days In the competitive landscape of AI-driven technologies, Nvidia continues to make strides, posing a formidable challenge to established market leaders. The company's upcoming earnings report on Feb. 21 will be closely watched as it navigates the dynamic tech market. (With inputs from Bloomberg and Reuters) Milestone Alert!\nLivemint tops charts as the fastest growing news website in the world 🌏 Click here  to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now! Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp "
}