{
    "title": "Alphabet Inc. (GOOG) is Attracting Investor Attention: Here is What You \nShould Know",
    "date": "2/5/2024",
    "url": "https://finance.yahoo.com/news/alphabet-inc-goog-attracting-investor-140012150.html",
    "text": "Alphabet Inc. (GOOG) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock. Shares of this company have returned +4.5% over the past month versus the Zacks S&P 500 composite's +4.6% change. The Zacks Internet - Services industry, to which Alphabet Inc. belongs, has gained 3.6% over this period. Now the key question is: Where could the stock be headed in the near term? Although media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision. Revisions to Earnings Estimates Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings. Our analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements. Alphabet Inc. is expected to post earnings of $1.48 per share for the current quarter, representing a year-over-year change of +26.5%. Over the last 30 days, the Zacks Consensus Estimate has changed +0.7%. For the current fiscal year, the consensus earnings estimate of $6.76 points to a change of +16.6% from the prior year. Over the last 30 days, this estimate has changed +1.7%. For the next fiscal year, the consensus earnings estimate of $7.77 indicates a change of +15% from what Alphabet Inc. is expected to report a year ago. Over the past month, the estimate has changed +0.3%. Having a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Alphabet Inc. is rated Zacks Rank #3 (Hold). The chart below shows the evolution of the company's forward 12-month consensus EPS estimate: 12 Month EPS Revenue Growth Forecast Even though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial. In the case of Alphabet Inc. the consensus sales estimate of $65.88 billion for the current quarter points to a year-over-year change of +13.5%. The $286.45 billion and $318.2 billion estimates for the current and next fiscal years indicate changes of +11.7% and +11.1%, respectively. Last Reported Results and Surprise History Alphabet Inc. reported revenues of $72.32 billion in the last reported quarter, representing a year-over-year change of +14.6%. EPS of $1.64 for the same period compares with $1.05 a year ago. Compared to the Zacks Consensus Estimate of $70.81 billion, the reported revenues represent a surprise of +2.14%. The EPS surprise was +2.5%. The company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period. Valuation Without considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects. Comparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is. As part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued. Alphabet Inc. is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade. Bottom Line The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet Inc. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}