{
    "title": "‘Looks like a job interview’: Picture of Apple CEO Tim Cook, Google CEO \nSundar Pichai at a restaurant goes viral",
    "date": "3/20/2024",
    "url": "https://www.businesstoday.in/technology/news/story/looks-like-a-job-interview-picture-of-apple-ceo-tim-cook-google-ceo-sundar-pichai-at-a-restaurant-goes-viral-422240-2024-03-20",
    "text": "Feedback Apple CEO Tim Cook and Google CEO Sundar Pichai were seen having dinner together in Palo Alto at a restaurant. A picture of the two tech leaders sitting across from each other in a Vietnamese restaurant was shared by a user on X, formerly known as Twitter. However, it turned out to be an old picture from 2017 that went viral on the internet recently. As per a report by CNBC in 2017, Steve Sims, founder of luxury concierge service Bluefish, was hosting a corporate client when he clicked an image of the guests during a smoke break at around 9pm. However, he wasn’t aware of the details of their conversation. Since the two big tech giants are major competitors in the market, this news came as a surprise to many. Users on Twitter have started speculating what this meeting could have been about. Some are suggesting personal matters while others are speculating a big collaboration. Here are some of the hilarious reactions to this viral picture:  It’s literally this pic.twitter.com/OtiaH3NFDH  they couldn't cook  Looks like a job interview🤣  steve would never For the unversed, Apple is planning to bring new generative AI features in iPhones by integrating Google’s Gemini. As per a report by Bloomberg, Apple is in talks to license Gemini for the future iPhones. These features are likely to include AI chatbots, coding assistants, and more. The two tech giants are reportedly \"in active negotiations\" for Gemini for some AI-powered tools for iPhone models that will launch later this year. Alphabet, Google’s parent company, shares rose 3 per cent in premarket US trading, while Apple was up 0.5 per cent. However, the report further revealed that Apple has also held discussions with OpenAI to potentially use GPT models in the future iPhone models. Also Read: Samsung Galaxy Ultra Days sale: Discounts, offers announced for Galaxy S23 Ultra, Galaxy S24 Ultra, more Pay from your wrist: Airtel Payments Bank, Noise, Mastercard collaborate on smartwatch with contactless payments Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}