{
    "title": null,
    "date": "3/1/2024",
    "url": "https://finance.yahoo.com/news/stock-cheapest-magnificent-seven-top-104600239.html",
    "text": "The S&P 500 has soared from its bear market low 16 months ago, and earlier this year, the index confirmed what everyone eagerly was waiting for: We're in a new bull market. A handful of stocks, in particular, have been leading this new wave of market positivity. I'm talking about the \"Magnificent Seven,\" a group of leaders that each is tied to the technology industry: Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL), Apple, Amazon, Meta Platforms, Microsoft, Nvidia, and Tesla. Last year, each of these innovative players climbed in the double or triple digits. Considering they are among the top 10 most heavily weighted shares in the S&P 500, they contributed heavily to the index's gains. After such performance, you may expect the valuations of these stocks to have exploded, too -- but one, in particular, still trades for an absolutely dirt cheap valuation. Should this tech stock be your top buy? Of these market-leading stocks, the cheapest today by one particular measure is Google-parent Alphabet, trading for about 20x forward earnings estimates. This valuation tool considers estimates of earnings over the coming 12 months, as opposed to the trailing price-to-earnings ratio (P/E), which uses the company's actual earnings over the past year. Forward P/E is subject to error if the company surprises positively or negatively during upcoming earnings reports, but I prefer it to trailing measures because it looks to the future. By using it, investors can get an idea of how cheap or expensive a company is relative to its future earnings potential. It's important to remember that this measure only considers potential earnings over the coming 12 months. If a particular company (such as Alphabet) has fantastic long-term growth prospects, this measure doesn't take that into account. This means the stock may be even cheaper than this measure indicates -- and I think that's the case with Alphabet for two particular reasons. First, Alphabet's Google Search has dominated the search market by far -- with a 91% market share -- for quite some time, and thanks to Google's spot in people's daily routines, that's unlikely to change. Consider how the search engine has even become part of the vocabulary: When someone doesn't know the answer to a question, they'll often say, \"I'll Google it.\" This gives Alphabet a significant moat, or competitive advantage, which helps ensure that its leadership in the market will continue. This is important because advertisers trying to reach consumers -- the users of Google Search -- flock to Alphabet to buy ads. These advertisements make up an enormous portion of Alphabet's revenue, about 75% in the most recent quarter. Here's my second point, and it supports the idea that Alphabet's search dominance is likely to last. The tech giant has been investing significantly in artificial intelligence (AI) and recently released its most powerful AI tool Gemini, followed by its next-generation model, Gemini Ultra. Alphabet is using this top tool across its businesses, but I'm particularly enthusiastic about the company's application of AI to improve the search experience and streamline the creation of ads for advertisers. For example, the use of generative AI in search has cut down latency by 40% in U.S. English language searches. Its increased speed and expanded search results should keep users coming back. The AI tools for advertisers is likely to keep them flocking to Alphabet, too. All of this bodes well for the search business. On top of this, Alphabet continues to increase revenue from its cloud business -- another unit that's likely to benefit from the investment in AI because the company offers a variety of AI tools to cloud clients. Alphabet has grown its return on invested capital over the years, showing it has a solid track record of smart growth decisions. Let's get back to our question: Should this dirt cheap Magnificent Seven stock be your top buy? Many of the Magnificent Seven stocks make compelling buys today. And even after last year's gains, valuations remain interesting. But Alphabet looks particularly cheap today, considering its dominance in the search market, solid moat, and potential to deliver long-term growth. That means this Magnificent Seven stock makes a terrific buy today. Should you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*. See the 10 stocks *Stock Advisor returns as of February 26, 2024 Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Adria Cimino has positions in Amazon and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. This Stock Is the Cheapest of the \"Magnificent Seven\" -- Should It Be Your Top Buy? was originally published by The Motley Fool Related Quotes "
}