{
    "title": "Alphabet (GOOGL) Enhances Google Maps With New Feature",
    "date": "3/5/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-enhances-google-maps-164600247.html",
    "text": "Alphabet’s GOOGL Google is gaining strong momentum in the digital map space on the back of continuous enhancements in Google Maps.In this regard, the company announced a feature on Google Maps that shows entrances for buildings to some select users, addressing the issue of navigating to specific building portions on the map.This change is aimed at improving the user experience and ensuring accurate directions for businesses or locations.Alphabet is expected to gain solid traction across Android users on the back of this latest feature. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the latest introduction, Google added \"glanceable directions\" for Maps on Android and iOS, providing live ETAs and directions on the device's lock screen, using regular system notifications.Further, Google introduced wearable and navigation-related updates, including public transit directions in Google Maps for Wear OS, alongside driving, cycling and walking, and providing recommended routes and compass-guided map views.The company is also set to introduce additional features for its Maps application, which will allow users to delete place-related activity on Android, with location controls like Location History and Timeline status available.All the above-mentioned endeavors will enable the company to capitalize on growth opportunities present in the global digital map market. Per a Future Market Insights report, the global digital map market is expected to reach $73.1 billion by 2033, witnessing a CAGR of 14.8% between 2023 and 2033.Moreover, growing Google Maps efforts are in sync with Alphabet’s increasing focus on bolstering its Android offerings. This, in turn, will boost its Google Services segment, which remains the key growth catalyst for the company. Its shares have surged 44.5% in the past year compared with the Zacks Computer & Technology sector’s growth of 46.8%.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $286.52 billion, indicating year-over-year growth of 11.7%. Alphabet’s growing efforts to boost its Google Maps offerings will enable it to compete well against its peers like Apple AAPL and Microsoft MSFT, which are also making concerted efforts to boost its Maps offerings.Apple is enjoying the growing momentum of its Apple Maps offerings.Notably, Apple launched Apple Business Connect, a free tool enabling businesses to manage their location place cards and customize information for over a billion users on Apple Maps, including adding photos, logos and promotions.Meanwhile, Microsoft is riding on the success of Bing Maps with new feature updates.Microsoft introduced live traffic updates on Bing Maps, enabling users to plan their journeys more efficiently by providing real-time information about traffic conditions during commutes. Currently, Alphabet carries a Zacks Rank #3 (Hold).A better-ranked stock in the broader technology sector is CrowdStrike CRWD, sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Shares of CrowdStrike have gained 25.7% in the year-to-date period. The long-term earnings growth rate for CRWD is 36.07% Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report CrowdStrike (CRWD) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}