{
    "title": "Analysts say Google needs transformation, CEO Sundar Pichai must resign",
    "date": "3/3/2024",
    "url": "https://www.indiatoday.in/technology/news/story/analysts-say-google-needs-transformation-ceo-sundar-pichai-must-resign-2509824-2024-03-03",
    "text": "Listen to Story Sundar Pichai-led Google found itself in the middle of a controversy recently as its ambitious AI chatbot, Gemini, was accused of being \"racist\". The AI tool, in several cases, was accused of refusing to generate images of white people and portraying historical figures as people of colour, even though they were originally white. As a result, Google had to shut down Gemini's human image generation capabilities. Google CEO Sundar Pichai had also responded to the controversy, calling it \"completely unacceptable.\" However, as per the latest reports, there are now growing calls against the CEO himself.advertisementSundar Pichai must resign, analysts sayAs per a Business Insider report, calls demanding Pichai's resignation are increasing and many are arguing that the CEO must step down. The report quotes analysts Ben Thompson and Mark Shmulik who said that things at Google needed to change, including possibly replacing CEO Sundar Pichai. While Thompson emphasised the need to address past issues, Shmulik questioned if the current leadership is suitable for guiding Google in the future. As per a Business Insider report, calls demanding Pichai's resignation are increasing and many are arguing that the CEO must step down. The report quotes analysts Ben Thompson and Mark Shmulik who said that things at Google needed to change, including possibly replacing CEO Sundar Pichai. While Thompson emphasised the need to address past issues, Shmulik questioned if the current leadership is suitable for guiding Google in the future. Thompson, in his newsletter, wrote that Google needed a \"transformation\" that would \"mean removing those who let the former run amok, up to and including CEO Sundar Pichai.\" The analyst's newsletters are read across the Silicon Valley and by several other Googlers. Bernstein internet analyst Mark Shmulik also talked about how things at Google needed to change in a research note. His note read, \"The most recent saga only further raises increasingly louder questions around whether this is the right management team to guide Google into this next era.\"Google's Gemini controversy To recall what happened with Google's Gemini, as mentioned already, it was called out by several users across the internet for generating historically inaccurate and biased images. The AI tool was accused of being \"too woke\", \"racist\" and getting details about \"white people\" wrong. Numerous user complaints talked about Gemini's inability to generate images of \"white people\" accurately. Users reported that when they requested images of figures like the pope, English kings, Vikings, or even Nazi soldiers, the AI produced pictures of people with darker skin tones. In response to this, Google paused the image generation feature of Gemini and issued a statement saying that they are working on the reported issues. \"While we do this, we’re going to pause the image generation of people and will re-release an improved version soon,\" the company noted. Google CEO Sundar Pichai, acknowledging the problem, said that the company “got it wrong”. He added that what happened was “completely unacceptable” and that the company is working on a solution. Published By: Divyanshi SharmaPublished On: Mar 3, 2024ALSO READ |  Google DeepMind CEO promises Gemini will be back in a few weeks, says things did not go as plannedALSO READ |  Google employee resigns after working for 18 years, slams Sundar Pichai and company's work culture "
}