{
    "title": "1 Wall Street Analyst Thinks Alphabet Stock Is Going to $170. Is It a Buy \nAround $130?",
    "date": "3/7/2024",
    "url": "https://www.fool.com/investing/2024/03/07/1-wall-street-analyst-thinks-alphabet-stock-is-goi/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More As the seemingly eternal leader in internet search, Google parent Alphabet (GOOG 0.21%) (GOOGL 0.04%) has made a great many investors richer over the course of its more than 25-year history. Lately, though, it hasn't been the most exciting stock, neither soaring higher nor crashing violently in price on the tech sector's gyrations. Some believe it's being unfairly ignored by the market, and the market is missing a chance to get a solid investment at a cheap price. Let's explore one analyst's bullish take on the company. As February came to a close, Redburn-Atlantic's James Cordwell upped his price target on Alphabet's class A voting shares (the ones with the GOOGL ticker symbol). These should be worth $170 apiece, according to him, up from his previous level of $165. In making his change, Cordwell maintained his buy rating on the shares. That makes for a potential gain of around 30% on both classes of Alphabet's stock, given that they're hovering around the $130 level these days and they trade at basically the same level. Cordwell feels that Alphabet is priced more like a traditional blue chip stock in an unexciting industry than a leader dominating a corner of the tech sector. He wrote in a note that with \"Alphabet's forward P/E now just in line with that of the [S&P 500 index] sentiment has clearly turned negative regarding Google Search's competitive position and ongoing growth potential.\" It can be tough for a company that's been so firmly established in its niche to win investor love. With longevity, more people can take a business for granted and forget that it still might have powerful growth in front of it. Technological advances will make internet search more of a valuable resource, not less, and there's no meaningful competition to the powerhouse that is Alphabet. That makes Cordwell's latest take on the stock rather compelling and $130 looks like a cheap price for a company with a bright future. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Eric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}