{
    "title": null,
    "date": "3/24/2024",
    "url": "https://www.defenseworld.net/2024/03/24/alphabet-inc-nasdaqgoogl-shares-sold-by-bellwether-advisors-llc.html",
    "text": "Posted by Defense World Staff on Mar 24th, 2024 Bellwether Advisors LLC cut its holdings in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 26.3% in the 4th quarter, HoldingsChannel reports. The fund owned 2,909 shares of the information services provider’s stock after selling 1,040 shares during the period. Bellwether Advisors LLC’s holdings in Alphabet were worth $406,000 at the end of the most recent quarter. Several other institutional investors also recently bought and sold shares of the business. Vanguard Group Inc. raised its holdings in  Alphabet by 0.3% in the 3rd quarter. Vanguard Group Inc. now owns 487,435,495 shares of the information services provider’s stock valued at $63,785,809,000 after acquiring an additional 1,302,104 shares during the last quarter.  FMR LLC raised its holdings in  Alphabet by 5.6% in the 3rd quarter. FMR LLC now owns 227,317,469 shares of the information services provider’s stock valued at $29,746,764,000 after acquiring an additional 12,070,681 shares during the last quarter.  State Street Corp raised its holdings in  Alphabet by 0.8% in the 2nd quarter. State Street Corp now owns 218,540,033 shares of the information services provider’s stock valued at $26,159,242,000 after acquiring an additional 1,666,205 shares during the last quarter.  Moneta Group Investment Advisors LLC increased its holdings in shares of  Alphabet by 111,197.8% during the 4th quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock worth $15,036,178,000 after buying an additional 170,267,122 shares during the last quarter.  Finally, Geode Capital Management LLC increased its holdings in shares of  Alphabet by 2.3% during the 2nd quarter. Geode Capital Management LLC now owns 121,308,289 shares of the information services provider’s stock worth $14,481,781,000 after buying an additional 2,731,671 shares during the last quarter. 35.08% of the stock is currently owned by institutional investors and hedge funds. Shares of Alphabet stock opened at $150.77 on Friday. The business has a 50-day moving average of $143.02 and a 200-day moving average of $137.79. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. The company has a market capitalization of $1.87 trillion, a PE ratio of 25.99, a P/E/G ratio of 1.36 and a beta of 1.04. Alphabet Inc. has a 1-year low of $99.74 and a 1-year high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last posted its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 EPS for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. The business had revenue of $86.31 billion during the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same period last year, the firm earned $1.05 earnings per share.  As a group, equities analysts forecast that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. In related news, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction dated Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total value of $3,347,550.00. Following the completion of the transaction, the chief executive officer now directly owns 2,310,191 shares in the company, valued at $343,710,216.98. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through the SEC website. In other Alphabet news, Director Frances Arnold sold 230 shares of the firm’s stock in a transaction dated Tuesday, January 30th. The shares were sold at an average price of $154.06, for a total value of $35,433.80. Following the transaction, the director now owns 15,104 shares of the company’s stock, valued at $2,326,922.24. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction dated Wednesday, March 20th. The stock was sold at an average price of $148.78, for a total transaction of $3,347,550.00. Following the completion of the transaction, the chief executive officer now directly owns 2,310,191 shares in the company, valued at approximately $343,710,216.98. The disclosure for this sale can be found here. Over the last three months, insiders sold 279,659 shares of company stock worth $39,460,310. Corporate insiders own  0.88% of the company’s stock. A number of analysts have recently commented on GOOGL shares. KeyCorp upped their price objective on Alphabet from $153.00 to $165.00 and gave the stock an “overweight” rating in a report on Monday, January 29th. BMO Capital Markets upped their price objective on Alphabet from $170.00 to $178.00 and gave the stock an “outperform” rating in a report on Wednesday, January 31st. JMP Securities upped their price objective on Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a report on Wednesday, January 31st. Needham & Company LLC  restated a “buy” rating and set a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Finally, Wells Fargo & Company upped their price objective on Alphabet from $141.00 to $144.00 and gave the stock an “equal weight” rating in a report on Monday, March 18th. Five analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have assigned  a strong buy rating to the company. According to MarketBeat, Alphabet presently has an average rating of “Moderate Buy” and an average price target of $155.48. Read Our Latest Analysis on GOOGL (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Liberty Latin America Ltd. (NASDAQ:LILAK) Major Shareholder Acquires $230,065.40 in Stock Cedar Brook Financial Partners LLC Has $1.67 Million Holdings in Johnson & Johnson (NYSE:JNJ) "
}