{
    "title": "ROSEN, A GLOBALLY RECOGNIZED FIRM, Encourages Alphabet Inc. Investors to \nSecure Counsel Before Important ...",
    "date": "3/26/2024",
    "url": "https://www.kxan.com/business/press-releases/accesswire/751683/rosen-a-globally-recognized-firm-encourages-alphabet-inc-investors-to-secure-counsel-before-important-deadline-in-securities-class-action-goog-googl/",
    "text": "KXAN Austin Please enter a search term. Please enter a search term. News provided by Apr 27, 2023, 2:00 PM\t\t\t\t\t\tET NEW YORK, NY / ACCESSWIRE / April 27, 2023 / WHY: Rosen Law Firm, a global investor rights law firm, reminds purchasers of securities of Alphabet Inc. (NASDAQ:GOOG, GOOGL), the parent company of Google, between February 4, 2020 and January 23, 2023, both dates inclusive (the \"Class Period\"), of the important May 15, 2023 lead plaintiff deadline. SO WHAT: If you purchased Alphabet securities during the Class Period you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement. WHAT TO DO NEXT: To join the Alphabet class action, go to https://rosenlegal.com/submit-form/?case_id=13312 or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than May 15, 2023. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. WHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources or any meaningful peer recognition. Many of these firms do not actually litigate securities class actions, but are merely middlemen that refer clients or partner with law firms that actually litigate the cases. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs' Bar. Many of the firm's attorneys have been recognized by Lawdragon and Super Lawyers. DETAILS OF THE CASE: According to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) Alphabet used its dominance in the field of digital advertising to disadvantage website publishers and advertisers who used competing advertising products; (2) the foregoing conduct was anticompetitive in nature and likely to draw significant regulatory scrutiny; (3) Alphabet's revenues were unsustainable to the extent that they were the product of said anticompetitive conduct; (4) Alphabet's conduct, once revealed, would negatively impact the Company's reputation and expose it to a heightened risk of litigation and regulatory enforcement action; and (5) as a result, the Company's public statements were materially false and misleading at all relevant times. When the true details entered the market, the lawsuit claims that investors suffered damages. To join the Alphabet class action, go to https://rosenlegal.com/submit-form/?case_id=13312or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. No Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff. Follow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/. Attorney Advertising. Prior results do not guarantee a similar outcome. ------------------------------- Contact Information: Laurence Rosen, Esq.Phillip Kim, Esq.The Rosen Law Firm, P.A.275 Madison Avenue, 40th FloorNew York, NY 10016Tel: (212) 686-1060Toll Free: (866) 767-3653Fax: (212) 202-3827lrosen@rosenlegal.compkim@rosenlegal.comcases@rosenlegal.comwww.rosenlegal.com SOURCE: The Rosen Law Firm, P.A. NOTE: This content is not written by or endorsed by \"KXAN\", its advertisers, or Nexstar Media Inc. "
}