{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/alphabet-inc-nasdaqgoogl-shares-sold-by-hunter-perkins-capital-management-llc.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Hunter Perkins Capital Management LLC decreased its position in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 14.5% in the 4th quarter, according to the company in its most recent filing with the Securities and Exchange Commission. The institutional investor  owned 114,036 shares of the information services provider’s stock after selling 19,412 shares during the quarter. Alphabet accounts for approximately  3.3% of Hunter Perkins Capital Management LLC’s holdings, making the stock its 8th largest position. Hunter Perkins Capital Management LLC’s holdings in Alphabet were worth $15,930,000 at the end of the most recent quarter. Several other hedge funds also recently made changes to their positions in GOOGL. Live Oak Investment Partners acquired a new position in  Alphabet during the 4th quarter valued at approximately $26,000.  VitalStone Financial LLC boosted its position in  Alphabet by 1,900.0% during the 2nd quarter. VitalStone Financial LLC now owns 280 shares of the information services provider’s stock valued at $34,000 after purchasing an additional 266 shares during the period.  Sanctuary Wealth Management L.L.C. acquired a new position in  Alphabet during the 4th quarter valued at approximately $34,000.  Turim 21 Investimentos Ltda. acquired a new position in  Alphabet during the 3rd quarter valued at approximately $38,000.  Finally, Meritage Group LP boosted its position in  Alphabet by 1,061.5% during the 3rd quarter. Meritage Group LP now owns 302 shares of the information services provider’s stock valued at $40,000 after purchasing an additional 276 shares during the period. Institutional investors and hedge funds own  40.03% of the company’s stock. Shares of NASDAQ GOOGL opened at $150.93 on Friday. The company has a quick ratio of 2.10, a current ratio of 2.10 and a debt-to-equity ratio of 0.05. The stock has a market capitalization of $1.88 trillion, a price-to-earnings ratio of 26.02, a PEG ratio of 1.39 and a beta of 1.04. The stock’s fifty day simple moving average is $143.67 and its 200 day simple moving average is $138.21. Alphabet Inc. has a 52-week low of $99.78 and a 52-week high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, beating analysts’ consensus estimates of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. During the same quarter in the previous year, the company posted $1.05 earnings per share.  As a group, sell-side analysts forecast that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. In other news, SVP Prabhakar Raghavan sold 16,088 shares of Alphabet stock in a transaction on Tuesday, January 2nd. The stock was sold at an average price of $139.10, for a total transaction of $2,237,840.80. Following the transaction, the senior vice president now owns 52,440 shares in the company, valued at $7,294,404. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through this link. In other Alphabet news, CFO Ruth Porat sold 48,077 shares of the business’s stock in a transaction dated Friday, March 8th. The stock was sold at an average price of $137.22, for a total value of $6,597,125.94. Following the transaction, the chief financial officer now owns 1,777,106 shares in the company, valued at $243,854,485.32. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, SVP Prabhakar Raghavan sold 16,088 shares of the business’s stock in a transaction dated Tuesday, January 2nd. The shares were sold at an average price of $139.10, for a total value of $2,237,840.80. Following the completion of the transaction, the senior vice president now owns 52,440 shares in the company, valued at approximately $7,294,404. The disclosure for this sale can be found here. Over the last quarter, insiders have sold 263,312 shares of company stock worth $37,268,315. 0.88% of the stock is owned by corporate insiders. A number of research analysts recently issued reports on GOOGL shares. Wells Fargo & Company boosted their price objective on Alphabet from $141.00 to $144.00 and gave the company an “equal weight” rating in a research report on Monday, March 18th. StockNews.com upgraded Alphabet from a “buy” rating to a “strong-buy” rating in a research report on Wednesday, December 20th. KeyCorp lifted their target price on Alphabet from $153.00 to $165.00 and gave the company an “overweight” rating in a research note on Monday, January 29th. Wedbush lifted their target price on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a research note on Friday, March 22nd. Finally, Royal Bank of Canada  reaffirmed an “outperform” rating and set a $155.00 target price on shares of Alphabet in a research note on Wednesday, January 31st. Five analysts have rated the stock with a hold rating, twenty-six have given a buy rating and two have given a strong buy rating to the company. Based on data from MarketBeat.com, the company presently has a consensus rating of “Moderate Buy” and an average price target of $155.48. Check Out Our Latest Stock Analysis on GOOGL (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. 1,264 Shares in Kenvue Inc. (NYSE:KVUE) Bought by Planned Solutions Inc. Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by Parisi Gray Wealth Management "
}