{
    "title": "Google Stock: Apple, Alphabet In Talks Over Gemini AI System Licensing For \niPhones",
    "date": "3/18/2024",
    "url": "https://www.investors.com/news/technology/apple-google-in-talks-gemini-ai-system-iphone/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Apple (AAPL) is in talks with Google-parent Alphabet (GOOGL) over licensing its \"Gemini\" artificial intelligence  training model for use in iPhones, according to a report. Google stock rose on the news, which follows controversy over Google's Gemini-powered gen AI chatbot. On the stock market today, Google stock climbed 4.6% to close at 147.68. Apple stock rose 0.6% to 173.72. Apple would use the Gemini generative AI models to power new features coming to iPhone software, Bloomberg reported. New generative AI models process \"prompts,\" such as internet search queries, that describe what a user wants to get. Generative AI technologies create text, images, video and computer programming code on their own. At Bank of America, analyst Wamsi Mohan said a deal could be good for both Google and Apple. \"Google Gemini has multiple versions (Ultra, Pro and Nano) that can run in the cloud and on device and vary in complexity and capability,\" Mohan said. \"It remains unclear if Apple will choose to leverage a cloud-based model that could potentially have higher latency versus  on device option.\" He added: \"Given Apple's installed base of 2.2 billion iOS devices, a licensing deal based on volume of usage could end up being a very significant cost for Apple but a fixed license for any cloud-based usage would not be economical for partners. An on-device fixed charge per device seems most likely but would be more limited in capabilities. Apple could also use this as an approach to speed up time to market, while continuing to develop in-house technologies.\" On Feb. 8, Google announced a new Gemini app on the Android mobile operating system as well as a Gemini option within the existing Google iOS app. \"This is a major win for Google to get onto the Apple ecosystem and have access to the golden installed base of Cupertino with clearly a major license fee attached to this,\" said Wedbush analyst Daniel Ives in a report. He added: \"For Apple this will give them the foundation and technology blueprint to double down on AI features currently being developed within Apple Park to make sure that iPhone 16 will be a potential game changer around AI functionality.\" In addition, Apple has been in talks with generative AI leader OpenAI, the Bloomberg report said. Microsoft (MSFT) is the biggest investor in Open AI. Shares in Microsoft edged up a fraction to 417.32 on Monday. At CFRA Research, analyst Angelo Zino said Apple will likely not announce any licensing deal until the Worldwide Developers Conference (WWDC) in June. Speculation has been rife over Apple's plans. Apple researchers have been developing their own AI training models. \"As AI enabled tools become more mainstream we think there will be a strong value proposition to run AI on the edge (inferencing),\" said Evercore ISI analyst Amit Daryanani in a recent report. \"We think Apple's AI strategy will focus on incorporating on-device inference for language models that will substantially uplift the user experience for the iPhone. Given their vertical integration and especially their control over their own silicon, Apple seems best positioned to not only expand the moat surrounding the iOS ecosystem but also potentially drive an accelerated refresh cycle should the final implementation be deemed a big enough change.\" Also, Google recently stopped allowing users of its chatbot technology to generate images of humans. The move came after chatbot users produced pictures of Black Founding Fathers in American history and portrayed Nazis as people of color. Further, reports said the issues arose after Google attempted to train the AI software to consider diversity in responses. Google admitted to issues with \"inaccuracies in some historical depictions.\" Google Chief Executive Sundar Pichai said the chatbot's biased responses around race were \"unacceptable.\" Apple and Google already have ties. Alphabet pays Apple fees to make the Google internet search engine an option on iPhones. A ruling in the Justice Department's nonjury antitrust trial vs. Google is pending.  The government alleges Google maintains an internet search monopoly \"through exclusionary distribution agreements that steer billions of search queries to Google each day.\" Meanwhile, Google's payments to Apple are under scrutiny in the anti-trust lawsuit. As of March 15, Google stock had advanced only 1% in 2024. However, Google stock has clawed back near its 50-day moving average. Google stock is set to reclaim the 50-day line and clear Thursday's high of 143.59. That would offer an early entry into the stock, which has a 153.78 consolidation buy point. Apple stock has retreated 10% in 2024. In addition, the company hosts Google Cloud Next from April 9 to April 11. At the annual event for enterprise customers, Google is expected to make artificial intelligence announcements. If you're new to IBD, consider taking a look at its stock trading system and CAN SLIM basics. Recognizing chart patterns is one key to the investment guidelines. IBD offers a broad range of growth stock lists, such as Leaderboard. Follow Reinhardt Krause on X, formerly Twitter @reinhardtk_tech for updates on artificial intelligence, cybersecurity and cloud computing. YOU MAY ALSO LIKE: IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Learn How To Time The Market With IBD's ETF Market Strategy IBD Live: A New Tool For Daily Stock Market Analysis Want To Get Quick Profits And Avoid Big Losses? Try SwingTrader Market Rally Pauses Ahead Of Fed, Two Big AI Events 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be... 3/31/2024\nThe stock market impressed but Friday's inflation data was sticky.... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}