{
    "title": "Alphabet named a 'Best Idea' at Wedbush",
    "date": "3/22/2024",
    "url": "https://finance.yahoo.com/video/alphabet-named-best-idea-wedbush-194912436.html",
    "text": "Analysts at Wedbush Securities raised their price target on Alphabet (GOOGL, GOOG) to $175 from $160 and moved it to their \"Best Ideas List.\" Analyst Scott Devitt writes that he believes \"the perceived structural risks to Google Search are overstated,\" adding that he believes Google will benefit from AI. Yahoo Finance's Josh Lipton and Julie Hyman discuss the call in the video above. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich. JOSH LIPTON: Let's move on air. Time for calls of the day. We're going to start here with Wedbush lifting its target price on Google's parent company, Alphabet, to $175. That's up from $160. The firm also adding the tech giant to its best ideas list. So we've heard this-- it's interesting. We've heard this kind of skepticism about Google from some that they just aren't moving fast enough and smart enough when it comes to AI. And you've seen the stock kind of lag at least its mega-cap peers this year. But here comes the team at Wedbush, that's Scott Devitt and Dan Ives specifically, and they say Alphabet's a buy. In fact, they move it to their best ideas list. Bottom line, I think, here, they sum it up in their note. \"We believe the perceived structural risk to Google search are overstated and continue to view Alphabet as a net beneficiary of generative AI.\" JULIE HYMAN: You know, what's interesting about this note is, yes, the, sort of, market view does seem to be that there are risks. But we talked to another smart guy this week, Mark Mahaney over at Evercore ISI and he made very similar comments. Let's play for you what he said just a couple of days ago. [VIDEO PLAYBACK] MARK MAHANEY: I think this is actually going to lead to a material increase in the overall number of searches that people do with Google. That's a deeply concerning point of view now so that's why I think there's a little bit of an unnecessary overhang on Google. And that's one of the reasons why I made Google, for the first time in maybe two or three years, one of our top picks, actually supplanted Meta. [END PLAYBACK] JULIE HYMAN: Yeah, so interesting there. And it's sort of a similar case although the folks over at Wedbush, Devin and Ives, did a sort of side by side search using gen-AI-assisted search and just regular search to see how many ads came up in each situation. JOSH LIPTON: Yeah. JULIE HYMAN: So they did this big case study. And basically, they said, it was pretty similar. So they don't see a loss in ad revenue as a result of layering on this gen AI ability. JOSH LIPTON: Yeah, although as tech develops, you do wonder-- JULIE HYMAN: Sure. JOSH LIPTON: I mean, to the extent that-- the only thing I would question these bulls on is let's say search gets disrupted and Google-- listen, very smart group of engineers-- they move with that. Even so you just kind of wonder what the economics of search looks like going ahead. Is it still going to be that sort of high-margin business investors love? JULIE HYMAN: Yes, exactly. And so will that apples to apples comparison even make sense six months from now? We'll see. Related Quotes "
}