{
    "title": "McCullough: Tread Very Carefully On $GOOGL Right Now",
    "date": "1/31/2024",
    "url": "https://app.hedgeye.com/insights/145781-mccullough-tread-very-carefully-on-googl-right-now?type=stock-and-policy%2Chedgeye-tv",
    "text": "Continue Browsing © 2024 Hedgeye Risk Management LLC. The information contained herein is the property of Hedgeye, which reserves all rights thereto. Redistribution of any part of this information is prohibited without the express written consent of Hedgeye. Hedgeye is not responsible for any errors in or omissions to this information, or for any consequences that may result from the use of this information. Keith McCullough discussed key takeaways on Alphabet’s latest earnings report after the company reported ad revenue that missed analysts’ estimates. “The expectation for Google was that they’d show an acceleration—and they didn’t,” explains Hedgeye’s CEO in this clip from The Macro Show. “This company sells advertising. As you’re entering a recession, I would just plainly expect advertising revenue demand to slow. And it did.” “Now, you can replace that with whatever some bozo wants to tell you about their AI initiatives and believe that. At the top of the risk range, I don’t believe anything, and that’s where it’s coming from.” “This is a really interesting setup. Trend for Google is 143. The risk range is 139 to 153. So, there’s a rising probability that Google is going to break trend. That’s a meaningful callout. What would be the catalyst for it not to break trend? A reacceleration in advertising revenue growth. Because all they did on AI was increase capex growth.”Watch the full clip above.  By joining our email marketing list you agree to receive marketing emails from Hedgeye. You may unsubscribe at any time by clicking the unsubscribe link in one of the emails. © 2024 Hedgeye Risk Management LLC. The information contained herein is the property of Hedgeye, which reserves all rights thereto. Redistribution of any part of this information is prohibited without the express written consent of Hedgeye. Hedgeye is not responsible for any errors in or omissions to this information, or for any consequences that may result from the use of this information. Thank You! Your request has been received. You have been added to our\n\nMarket Brief. By joining our email marketing list you agree to receive marketing emails from Hedgeye. You may unsubscribe at any time by clicking the unsubscribe link in one of the emails.\nAll hedgeye products and services are subject to Hedgeye's Terms of Service available at\nwww.hedgeye.com//terms_of_service Thank You! Your request has been received. CONGRATULATIONS You're well on your way to becoming a better investor. Check your email & get started today! "
}