{
    "title": "Alphabet (GOOGL) Boosts Google Meet Offerings With \"Calls\" Tab",
    "date": "1/5/2024",
    "url": "https://www.zacks.com/stock/news/2206379/alphabet-googl-boosts-google-meet-offerings-with-calls-tab",
    "text": "We use cookies to understand how you use our site and to improve your experience. This includes personalizing content and advertising. To learn more, click here. By continuing to use our site, you accept our use of cookies, revised Privacy Policy and Terms of Service. New to Zacks? Get started here. Don't Know Your Password?  Don't Know Your Password?  You are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities. If you wish to go to ZacksTrade, click OK. If you do not, click Cancel. OK Cancel Image: Bigstock Zacks Equity Research\n                    January 05, 2024 KT Quick QuoteKT CAMT Quick QuoteCAMT GOOGL Quick QuoteGOOGL EVBG Quick QuoteEVBG Better trading starts here. You follow Analyst Blog - edit You follow Zacks Equity Research - edit Zacks Equity Research Analyst Blog Alphabet’s (GOOGL Quick QuoteGOOGL  -  Free Report)     Google has added a \"Calls\" tab to its Google Meet web app, integrating the meeting side with the traditional Duo direct dialing feature.The recent update comes with a navigation drawer that allows users to switch between \"Meetings\" and \"Calls.\"With this new feature, Google Meet now offers meeting and direct calling functionality on mobile, while the \"Meet (original)\" app remains with a video tab for meetings.Alphabet is expected to gain solid traction across various enterprises on the back of its latest move.  Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the addition of the Calls tab, Alphabet introduced an On-the-Go mode for Google Meet users on mobile, enhancing the meeting experience by detecting motion and prompting users to enable the mode.Another Google Meet update now allows Workspace users to make direct calls, allowing them to share meetings via calendar invite, chat, or email. This change allows users to place cloud-encrypted 1:1 video calls directly to colleagues, similar to personal users.Additionally, a recent Google Meet update now enables gesture detection to trigger a \"Raise hand\" button in the toolbar, allowing users to raise their hand for Q&A sessions and moderation.The company also rolled out portrait touch-ups on Google Meet, offering two subtle and smoothing options for users to enhance their appearance before or during meetings. These visual tweaks are designed to help users feel their best, especially after workouts, colds, or jetlag. Alphabet’s growing efforts to bolster its Google Meet capabilities will, in turn, boost its Workspace offerings.Notably, Alphabet unveiled Google Chat redesigns featuring Home, Direct messages, Spaces and Mentions in a pill-shaped container, replacing the bottom bar and \"New\" floating action button (FAB).Further, this home-screen redesign is gradually advancing to Android following the widespread release of the \"New\" FAB icon.Additionally, Alphabet’s introduction of a paid \"Proofread\" feature on Google Docs, powered by AI to replace current spelling and grammar checks, remains noteworthy.All these above-mentioned endeavors to strengthen Google Workspace offerings will, in turn, likely boost its Google Cloud segment, which has become an integral part of Alphabet’s overall growth. The company’s shares have gained 56.2% in the past year compared with the Zacks Computer & Technology sector’s growth of 47.6%.Moreover, the strengthening Google Cloud segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%. Currently, Alphabet carries a Zacks Rank #2 (Buy).Some other top-ranked stocks in the broader technology sector are Camtek (CAMT Quick QuoteCAMT  -  Free Report)    , KT (KT Quick QuoteKT  -  Free Report)     and Everbridge (EVBG Quick QuoteEVBG  -  Free Report)    , each carrying a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Camtek shares have returned 194.6% in the past year. The long-term earnings growth rate for CAMT is pegged at 12.26%.Shares of KT have declined 6.4% in the past year. The long-term earnings growth rate for KT is currently projected at 6.75%.Shares of Everbridge have lost 19.3% in the past year. The long-term earnings growth rate for EVBG is currently projected at 47.04%. KT Corporation (KT) - $25 value - yours FREE >> Camtek Ltd. (CAMT) - $25 value - yours FREE >> Alphabet Inc. (GOOGL) - $25 value - yours FREE >> Everbridge, Inc. (EVBG) - $25 value - yours FREE >> Our experts picked 7 Zacks Rank #1 Strong Buy stocks with the best chance to skyrocket within the next 30-90 days. Recent stocks from this report have soared up to +67.5% within 30 days - this month's picks could be even better. See our report's 7 new picks today - it's really free! Privacy Policy  |  No cost, no obligation to buy anything ever.Past performance is no guarantee of future results. This page has not been authorized, sponsored, or otherwise approved or endorsed by the companies represented herein. Each of the company logos represented herein are trademarks of Microsoft Corporation; Dow Jones & Company; Nasdaq, Inc.; Forbes Media, LLC; Investor's Business Daily, Inc.; and Morningstar, Inc. Copyright 2024 Zacks Investment Research | 10 S Riverside Plaza Suite #1600 | Chicago, IL 60606 At the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1988 it has more than doubled the S&P 500 with an average gain of +24.15%  per year. These returns cover a period from January 1, 1988 through March 4, 2024. Zacks Rank stock-rating system returns are computed monthly based on the beginning of the month and end of the month Zacks Rank stock prices plus any dividends received during that particular month. A simple, equally-weighted average return of all Zacks Rank stocks is calculated to determine the monthly return. The monthly returns are then compounded to arrive at the annual return. Only Zacks Rank stocks included in Zacks hypothetical portfolios at the beginning of each month are included in the return calculations. Zacks Ranks stocks can, and often do, change throughout the month. Certain Zacks Rank stocks for which no month-end price was available, pricing information was not collected, or for certain other reasons have been excluded from these return calculations. Zacks may license the Zacks Mutual Fund rating provided herein to third parties, including but not limited to the issuer. Visit Performance Disclosure for information about the performance numbers displayed above. Visit www.zacksdata.com to get our data and content for your mobile app or website. Real time prices by BATS. Delayed quotes by Sungard. NYSE and AMEX data is at least 20 minutes delayed. NASDAQ data is at least 15 minutes delayed. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. "
}