{
    "title": null,
    "date": "1/18/2024",
    "url": "https://www.technologyforyou.org/google-ceo-sundar-pichai-tells-employees-to-expect-more-job-cuts-this-year-report/",
    "text": "Google CEO Sundar Pichai told employees to expect more job cuts at the Alphabet-owned company this year, The Verge reported on Wednesday, citing an internal memo. Pichai said in the memo that the layoffs this year were focused on removing layers to simplify execution and drive velocity in some areas, according to the report. The move adds to signs that job cuts will continue this year, as companies look to adopt artificial intelligence software and automation to lighten workloads. “These role eliminations are not at the scale of last year’s reductions, and will not touch every team,” Pichai informed all employees in the memo. “We have ambitious goals, and will be investing in our big priorities this year.” A Google representative confirmed to Reuters that an email was sent to all employees, but refused to disclose further contents of the memo. Last week, Google said it would lay off several employees in its Voice Assistant units, hardware teams responsible for Pixel, Nest and Fitbit, advertising sales team, as well as in its augmented reality team. The layoffs at Google Assistant, first reported by news platform Semafor, are a part of organizational changes that have been in place since the second half of 2023, which included layoffs at the company’s mapping app Waze. A few hundred roles are being eliminated in the company’s Devices and Services team, with the majority in the 1P AR hardware team, the company said, confirming a report by tech media website 9to5Google, which first reported the reorganization. In January 2023, Alphabet announced plans to cut 12,000 jobs, or 6 percent, of its global workforce. As of September 2023, the company had 1,82,381 employees globally. © Thomson Reuters 2024 Source Link Save my name, email, and website in this browser for the next time I comment.  "
}