{
    "title": "New Google Layoff Hits Moonshot X Employees Amid Ongoing Restructuring",
    "date": "1/23/2024",
    "url": "https://www.techtimes.com/articles/300900/20240123/new-google-layoff-hits-moonshot-x-employees-amid-ongoing-restructuring.htm",
    "text": " Google's forward-thinking technology lab, X, is undergoing a transformative phase, strategically realigning its operations and implementing layoffs to pave the way for external funding. The lab, known for its audacious projects, is actively engaging with venture capitalists and other investors to secure financial backing. The goal is to establish a new operational model, enabling X's ventures to evolve into independent startups with support from both Alphabet and external investors. (Photo :  Pawel Czerwinski from Unsplash)As Google CEO Sundar Pichai recently said, more layoffs are expected to come this 2024. Just recently, Alphabet's secret research lab X has also experienced the same fate. In a bid to underscore lean teams, capital efficiency, and expanded collaboration with industry and financial partners, X is streamlining its workforce through targeted layoffs. The restructuring primarily affects support staff, aligning with X's vision of fostering efficiency and cross-industry collaboration. Related Article: Google CEO Sundar Pichai Tells Employees to Brace for More Cuts While X has been a trailblazer in tackling global challenges like climate change and connectivity, there's increasing pressure to translate speculative ventures into profitable endeavors, according to First Post. Furthermore, Alphabet's restructuring plan is aligned to its broader cost-cutting measures. X aims to reduce reliance on its parent firm when it comes to financial support, not to mention its push for external funding. X is actively exploring diverse funding sources, including venture capital, family offices, sovereign wealth funds, private equity firms, and strategic investors. This marks a departure from its historical reliance solely on Alphabet for financial backing. Past attempts to raise external capital faced obstacles within Alphabet's leadership, but the current shift indicates a renewed effort to diversify funding avenues. In the same report, Google sees that an increased flexibility in fulfilling its ambitious projects will happen with the strategic restructuring for X. Again, the layoffs are here to stay and it's evident to continue for the next months to come. \"We're expanding our approach to focus on spinning out more projects as independent companies funded through market-based capital,\" X CEO Eric Teller told staff via email obtained by Bloomberg. Alphabet, the parent company of X, has been actively streamlining its operations to reduce costs. In recent months, Google, an Alphabet subsidiary, implemented significant job cuts, particularly in hardware and engineering teams. The company is intensifying its focus on artificial intelligence, aligning with broader industry trends. Despite the restructuring, X's Captain of Moonshots, Astro Teller, emphasizes the continued commitment to inventing breakthrough technologies. Teller underscores the importance of addressing pressing global challenges through audacious moonshots, stating, \"Because the world needs moonshots more now than ever.\" Concurrently, X's restructuring aligns with broader leadership changes at Alphabet, with Ruth Porat, the Chief Financial Officer, taking on a new role as president and chief investment officer. In her expanded role, Porat will oversee divisions, including X, signaling a holistic approach to Alphabet's strategic evolution. As CEO Sundar Pichai warned, several rounds of Google layoffs will arrive this year. According to the tech boss, this is in line with the company's key goals in 2024 which is the \"durable cost savings.\" Earlier this month, Google cut jobs in its workforce, particularly those employees working in the engineering, voice assistance, and hardware development divisions. Read Also: Former Google Employees Post their 'Layoff Stories' on TikTok  Sign up for our free newsletter for the Latest coverage!   "
}