{
    "title": "Alphabet (GOOGL) Boosts Chromebook Features With ChromeOS 120",
    "date": "1/8/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-boosts-chromebook-features-144300654.html",
    "text": "Alphabet GOOGL is leaving no stone unturned to enhance its Chromebook offerings on the back of feature updates.In this regard, the company launched ChromeOS 120 and announced several feature updates for Chromebooks, which are coming soon.Notably, ChromeOS 120 features a Virtual Desk Button in the ChromeOS Shelf, allowing quick switch between desks and creating new ones.Meanwhile, the Nearby Share Self-Share feature allows transfers between devices logged into the same Google Account, even when the Chromebook's screen is off. It displays app details, installation methods, storage and versioning information.Additionally, the new \"Mouse\" settings allow control of cursor speed, scrolling speed, and scroll acceleration and enable the right-click combination using alt + click, launcher + click, or Disabled.Also, the \"Customize keyboard keys\" page allows users to select shortcuts for various actions, including delete, page down/up, end, home and insert, and enable F11 and F12 via predefined key combos.Alphabet is expected to gain solid traction among Chromebook users on the back of the latest move. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from ChromeOS 120, Google recently introduced ChromeOS 117, featuring Material You and usability improvements. The update includes rounded rectangles, smaller cards for Wi-Fi, Bluetooth and notifications, a volume slider, a Live Caption button, brightness, and more.Alphabet also offers Chromebook owners and IT admins the option to extend automatic updates for ten years and extend battery health with adaptive charging, staying at 80% before power disconnection.The company also partnered with policymakers and data-privacy regulators to bring new features including data processor mode, data controls, and camera and mic toggles on Chromebook, enabling privacy-focused education services.All the above-mentioned Chromebook advancements will, in turn, aid Alphabet to strengthen its Google Services segment, which has been the key growth driver of the company. Alphabet’s shares have gained 54.2% in the past year compared with the Zacks Computer & Technology sector’s growth of 45.1%.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, indicating year-over-year growth of 15.6%. The estimate has been revised upward by 0.7% in the past 30 days. Alphabet's growing Chromebook updates are expected to strengthen its competitive edge against rivals like Apple AAPL and Microsoft MSFT, which are also making strong efforts to enhance their notebook and laptop offerings.Apple introduced M3, M3 Pro and M3 Max, three personal computer chips featuring advanced 3-nanometer process technology, enhancing performance and capabilities for Mac, showcasing Apple's significant advancements since the M1 family's debut.Apple also unveiled the macOS Sonoma update for compatible Macs, which features several improvements over its predecessor, Venture. This free software update brings new features like desktop widgets, screen savers, video conferencing, Safari and optimized gaming, enhancing the Mac experience.Meanwhile, Microsoft unveiled the Surface Laptop Go 3, a 2-in-1 portable laptop featuring a 12th-Gen Alder Lake mobile architecture for efficient multi-tasking, running on the Intel Core i5-1235U with 10 cores and 12 threads configuration.Microsoft’s launch of Surface Laptop Studio 2, the first Microsoft laptop with a dedicated VPU AI accelerator, offering Windows 11 Copilot functionality, expanded port selection and high battery life, remains noteworthy. Currently, Alphabet carries a Zacks Rank #2 (Buy).Another top-ranked stock in the broader technology sector is Camtek CAMT, sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Camtek shares have returned 182.3% over the past year. The long-term earnings growth rate for CAMT is pegged at 12.26%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Camtek Ltd. (CAMT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}