{
    "title": "Apple's $85B Services Business In Crosshairs Of Legal And Regulatory \nRulings - Alphabet (NASDAQ:GOOG), Ap",
    "date": "1/3/2024",
    "url": "https://www.benzinga.com/government/24/01/36463729/apples-85b-services-business-in-crosshairs-of-legal-and-regulatory-rulings",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW The services business of Apple Inc. AAPL, bringing in $85 billion annually, is bracing for potential impacts from a succession of legal and regulatory rulings expected in 2024. What Happened: According to the Financial Times, a U.S. antitrust trial against Alphabet Inc.-owned GOOGL GOOG Google could pose the most significant threat to Apple’s business. It was unveiled during the trial that Google had paid more than $26 billion in 2021 to be the default search engine on Apple devices and other platforms. If Google loses the case, this revenue stream, which constitutes around a quarter of Apple’s services arm income, could disappear. Additionally, the Biden administration’s increased scrutiny over the dominance of Apple and other tech giants in the App Store has already resulted in mandatory changes in the European Union aimed at reducing the power of Big Tech. These ongoing legal and regulatory actions in two of Apple’s largest markets represent the most severe threat to the firm’s business in years. The services arm, which includes revenue from the App Store, video streaming, and Apple Music, has become an increasingly significant portion of Apple’s overall revenues. See Also: Semiconductor Stocks Tumble, Wiping Out $100 Billion Amid US-China Trade Tensions: Rocky Start To 2024 The result of the Google trial, considered the most important antitrust monopoly trial in over 25 years, will be revealed in May. A loss for Google could trigger an appeal and raise concerns about the future relationship between the two tech giants. Furthermore, Apple is gearing up for changes in the EU due to the new Digital Markets Act, which necessitates legal compliance from tech companies by March. In response, Apple plans to allow “sideloading”, enabling iPhone users to download apps from outside its store for the first time. Why It Matters: Apple’s monetary gain from Google’s search revenue was disclosed during the ongoing antitrust trial in Washington that started in November. Apple was found to be receiving 36% of Alphabet's search revenue made via the Safari browser. In December 2023, the Department of Justice’s antitrust lawyers began examining Apple over its actions to block Beeper, an app that enabled Android users to access iMessage. Also, in the same month, Apple proposed to allow competitors access to its tap-and-go mobile payment technology in the EU, potentially addressing EU antitrust charges and avoiding a hefty fine. Read Next: Dutch Chip Equipment Maker ASML Halts Planned Exports To China Following US Administration’s Influence Photo via Shutterstock Engineered by\n        Benzinga Neuro, Edited by\n        \n\n              Ramakrishnan M The GPT-4-based Benzinga Neuro content generation system exploits the\n        extensive Benzinga Ecosystem, including native data, APIs, and more to\n        create comprehensive and timely stories for you.\n        Learn more. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}