{
    "title": "Google stock is the 'riskiest' among its large-cap internet peers: Mark \nMahaney",
    "date": "1/19/2024",
    "url": "https://www.investorsobserver.com/news/qm-news/6130444606404711",
    "text": "Google stock is the ‘riskiest’ among its large-cap internet peers: Mark Mahaney\n\n  2024-01-19 11:13:06 ET\n \n\n\n\n\n\n   Alphabet Inc (NASDAQ: GOOGL) is the riskiest stock among its large-cap internet peers, says Mark Mahaney. He’s a senior analyst at Evercore ISI.\n  \n\n   Investors want cost discipline out of Google\n  \n\n   Mahaney is “cautious” on Google stock primarily because of the “cost issue”.\n  \n\n   Note that the tech behemoth has already warned of more layoffs this year as Invezz reported\n   \n    here\n   \n   . That’s on top of well over 10,000 employees that it let go in 2023.\n  \n\n   Still, the Evercore analyst is convinced that investors won’t “see enough out of Google” in terms of “cost discipline” in 2024.\n  \n\n   Alphabet Inc is scheduled to report its financial results for the fourth quarter in the first week of February. Consensus is for it to earn $1.62 a share versus $1.05 per share a year ago.\n  \n\n   Watch here: https://www.youtube.com/embed/lm-LIGtUtmQ?feature=oembed\n  \n\n   Why else is Mahaney cautious on Google stock?\n  \n\n   Google typically sees a sequential decline in its operating margin in the fourth quarter.\n  \n\n   Mahaney attributed that trend partially to the NFL Sunday Ticket that he said tends to be materially dilutive to search. On CNBC’s “\n   \n    Squawk Box\n   \n   ”, the Evercore analyst added on Friday:\n  \n\n\n    Alphabet could address all this on its earnings call and talk about how they’re going to manage expenses better going forward. But they have never really done that.\n   \n\n\n   Nonetheless, Mahaney has an outperform rating on Google stock with a $160 price target that suggests about a 10% upside from here. But other mega-cap names in the internet space like Meta Platforms Inc and Amazon.com Inc are better buys than $GOOGL, Mahaney concluded.\n  \n\n\n\n\n      Meta Platforms'\n      \n       $META\n      \n      Zuckerberg hints company is spending billions on NVIDIA\n      \n       $NVDA\n      \n\n       #AI\n      \n      chips\n      \n       https://t.co/XpRZGSc0pF\n      \n\n       pic.twitter.com/mJ48CD98Wn\n      \n\n     — Streetinsider.com (@Street_Insider)\n     \n      January 19, 2024\n     \n\n\n\n\n\n   The post\n   \n    Google stock is the 'riskiest' among its large-cap internet peers: Mark Mahaney\n   \n   appeared first on\n   \n    Invezz\n   \n\n\nInvezzJanuary 19, 2024 - 8:13 AM PSTNews by QuoteMediawww.quotemedia.com 2024-01-19 11:13:06 ET Alphabet Inc (NASDAQ: GOOGL) is the riskiest stock among its large-cap internet peers, says Mark Mahaney. He’s a senior analyst at Evercore ISI. Mahaney is “cautious” on Google stock primarily because of the “cost issue”. Note that the tech behemoth has already warned of more layoffs this year as Invezz reported\n   \n    here\n   \n   . That’s on top of well over 10,000 employees that it let go in 2023. Still, the Evercore analyst is convinced that investors won’t “see enough out of Google” in terms of “cost discipline” in 2024. Alphabet Inc is scheduled to report its financial results for the fourth quarter in the first week of February. Consensus is for it to earn $1.62 a share versus $1.05 per share a year ago. Google typically sees a sequential decline in its operating margin in the fourth quarter. Mahaney attributed that trend partially to the NFL Sunday Ticket that he said tends to be materially dilutive to search. On CNBC’s “\n   \n    Squawk Box\n   \n   ”, the Evercore analyst added on Friday: Alphabet could address all this on its earnings call and talk about how they’re going to manage expenses better going forward. But they have never really done that. Nonetheless, Mahaney has an outperform rating on Google stock with a $160 price target that suggests about a 10% upside from here. But other mega-cap names in the internet space like Meta Platforms Inc and Amazon.com Inc are better buys than $GOOGL, Mahaney concluded. Meta Platforms'\n      \n       $META\n      \n      Zuckerberg hints company is spending billions on NVIDIA\n      \n       $NVDA\n      \n\n       #AI\n      \n      chips\n      \n       https://t.co/XpRZGSc0pF\n      \n\n       pic.twitter.com/mJ48CD98Wn The post\n   \n    Google stock is the 'riskiest' among its large-cap internet peers: Mark Mahaney\n   \n   appeared first on\n   \n    Invezz Subscribe to our daily morning update newsletter and never miss out on the need-to-know market news, movements, and more. Thank you for signing up! You're all set to receive the Morning Update newsletter Stock Price data may be delayed up to 15 minutes. Copyright © 2024. Portions of this content may be copyrighted by Fresh Brewed Media, Investors Observer, and/or O2 Media LLC. All Rights Reserved. Portions of this content protected by US Patent numbers 7,865,496, 7,856,390, and 7,716,116. Investing in stocks, bonds, option and other financial instruments involve risks and may not be suitable for everyone. Portfolio results are unaudited and based on varying investment expiration dates. Terms of Service | Privacy Policy "
}