{
    "title": null,
    "date": "1/12/2024",
    "url": "https://investorplace.com/2024/01/alphabet-forecast-3-reasons-to-be-bullish-on-goog-stock-in-2024/",
    "text": " Here are three of many reasons why this tech giant is worth buying right now Advertisement Source: IgorGolovniov / Shutterstock.com Alphabet’s (NASDAQ:GOOG, NASDAQ:GOOGL) Google Cloud, a burgeoning cloud-infrastructure segment, is poised for substantial growth with the integration of key AI services. The integration of generative AI search experiences not only enhances search revenue but also paves the way for diverse ad formats and placements, driving bid optimization for increased revenues. This will have important implications for GOOG stock holders. The company saw a significant portion of its Q3 2023 revenue, over 10%, attributed to Google Cloud, outpacing ad revenue growth. The company, valued at over $1 trillion, marked an 11% year-over-year revenue increase, with shares up 58% in the past year and 168% in the last five years. Alphabet maintains a robust balance sheet, boasting $176.3 billion in total current assets versus $86.3 billion in total current liabilities. But there’s more to the numbers why this stock is a must-buy this 2024. Alphabet’s digital biotech firm, Isomorphic Labs, secured partnerships with Eli Lilly and Novartis. Leveraging its AI platform, Isomorphic aims to enhance drug discovery for undisclosed targets, utilizing computational techniques to address scientific challenges in biology, chemistry, and medical research. In collaboration with Lilly, Isomorphic Labs earned $45 million upfront and potential milestones of up to $1.7 billion, along with royalties. A similar agreement with Novartis included $37.5 million upfront, potential $1.2 billion milestones, and royalties. The partnerships aim to address undisclosed conditions through Isomorphic’s AI approach, focusing on three targets. Novartis will sponsor select research expenses of the Alphabet company, per the Sunday release. These collaborations with Lilly and Novartis align with the upcoming J.P. Morgan Healthcare Conference, signaling an active year in biopharma, following PwC’s forecast of robust dealmaking and increased investor interest in precision medicine, oncology, immunology, cardiovascular diseases, and weight loss. The report also predicts a modest rise in initial public offerings, particularly for promising start-ups with strong clinical data. Beyond AI, investors find optimism in other aspects. Advertising revenue, constituting 78% of Alphabet’s Q3 2023 revenue, rose by 9% year over year, signaling a awaited market recovery. Additionally, Google Cloud, the company’s leading non-advertising segment, achieved a 22% year-over-year revenue growth in Q3. As of Q2 2023, it holds the third-largest market share (11%) among cloud infrastructure providers. GOOG stock holds businesses beyond Google Cloud, like Verily Life Sciences and self-driving car company Waymo, not individually detailed in financials. These ventures provide potential revenue streams and synergies with AI initiatives, emphasizing the importance of sustaining a technological advantage. Alphabet maximized its AI potential with significant software advancements in 2023, introducing Bard, expanding Google Cloud’s AI tools, and unveiling Gemini. The company’s widespread user base, driven by popular brands like Android and YouTube, fuels its lucrative digital advertising business, constituting about 25% of the $740 billion market. In March 2023, Alphabet entered the AI arena with Bard and continued to invest in upgrades. The late 2023 release of Gemini Pro bolstered Bard’s capabilities, narrowing the gap with ChatGPT. Alphabet’s upcoming launch of Gemini Ultra in early 2024 positions it as a potential leader in generative AI technology. Alphabet’s robust stock performance and substantial AI investment position it strongly. With Google Chrome as the preferred browser for over 60% of users, Alphabet has a prime data source for training Bard AI. Predicted 2024 revenue of $340.61 billion adds to its potential as a frontrunner in the AI stock competition. Despite the unexpected release of ChatGPT, Alphabet’s overall market position, cash reserves, and valuation make it a compelling investment. The launch of Gemini reaffirms its commitment to being an AI-first company. Other segments, including the vital ad business and Google Cloud, are displaying signs of recovery. With substantial liquidity and an attractive valuation, GOOG stock remains an appealing option for investors. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. Technology Growth Stocks   Article printed from InvestorPlace Media, https://investorplace.com/2024/01/alphabet-forecast-3-reasons-to-be-bullish-on-goog-stock-in-2024/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}