{
    "title": "Google Is Feeling Like Any Old Business, and It Won't Be Easy to Pivot",
    "date": "2/29/2024",
    "url": "https://www.businessinsider.com/google-losing-cool-factor-popularity-silicon-valley-comeback-2024-2",
    "text": "       Happy Leap Day! It might be frustrating for some of you to wait an extra day for your paycheck, but there's a legitimate reason we do this every four years. In today's big story, we're looking at how Google has gone from the tech industry's vanguard of cool to just another boring company. What's on deck: Markets: Consumers fended off a recession — but keep spending like there's no tomorrow. Tech: Snowflake's CEO is retiring, effective immediately. Business: Toyota was right about hybrid cars. But first, the unbearable weight of staying cool. If this was forwarded to you, sign up here. Coolness is fickle. You're all anyone can talk about until suddenly you're not. (Just ask skinny jeans.) Tech trends move particularly fast. A startup that catches investors' eyes can quickly be labeled the next big thing. Google has long stayed atop Silicon Valley's volatile popularity contest — but the best place to work in tech is starting to feel like any other business, Business Insider's Hugh Langley and Lara O'Reilly write. Bureaucracy, an aversion to risk, and deference to Wall Street over employees — things Google long eschewed — have become the norm. The latest example is the debacle surrounding Gemini — its flashy new AI model that faced backlash for being too \"woke.\" Instead of Google's latest product becoming the new standard, it's being lambasted. (Although BI's Alistair Barr has a breakdown of a wild theory making the rounds that Google intentionally sabotaged Gemini to slow generative AI adoption.) The uproar over Gemini has gotten so loud that Google CEO Sundar Pichai ended up weighing in. He addressed the criticism in a note to employees that acknowledged the tech giant had \"got it wrong.\" \"It's a PR nightmare for the company,\" a current senior employee told Hugh and Lara of the latest drama. \"Googlers are pissed.\" Google's issues could just be the natural maturation of a tech company. Meta rebounded from its metaverse mess with a cost-cutting \"year of efficiency\" that has delighted investors, while Big Tech elder statesman Microsoft's valuation has rebounded thanks to its tie-up with OpenAI. But it might be tougher for Google to stage a comeback. The Gemini incident has led some critics to question if the company's culture is overly influenced by left-leaning workers, BI's Peter Kafka writes. And even as Google works to address the issues, it's playing a game of whack-a-mole since AI models are a bit of a black box. Corporations' favorite fix-all is a rising stock price, but here, too, there are problems. Disappointing revenue numbers for Google's search business in the fourth quarter have dragged on shares. The Magnificent 7 member is lagging behind some of its high-flying peers, with its stock down roughly 1.5% year-to-date. Still, this is Google. For all the headwinds it's facing, the tech giant's $1.7 trillion market cap dwarfs most countries' GDP. But no matter how Google decides to push forward, the magic factory that once defined Silicon Valley culture now faces the prospect of a radical realignment. Investors' evaluation of hedge funds has been upended. The rise of multi-manager hedge funds means there's a new due diligence model for those looking to invest in them. Evaluation of funds has switched to looking at the C-suite and how they manage expenses instead of top money makers. Consumers can't shore up the economy forever. Resilient spending has helped stave off a recession — but financial pressures are mounting. Top economists like David Rosenberg and Gary Shilling are warning of a looming slowdown that could drag on growth. Nvidia execs cash in. The chipmaker's directors bagged $80 million offloading shares last week, according to SEC filings. The selling spree came after a blowout earnings report powered Nvidia's stock price to a new all-time high. TikTok is trying to make photos cool. Amid a fight with Universal Music Group — which has required TikTok to take down Universal-owned songs — TikTok is telling creators to focus on photo slideshows. Klarna's AI assistant is doing the work of 700 employees. In a blog post, the fintech said its OpenAI-powered assistant had engaged in 2.3 million conversations since launching. The company's statement comes after it stopped hiring human workers, apart from engineers, late last year. Snowflake's Frank Slootman is retiring. The cloud software company's shares tumbled 23% in after-hours trading on Wednesday after it said its CEO would stand down, effective immediately. When BI asked Slootman if he was about to retire eight months ago, he said we were \"wrong on all counts\" and \"regurgitating competitive FUD.\" Toyota was right about hybrid cars. Toyota's slow and steady approach to hybrid vehicles is paying off. As its competitors poured money into — and in Apple's case, ultimately abandoned — their plans for EVs, Toyota's measured approach could mean it comes out on top. Boxabl welcomes new investors. The tiny-home builder has struggled to establish a profitable business model and could run out of funds by the end of the year. As it invites new investors in, its founders are planning to cash out $10 million. Elon Musk says the revamped Roadster will blow your mind. The world's richest man said on X Wednesday that Tesla has overhauled the design of its long-delayed sports car. The company aims to ship the second-generation EV in 2025, he added in a follow-up post. Joe Biden might end up missing Mitch McConnell. Hackers threaten to release Trump documents from Georgia case if they don't get a ransom by Thursday. Secret military files reveal when Russia would consider using nuclear weapons, including the destruction of 20% of its ballistic missile submarines: FT. Bitcoin soars past $60,000 for the first time since November 2021. Sam Bankman-Fried is dispensing crypto investment tips to Brooklyn prison guards: NYT. PlayStation is laying off 900 people globally — read the full email employees received about it. From a 20% AI-fueled stock surge to tumbling market cap for Apple, here are UBS's biggest surprises for 2024. The FTC is going to war with tax services that bill themselves as free. Kate Middleton hasn't been seen in public since last year. Now, social media users are suspicious. Richard Lewis, 'Curb Your Enthusiasm' star and comedian, dead at 76. Today's earnings: Best Buy, Hewlett Packard, and other companies are reporting. The Insider Today team: Dan DeFrancesco, deputy editor and anchor, in New York. Hallam Bullock, editor, in London. Jordan Parker Erb, editor, in New York. Jump to "
}