{
    "title": "Google: Q4 Earnings And Valuation Make It A No-Brainer Buy (NASDAQ:GOOGL)",
    "date": "2/7/2024",
    "url": "https://seekingalpha.com/article/4668410-google-stock-q4-earnings-and-valuation-make-brainer-buy",
    "text": "pcess609  pcess609 Dear readers, Alphabet Inc. (NASDAQ:GOOGL) is the cheapest stock out of the Magnificent 7 on a trailing 12-months as well as forward basis. Currently the stock trades at a forward P/E of 24.8x. That puts GOOGL ahead of its nearest competitor in the group - Meta Platforms (META) which trades at 26.1x forward earnings, as well as Apple Inc. (AAPL) which trades at 28.2x. Seeking Alpha Seeking Alpha While valuation by itself doesn't make a good investment, I believe that GOOGL represents the best value of the Magnificent 7. Here's why. In terms of historical revenue growth, the company has recorded 5.3% this year, with a 5-year CAGR of 18%. That puts GOOGL ahead of AAPL and Microsoft (MSFT), and in line with META. On a forward basis, consensus currently calls for 9.7% revenue growth next year, which is ahead of META's 8.5% and miles ahead of AAPL's 2.1%. Seeking Alpha Seeking Alpha And EPS are expected to rise even faster with GOOGL's consensus growth of around 15% per year for the next three years as a result of (1) growing ad revenue in their legacy search and network business, (2) improving operating margins thanks to the many initiatives taken recently (more on this later), (3) rapid AI market growth driving cloud revenue much higher and (4) a reduced share count thanks to an aggressive share repurchase program. My point here is that although GOOGL is the cheapest of the group, its growth prospects are far from worst. As a result, its PEG ratio of 1.4x, which is a good measure of how much we pay for growth, is second best only to NVIDIA (NVDA), suggesting that the stock is well priced. Sure, there's currently a cloud hovering above Google because the market worries that they may be losing the AI battle to Microsoft and ChatGPT and that AI applications may lead to a decline in Google search usage. Moreover, the company has faced a number of high ticket lawsuits, most recently a $5 Billion lawsuit for tracking users in private mode. But I'd argue that the best time to invest in a stock is not when all lights are shining at it, but rather when investors are, at least to an extent, fearful. Just 10 years ago in 2013, Microsoft was the underdog in the group, largely under-appreciated and trading at a P/E of 14x, while Google was trading at 25x. Since then, Microsoft has outperformed Google by a big margin. Data by YCharts The lesson to be learned, I believe, is to look past the headlines and invest in healthy companies that are currently somewhat under appreciated. And out of the Mag 7, I believe Google is most under-appreciated right now. GOOGL released their Q4 2023 earnings on January 30 and posted earnings as well as revenue beats. Seeking Alpha Seeking Alpha Google beat expectations in the fourth quarter with EPS of $1.64 (vs consensus of $1.60) and Revenue of $86.31 Billion (vs consensus of $85.28). These results came in as a result of full year 10% revenue growth and were driven by high 16% YoY growth in Ad revenues and 13% YoY growth in Search. The Cloud business continued to be the fastest growing segment at 26% YoY with revenues nearing $10 Billion. I also want to point out that 2023 is the year in which the cloud business turned profitable with a margin of 9% and about $900 Million in operating income. Notably, revenue growth in all segments (YouTube, Search, and Cloud) has accelerated relative to Q4. Below I list four reasons why I think GOOGL is a BUY at the current valuation. Google needs little introduction. The company dominates search with a 92% market share worldwide. It owns YouTube which is one of the largest social media platforms in the world and has nearly 3 Billion active users. And it runs Google Cloud which is the third biggest cloud provider with an 11% share of this growing market and is the provider of choice for 60% of the world's biggest 1,000 companies. Ad revenue from Search and YouTube make Google the cash cow that it is with $78 Billion in free cash flow over the past 12 months (a 4.4% FCF yield). Such high FCF has enabled the company to accumulate a vast $120 Billion cash position, which is very advantageous in the current high interest rate environment, because it earns a high interest of nearly 5%. Moreover, their presence in Cloud allows for faster growth and directly benefits from growth of AI. Carbon Finance Carbon Finance Ad revenue from Search and YouTube continues to account for the bulk of Google's revenue. And Search revenue growth continued to accelerate in Q4 and reached 13% YoY, up from 11.3%, 4.8% and 1.9% in Q3, Q2, and Q1, respectively. This acceleration was largely driven by strong performance in retail ads. YouTube ad revenues saw an equally impressive quarter with 12% YoY revenue growth, driven by brand advertising and direct response. Going forward, ad revenues are expected to grow by about 10% per year, driven indirectly by consumer spending (the more consumer buy, the more businesses spend on marketing). Unsurprisingly, the biggest risk is therefore an economic slowdown or a recession which would result in a temporary reduction in ad spending. So far, however, GDP growth remains strong at 4.9% in Q3 2023 and is expected above 2% in 2024, according to Goldman Sachs (GS). Moreover, with a strong labor market and record low unemployment, the consumer has yet to weaken, which adds to the likelihood of strong earnings going forward. Therefore, I expect Ad revenues to hit or surpass expectations in 2024, unless the economy falls into a recession. I like Google, because they have a stable part to their business, i.e. the ad business described above, but are also present in a rapidly growing AI/cloud space. And while some claim that Google failed to get involved in AI early enough and is now behind, I disagree. Google was actually the first big tech stock to make an AI start up acquisition when in 2014 Google acquired DeepMind for more than half a Billion. They have been working on incorporating AI into search and other parts of their business for a decade and although the market has ridiculed their chatbot Bard last year for making basic mistakes, the race is far from lost in my opinion. Currently, Google's cloud business accounts for only about 10% of total revenues but is very promising thanks to its high growth rate. During the latest quarter revenue has increased by 22% YoY and there could be even more growth going forward. In particular, the AI market is expected to grow by a 38% CAGR from just over $250 Billion this year to $1.75 Trillion by the end of the decade. Consequently, any player that can at least maintain market share is set to see their revenues rise rapidly. Chart: AI market size (in Millions) Statista Statista And all major hyper-scalers (MSFT, AMZN, GOOGL) are very well positioned to at least maintain their market share. I like hyper-scalers much more than data centers, which I've covered extensively. The reason is that data center REITs are at a very disadvantageous place in the AI value chain, where on one side, a lot of value gets extracted by high-margin chip-makers and on the other side by AI application providers. Data center REITs are right in the middle, getting squeezed from both sides and therefore their margins are slim. At the same time, they are responsible for paying the entire maintenance CAPEX bill, which is quite expensive as new technology emerges often. Hyper-scalers tend to leave the capital-heavy business of owning the data center infrastructure to REITs and focus on their AI applications which scale much faster. Therefore, I believe that investing in hyper-scalers is one of the best ways to play AI right now. And Google is the cheapest of the group. But frankly, the ride may not be smooth. While the Cloud business is already profitable, it remains to be seen whether it stays that way. In particular, there are two risks worth considering. First, the cloud space is very competitive and it's likely that Google will have to compete on price if it wants to gain market share from its two biggest competitors MSFT's Azure and Amazon's (AMZN) AWS. Moreover, in an effort to develop their own search related AI application similar to ChatGPT, Google risks cannibalizing their own search revenues. Personally, I believe that both of these risks will be overshadowed by the exponential growth of the market as a whole and therefore shouldn't jeopardize Google's growth. Over the medium-term though, I fully expect Google to hit their 15% EPS growth forecast. It also helps that the analysts whose consensus we're looking at have a 100% hit rate of either a hit or a beat in EPS. FAST Graphs FAST Graphs Google essentially has a monopoly on search which allows for very high margins, even after spending exuberantly on R&D and M&A. Over the most recent quarter, their operating margin declined slightly from 29.3% to 27.8%, but remains above 2022 levels and one of the highest ever, except for the exceptional year 2021. Main Street Data Main Street Data Notably, Google has also been actively working towards improving their margins by: Google doesn't pay dividends, but it returns a ton of money to shareholders through their share repurchase program. In 2022, the company spend $60 Billion on repurchases, more than any other company except for AAPL. And in 2023, $61.5 Billion was spent (89% of free cash flow), reducing the share count by about 4%. Main Street Data Main Street Data Going forward, I fully expect Google to continue with their aggressive share repurchase program, reducing the number of shares by about 3-4% each year. Google is a quality growth stock with a superb balance sheet which is expected to grow earnings by 15% per year. Therefore, it's unsurprisingly not cheap. The company has a legacy cash cow ad business and has a long growth runway in their cloud business. Although Google seems to be behind on AI compared to peers, I believe the race is far from lost as they have been working on AI for the past decade. Moreover, history suggests that buying the underdog in the group may pay off over the longer-term. At 24.8x forward earnings I view Google's valuation as reasonable and expect annual returns of 15%+ driven by strong earnings growth and share buybacks. A further potential catalyst may be an introduction of a dividend. On the other hand, a recession could lead to a decrease in ad revenue and hurt the stock. All things considered, I rate Google a BUY here at $142 per share. If you want to access my entire Portfolio and all my current Top Picks, feel free to join ‘High Yield Landlord’ for a 2-week free trial. We are the largest and best-rated community of real estate investors on Seeking Alpha with 2,500+ members on board and a 4.9/5 rating from 500+ reviews:  You won't be charged a penny during the free trial, so you have nothing to lose and everything to gain. Start Your 2-Week Free Trial Today!  This article was written by David Ksir has extensive private equity experience in finance and European real estate. He manages a small 8-figure family office focused on generating reliable dividend income through value investing. David also contributes to the High Yield Landlord which is led by Jussi Askola and has a team of 5 other top Seeking Alpha REIT and income analysts. They help investors become passive landlords with their 8% yielding real estate portfolio. Service features include: three portfolios (core, retirement, international), community through chat room, buy/sell alerts, and educational content. Disclosure: I am associated with another SA contributor Deep Value Explorer. Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}