{
    "title": "Google not shutting down Gmail",
    "date": "2/27/2024",
    "url": "https://nairametrics.com/2024/02/23/google-not-shutting-down-gmail/",
    "text": "Google is not shutting down Gmail, as the email platform asserted, “Gmail is here to stay,” in response to a viral hoax tweet claiming the platform would halt its email feature. Additionally, the tech giant, under its parent company Alphabet, did not officially issue any statements announcing the purported “Gmail shutdown” on its website or through any press release statements for its 1.8 billion users. A screenshot circulating on social media platforms alleged that Google plans to phase out Gmail entirely by the end of this year, suggesting the service would no longer support email functions starting August 1. The screenshot, gaining over 1 million views across various accounts, claimed that Gmail would cease facilitating the sending, receiving, or storing of emails.   This statement, which carried with the company’s logo, surfaced shortly after Google announced the suspension of its text-to-image AI tool Gemini. Bakke jokingly stated that he was instructed by Google CEO Sundar Pichai to terminate the company’s Gemini team but mistakenly fired the entire Gmail team. In the aftermath of the rumored Gmail shutdown, Alphabet, Google’s parent company, witnessed a more than 1% increase in shares, concluding at $145.32. Furthermore, Larry Page and Sergey Brin saw a boost in their net worth, with an addition of $1.18 billion and $2.49 billion, respectively, by the close of Thursday’s market trade. Both billionaire founders, controlling approximately 51.4% of the company through class B shares, now boast a combined net worth of $256 billion. Google was founded in 1998 by both Page and Brin. With Brin, Page invented Google’s PageRank algorithm, which powers the search engine. Page was CEO until 2001, when Eric Schmidt took over, and then from 2011 until 2015, when he became CEO of Google’s new parent firm Alphabet. Since its launch in April 2004, Gmail has held a significant position in the email industry, contending with competitors like Yahoo and AOL. Last year, Google disclosed plans for the gradual phase-out of Gmail’s HTML version, commencing in January. The HTML view aims to provide users with quicker load times and enhanced connectivity, particularly beneficial on slower internet connections. Deborah Dan-Awoh is a seasoned lifestyle analyst with a knack for storytelling. The focus of her work covers people, money and culture as it relates with business and economy.\r\nWhen she's not keeping tabs on the latest trends in lifestyle and finance- Deborah enjoys networking with industry experts to gain insight into major markets as it affects the populace Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ       Business News | Stock Market | Money Market | Cryptos | Financial Literacy | SME | Follow us on social media: © 2024 Nairametrics Login to your account below   Remember Me  Fill the forms below to register    Please enter your username or email address to reset your password.   © 2024 Nairametrics "
}