{
    "title": "Nvidia Worth More Than Alphabet, Amazon",
    "date": "2/23/2024",
    "url": "https://247wallst.com/technology-3/2024/02/23/nvidia-worth-more-than-alphabet-amazon/",
    "text": "After blockbuster earnings, Nvidia Corp.’s (NASDAQ: NVDA) market cap is larger than that of Alphabet Inc. (NASDAQ: GOOGL), the owner of Google, and Amazon.com Inc. (NASDAQ: AMZN), the owner of cloud computing giant AWS. The question raised by this is whether artificial intelligence (AI) has a better economic future than search or cloud computing. (These 25 American industries are booming.) Nvidia’s market cap is $1.96 trillion. Alphabet’s is $1.80 trillion, and Amazon’s is $1.81 trillion. In the past year, Nvidia’s shares are up 278% to $801. Amazon’s are up 82% to $174, while Alphabet’s are up 58% to $145. The Nasdaq is 45% higher than a year ago. Most of Nvidia’s revenue comes from AI chips. Of its $22.1 billion in revenue in the most recent quarter, a small part ($2.9 billion) came from gaming. AI was virtually all of the balance. Overall revenue was up 265% year over year. Amazon’s revenue rose 14% to $170 billion in the most recent quarter. AWS’s cloud business had a revenue increase of 13% to $24.2 billion. Some investors think AWS is worth more than Amazon’s e-commerce business because cloud computing has been a major driver of tech revenue and stock valuations for several years. Based on Amazon’s stock price compared to Nvidia’s, AI may have replaced cloud computing as the core of tech growth across the industry. In the most recent quarter, Alphabet’s revenue rose 13% to $86.3 billion. Its core ad business, Google and YouTube combined, had revenue of $76.3 billion, up 13%. Search has been a critical technology for over a decade, and Google has a market share of over 90% in many countries. A look at the revenue growth of the three companies answers the question of comparison. For now, AI revenue is growing much faster than search or cloud computing revenue. Many analysts believe that may be true permanently. Based on this alone, the distance between Nvidia’s market cap and those of Amazon and Alphabet will continue to grow in Nvidia’s favor.  Robinhood set out to democratize investing to individuals, and it’s not slowing down. The app makes it possible to buy and sell stocks, mutual funds, trade options, and even cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH). With FDIC insurance ,an award winning design, and benefits like IRAs and more, Robinhood could be your path to a richer tomorrow. Sign up today — click here to start your journey. Thank you for reading! Have some feedback for us?Contact the 24/7 Wall St. editorial team. "
}