{
    "title": "Nvidia stock has worst day in months, market cap trails Google, Amazon",
    "date": "2/20/2024",
    "url": "https://qz.com/nvidia-stock-dropping-behind-alphabet-amazon-1851271675",
    "text": "Fund next-gen business journalism with $10 a month Search Free Newsletters Read more: Nvidia stock is rebounding after the chipmaker exceeded Wall Street’s sky-high expectations Nvidia made waves last week when it surpassed Amazon and Google parent Alphabet to become the third-most valuable company in the U.S. Thanks to the surge, even companies that the AI chipmaker has stakes in felt their own ripple effects of the interest in Nvidia. But this week, the tides have shifted. Nvidia stock on Tuesday had its worst day since October 2023, a day before the company is set to report quarterly earnings. On Tuesday morning, its stock price was $741 per share, with a market cap of $1.83 trillion (ahead of Amazon’s $1.75 trillion and Alphabet’s $1.78 trillion at market open). Then Nvidia shares plunged as much as 8.6%, sending its market cap as low as $1.67 trillion before the company’s stock began to recover. Altogether, the company lost $78 billion in market value on Tuesday. Now the rankings have reconfigured, and Alphabet and Amazon are once again ahead of Nvidia. All to say, this is a bad sign for Nvidia, the company that’s already being watched by investors as it prepares to share its financials Wednesday after the bell. Wall Street wants to know if the company’s bubble will burst, and it appears to be on the brink. Notably, Nvidia remains a long way from the bottom. Its shares are still up about 40% since the beginning of January — and about 200% from a year ago — as it remains a top AI chip supplier for companies and governments alike. Small changes in Nvidia’s share price go a long way. Nvidia has fewer shares priced higher than other tech giants like Apple and Alphabet, and any minor wins and losses on stock market impact its market cap more than those companies. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  "
}