{
    "title": "ii view: Google owner Alphabet working hard to sell its AI tech",
    "date": "2/1/2024",
    "url": "https://www.ii.co.uk/analysis-commentary/ii-view-google-owner-alphabet-working-hard-sell-its-ai-tech-ii530621",
    "text": "Having persuaded corporations to adopt its Android software, can this tech titan do it again with AI? We assess prospects. 1st February 2024 15:31 Keith Bowman from interactive investor Ruth Porat, President and Chief Investment Officer said: “We ended 2023 with very strong fourth quarter financial results. We remain committed to our work to durably re-engineer our cost base as we invest to support our growth opportunities.” ii round-up: Google owner Alphabet Inc Class A (NASDAQ:GOOGL) detailed forecast beating earnings as part of its drive to improve efficiency, but did admit to marginally disappointing advertising related sales. Fourth-quarter earnings of $1.64 per share beat Wall Street hopes for $1.60, helped by a $864 million profit for its cloud data business compared to last year’s loss of $186 million, and a continued focus on containing costs. However, sales of $65.5 billion at its core advertising business missed forecasts of $65.9 billion, hindered by slower-than-expected growth at its YouTube business, a rival to TikTok. Shares in the Nasdaq 100 company fell around 7% in post-results trading having come into this latest news up 58% in 2023. That’s similar to fellow cloud data hosting business Microsoft Corp (NASDAQ:MSFT), although far short of a near 200% gain for rival ad selling tech giant and owner of Facebook, Meta Platforms Inc Class A (NASDAQ:META). Accompanying comments from chief executive Sundar Pichai flagged the benefit each of its businesses was now enjoying from its artificial intelligence (AI) related investments and innovation, with the best yet to come given its December launch of AI language Gemini. Alphabet plans to license Gemini to its customers via its installation on Google Cloud for them to use within their own software applications. Sales at Google Cloud climbed 26% year-over-year to $9.2 billion, with revenue at its other businesses division, which includes its self-drive Waymo unit, almost trebling to $657 million. Full-year 2023 profit rose 13% to $84.3 billion, helped by around 12,000 job losses and a rejig of its property portfolio. Broker Morgan Stanley reiterated its ‘overweight’ stance on Alphabet shares post the results. First-quarter numbers are likely to be announced late April or early May. ii view: Started in 1998 under the Google brand, the company today operates across the three divisions of Google Services, Cloud and Other Bets. Services includes its hardware, Google maps and Google play services, along with its core search adverting business including YouTube. Google Cloud competes against the likes of Amazon.com Inc (NASDAQ:AMZN), Oracle Corp (NYSE:ORCL), and International Business Machines Corp (NYSE:IBM), while its Other Bets division also includes its life sciences unit Verily. For investors, competitors such as TikTok have grown popular with younger online viewers, likely pressuring ad sales at Alphabet’s YouTube business. Competition elsewhere such as that at Tesla Inc (NASDAQ:TSLA) for self-driving vehicles and Waymo cannot be overlooked. The debate over appropriate tech valuations also persists, while fears that AI could encroach on Alphabet’s search engine business now warrant consideration. To the upside, Alphabet's previous success in allowing other companies such as Samsung to use its Android mobile phone software potentially offers a template for its new AI language, Gemini. A diversity of both business types and geographical operating regions exists, a focus on cost containment is ongoing, while its search engine business, at least for now, remains the go-to place for corporate advertising. Despite continued risks and the expense of developing AI, there's a lot to like about the Alphabet business, and an analyst consensus fair value estimate above $155 per share adds further confidence to investors with belief in this US tech leader. Positives Negatives The average rating of stock market analysts: Buy These articles are provided for information purposes only.  Occasionally, an opinion about whether to buy or sell a specific investment may be provided by third parties.  The content is not intended to be a personal recommendation to buy or sell any financial instrument or product, or to adopt any investment strategy as it is not provided based on an assessment of your investing knowledge and experience, your financial situation or your investment objectives. The value of your investments, and the income derived from them, may go down as well as up. You may not get back all the money that you invest. The investments referred to in this article may not be suitable for all investors, and if in doubt, an investor should seek advice from a qualified investment adviser. Full performance can be found on the company or index summary page on the interactive investor website. Simply click on the company's or index name highlighted in the article. Related Categories Get more news and expert articles direct to your inbox Editor's Picks Shares for the future: analysing a new company for my top 40 Ian Cowie: this investment trust has a 7.4% yield and a big tailwind Stockwatch: are interest rates really coming down soon? Bond Watch: the low-risk, high-yield bond funds Does the political risk of investing in China outweigh the rewards? 20 years of investing: what I’ve learnt, and my best and worst investments Five ways fund investors can get Warren Buffett in their ISA A solid, low-risk investment to hold for the long term How to build a £1 million pension and ISA portfolio The highest-yielding money market funds to park your cash in ii: an abrdn business. abrdn is a global investment company that helps customers plan, save and invest for their future. © 2018 - 2024 Interactive Investor Services Limited. All Rights Reserved. Interactive Investor Services Limited is authorised and regulated by the Financial Conduct Authority. "
}