{
    "title": "After Meta's surprise dividend move, are Google and Amazon next?",
    "date": "2/4/2024",
    "url": "https://invezz.com/news/2024/02/04/after-metas-surprise-dividend-move-are-google-and-amazon-next/",
    "text": "Follow Invezz on Telegram, Twitter, and Google News for instant updates > Meta Platforms (NASDAQ: META) stock price went bonkers this week after the company published strong financial results and announced its first dividend payments. It will embark on a giant $50 billion buyback as it seeks to boost its EPS by reducing the number of outstanding shares. With this in mind, I believe that Alphabet (GOOG) and Amazon (AMZN) could be the next big players in dividend payouts.   Meta Platforms decided to reward its shareholders because of the strength of its balance sheet. It ended last quarter with over $110 billion in cash, making it one of the top cash-rich companies in the world. High-tech companies like Meta and Netflix have resisted giving out dividends for years. Instead, they have preferred buying back their shares and using their cash to buy other companies. They also believe that having a huge cash balance is a good thing in terms of prestige and positioning for long-term growth. I believe that Amazon and Google could be pressured to start paying out dividends, especially when the Fed starts cutting interest rates. This will be an ideal period because these companies are making free money as long as interest rates are high.  Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. The most recent results showed that Google’s parent company had a net interest income of $1.1 billion. In 2023, its interest revenue came in at over $3 billion. This happened because Alphabet sits on over $110 billion in cash and short-term investments. Are you looking for fast-news, hot-tips and market analysis? \n\n  \n    Sign-up for the Invezz newsletter, today. Amazon is also cash-rich as its total cash and short-term investments jumped to over $86 billion from $64 billion in the last quarter. Its interest income came in at over $901 million. But unlike Alphabet, Amazon has substantial debt, meaning that it also paid $713 million in interest. As such, Amazon might aim to boost its cash balance before starting its payouts soon. The results published last week showed that Meta, Amazon, and Apple are still growing well. Amazon’s growth is being powered by its AWS cloud business, which recorded strong performance as companies boosted their IT spending. This is in line with what I wrote after the strong results by IT consultants like Accenture and Infosys. Alphabet’s business is being boosted by robust cloud computing and advertising spending around the world. Its YouTube premium and music business also recorded strong growth as members jumped to over 100 million. Alphabet has one of the best business models in the Magnificent 7. For one, the company receives approximately $18 billion every year from Apple for it to be the default search engine. Its YouTube premium, which allows users to avoid ads, is what I see as free money. Amazon’s business is also set to boom as the American economy strengthens and as demand for cloud computing and AI booms. Copy expert traders easily with Plus500. Invest in stocks like Tesla & Apple. Instantly trade ETFs like FTSE 100 & S&P 500. Sign-up in minutes. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.  Should you buy Bitcoin before the halving? Should you buy Bitcoin before the halving?  Use Invezz APP Get a better user experience Allow notifications? Allow us to send you updates You must agree to the privacy policy. "
}