{
    "title": "Google’s Gemini Headaches Spur $90 Billion Selloff",
    "date": "2/26/2024",
    "url": "https://www.forbes.com/sites/dereksaul/2024/02/26/googles-gemini-headaches-spur-90-billion-selloff/",
    "text": "Google parent Alphabet lost some $90 billion in market value Monday as controversy over the Silicon Valley giant’s generative artificial intelligence product made its way to Wall Street. Alphabet CEO Sundar Pichai has grappled with significant headaches from his company's generative AI ... [+] chatbot. Shares of Alphabet fell 4.5% to $138.75 Monday, closing at its lowest price since Jan. 5 and registering its second-steepest daily loss of the last year. The selloff followed a spate of controversy surrounding Google’s Gemini AI service, with issues including Gemini’s image-generating service producing racially inaccurate depictions of historical figures and its chatbot refusing to determine the more negatively impactful historical figure between Adolf Hitler and Elon Musk, culminating in the company’s admission it “missed the mark” with Gemini’s early rollout and taking its AI image service offline for the next few weeks. “This is a meaningful blunder in the PR battle surrounding [generative AI] and further suggests that Google is trailing and mis-executing in a fast-moving and high-stakes space,” Loop Capital analyst Rob Sanderson wrote in a note to clients Sunday. Alphabet’s losses came as major stock indexes were flat in a rather uneventful day of trading, and Alphabet was the biggest percentage faller among S&P 500 constituents with a market capitalization over $50 billion. “The issue for the stock is not the debate [over Gemini] itself, it is the perception of truth behind the brand,” Melius Research analysts Ben Reitzes and Nick Monroe wrote in a Monday note to clients. “Regardless of your view, if Google is seen as an unreliable source for AI to a portion of the population, that isn’t good for business,” the analysts continued. Alphabet propulsion into the “crosshairs” of the culture war debate could challenge its stranglehold in the online search market, the Melius group hypothesized, considering AI’s burgeoning role in online search and the possibility of “a meaningful portion of users grow[ing] concerned about Google’s hallucinations and bias.” Gemini’s apparent bias is the latest flub by Alphabet during the AI arms race, in which rival Microsoft appears to be in pole position. Alphabet famously lost more than $100 billion in market capitalization on the day of the announcement of its AI chatbot service last February after the press release included factual errors made by the service. Alphabet stock is down 1% year-to-date, trailing the S&P’s 7% gain and tech-heavy Nasdaq’s 8% rally, as well as the double-digit gains of rivals like Microsoft and Meta.   "
}