{
    "title": null,
    "date": "2/2/2024",
    "url": "https://fortune.com/2024/02/02/earnings-meta-apple-amazon-microsoft-alphabet/",
    "text": "Hi there, it’s tech reporting fellow Rachyl Jones. The busiest week for tech CEOs in recent memory comes to a close today—following a spree of earnings announcements from Meta, Apple, Amazon, Microsoft, and Alphabet. And when taking the whole week into account, there’s a few things investors and consumers can glean about the future of the world’s top companies. First, the massive layoffs that have plagued the tech industry over the past year are doing wonders for the companies’ bottom lines, and executives appear keen on continuing to operate in a lean fashion. Meta’s headcount is down 22% from the same time last year, representing the elimination of 67,000 jobs, which CEO Mark Zuckerberg said “is helping us execute better and faster,” adding that “we will continue to carry these values forward as a permanent part of how we operate.” For Amazon, which is down 27,000 employees in two years, further job cuts are on the table, CFO Brian Olsavsky said on Thursday. And as Big Tech continues to integrate artificial intelligence technologies into corporate workflows, layoffs will remain a subject to watch. Speaking of AI, executives had a lot to say about their respective investments in the technologies—except for Apple, which has largely kept mum about its plans but teased a generative AI announcement coming later this year (see news blurb below). For the rest of the pack, though, the term “AI” sounded 200 times across the four earnings calls. Amazon expects its generative AI services to produce tens of billions of dollars in revenue over the coming years. Microsoft and Alphabet are already feeling the benefits of AI on their businesses (though specific financial details from the companies are woefully scant). Perhaps the company with the biggest talk was Meta, which is planning a massive infrastructure investment (to the tune of at least $30 billion to $37 billion this year) to win the AI race, and with CEO Mark Zuckerberg touting the company’s vast trove of user data as its secret weapon. Of course, the AI arms race is taking place amid growing concerns over safety and privacy, and mounting regulatory pressure. In fact, the threat of Big Tech regulation marked another common thread throughout the week, offering a striking contrast as CEOs took their lumps from regulators one day and celebrated record results and stock gains the next. For Zuckerberg, that took the form of a four-hour grilling by the Senate Judiciary Committee on how Facebook and Instagram risk the safety and well-being of children. Support for reining in social media companies is a rare point of bipartisanship in Congress, with a series of legislative measures on the table. Amazon abandoned its $1.4 billion acquisition of iRobot on Monday, citing “undue and disproportionate regulatory hurdles.” And Apple is preparing for major changes to its App Store in the EU in March, to comply with Europe’s competition law. The company will allow iPhone users to download apps from non-Apple app stores, and it will lower the fees it charges developers. The EU market represents 7% of global App Store sales, but how the regulation will impact revenue—well, CEO Tim Cook gave an answer to the effect of “We’ll have to wait and see.” With that, here’s today’s biggest news in tech. Rachyl Jones Want to send thoughts or suggestions to Data Sheet? Drop a line here. Today’s edition was curated by David Meyer. Meta does a dividend. Meta’s share price surged by more than 20% after it delivered a spectacular “beat and raise” earnings report and announced its first-ever cash dividend. The company said it will pay a quarterly dividend (of 50 cents per share) starting next month to all shareholders of record as of Feb. 22. One of those shareholders is Zuckerberg himself, who will receive $700 million per year thanks to his 350 million shares, according to Bloomberg. Apple talks AI. Apple CEO Tim Cook has finally said his company has some generative AI news coming up. “In terms of generative AI … we have a lot of work going on internally, as I’ve alluded to before,” Cook said on yesterday’s earnings call, as reported by TechCrunch. “Our MO, if you will, has always been to do work and then talk about work and not to get out in front of ourselves. And so we’re going to hold that to this as well. But we’ve got some things that we’re incredibly excited about, that we’ll be talking about later this year.” That probably means at WWDC in June, where reports already suggest an AI-powered Siri will be revealed. Meanwhile, EU countries today agreed on what will probably be the final text of the bloc’s incoming AI Act, Politico reports. Tesla settles waste suit. Two days after 25 California counties sued it over the mishandling of hazardous waste, Tesla has settled. CNBC reports it will pay $1.3 million in civil penalties and $200,000 in costs. Elon Musk’s car firm will also have to train its employees and pay for third-party trash-container audits for the next five years. Meanwhile, U.S. transport authorities have forced Tesla to increase the font size in its vehicles’ warning lights. —The amount of revenue Apple’s App Store gets from the EU market, as disclosed by CFO Luca Maestri yesterday. This gives an idea of the stakes as Apple rolls out highly controversial changes in the region, most important by allowing third-party app stores on iOS, in response to a new antitrust law. Meta yesterday became the latest company to criticize the way Apple wants to implement the changes. A global race to regulate AI has put the booming industry on the defensive, by Vivienne Walt Mark Zuckerberg explained how Meta will crush Google and Microsoft at AI—and Meta warned it could cost more than $30 billion a year, by Alexandra Sternlicht Amazon is more profitable than ever after a year of mass layoffs, by Jason Del Rey Tim Cook pitches Apple’s new Vision Pro headset as a must-have for businesses despite augmented reality’s checkered history in the workplace, by Rachyl Jones DataSnipper, startup that uses AI to eliminate some of the ‘dread’ in accounting, is valued at $1 billion in latest funding round, by Jeremy Kahn Google cofounder Larry Page bought a private island for $32 million—it’s at least the 5th island he owns across the globe’s tropics, by Paolo Confino The age of the sellout. Just read this fabulous Vox piece on how, thanks to social media, every artist is now forced to be a marketing expert—and how their art suffers for it. Speaking as a late-Gen-X musician whose youthful views on marketing were largely shaped by the late lamented Bill Hicks, this article is so true it hurts. Remember, kids, it wasn’t always this way. This is the web version of Data Sheet, a daily newsletter on the business of tech. Sign up to get it delivered free to your inbox. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}