{
    "title": "Top Stock Movers Now: Google Parent Alphabet, Tesla, Logitech, and More",
    "date": "3/18/2024",
    "url": "https://www.investopedia.com/top-stock-movers-now-google-parent-alphabet-tesla-logitech-and-more-8610473",
    "text": " Bill McColl has 25+ years of experience as a senior producer and writer for TV, radio, and digital media leading teams of anchors, reporters, and editors in creating news broadcasts, covering some of the most notable news stories of the time. Tayfun Coskun / Anadolu Agency / Getty Images U.S. equities gained at midday as tech stocks surged ahead of a keynote address by Nvidia (NVDA) founder and CEO Jensen Huang at the chipmaker's annual GPU Technology Conference. The S&P 500 and Nasdaq were up about 1%, and the Dow was also in the green. Google parent Alphabet (GOOGL) was the best-performing stock in the S&P 500 following a report Apple (AAPL) is in talks with Alphabet to have Google’s Gemini chatbot power iPhone artificial intelligence (AI) features. Apple shares rose as well. Shares of Tesla (TSLA) gained after the electric vehicle maker said it was raising the price of its most popular car, the Model Y. Nvidia (NVDA) shares advanced as the AI chipmaker holds its developers’ conference. Super Micro Computer (SMCI) shares took off to start the session on the tech firm's first day as a member of the S&P 500, but shares later reversed course and turned lower. Logitech (LOGI) shares fell after the Swiss computer accessories maker said its finance chief, Charles Boynton, had stepped down to pursue another career opportunity. Shares of Boeing (BA) lost ground amid concerns following incidents affecting Boeing-built aircraft last week. Uber Technologies (UBER) shares fell after the ride-sharing company settled a class action lawsuit brought by taxi drivers in Australia for $178 million. Oil and gold futures rose. The yield on the 10-year Treasury note was higher. The U.S. dollar climbed versus the euro, pound, and yen. Most major cryptocurrencies traded lower. TradingView UPDATE—March 18, 2024: This article was updated to include additional information about Logitech. "
}