{
    "title": null,
    "date": "3/13/2024",
    "url": "https://www.tradingview.com/news/benzinga:bf99d1fb6094b:0-will-alphabet-storm-back-plus-progressive-d-r-horton-and-pfizer-on-cnbc-s-final-trades/",
    "text": "On CNBC’s \"Halftime Report Final Trades,\" Joshua Brown of Ritholtz Wealth Management named  Pfizer Inc.  PFE  as his final trade. Pfizer announced that a Phase 3 study of the antibody-drug conjugate Adcetris (brentuximab vedotin) combined with lenalidomide and rituximab for relapsed/refractory diffuse large B-cell lymphoma (DLBCL) showed a statistically significant and clinically meaningful improvement in overall survival (OS) compared to lenalidomide and rituximab plus placebo. Jim Lebenthal of Cerity Partners picked  Alphabet Inc.  GOOGGOOGL. \"I think this one is coming back. The failed image generator is much like what happened a year ago when it came storming back after that,\" he added. In a surprising turn of events, on March 8, Alphabet’s Google revealed that its latest Pixel 8 smartphone will miss out on the highly-anticipated Gemini Nano AI feature. Don’t forget to check out our  premarket coverage here Jason Snipe of Odyssey Capital Advisors said he likes  The Progressive Corporation PGR for its solid earnings and 26% long-term growth. On March 6, Morgan Stanley analyst Bob Huang upgraded Progressive from Equal-Weight to Overweight and raised the price target from $185 to $227. Stephanie Link of Hightower said  D.R. Horton, Inc.  DHI is trading at 11 times earnings. D.R. Horton is expected to release financial results for its second quarter ended March 31, 2024 on April 18, 2024 before the opening bell. Analysts expect the company to report quarterly earnings at $3.06 per share on revenue of $8.28 billion. Price Action: Check This Out:  Roku, Boyd Gaming And 2 Other Stocks Insiders Are Selling Image: Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}