{
    "title": "Will Google CEO Sundar Pichai step down? Clamour grows after search giant's \nGemini snafu",
    "date": "3/3/2024",
    "url": "https://www.businesstoday.in/technology/news/story/will-google-ceo-sundar-pichai-step-down-clamour-grows-after-search-giants-gemini-snafu-419832-2024-03-03",
    "text": "Feedback After worrying results from Gemini, there are growing calls for Sundar Pichai to step down as the search giant’s CEO. Gemini’s AI image generation tool was received very poorly, forcing the firm to pull the feature from the chatbot. Things got so bad that Pichai addressed the issues in a statement to employees, calling it “completely unacceptable.” The melee also saw Google-parent Alphabet’s stock plummetting. As per a Business Insider report, calls demanding Pichai's resignation are increasing and many are arguing that the CEO must step down. The report quotes analysts Ben Thompson and Mark Shmulik who said that things at Google needed to change, including possibly replacing CEO Sundar Pichai. While Thompson emphasised the need to address past issues, Shmulik questioned if the current leadership is suitable for guiding Google in the future. Thompson, in his newsletter, wrote that Google needed a \"transformation\" that would \"mean removing those who let the former run amok, up to and including CEO Sundar Pichai.\" The analyst's newsletters are read across the Silicon Valley and by several other Googlers. Bernstein internet analyst Mark Shmulik also talked about how things at Google needed to change in a research note. His note read, \"The most recent saga only further raises increasingly louder questions around whether this is the right management team to guide Google into this next era.\" To recall what happened with Google's Gemini, as mentioned already, it was called out by several users across the internet for generating historically inaccurate and biased images. The AI tool was accused of being \"too woke\", \"racist\" and getting details about \"white people\" wrong. Google CEO Sundar Pichai, acknowledging the problem, said that the company “got it wrong”. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu "
}