{
    "title": "Alphabet (GOOGL) Boosts Android Auto With New AI Feature",
    "date": "3/4/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-boosts-android-auto-154100114.html",
    "text": "Alphabet GOOGL is leaving no stone unturned to bolster its presence in the automobile sector on the back of robust AI capabilities for Android Auto.In this regard, the company announced the wide availability of its AI message summarizing feature on the newest version of Android Auto.This feature is applicable for messages with a minimum of 40-word limit, allowing AI to automatically summarize longer texts or busy group chats while driving. This provides users with a quick and easy way to stay updated on unread messages.Alphabet is expected to gain significant popularity among car owners using the Android platform on the back of its latest move.Moreover, the AI message summarizing feature is in sync with Alphabet’s continued efforts to enhance its product and service offerings with the power of AI, which, in turn, will likely strengthen its presence in the booming global AI market space. Per a Fortune Business Insights report, the global AI market size is expected to reach $2.02 trillion by 2030, exhibiting a CAGR of 21.6% between 2023 and 2030. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the AI message summarizing feature, Google Maps on Android Auto now displays 3D buildings while driving, a feature that is enabled by default. The feature can be turned off in Google Maps settings. However, 3D buildings only appear when Android Auto is in light mode and disappear when the UI switches to dark mode.Further, Google's MyRadar, a radar-first weather app, is now available on Android Auto, offering hyperlocal forecasts, push notifications and Wear OS support. MyRadar's \"RouteCast\" feature provides alerts and forecasts for the weather along your car's route, offering valuable weather insights for drivers.All the above-mentioned endeavors will aid Alphabet in capitalizing on growth opportunities present in the promising automotive infotainment market. Per a Grand View Research report, the global automotive infotainment market is expected to witness a CAGR of 9.9% between 2024 and 2030.We note that the company’s increasing efforts to bolster its Android Auto portfolio will expand its Android offerings. This, in turn, will boost its Google Services segment, which remains the key growth catalyst for Alphabet. Its shares have rallied 44.2% in the past year compared with the Zacks Computer & Technology sector’s growth of 46.8%.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $286.52 billion, indicating year-over-year growth of 11.7%. Currently, Alphabet carries a Zacks Rank #3 (Hold).Some better-ranked stocks in the broader technology sector are CrowdStrike CRWD, Badger Meter BMI and AMETEK AME. While CrowdStrike currently sports a Zacks Rank #1 (Strong Buy), Badger Meter and AMETEK carry a Zacks Rank #2 (Buy) each at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Shares of CrowdStrike have gained 146.6% in the past year. The long-term earnings growth rate for CRWD is 36.07%Shares of Badger Meter have gained 33.5% in the past year. The long-term earnings growth rate for BMI is 12.27%.Shares of AMETEK have gained 26% in the past year. The long-term earnings growth rate for AME is 9.19%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Badger Meter, Inc. (BMI) : Free Stock Analysis Report AMETEK, Inc. (AME) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report CrowdStrike (CRWD) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}