{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/alphabet-inc-nasdaqgoogl-is-investment-research-advisory-group-inc-s-5th-largest-position.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Investment Research & Advisory Group Inc. cut its position in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 0.3% in the 4th quarter, Holdings Channel.com reports. The firm owned 43,224 shares of the information services provider’s stock after selling 125 shares during the quarter. Alphabet comprises  3.1% of Investment Research & Advisory Group Inc.’s holdings, making the stock its 5th largest position. Investment Research & Advisory Group Inc.’s holdings in Alphabet were worth $6,038,000 as of its most recent filing with the Securities and Exchange Commission. Other institutional investors and hedge funds have also made changes to their positions in the company. Live Oak Investment Partners bought a new position in  Alphabet during the 4th quarter valued at $26,000.  VitalStone Financial LLC boosted its stake in  Alphabet by 1,900.0% during the 2nd quarter. VitalStone Financial LLC now owns 280 shares of the information services provider’s stock valued at $34,000 after acquiring an additional 266 shares during the last quarter.  Sanctuary Wealth Management L.L.C. bought a new position in  Alphabet during the 4th quarter valued at $34,000.  Turim 21 Investimentos Ltda. bought a new position in  Alphabet during the 3rd quarter valued at $38,000.  Finally, Meritage Group LP boosted its stake in  Alphabet by 1,061.5% during the 3rd quarter. Meritage Group LP now owns 302 shares of the information services provider’s stock valued at $40,000 after acquiring an additional 276 shares during the last quarter. 40.03% of the stock is currently owned by hedge funds and other institutional investors. Shares of GOOGL opened at $150.93 on Friday. The firm’s 50 day moving average is $143.67 and its 200-day moving average is $138.21. The stock has a market capitalization of $1.88 trillion, a P/E ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a 12-month low of $99.78 and a 12-month high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last announced its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.60 by $0.04. The company had revenue of $86.31 billion for the quarter, compared to analysts’ expectations of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter in the previous year, the company posted $1.05 EPS.  Equities research analysts anticipate that  Alphabet Inc. will post 6.77 EPS for the current fiscal year. A number of research analysts have recently issued reports on the stock. JMP Securities raised their price target on shares of Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a research report on Wednesday, January 31st. Needham & Company LLC  restated a “buy” rating and issued a $160.00 price target on shares of Alphabet in a research report on Wednesday, January 31st. Truist Financial reduced their price target on shares of Alphabet from $160.00 to $158.00 and set a “buy” rating on the stock in a research report on Wednesday, January 31st. Barclays reduced their price target on shares of Alphabet from $180.00 to $173.00 and set an “overweight” rating on the stock in a research report on Wednesday, January 31st. Finally, Wells Fargo & Company raised their price target on shares of Alphabet from $141.00 to $144.00 and gave the stock an “equal weight” rating in a research report on Monday, March 18th. Five investment analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have assigned  a strong buy rating to the stock. According to data from MarketBeat, the stock presently has a consensus rating of “Moderate Buy” and an average price target of $155.48. Check Out Our Latest Stock Analysis on GOOGL In other Alphabet news, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction dated Wednesday, March 6th. The shares were sold at an average price of $132.70, for a total value of $2,985,750.00. Following the completion of the transaction, the chief executive officer now directly owns 2,332,691 shares in the company, valued at $309,548,095.70. The sale was disclosed in a filing with the SEC, which is accessible through this link. In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the firm’s stock in a transaction dated Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the transaction, the chief accounting officer now directly owns 27,259 shares in the company, valued at $3,805,628.99. The sale was disclosed in a filing with the SEC, which is accessible through this link. Also, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction that occurred on Wednesday, March 6th. The stock was sold at an average price of $132.70, for a total transaction of $2,985,750.00. Following the sale, the chief executive officer now owns 2,332,691 shares of the company’s stock, valued at $309,548,095.70. The disclosure for this sale can be found here. Insiders sold a total of 263,312 shares of company stock worth $37,268,315 over the last ninety days. 0.88% of the stock is currently owned by company insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Elk River Wealth Management LLC Purchases 345 Shares of Alphabet Inc. (NASDAQ:GOOGL) "
}