{
    "title": "Alphabet (GOOGL) Adds New Feature to Google Maps for Wear OS",
    "date": "3/20/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-adds-feature-google-155600989.html",
    "text": "Alphabet’s GOOGL Google added a new Transit feature to Google Maps for Wear OS, offering users public transit directions.Notably, this Transit option for location searches works with Wear OS Tile for quick travel, providing an ETA after driving, walking and biking.Further, users can access a live map view, zoomed-out map view and exit icon on the watch face when selecting a route in Google Maps.The latest move will likely boost the adoption of Wear OS. Moreover, the company is expected to gain solid traction across smartwatch users on the back of this new feature.This, in turn, will enable Alphabet to capitalize on growth opportunities present in the global smartwatch market. Per an EMR report, the global smartwatch market is expected to be valued at $160.67 billion by 2032, exhibiting a CAGR of 15.6% between 2024 and 2032. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the latest feature for Wear OS, the company also announced a feature on Google Maps that shows entrances for buildings to some select users, addressing the issue of navigating to specific building portions on the map. This feature is aimed at improving the user experience and ensuring accurate directions for businesses or locations.Further, Google added \"glanceable directions\" for Maps on Android and iOS, providing live ETAs and directions on the device's lock screen, using regular system notifications.The company has also updated Google Maps on Android Auto to display estimated drive time in a bolder font, similar to other platforms. The bolder number, now displayed alongside thinner minutes and hour indicators, is available in version 11.119.0100 of Google Maps and version 11.5 of Android Auto.All the above-mentioned endeavors will enable the company to capitalize on growth opportunities present in the global digital map market. Per a Future Market Insights report, the global digital map market is expected to reach $73.1 billion by 2033, witnessing a CAGR of 14.8% between 2023 and 2033.Moreover, growing Google Maps efforts will further bolster its Android offerings. This, in turn, will boost its Google Services segment, which remains the key growth catalyst for the company. Its shares have rallied 45.9% in the past year compared with the Zacks Computer & Technology sector’s growth of 44.6%.The strengthening Google Services segment is expected to aid its overall financial performance in the near term.The Zacks Consensus Estimate for 2024 total revenues stands at $286.48 billion, indicating year-over-year growth of 11.7%. Strengthening Google Maps offerings will aid Alphabet to compete well with some notable industry players like Microsoft MSFT and Apple AAPL, which have positioned themselves well in the digital map space.Apple is riding on the success of its Apple Maps offerings.Apple’s launch of Apple Business Connect, a free tool enabling businesses to manage their location place cards and customize information for over a billion users on Apple Maps, including adding photos, logos and promotions, remains noteworthy.Meanwhile, Microsoft is enjoying the growing momentum of Bing Maps with new feature updates.Microsoft introduced live traffic updates on Bing Maps, enabling users to plan their journeys more efficiently by providing real-time information about traffic conditions during commutes. Currently, Alphabet carries a Zacks Rank #3 (Hold).A better-ranked stock in the broader technology sector is CrowdStrike CRWD, carrying a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Shares of CrowdStrike have gained 28.7% in the year-to-date period. The long-term earnings growth rate for CRWD is 22.31% Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report CrowdStrike (CRWD) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}