{
    "title": null,
    "date": "3/6/2024",
    "url": "https://www.tradingview.com/news/investorplace:c477d8cf0094b:0-bull-vs-bear-how-should-investors-play-goog-stock-now/",
    "text": "Alphabet GOOG has soared amid a massive tech recovery, digital advertising rebound, and AI adoption. Its 52% surge outpaced S&P 500 gains. This has been led by improved financials fuel investor confidence in sustained ad market growth, driving GOOG stock to more reasonable levels based on a historical valuation basis. Recently, Alphabet’s shares faced resistance, oscillating between $140 and $150 per share. Much of this sideways trading pattern appears to be influenced by market dynamics and Google/YouTube factors. Concerns have arisen regarding generative AI’s impact on future growth and profitability. However, premature conclusions are cautioned amidst setbacks and competition. So, with that said, is a pullback imminent, or is it time to buy GOOG stock? Let’s dive in. Bull Case Despite the 2022 downturn, Google’s dominant market share in the company’s core search business drives Alphabet’s revenue from digital advertising. With an expected spike in digital ad spending in 2024, Alphabet’s position remains strong. The company’s fourth-quarter revenue surge hints at a recovering advertising market, potentially boosting Alphabet’s stock further. AI stocks, including GOOG stock, may stall amidst waning enthusiasm. The market appears to be questioning the tech giants’ pace in AI commercialization amid negative headlines. However, beyond advertising, cloud migration offers growth potential. Google Cloud ranks third globally, with innovative services like Vertex AI and Gemini. If Alphabet is able to continuing seeing cloud growth accelerate due to the company’s AI endeavors and integrations, there could be a lot to like about this stock. Currently trading around 23-times earnings, GOOG stock remains among the most attractively-priced mega cap tech stocks in the market. Thus, there’s a simple valuation-based thesis for owning this stock here. Bear Case Google, as the foremost name in traditional search, faces significant threats from emerging trends. Notably, the rise of gen AI chatbots poses a considerable challenge. Moreover, recent reports, such as one by Gartner, suggest a potential 25% decline in traditional search engine volumes by 2026 due to this development. Google ceased allowing users to generate human images using its chatbot technology due to incidents involving the portrayal of various key historical figures as people of color. This followed attempts to train the AI for diversity in responses. CEO Sundar Puchai addressed the comments about the chatbot being biased to racial responses absurd and unacceptable. Since 2014, Alphabet has always had a section in its earnings report named “Other Bets” in which it still shows a whopping $37.3 billion operating losses til this day. However, financials improved in 2023, with Other Bets reporting a $4.1 billion operating loss on $1.5 billion revenue. This will remain a key focus for some investors, who want to see more capital discipline from these major players, or at least a return on these investments at some point. Alphabet is exploring external investments for ventures like Google Fiber, possibly leading to spin-offs. Yet, assessing the valuations of projects like Waymo and Verily poses significant challenges. GOOG Stock Remains a Buy Despite potential threats, Alphabet’s competitive position remains robust. Though some investors may look to exit their Alphabet positions amid AI setbacks, I’d caution against premature conclusions. Alphabet is swiftly addressing Gemini issues, ensuring continued AI integration and enhancing monetization across segments. Despite recent setbacks, holding onto GOOG stock remains a prudent move. Potential positive surprises later may refute claims that gen AI harms Alphabet. Revenue from Gemini subscriptions and AI-driven ad improvements could impact quarterly results positively. Competitors’ efforts to challenge Google’s search dominance, like OpenAI’s, may face hurdles. Alphabet is poised to meet or exceed earnings growth forecasts, aiming for double-digit annualized growth until 2026. While patience is advised amid near-term challenges, GOOG’s potential for significant growth remains. On the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Chris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective. More from InvestorPlace Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}