{
    "title": "Alphabet’s Ad Revenue Miss Punished By Investors",
    "date": "1/31/2024",
    "url": "https://www.silicon.co.uk/e-marketing/advertising/alphabets-ad-revenue-miss-punished-by-investors-548197",
    "text": "All Tech News > category news Marketing > category news Advertising Another tech industry bellweather, Alphabet, delivers strong Q4 and FY23 financials, yet investors not happy at ad revenue miss Alphabet has joined Microsoft in posting another strong set of financial results, but investors took issue with a slight miss in advertising revenues. Alphabet posted double digit revenue growth in its fourth quarter, marking the third consecutive quarter of revenue growth at the Mountain View, California-based tech giant. This was achieved mostly thanks to Google’s of search and online advertising domination. But there has also been some challenges. Last week Google confirmed hundreds of job losses in its ad sales team, after 1,000 layoffs the previous week. That came after Alphabet had announced in January 2023 that it would cut 12,000 jobs worldwide, or roughly 6 percent of its workforce. And in 2024 Alphabet and Google CEO Sundar Pichai did not offer much comfort to employees, after he warned staff in an internal memo to expect more job losses as the firm “will be investing in our big priorities this year.” But looking back to the last three months of 2023, and the full year 2023, it seems that Alphabet has financially been very solid indeed. For the fourth quarter ending 31 December, Alphabet posted net income of $20.7bn, up from $13.6bn in the same year-ago quarter. Revenues rose 13 percent to $86.3bn from $76bn a year earlier. This was the fastest rate of expansion since early 2022. And the sales of $86.31bn topped analyst expectations of $85.33bn. Digging down in the full year 2023 results, Alphabet post a net profit of $73.8bn, up from $60bn in 2022. Full year revenues were to $307bn from $282.8bn. “We are pleased with the ongoing strength in Search and the growing contribution from YouTube and Cloud,” said Pichai. “Each of these is already benefiting from our AI investments and innovation. As we enter the Gemini era, the best is yet to come.” But after the financial report was released, Alphabet’s share price dropped 6 percent, after Google’s ad business disappointed investors. Google’s ad business delivered quarterly revenue of $65.52bn (up from $59bn in 2022), which missed analysts estimates of $65.94bn. YouTube ad revenues of $9.2bn (up from $7.9bn) also just missed analyst expectations. Meanwhile quarterly revenue at Google’s ‘Other Bets’ division came in at $657m – dramatically up from $226m in the same year-ago quarter. In July 2023 Aplhabet’s chief financial officer Ruth Porat confirmed she will step down from the CFO role, in order to take charge of Google’s ‘Other Bets’ portfolio. NEWSLETTER Subscribe to our best articles Brand Discovery offers Advertisers the opportunity to speak directly to our professional communities. It’s an ad format that blends in with the editorial content and overall page design giving non-intrusive, flowing advertising experience. Readers can easily identify their provenance with the “Brand Discovery” mention. For any further information, contact us at the following address:\t\t\t\t\t\t internationalsales@netmediaeurope.com Follow us: "
}