{
    "title": "Mitsotakis Discusses Investment Opportunities In Greece With Google, \nAlphabet, And Intel",
    "date": "1/19/2024",
    "url": "https://greekcitytimes.com/2024/01/19/mitsotakis-google-alphabet/",
    "text": "While attending the World Economic Forum in Davos, Switzerland, Prime Minister Kyriakos Mitsotakis had meetings with senior executives of Intel, Alphabet Inc (of which Google is a subsidiary), and Google on Thursday. Specifically, he met Intel CEO Pat Gelsinger, followed by the President, Chief Investment Officer and Chief Financial Officer of Alphabet Inc. Ruth Porat and Google EMEA Business and Operations President Matt Brittin. According to government sources, they discussed investment opportunities in Greece, its comparative advantages and economic performance, including high growth rates that consistently exceed the European average, as well as developments in artificial intelligence (AI), an area on which the prime minister's interlocutors congratulated him on the government's initiatives. The prime minister spoke about the digital transformation of the Greek state, the emergence of a Greek ecosystem of high-tech companies, and the actions taken by the government to map the opportunities and challenges arising as a result of AI developments. He also noted the high levels of specialisation and training the Greek educational system offers. The same sources said the meeting with Google also focused on the possibility of collaboration in using advanced technology to predict extreme weather phenomena and natural disasters. They also discussed ways of using AI to optimise the operation of traffic lights in the Attica region. Gelsinger, Porat and Brittin congratulated the prime minister on his re-election while stressing the importance of political stability in an environment marked by global uncertainty and \"opacity\" regarding the future. READ MORE: Mitsotakis: Greece will become an exporter of green energy in the medium-term.  Copyright Greekcitytimes 2024 Copyright Greek City Times 2024 To provide the best experiences, we and our partners use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us and our partners to process personal data such as browsing behavior or unique IDs on this site and show (non-) personalized ads. Not consenting or withdrawing consent, may adversely affect certain features and functions. Click below to consent to the above or make granular choices. Your choices will be applied to this site only. You can change your settings at any time, including withdrawing your consent, by using the toggles on the Cookie Policy, or by clicking on the manage consent button at the bottom of the screen.    "
}