{
    "title": "Alphabet (GOOGL) Adds Shortcuts to Pixel Launcher on Android",
    "date": "1/4/2024",
    "url": "https://finance.yahoo.com/news/alphabet-googl-adds-shortcuts-pixel-145100397.html",
    "text": "Alphabet’s GOOGL Google recently added Pixel Launcher shortcuts on Android.In this regard, Google introduced a Pixel Launcher search shortcut for Password Manager, displaying \"password\" or \"password manager\" search options on selected Pixel devices.Further, the company’s recent move allows Pixel Launcher to display an expanded temperature card when searching for \"weather,\" with the \"See full forecast\" shortcut opening a larger search results page.Alphabet is expected to get solid traction across Pixel users on the back of its latest move.Moreover, the new enhancement will bolster Google’s Android offerings, which have been a key growth driver for the company. Alphabet’s shares have gained 61.2% in the past year compared with the Zacks Computer & Technology sector’s growth of 52.5%. Alphabet Inc. price-consensus-chart | Alphabet Inc. Quote Apart from the latest move, Google, via Pixel Launcher, is now launching \"voice search\" instead of Assistant, a feature that dates back to the pre-Assistant Google Now era. This change is part of Google App 15.0, which is currently in beta.Google also updated the Pixel Launcher search, which now displays interactive Quick Settings Tiles in search results, including Internet, Bluetooth, Hotspot, Do Not Disturb, Camera/Microphone access, Screen Cast, Screen record, Home/Device controls, Location and Battery Saver.Another Pixel Launcher update allows users to search and \"quick launch\" apps without tapping the top of the screen, replacing the previous functionality of typing an application's name and pressing enter on a virtual keyboard.Additionally, Google’s update of the Pixel Launcher search experience, introducing a new Messages shortcut that displays recent conversations in a carousel-like format, remains noteworthy. All the above-mentioned endeavors are expected to bolster the Google Services segment that accounts for the majority of GOOGL’s total revenues.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $283.39 billion, indicating year-over-year growth of 11.26%.The consensus mark for 2024 earnings is pegged at $6.74 per share, indicating year-over-year growth of 15.6%. The estimate has been revised upward by 0.7% in the past 30 days. Currently, Alphabet carries a Zacks Rank #2 (Buy).Some other top-ranked stocks in the broader technology sector are Camtek CAMT, KT KT and Everbridge EVBG, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Camtek shares have returned 198.9% in the past year. The long-term earnings growth rate for CAMT is pegged at 12.26%.Shares of KT have lost 2.9% in the past year. The long-term earnings growth rate for KT is currently projected at 6.75%.Shares of Everbridge have lost 19.9% in the past year. The long-term earnings growth rate for EVBG is currently projected at 47.04%. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report KT Corporation (KT) : Free Stock Analysis Report Camtek Ltd. (CAMT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report Everbridge, Inc. (EVBG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}