{
    "title": "Alphabet Unit In Drug Discovery Deals With Eli Lilly, Novartis",
    "date": "1/8/2024",
    "url": "https://www.investors.com/news/technology/alphabet-isomorphic-labs-in-drug-discovery-deals-with-eli-lilly-novartis/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Isomorphic Labs, a unit of Google-parent Alphabet (GOOGL), on Sunday announced strategic research collaborations with Eli Lilly (LLY) and Novartis (NVS). The Lilly and Novartis collaborations will focus on small-molecule treatments and multiple targets. Isomorphic Labs, which uses artificial intelligence to help discover new drugs, will receive upfront cash and possible milestone payments. Eli Lilly and Isomorphic Labs will team up to discover small molecule therapeutics for multiple targets. Isomorphic will receive $45 million upfront, with up to $1.7 billion in milestone payments as well as possible royalties. The Novartis-Isomorphic collaboration will focus on finding small molecule therapeutics vs. three targets. Alphabet's Isomorphic gets $37.5 million cash now, along with Novartis covering some research costs. It's als0 eligible for up to $1.2 billion in milestone payments, plus possible royalties. Eli Lilly stock rose 1.2% to 626.03  Monday, erasing early losses. Shares leapt 6.1% to 618.55 last week, clearing early entries on Tuesday and Wednesday. On Thursday, LLY stock briefly topped a 629.97 flat-base buy point. NVS stock edged up 0.7% to 107.08. Shares jumped 5.3% last week to 106.31. Shares are now extended from a double-bottom buy point of 98.69, decisively cleared in the final days of last year. GOOGL stock climbed 2.3% to 138.84. Google sank 2.8% last week to 135.73, falling below a 139.42 cup-with-handle buy point and testing support at the 10-week line. Please follow Ed Carson on Threads at @edcarson1971, X/Twitter at @IBD_ECarson and Bluesky at @edcarson.bsky.social for stock market updates and more. YOU MIGHT ALSO LIKE: Want To Get Quick Profits And Avoid Big Losses? Try SwingTrader Best Growth Stocks To Buy And Watch IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Bitcoin ETFs Are Coming Fast. Crypto Investing Will Never Be The Same. It's Been An Abysmal Two Years. But Biotech Is Looking Up. Three AI Stocks Among S&P 500's Top Performers 3/29/2024\nBuying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the... 3/29/2024\nBuying a stock is easy, but purchasing the right stock... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}