{
    "title": "GOOGL Stock: Google Earnings Outlook: AI Uncertainty, Cloud, Capital \nSpending, YouTube",
    "date": "1/29/2024",
    "url": "https://www.investors.com/news/technology/googl-stock-google-earnings-2024-outlook-ai-cloud-capital-spending/",
    "text": "BREAKING: Futures Loom After 'Good' Inflation Data     Google parent Alphabet (GOOGL) as usual isn't expected to offer profit or revenue guidance for GOOGL stock when it reports earnings on Tuesday. So analysts focused on the 2024 outlook for Google stock will crunch fourth quarter trends as well as management commentary on generative artificial intelligence, cloud computing, capital spending and the core digital advertising business. Google could update the search for a new chief financial officer. Ruth Porat is stepping down as CFO for a new role as president and chief investment officer. Wall Street analysts polled by Factset expect Google's 2024 revenue to grow 11.5%, up from 8% in 2023. Alphabet earnings per share will grow 16.5% versus 26% last year, according to consensus estimates. Heading into the Google earnings report, GOOGL stock has climbed 9%. GOOGL stock rose 58% in 2023, though other big cap tech stocks — Meta Platforms (META), Amazon.com (AMZN) and Netflix (NFLX) did even better. How the emergence of generative AI will impact Google's digital ad and internet search business is the hottest topic for investors. Google is among AI stocks to watch. Analysts also are focusing on cloud computing trends, capital spending, cost cutting/job cuts, and YouTube's short-form video ad growth amid competition with TikTok. Microsoft's (MSFT) partnership with startup OpenAI remains a concern. At Bank of America, analyst Justin Post said in a report: \"In 2023, GOOGL stock benefited from a recovery in the ad market, a diminishing overhang from ChatGPT, new product launches reaffirming AI positioning and free cash flow valuation support.\" He added: \"With AI positioning as the top debate on the stock, we see 2024 as a crucial year for Google, which could help establish Google as either an AI leader or at risk for further search erosion.\" One concern on Wall Street is how much Google will ramp up capital spending in 2024. It's building out data center infrastructure for gen AI projects. At TD Cowen, analyst John Blackledge has upped his 2024 capital spending outlook for Google stock. Consensus estimates call for Google's capital spending to grow nearly 15% in 2024 to $36.51 billion. Blackledge expects much higher 2024 capex. \"We now forecast 2024 capex of $41.8 billion (vs. $39.2 billion prior), plus 29% year-over-year and 15% above consensus as GOOG ramps data center spend to support gen AI initiatives. We expect ramping capex spend to support Google's gen AI efforts at Google Cloud and across biz segments including search, YouTube, etc.\" Forget The Magnificent Seven. Focus On These Fab Five. Despite buzz around corporate adoption of gen AI, Google's cloud computing business missed estimates for GOOGL stock in the September quarter. Google's core cloud customers are tech companies and startups. Google said cloud-computing revenue rose 22% to $8.41 billion, missing Q3 estimates of $8.64 billion. Google's cloud-computing business posted 28% growth in the June quarter. One question for GOOGL stock investors is whether Microsoft's cloud business is gaining share at Alphabet's expense. \"Google Cloud's (order) backlog is improving, but it's early on AI revenue,\" said Jefferies analyst Brent Thill in a report. \"Our checks indicate the peak of cloud cost optimization has passed, and buyer sentiment has shifted to resumed cloud transformation, including data modernization in preparation for AI deployments. However, the pace remains measured and gradual, with revenue inflection unlikely until (late) 2024.\" Of course, the internet giant garners most revenue from digital advertising. At Oppenheimer, analyst Jason Helfstein said in a recent report on GOOGL stock: \"While we expect the ad market to improve in the second half of 2024 on Federal Reserve rate cuts, we are adopting a more wait-and-see approach as the timing remains uncertain.\" Wedbush analyst Daniel Ives is upbeat. \"We believe the near-term outlook for Google is more positive than negative with the core advertising business set to accelerate in 2024 against minimal headcount growth and continued cost discipline, which should support modest operating margin gains.\" Follow Reinhardt Krause on X, formerly called Twitter, @reinhardtk_tech for updates on artificial intelligence, cybersecurity and cloud computing. YOU MIGHT ALSO LIKE: Can Meta Rejoin Apple, Microsoft, Amazon, Nvidia In The Trillion-Dollar Club? IBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today Learn How To Time The Market With IBD's ETF Market Strategy Get Free IBD Newsletters: Market Prep | Tech Report | How To Invest These Seven Stocks Lead Huge Earnings Wave; What To Do 3/29/2024\nBuying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the... 3/29/2024\nBuying a stock is easy, but purchasing the right stock... The IPO pipeline is bulging with companies that are registered, ready to go, and closely watching the performance of new stocks like Reddit. (Impressario Ink/Shutterstock) Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! Get market updates, educational videos, webinars, and stock analysis. Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content. Notice: Information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. The information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. Authors may own the stocks they discuss. The information and content are subject to change without notice. *Real-time prices by Nasdaq Last Sale. Realtime quote and/or trade prices are not sourced from all markets. Ownership data provided by Refinitiv and Estimates data provided by FactSet. © 2000-2024 Investor's Business Daily, LLC. All rights reserved "
}