{
    "title": "Google: It Warrants A Large Allocation (NASDAQ:GOOG)",
    "date": "1/5/2024",
    "url": "https://seekingalpha.com/article/4661356-google-it-warrants-a-large-allocation",
    "text": "400tmax 400tmax Google (NASDAQ:GOOG) (NASDAQ:GOOGL) is an exceptional company that I deem fairly valued with very few major risks. My thesis is that while the firm may experience slower top-line growth, it is geared up for not only significant bottom-line expansion but also a market-leading presence in its AI initiatives driving this. Most important to my thesis is that the firm may be laying off a large amount of its workforce as it integrates artificial intelligence and automation into its operations. The head of ad sales for major accounts in the US, Sean Downey, revealed a re-organization of Google's ad sales team. While he did not mention any layoffs, there is speculation that up to 30,000 jobs could be cut. While I do not believe this will happen so soon, I think the outlook of such a thing happening is close to inevitable. I believe 2024 will be another year of setting the stage for radical AI-driven restructurings to come. Google fired 12,000 employees at the beginning of 2023. AI is being used more for testing ad copy variations, with suggestions for keywords, visual element optimization, and engagement tools. It is also aiding in audience segmentation for more precise ad targeting and is enabling predictive analytics to anticipate campaign opportunities and challenges. An increase in short-form video ads from YouTube Shorts is expected, and Search will become more visual, with images and graphics more prevalent in Search ads. Specific AI integrations already underway include the Google Search Generative Experience, which incorporates generative AI into a seamless and user-friendly Google experience. The company also has data on over four billion people worldwide, which is a significant advantage in its AI efforts. Gemini, a new family of large language models, should enhance applications like the Google Search Generative Experience, and AI is also being added to operating systems, potentially driving revenue from new streams in chatbots, copilots, and APIs. The organization is also venturing into healthcare AI and taking AI ethics seriously in its expansion endeavors. My main financial outlook for Google is that it is going to struggle with revenue opportunities due to its size now, but has a strong margin outlook. This idea is reiterated in Seeking Alpha Quant's Factor Grades for the firm, listing its growth as a B and its profitability as an A+: Seeking Alpha Seeking Alpha To understand this further, I wanted to look at the company's long-term revenue versus net income: Author, Using Seeking Alpha Author, Using Seeking Alpha However, this isn't enough for me to gauge the risk of the company's revenues slowing down, so I wanted to get a closer look at the firm's long-term revenue growth rates: GuruFocus GuruFocus From this data, we can see that Google's EPS without NRI is growing at a much faster rate than its revenues over the last five years on average, until recently, when the firm saw the significant decline in net income indicated on the Seeking Alpha chart above. If I then add the gross profit margin to the equation, we can see a problem that has been on the company's hands for quite some time related to an increase in employee numbers that had outpaced business growth, which is evidence of the revenue growth concerns I mentioned earlier, as well as an indicator that the company is going to double-down on a lean organizational structure supported by automated tasks. That seems almost unavoidable if the firm wants to keep on growing shareholder returns. Author, Using Seeking Alpha Author, Using Seeking Alpha Hence, the real concern here is whether Google can continue to grow revenue at a reasonable pace, and the opportunity is if it can maximize shareholder value by efficient restructurings hinged on automation. Whether or not the company does this now or not may be a matter of timing and ethics, but I think whether it does it at all is undoubtedly considering the general shift society is experiencing toward robotics, AI, machine learning, and automated labor. The societal implications caused across multiple companies should be large, and many decades out could result in political and governmental shifts to more radically socialized basic income in my opinion, as the need for human labor decreases. My analysis shows me the firm is fairly valued, even though receiving a D grade from Seeking Alpha's Quant system. The reason for this is that great companies deserve a premium valuation, and Google is certainly one such great company in terms of forward operational strategies and historical financial performance. Author, Using Seeking Alpha Author, Using Seeking Alpha Relative to Tencent (OTCPK:TCEHY), both Google and Meta (META) are highly valued, but this is expected due to the general undervaluation of many Chinese technology stocks at the moment. Instead, comparing Google to Meta presents the former as a slightly more favorable stock in terms of value on the surface. However, according to Seeking Alpha, Google's PEG ratio is 8, Quant Factor Grade is F, and Meta's is 4.08, with a Quant Factor Grade D-. I believe that this poor earnings growth is temporary, however, and it is worth bearing in mind that the technology sector recession was global and looks to ease in mid-to-late 2024, in my opinion, with 2025 allowing for more top-line growth and a chance for the firms to maximize margins based on automation as discussed earlier. My outlook is primarily reliant on interest rate decreases expected this year and inflation easing after a difficult post-pandemic period. Author, Using Seeking Alpha Author, Using Seeking Alpha Google has faced a significant antitrust win by Epic Games over its app store. This significantly reinforced investors' concerns over the regulatory risk associated with the stock in relation to its monopoly practices in 2024 and beyond. Additionally, the launch of Gemini AI for cloud users has had mixed results. Confidence was relatively dampened due to a PR disaster, but the product seems to genuinely aid in enhancing efficiency and cost management. This may affect public and investor sentiment over Google's AI abilities in the short term and may lead to less stock growth over ungrounded and speculative transitory fear. Google is a leader in its field and a top technology stock that most people have in their portfolio. I think it's one of the safest technology stocks to own due to its large market saturation and a business model that is well diversified among many elite fields with stronger moats than most. My analyst rating for the firm is Buy; I believe it warrants a large allocation, and I'm looking at increasing its weight in my portfolio to around 7.5%. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of GOOGL, GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}