{
    "title": "Why are so many companies 'rightsizing'?",
    "date": "1/14/2024",
    "url": "https://www.businesstimes.com.sg/companies-markets/why-are-so-many-companies-rightsizing",
    "text": "AS the era of low interest rates came to a halt over the past two years, hundreds of tech companies slashed jobs. Alphabet, Google’s parent company, cut 12,000 jobs, or about 6 per cent of its global workforce, at the start of 2023. Meta laid off more than 10,000 employees, or roughly 13 per cent of its staff. So did other household names, including Microsoft, Amazon and Disney. More than 260,000 tech employees were laid off in 2023, according to Layoffs.fyi, a site that tracks job cuts across the tech industry. Google just announced more cuts this month. Some executives were squeamish about using the term “laid off,” so many cloaked such discussions in opaque language. “The term ‘rightsizing’ sounds more neutral,” said Roger Lee, creator of Layoffs.fyi, adding that the phrase is also used “to convey the fact that these companies did a lot of hiring the past couple years, and now realize, given the current economic reality, it makes sense for the business to go back to a smaller size.” Start and end each day with the latest news stories and analyses delivered straight to your inbox. Some layoffs were announced in the strange, isolating environment of remote work settings – with workers shutting down their laptops, in their living rooms, knowing they might never speak to their teammates again. When Wayfair, the furniture retailer, announced last January that it was laying off 1,750 employees, or 10 per cent of its workforce, the company said it was part of a “rightsizing” plan. That same month, when PayPal eliminated 2,000 full-time roles, or 7 per cent of its overall staff, the company also discussed “rightsizing our cost structure.” But experts caution that avoiding the phrase “job cuts” doesn’t soften the blow for employees. “This language can dehumanize the process,” Lee said, “and perhaps have the unintended effect of making the employee feel that the company doesn’t fully realize the real impact the decision has.” Sandra Sucher, a Harvard University professor of management who has studied layoffs, said using euphemisms during a layoff process could reflect the psychological phenomenon of “moral disengagement,” in which business leaders rely on squishy language to distance themselves from the ethics of their decisions. But for workers, the term “rightsizing” means one thing: They’ve been laid off. NYT BT is now on Telegram! For daily updates on weekdays and specially selected content for the weekend. Subscribe to  t.me/BizTimes Get the latest coverage and full access to all BT premium content. Browse corporate subscription here SPH MEDIA DIGITAL NEWS MCI (P) 064/10/2023 © 2024 SPH MEDIA LIMITED. REGN NO. 202120748H "
}