{
    "title": "Big Tech Announces Another Round of Job Cuts As It Continues Its Expensive \nEfforts To Turn GenAI Into Bus",
    "date": "1/26/2024",
    "url": "https://www.benzinga.com/24/01/36806233/big-tech-announces-another-round-of-job-cuts-as-it-continues-its-expensive-efforts-to-turn-genai-int",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW According to data from S&P Global Market Intelligence, Amazon.com Inc AMZN, Google-parent Alphabet GOOGGOOGL, Microsoft Corporation MSFT, Meta Platforms META and Apple Inc AAPL hold the highest cash and short-term investment balances among nonbanking companies in the S&P 500 community. Although they are not hurting cash-wise, they are also quite careful about their spending. Amazon and Google-parent Alphabet entered the new year by announcing more layoffs. Last year, Amazon, Google, along with Microsoft, Meta and Salesforce Inc CRM, trimmed their respective workforces by 6% to 13%, but layoffs started back in 2022, costing several thousand employees their jobs. Last week, Google announced its job cuts across engineering and hardware teams as it continues its push for greater efficiency. Although other parts of the tech giant were affected, mostly impacted were workers in hardware, central engineering and Google Assistant voice-activated software product. As it continues to keep up with its rivals, Microsoft and Amazon, Google eliminated about 12,000 jobs last year under the leadership of Sundar Pichai. The e-commerce and cloud titan, Amazon laid off hundreds across Twitch, Prime Video and MGM Studios divisions, taking the overall job cuts to 27,000. Last year alone, Amazon laid off about 18,000 employees. Although it seems like a strange time for job cuts considering that Big Tech ended 2023 by exiting the post-pandemic slump with the recovery of online advertising, Big Tech is in an expensive arms race to build AI services. Therefore, it is not a surprise that Google and Amazon opted to continue the trend of cost-cutting efforts, while streamlining operations and focusing on key projects. But even though this year will bring increased AI spending, its impact on revenue will likely be limited. Although generative AI is expected to pay out big-time, but turning GenAI magic into the desired top and bottom-line business impact will take time. Microsoft gained the early lead in the AI-race thanks to its partnership with the ChatGPT creator, OpenAI, but Amazon and Google are determined to catch up and to do so, they will need to spend their billions wisely. DISCLAIMER: This content is for informational purposes only. It is not intended as investing advice. This article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}