{
    "title": null,
    "date": "1/18/2024",
    "url": "https://kashmirreader.com/2024/01/18/expect-more-job-cuts-at-google-this-year-sundar-pichai-tells-employees/",
    "text": "Our endeavour to pursue free and fair journalism is possible only when we are both editorially and financially sound. Click here for more By KR Desk on 11:32 pm January 18, 2024No Comment New Delhi: Google CEO Sundar Pichai has reportedly warned employees to brace themselves for more job cuts this year.\nGoogle, which has let go over a thousand employees across various departments in the last one week or so, is likely to go for more job cuts, reports The Verge, citing an internal memo.\n“We have ambitious goals and will be investing in our big priorities this year,” Pichai told employees in the memo.\n“The reality is that to create the capacity for this investment, we have to make tough choices,” he added.\nIn the memo, Pichai said that latest “role eliminations are not at the scale of last year’s reductions, and will not touch every team”.\n“But I know it’s very difficult to see colleagues and teams impacted,” the Google CEO added.\nThe layoffs this year are about “removing layers to simplify execution and drive velocity in some areas”.\n“Many of these changes are already announced, though to be upfront, some teams will continue to make specific resource allocation decisions throughout the year where needed, and some roles may be impacted,” Pichai further wrote.\nAfter laying off nearly 1,000 employees last week, Google is also reportedly slashing “a few hundred” more jobs in its advertising sales team as part of an ongoing restructuring exercise.\nPhilipp Schindler, Google’s chief business officer, told staff in a memo that the fresh job cuts “were the result of changes to how Google’s sales team operated”, Business Insider reported.\nA Google spokesperson also confirmed that “a few hundred roles globally are being eliminated” as part of the restructuring.\nIn January last year, Google cut its workforce by 12,000 people, or around 6 per cent of its full-time employees.\nAgencies  Expect more job cuts at Google this year, Sundar Pichai tells employees added by KR Desk on 11:32 pm January 18, 2024View all posts by KR Desk → ________________________________ Our endeavour to pursue free and fair journalism is possible only when we are both editorially and financially sound. We are the organisation that has dreamt of becoming a voice of the voiceless and has pledged to be with the truth. We will never give up; we will persevere to the last drop of our ink. MORE Your email address will not be published.  Save my name, email, and website in this browser for the next time I comment.  Δ "
}