{
    "title": "Alphabet’s Share Price: what to expect from Q4 results",
    "date": "1/23/2024",
    "url": "https://www.ig.com/en/news-and-trade-ideas/alphabet--goog-_s-share-price--what-to-expect-for-q4-2023-result-240124",
    "text": "We want to clarify that IG International does not have an official Line account at this time. We have not established any official presence on Line messaging platform. Therefore, any accounts claiming to represent IG International on Line are unauthorized and should be considered as fake. CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. \n CFDs are complex instruments. 70% of retail client accounts lose money when trading CFDs, with this investment provider. You can lose your money rapidly due to leverage. Please ensure you understand how this product works and whether you can afford to take the high risk of losing money. View more search results Alphabet Inc is set to release its Q4 financial results on 30 January 2024, after market closes. Alphabet Inc is set to release its quarter four (Q4) financial results on 30 January 2024, after market closes.  For Alphabet’s upcoming results, expectations are for a broad recovery on all fronts. Double-digit growth in both its key segments (Google cloud and Google services) are expected to power a 12.1% year-on-year (YoY) growth in overall revenue to US$85.3 billion. Likewise, its 4Q 2023 earnings per share (EPS) is expected to improve to US$1.59 from previous quarter’s US$1.55, which will extend its streak of positive YoY EPS growth to the third straight quarter. Advertisement revenue accounts for 78% of Alphabet’s top-line. Having reverted to positive YoY growth over the past two quarters, the recovery momentum for the segment is expected to continue with a stronger 11.6% growth in 4Q 2023, up from the 9.5% in 3Q 2023. Increasing views of a US soft landing and further clarity of a peak in the Federal Reserve (Fed)’s hiking cycle in 4Q 2023 may see business confidence return, which could further accelerate ad spending ahead. Back in 3Q 2023, Alphabet’s management guided that there has been some ‘stabilisation’ in advertising spend, which seems to set the tone for better times ahead.   With the ongoing traction towards generative artificial intelligence (AI), Alphabet has previously incorporated AI-powered solutions like Search and Performance Max to help customers increase their ad’s return on investment (ROI), which may allow Alphabet to defend its edge over the broader advertising industry. Further integration of Bard with Google apps and services will also be on the lookout, but no doubt it will be a race against time against Microsoft, who has been a first-mover with its ChatGPT. Microsoft’s Copilot feature to integrate AI into its office applications will also serve as a threat to Alphabet’s cloud-based products, including Google Sheets and Google Docs, while further developments of Microsoft's search engine Bing could continue to compete for Google’s market share. The race to unlock synergies of generative AI on product offerings will remain tight, with any progress of new features on close watch at the upcoming earnings call. In the 3Q 2023 results, Alphabet topped both revenue and EPS estimates, but its share price plunged as much as 10% in a single day due to a miss in its cloud revenue. This highlights the importance that market participants are placing on this segment as Alphabet’s key growth driver, amid the rising trend of generative AI which should translate to growing demand for public cloud services. Any lack of growth momentum on that front could mean losing market share to Amazon Web Services (AWS) and Microsoft Azure – the other frontrunners in the highly-competitive cloud computing space. With that, a significant miss on this segment could singlehandedly drag the stock price down, given that the company has been investing heavily in its cloud unit and market participants naturally carry high expectations for its growth.   YouTube Shorts (Alphabet’s short-form video feature as a reply to competitor TikTok) has been delivering thus far. In the 3Q 2023 results, it is reported to have 70 billion daily views, a significant growth from the 50 billion daily views at the beginning of 2023. With that, some focus will be on whether the solid momentum in both the YouTube’s ads and subscription businesses from 3Q 2023 can be mirrored in the upcoming results as well.  Alphabet’s share price has been trading on a series of higher highs and higher lows since the start of 2023, with price movement fitting into a broad ascending channel pattern. Trading above its Ichimoku cloud on the daily chart, along with various moving averages (MA) (100-day, 200-day), validates the overall upward trend as well. On the weekly chart, its weekly relative strength index (RSI) has also been trading above its key 50 level since March 2023, briefly retesting the key level back in October 2023, which managed to see some defending from buyers. Ahead, buyers may eye for a potential retest of its all-time high at the US$152.00 level, with current prices standing just 3% away from the target. On the downside, immediate support to defend may be at the US$142.50 level. A stronger area of support confluence may be found at the US$132.40 level, where the lower channel trendline coincides with the lower edge of its Ichimoku cloud on the daily chart.  This information has been prepared by IG, a trading name of IG Markets Limited. In addition to the disclaimer below, the material on this page does not contain a record of our trading prices, or an offer of, or solicitation for, a transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. No representation or warranty is given as to the accuracy or completeness of this information. Consequently any person acting on it does so entirely at their own risk. Any research provided does not have regard to the specific investment objectives, financial situation and needs of any specific person who may receive it. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such is considered to be a marketing communication. Although we are not specifically constrained from dealing ahead of our recommendations we do not seek to take advantage of them before they are provided to our clients. Go long or short on thousands of international stocks. See more forex live prices See more shares live prices See more indices live prices Prices above are subject to our  website terms and agreements. All share prices are delayed by at least 20 minutes. Prices are indicative only. See more forex live prices See more shares live prices See more indices live prices Find out what charges your trades could incur with our transparent fee structure. Discover why so many clients choose us, and what makes us a world-leading provider of CFDs. Stay on top of upcoming market-moving events with our customisable economic calendar. Share CFDs Forex Indices Commodities Other markets Web platform Trading apps MetaTrader 4 ProRealTime Compare features Demo News and trade ideas Trading strategy  Charges and margins Premium services Refer a friend Marketing partnerships Corporate accounts New clients: +44 (20) 7633 5430 or email sales.en@ig.com Clients: Help & Support  IG | Terms and agreements | Privacy | How to fund | Vulnerability | Cookies | About IG Follow us online: ^IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG Group established in London in 1974, and is a constituent of the FTSE 250 index. The risks of loss from investing in CFDs can be substantial and the value of your investments may fluctuate. 70% of retail client accounts lose money when trading CFDs, with this investment provider. CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. You should consider whether you understand how this product works, and whether you can afford to take the high risk of losing your money. CFD Accounts provided by IG International Limited. IG International Limited is licensed to conduct investment business and digital asset business by the Bermuda Monetary Authority. IG provides an execution-only service. The information in this site does not contain (and should not be construed as containing) investment advice or an investment recommendation, or an offer of or solicitation for transaction in any financial instrument. IG accepts no responsibility for any use that may be made of these comments and for any consequences that result. The information on this site is not directed at residents of the United States and is not intended for distribution to, or use by, any person in any country or jurisdiction where such distribution or use would be contrary to local law or regulation. IG International Limited is part of the IG Group and its ultimate parent company is IG Group Holdings Plc. IG International Limited receives services from other members of the IG Group including IG Markets Limited. Careers | IG Group "
}