{
    "title": "Google Parent Alphabet Avoids $1.67B Lawsuit Over AI Chip Patent",
    "date": "1/24/2024",
    "url": "https://www.tradingview.com/news/benzinga:9ba21deef094b:0-google-parent-alphabet-avoids-1-67b-lawsuit-over-ai-chip-patent/",
    "text": "Alphabet Inc.'s GOOG GOOGL Google on Wednesday settled a patent lawsuit concerning AI technology, which demanded a staggering $1.67 billion. What Happened: The lawsuit was filed by Singular Computing, a company founded by Massachusetts-based computer scientist Joseph Bates, alleging that Google misappropriated its computer-processing solutions, reported Reuters. The case was due to start closing arguments on the day of the settlement. Singular Computing argued that Google had incorporated Bates’ technology into processing units that enable AI capabilities in various Google services. See Also: Google's AI Search – A Double-Edged Sword for Publishers Like the Atlantic The lawsuit, initiated in 2019, claimed that Google’s Tensor Processing Units, launched in 2016, duplicated Bates’ technology and violated two patents. Singular maintained that versions 2 and 3 of the units, launched in 2017 and 2018 respectively, infringed on its patent rights. Google disputed these allegations, asserting that its technology is “fundamentally different than what is described in Singular’s patents.” The terms of the settlement remain undisclosed. Both Google and Singular acknowledged the settlement but withheld further details, the report noted. Why It Matters: This settlement comes amidst a period of significant changes in Google’s AI division. Just days before the lawsuit settlement, Google’s parent company Alphabet announced its split from its Australian AI training partner, Appen. Appen was a significant revenue source for Alphabet, making up around one-third of Appen’s total earnings. The separation decision was made following a strategic review process led by Google CEO Sundar Pichai, impacting at least two thousand subcontracted Alphabet workers. Photo by Pawel Czerwinski on Unsplash. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Can AI Write Your Emails? Google Tests ‘Draft With Voice' In Gmail Disclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors. © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Traders and investors use our platform. Top website in the world when it comes to all things investing. Mobile reviews with 4.9 average rating. No other fintech apps are more loved. Custom scripts and ideas shared by our users. @jonagalletaso @mytradingsetup @sopht_fx @glentraderfx @tradingjunkies.shop @j.kruysbergen @ftmocomx @jordforex @Amrullah @AthanT_ @ketoryfx @bradfairbridge @TradingView @quantfurian @zeroskiifrmz @MidasPls @danielllgaleano @yurileblon Whatever the trade "
}