{
    "title": "Nvidia market cap threatens Alphabet",
    "date": "2/15/2024",
    "url": "https://www.thestar.com.my/business/business-news/2024/02/15/nvidia-market-cap-threatens-alphabet",
    "text": "Thursday, 15 Feb 2024 Upward trajectory: A sign at Nvidia headquarters in Santa Clara, California. The company’s stock hit record highs on Monday after analysts raised their outlook on the company. — AFP NEW YORK: Nvidia is on the verge of overtaking Alphabet as Wall Street’s third most valuable company. The dominant artificial intelligence (AI) chipmaker ended Tuesday with a market capitalisation above Amazon’s for the first time in two decades. Nvidia’s shares slipped 0.17%, leaving its stock market value at US$1.78 trillion, eclipsing Amazon’s US$1.75 trillion value after the online shopping and cloud-computing heavyweight’s stock declined 2.15%. Google-owner Alphabet’s stock dipped 1.62%, leaving its market capitalisation at US$1.81 trillion. Nvidia has been a top beneficiary of technology companies’ race to build AI into their products and services, with its graphics processors in short supply as Meta Platforms and other Big Tech companies buy billions of US dollars worth of its components. Mizuho in a client note raised its price target for Nvidia’s stock to US$825 from US$625 ahead of the Santa Clara, California, company’s quarterly results due on Feb 21. The stock ended Tuesday at US$721.28. Lead times for Nvidia’s top-shelf H100 processor have declined, “but overall demand far outstrips supply”, Mizuho analyst Vijay Rakesh wrote, adding he sees “substantial AI upside” for Nvidia, Broadcom and Advanced Micro Devices. Nvidia controls about 80% of the high-end AI chip market, a position that has sent its stock up 46% this year after more than tripling in 2023. Technology-related companies, including Microsoft and Meta, have also rallied to record highs on AI optimism. Alphabet has put chatbot technology into its Google search engine while marketing generative AI tools to cloud customers. Its stock hit an all-time high a day before its quarterly report on Jan 30 failed to meet investors’ high expectations and sent its shares tumbling. Alphabet’s stock remains up 4% in 2024. Nvidia’s market capitalisation briefly overtook Amazon’s on Monday, but Amazon was back on top by the end of that trading session. The previous time Nvidia was more valuable than Amazon was in 2002, when they were each worth under US$6bil. By mid-2004, Nvidia’s stock market value had tumbled to under US$2bil as Alphabet listed its shares at a valuation of US$23bil. An early leader in the AI race, Microsoft in January overtook Apple to become the world’s most valuable company, now valued at over US$3 trillion. State oil giant Saudi Aramco is the world’s third most valuable publicly listed company, according to LSEG. Widely viewed as lagging in the AI race, Apple’s stock has dropped 4% in 2024. Saudi Aramco has a US$2 trillion market capitalisation, although over 90% of it is closely held by the government of Saudi Arabia and less than 2% of its shares are available for trading by investors. — Reuters Tags / Keywords:\nNvidia\n                                                                ,\n                                                                                                MarketCapSurge\n                                                                ,\n                                                                                                AIRevolution\n                                                                ,\n                                                                                                TechStocks\n                                                                ,\n                                                                                                AlphabetAmazonChallenge\n                                                                ,\n                                                                                                Top3Battle Topic:  Report it to us. Thank you for your report!  Copyright © 1995-\n            \n\n Star Media Group Berhad [197101000523 (10894-D)] Best viewed on Chrome browsers.  We would love to keep you posted on the latest promotion. Kindly fill the form below We hope you enjoy this feature! "
}