{
    "title": "Stocks climb to new highs even as big-tech trade splinters",
    "date": "2/4/2024",
    "url": "https://telecom.economictimes.indiatimes.com/news/internet/stocks-climb-to-new-highs-even-as-big-tech-trade-splinters/107398040",
    "text": "It was an anxious stretch for bulls by any measure. The 13th gain in 14 weeks for the Nasdaq 100 masked wildly divergent reactions in stocks whose soaring valuations are threatening what has long been a monolithic trade in tech heavyweights. Among the five tech giants that announced quarterly results this week, two of them saw their stocks go up post earnings while three were down, breaking the almost lockstep rally that’s been fueled by optimism over artificial intelligence since early 2023. An Alphabet Inc. earnings flop in the grip of an historically narrow stock rally with echoes of the dot-com bubble. Jerome Powell downplaying hopes of early interest-rate cuts. A fresh regional bank rout.Yet for the Wall Street drama this week, the bull market powered on thanks to soothing economic data and strong reports from Meta Platforms and Amazon.com. The twist: The easy buy-and-hold trade on the Magnificent Seven is now on shakier ground.It was an anxious stretch for bulls by any measure. The 13th gain in 14 weeks for the Nasdaq 100 masked wildly divergent reactions in stocks whose soaring valuations are threatening what has long been a monolithic trade in tech heavyweights. Among the five tech giants that announced quarterly results this week, two of them saw their stocks go up post earnings while three were down, breaking the almost lockstep rally that’s been fueled by optimism over artificial intelligence since early 2023.\n\nAdvt\n\n\n\n\n\nFrom Fed Chair Powell’s rejection of a March rate cut to the collapse of New York Community Bancorp Inc., the market faced arguably the toughest week of news since October. And yet buttressed by signs the economy remains strong, the S&P 500 managed to score a fresh all-time high.“It may be a little premature to draw too many conclusions, but the results do seem to reflect the view that we can avoid a recession,” Greg Martin, co-founder at Rainmaker Securities said, citing tech earnings this week. Given the run-ups the Magnificent Seven have seen, “I want to see a broader rally, with other companies participating,” he said. Among economic reports, everything from consumer confidence to construction spending and hiring posted gains. However uneven the market reactions, virtually all the sales and earnings posted by the five tech megacaps this week showed robust growth. Quarterly revenue among the quintet rose by an average 15% and totaled nearly half a trillion dollars.Up 1.4% over five days, the S&P 500 posted a fourth straight weekly gain, fully erasing losses at the start of the year to end January in positive territory. The Nasdaq 100 and Dow Jones Industrial Average also advanced, building on a three-month rally that has added more than $8 trillion in total equity values.Ten-year Treasury yields pulled back over the week before a spike on Friday’s hot jobs report, as investors sought safety in government bonds amid renewed anxiety over regional banks and the health of the commercial real estate market.Meta Platforms was the standout, surging 20% after projecting better-than-expected sales and initiating a quarterly dividend. Amazon.com jumped as the online retailer’s strategy on cost-cutting and focus on services that make money paid off.\n\nAdvt\n\n\n\n\n\nOn the other side of the spectrum, Alphabet reported a narrow miss on sales in its core search unit while Microsoft’s growth in its cloud business disappointed some investors. Apple’s sales plunged in China, a long-prized market that generates roughly a fifth of its revenue.Nvidia Corp., a poster-child of the AI frenzy that’s surged 34% this year, is scheduled to report results later this month.While poor earnings reactions highlight the danger of expectations running too much ahead of reality, the fact that their weakness failed to rattle the market is comfort to the tech faithful. For six straight weeks though last Friday, investors have poured fresh money into the Invesco QQQ Trust (ticker QQQ), the largest exchange-traded fund tracking the Nasdaq 100. That’s a stretch of inflows not seen since April 2022.The resilience is also welcome news to equity bulls who just warmed up to the rally. From stock pickers to trend followers, investors boosted their aggregate equity positioning to a six-month high last week after keeping their exposure in a tight range since December, according to data compiled by Deutsche Bank AG. Predictably, strategists at firms including JPMorgan Chase & Co. and Bank of America Corp. sounded alarms. They drew a parallel between Big Tech’s concentration today and the dot-com bubble two decades ago and said their pace of gains is likely unsustainable. The cohort has surged 80% in the past year, while the average stock in the S&P 500 is up only 3%. Such skepticism is shared by Ken Laudan, who holds fewer internet and software giants in his Buffalo Large Cap Fund than suggested by its benchmark. The underweight position “is not owing to secular growth concerns. It’s owing to the fact that I’m not getting compensated enough relative to other equities that I have,” Laudan said. “AI is very unlikely to have another big macro surprise like they did last year.”The seven largest tech stocks were traded at 48 times profits, more than two times as high as the average stock in the S&P 500. As stretched as they looked, however, their profit trajectory can be framed as justifying the supremacy.Thanks to their dominant position in everything from e-commerce to cloud computing and electronics, the big seven’s profits are expected to expand at an average annual pace of 14% in the next three to five years, analyst estimates compiled by Bloomberg show. That’s 4 percentage points higher than the forecast growth rate for the S&P 500.When a secular trend like AI kicks in, valuation analysis stops working because companies have years or decades to grow into multiples, according to Ankur Crawford, co-manager of the Alger Capital Appreciation fund. By commenting, you agree to the Prohibited Content Policy By commenting, you agree to the Prohibited Content Policy News See whats happening in Telecom sector right now Exclusive Read and get insights from specially curated unique stories from editorial Leaders Speak Business leaders sharing their insights Events Explore and discuss challenges & trends in India's leading B2B events Awards Recognise work that not only stood out but was also purposeful Webinars Join leaders & experts for roundtables, conferences, panels and discussions Subscribe to our Daily Newsletter  By continuing you agree to our Privacy Policy & Terms & Conditions Advertise With Us We have various options to advertise with us including Events, Advertorials, Banners, Mailers, etc. Download ETTelecom App Save your favourite articles with seamless reading experience Get updates on your preferred social platform Follow us for the latest news, insider access to events and more. About Us Contact Us Newsletters "
}