{
    "title": null,
    "date": "2/18/2024",
    "url": "https://seekingalpha.com/article/4671205-3-stocks-i-cant-wait-to-buy-on-a-dip",
    "text": "Torsten Asmus  Torsten Asmus A dip in the roaring market is coming. When the market is at all-time highs and rising daily, it's easy to get caught up in the frenzy. But patience can lead to higher returns later. There will be a pullback; the only question is when. Many stocks have gone parabolic in 2024, eclipsing 2021 highs and pushing valuation metrics out of the norm. There are many reasons, and I'll highlight two. First, the economy is in better shape than many thought. The recession we were promised has yet to materialize. I thought we would see a softening in consumer spending by now, but there is little sign of that. However, I never bought the narrative that we would see up to six rate cuts this year. It's fashionable to criticize the Federal Reserve and Jerome Powell; however, it has set itself up nicely. The economy is growing even with rates above 5%. Each percentage point is an arrow in the Fed's quiver if the economy slows. Don't expect it to give them up easily. People are also returning to the workforce, easing the labor shortage and inflation. I recently spoke to a \"small\" ($70 million revenue) business associate who operates in an industry critical to the economy. The business had 140 applicants for a recent job posting. Coming out of the pandemic, there would typically be just one or two (and sometimes zero). Could the lack of rate cuts be the catalyst for a healthy pullback? The second is artificial intelligence (AI). Make no mistake; the technology is transformative. But, it is pushing the boundaries of many stock valuations, and there is a lot of hype. A pullback could be in order. Having a \"market dip\" wish list is wise. Here are a few on mine. Companies can cut many expenses during periods of economic uncertainty, like marketing, research, and employee costs. But cybersecurity is a critical need that would be foolish to trim. This is the argument I used during the dog days of 2022 and recovery in 2023 when buying CrowdStrike (CRWD) and Palo Alto (PANW). Both stocks have outperformed. CrowdStrike led the charge of comprehensive, cloud-based, modular security to $3.2 billion annual recurring revenue (ARR) last quarter, as shown below. Source; CrowdStrike Source; CrowdStrike The company improved its operating leverage, and free cash flow is booming to the tune of $655 million through Q3 fiscal 2024. I have long been on the CrowdStrike bandwagon, including this article where I \"doubled down\" at $130 per share in this article. The stock rocketed 150% since and trades at a hefty 28 times sales - too rich for me. Keep watch for a solid pullback. There is a reason Nvidia (NVDA) (one of the smartest companies on the planet) tried to buy Arm Holdings (ARM) in 2020. Arm is deeply embedded in the semiconductor market. You most likely use its design daily, as 99% of smartphones contain it. Here is an important distinction: Arm doesn't produce chips; Arm creates the architecture and licenses it to the top chip producers. It then receives royalties for each chip that goes out the door. To date, 280 billion have shipped. You may have heard of some of its customers, Apple (AAPL), Alphabet (GOOG)(GOOGL), Amazon (AMZN), Microsoft (MSFT), and Taiwan Semiconductor Manufacturing (TSM). The market is booming. Arm's Q3 fiscal 2024 results saw revenue rise 14% to $824 million - but that wasn't the story that caused this incredible jump in the stock. Data by YCharts The company reported increased adoption of its latest architecture, \"Arm v9\", which produces double the royalties of the previous version. Arm's remaining performance obligation jumped 38% year over year (YOY) from $1.75 billion to $2.4 billion. Arm has a terrific business model. It doesn't produce chips; capital expenditures are low, so free cash flow is abundant. It reported a 30% margin last quarter. A $130 billion market cap for a company with $3 billion trailing twelve-month sales is extremely pricy. The stock will likely retrace much of its recent explosion as the initial excitement wanes, and this will be an opportunity for long-term investors. I've made money on Palantir Technologies (PLTR) stock without owning a single share. When the stock crashed below $8 per share in 2022, I bought long-dated $10 call options, which I have since closed. Also, by selling put options going into the latest earnings call and closing them on the move depicted below. Data by YCharts Palantir looks like an excellent long-term play if it retraces some of this jump. Long entrenched in the defense industry, Palantir sought to expand its market by growing its commercial business, and it's bearing fruit. U.S. commercial sales rose 70% YOY last quarter to $131 million, and the U.S. commercial customer count increased 55% to 221. Total sales for the quarter rose 20% to $608 million, and Palantir was GAAP profitable for the fourth straight quarter. The release of Palantir AIP (Artificial Intelligence Platform) comes as many companies look to leverage generative AI for better decision-making and efficiency. Palantir will be an excellent partner, and this will drive further inroads into the private sector. Warren Buffett said: Most people get interested in stocks when everyone else is. The time to get interested is when no one else is. Sage advice. There are many incredible companies doing amazing things now, but valuations still matter, and patience is rewarded in the long run. Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. This article was written by Analyst’s Disclosure: I/we have a beneficial long position in the shares of ARM, AMZN, GOOG either through stock ownership, options, or other derivatives.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Investors' goals, financial situations, timelines, and risk tolerances vary widely. The stocks mentioned may not be suitable for all. As such, the article is not meant to suggest action on the reader's part. Each investor should consider their unique situation and perform their own due diligence. The author's positions included options to exit or enter at any time. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body. "
}