{
    "title": "Alphabet Stock (NASDAQ:GOOGL): AI Innovation Warrants a Higher Multiple",
    "date": "2/12/2024",
    "url": "https://finance.yahoo.com/news/alphabet-stock-nasdaq-googl-ai-075753967.html",
    "text": "Alphabet (NASDAQ:GOOGL) (NASDAQ:GOOG) stock has performed well but still hasn’t been the most magnificent of the so-called Magnificent Seven group over the past year. The artificial intelligence (AI) rally is still going strong into 2024, and though Alphabet has big AI innovation projects (perhaps better than some rivals), the stock still hasn’t been able to drive a great deal of multiple expansion in recent years. At writing, shares of GOOGL go for a very reasonable 22.2 times forward price-to-earnings (P/E), making it not only the “cheapest” Magnificent Seven stock but also a name that’s not all too much pricier than where the stock normally trades. The modest valuation alone leaves me incredibly bullish on the stock as the company looks to put its foot on the gas with Gemini (formerly Bard). With Google recently pulling the curtain on its Gemini Ultra paid tier, the firm is essentially following in the footsteps of ChatGPT-owner OpenAI. Heck, Gemini Ultra may appear to outperform ChatGPT-4 in certain measures. However, you can’t really dub either one as “better” for all uses, at least not yet. Gemini is every bit as intriguing as it is capable. But is there something fundamentally wrong with the Alphabet story as it stays on the cutting edge of AI innovation, just like many of its peers? There is one piece of hair on the GOOGL stock narrative. That lies in the high degree of uncertainty as to the fate of Google Search once AI potentially takes its place as the go-to “internet guru.” For now, it’s not yet known how many people will leave Google for greener pastures as new chatbots aim to grab a slice of share away from the previously untouchable search market. For now, it’s probably a known fact that Google is leaning heavily on the strength of its search engine when it comes to sales and earnings. Given Google’s heavy reliance on Search, I guess you could say a bear-case scenario exists that would cause some to view the stock as a bit of a value trap. Still, I think the GOOGL avoiders and skeptics are wrong to view the name as a value trap just because it’s the heavyweight champ in Search with everything to lose as consumer-facing AI gets smarter and faster by the day. If anything, generative AI products on Google could make the whole experience of Googling that much better. If there’s a company that can disrupt Google search, it’s a Google-built AI chatbot. Additionally, Google chatbots are backed by one of the most enviable search engines (and data sets) on the planet. AI chatbot hallucinations (AI just making things up) remain one of the biggest problems with AI these days. As AI models — especially those created by Google — pay more emphasis on citing sources (and the reliability of said sources), we could see more links make good use of trusted websites with a thumbs up from Google. Knowing who and what to trust is vital, especially in the age of AI, when some users may just believe their chatbots without source-checking. Could it be that a search-based LLM (large language model) is only as good as the search engine behind it? Possibly. Only time will tell if search-backed LLMs become more popular than their data-trained ones that lack access to the most up-to-date information. And with “edge AI” (on-device AI) on the horizon, it’s just too early to tell how things will pan out with AI models in the future. Personally, I see the most utility in a search-focused AI chatbot or a search engine that has a chatbot sitting off to the side, ready to assist upon request. Even if Google Search is bound to take a hit in the coming years, I’m confident that Alphabet will be able to adapt as it looks to diversify its revenue stream with a handful of powerful AI products. Just as Apple (NASDAQ:AAPL) was able to reinvent itself by shifting from the iPod (last generation’s top seller) to the iPhone, Alphabet will be able to move on from Google Search to what’s next as the industry tides shift. Today, Search represents a massive portion of the overall sales mix. But who knows what the breakdown will look like 10 years from now. My guess is that AI innovations will have grown into services that diversify the company beyond Search, perhaps putting it on the track of greater growth. Self-driving vehicle services (think Waymo), AI-assisted drug discovery, generative AI search tailored for physicians, Google Cloud with AI, Gemini, and other intriguing technologies are essentially options capable of contributing to the earnings mix over time. Indeed, they could turn Alphabet into less of a search company and more of a disruptive AI company. With that said, I view Alphabet stock as one of the cheapest AI stocks in today’s overheated tech-driven market. On TipRanks, GOOGL stock comes in as a Strong Buy. Out of 37 analyst ratings, there are 29 Buys and eight Hold recommendations. The average GOOGL stock price target is $164.56, implying upside potential of 11.5%. Analyst price targets range from a low of $141.00 per share to a high of $180.00 per share. Though GOOGL stock has been red-hot, surging nearly 60% over the past year alone, it still seems lukewarm when compared to some of its Magnificent Seven rivals. Whether Alphabet stock heats up on the back of AI to the magnitude of its peers remains to be seen. In any case, GOOGL stands out as a stock with GARP (growth at a reasonable price) written all over it. And it looks like a great pick-up, even if we are long overdue for a market correction in the first half of the year. Disclosure Related Quotes "
}