{
    "title": "Google Faces $2.3B Lawsuit from European Media Over Ad Practices - Alphabet \n(NASDAQ:GOOGL)",
    "date": "2/29/2024",
    "url": "https://www.benzinga.com/news/24/02/37393818/google-faces-2-3b-lawsuit-from-european-media-over-ad-practices",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Alphabet Inc’s GOOG GOOGL Google faces a massive 2.1-billion-euro lawsuit from 32 media groups, including Axel Springer and Schibsted. The plaintiffs accused the tech giant of inflicting financial losses through its digital advertising practices. The lawsuit highlights Google’s alleged market dominance abuse, suggesting that without such practices, these media companies would have earned significantly more from advertising and paid less for ad tech services, Reuters reports. Also Read: Meta Takes Legal Stand, Challenges EU Fee As It Battles Regulatory Scrutiny This legal action, filed in a Dutch court for its strategic importance in antitrust damage claims in Europe, reflects broader industry concerns over Big Tech’s grip on advertising revenues. The move aligns with ongoing antitrust scrutiny, including a notable 220-million-euro fine by the French competition authority against Google in 2021 and charges by the European Commission. Analysts and Google have responded, labeling the lawsuit “speculative and opportunistic” and defending its collaborative efforts with European publishers. The case underscores the evolving challenges in the digital advertising sector, particularly with the rise of generative AI technologies potentially reshaping Google’s advertising business. U.S. Big Techs, including Google, Apple Inc AAPL, Amazon.Com Inc AMZN, and Meta Platforms Inc META, remain embroiled in regulatory scrutiny and lawsuits worldwide for alleged misuse of their influence to thwart competition. Microsoft Corp’s MSFT OpenAI investment drew regulatory attention. Many takeover deals, including Nvidia Corp’s NVDA acquisition of British chip designer Arm Holdings Plc ARM succumbed to regulatory opposition. China also initiated a crackdown on its domestic tech giants, including Jack Ma, who co-founded Alibaba Group Holding Limited BABA and its fintech affiliate Ant Group. The Communication Services Select Sector SPDR Fund XLC, with a 10% exposure to GOOG and over 11% in GOOGL, has gained 9% year-to-date. Price Action: GOOG shares traded lower by 0.27% at $137.06 premarket on the last check Thursday. Also Read: Google Cloud Cautions Against Microsoft’s Monopoly Move in Cloud Computing Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}