{
    "title": "3 Artificial Intelligence (AI) Stocks That Are Screaming Buys in February",
    "date": "2/10/2024",
    "url": "https://www.fool.com/investing/2024/02/10/3-ai-stocks-screaming-buys-february/",
    "text": "Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. Founded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Artificial intelligence (AI) stocks have overperformed the market since late 2022. As the technology is likely to change the life of the average consumer dramatically, investors have flocked to the stocks that seem to lead the charge, resulting in elevated valuations for many AI stocks. Nonetheless, the spotlight hasn't been equal. Knowing that, investors might want to consider these three stocks before the market becomes more aware of their AI prowess. The emergence of ChatGPT seemed to cast doubt on AI stock Alphabet (GOOGL 0.04%) (GOOG 0.21%). This attitude might baffle investors, as the Google parent was an early AI innovator, and it has marketed itself as an \"AI-first\" company for the last eight years. Still, the sentiment seemed to shift from Alphabet amid the emergence of ChatGPT, whose parent, OpenAI, has a working relationship with Microsoft. That led to fears that consumers would stop using Google Search in favor of Microsoft's search engine, Bing. However, Alphabet bears may have overreacted. First, Alphabet has answered with its own generative AI product, called Gemini. That should at least keep it competitive with its AI peers. Additionally, Alphabet claims approximately $111 billion in liquidity. Hence, Google DeepMind or other Alphabet-owned enterprises will probably develop tools that match or surpass competitors. Also, if its in-house development falls short, that cash allows Alphabet to buy out smaller competitors. Finally, its P/E ratio of 25 is the smallest of its primary megatech peers. As it continues to benefit from AI, its stock should overcome the doubters and rise over time. Investors have bid Nvidia stock higher as it asserts a dominant position in the AI chip market. Nonetheless, investors often forget that it and competitors like Advanced Micro Devices depend on Taiwan Semiconductor Manufacturing (TSM -0.47%) to manufacture their advanced chips. The stock has suffered amid a slump in the notoriously cyclical semiconductor industry. Some investors also find the company risky, with most of its production capacity located in Taiwan, an island in the middle of a geopolitical conflict between two superpowers. However, for investors who can overlook those risks, analysts forecast a 23% revenue increase for 2024 and a 20% surge next year. Moreover, they can buy TSM stock at a recent P/E ratio of about 25. Also, the stock may finally have begun to gain traction, as it has risen by 25% over the last year. Hence, it may not be an inexpensive stock for long as more investors look for affordable investment options for the AI chip market. After years of stagnation, International Business Machines (IBM 0.08%) is finally making a comeback, and part of that story is AI. The company's purchase of Red Hat and dozens of other cloud companies made it a leading company in the cloud space, giving it a significant support role in AI. Nonetheless, IBM has also developed AI-specific services. Leading the way is its watsonx generative AI. It serves as a studio to build foundation models, create data estates, and oversee AI projects. This optimism has taken IBM stock to levels it last reached in the mid-2010s. Despite those gains, its P/E ratio has only risen to about 23. IBM data by YCharts Admittedly, its P/E ratio may be lower because IBM's mid-single-digit revenue growth is not as fast as its megatech competitors. However, in the eyes of some investors, a rising payout with a dividend yield of 3.6% makes IBM the dividend stock of the cloud. Also, since Arvind Krishna became CEO in 2020, the stock has outperformed the S&P 500. Given those returns, you might want to start buying shares before more investors begin to take notice. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Will Healy has positions in Advanced Micro Devices. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends International Business Machines. The Motley Fool has a disclosure policy. Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services. Making the world smarter, happier, and richer. © 1995 - 2024 The Motley Fool. All rights reserved. Market data powered by Xignite and Polygon.io. "
}