{
    "title": "Google One nears 100 million subscribers as Google bets big on AI",
    "date": "2/1/2024",
    "url": "https://www.techspot.com/news/101716-google-one-nears-100-million-subscribers-google-bets.html",
    "text": "The big picture: Google services continue to see remarkable growth, with Google One subscriptions nearing the 100 million mark. This was disclosed by Alphabet CEO Sundar Pichai during the company's latest earnings call. Speaking on the success of Google One, Pichai highlighted \"strong user growth\" seen by the expanded storage and premium features offered at a price. With subscription tiers ranging from 100GB to 30TB, and extras like Google Photos editing tools, Workspace upgrades, VPN access, and customer support benefits, it's easy to see the appeal for Google's most engaged users. Pichai revealed that Google One now has close to 100 million paying subscribers globally. He added that Google plans to introduce more AI features to the service and expects further growth in the future. The Google One figures were part of a broader overview of Google's booming subscription business. Pichai announced annual revenues from subscriptions now exceed $15 billion. Driving this growth are the company's core subscription services like YouTube Premium, YouTube Music, YouTube TV, and the recent addition of NFL Sunday Ticket. In fact, Pichai singled out YouTube as the \"key driver\" in pushing Google's subscription revenues over the $15 billion milestone. While specific YouTube subscriber numbers were not disclosed, the company did reveal that paid YouTube services had around 80 million subscribers as of November 2022. Clearly, YouTube remains a central pillar in Google's subscription strategy.  Looking ahead, Pichai hinted that Google One subscribers could soon benefit from advanced AI capabilities. With the unveiling of new AI technologies like Bard and Gemini, it's conceivable that premium Google One members might gain exclusive access to enhanced assistant features or content summarization tools. Google is aggressively pursuing an AI-first future across its products, employing technologies like Gemini to make existing services, such as Search, \"smarter\" and more intuitive. The conversational AI of Bard is already live in over 40 languages globally. Pichai revealed that an even more advanced version of Bard, powered by Gemini Ultra, will soon roll out and be offered to paid subscribers. Despite these promising numbers, the search giant has still been handing out pink slips. Earlier this month, Google canned around 1,000 workers across different divisions including hardware, engineering, and services. They even cut around 100 people from the YouTube team. CEO Sundar Pichai then sent a memo to employees indicating that more layoffs are expected this year, signaling stormy waters ahead. The dichotomy illustrates the complexities of tech's uncertain future, where AI promises opportunity yet disruption looms. TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark. About Us Ethics Statement Terms of Use Privacy Policy Change Ad Consent Advertise © 1998 - 2024 TechSpot, Inc. All Rights Reserved. "
}