{
    "title": null,
    "date": "2/6/2024",
    "url": "https://www.benzinga.com/markets/equities/24/02/36948376/nvidias-valuation-set-to-leapfrog-past-amazon-alphabet-as-ai-stalwarts-stock-closes-in-on-700-ma",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Nvidia Corp. NVDA shares rallied 4.79% on Monday after Goldman Sachs raised the price target to $800.  Monday’s gain pushed the stock to a fresh closing high of $693.32, and in the after-hours session, it added an incremental 1.25% to $702. Onward And Upward: Nvidia ended 2023 as the best-performing S&P 500 stock with a gain of 239%, and the upward momentum continued into the new year. The stock has surged up 40% this year, outperforming the iShares Semiconductor ETF SOXX, the S&P 500 Index, and the Nasdaq 100 Index, which are up 4.95%, 3.63%, and 4.68%, respectively for the year-to-date period. Chart courtesy of Benzinga At the end of Monday’s session, Nvidia’s market cap stood at $1.713 trillion (based on 2.71 million in outstanding shares). Source: Y Charts See Also: How to Buy NVIDIA (NVDA) Stock Nvidia is currently the sixth most-valued company behind Microsoft, Apple, Saudi Aramco, Alphabet and Amazon. The chip maker’s market cap trails that of Alphabet Inc. GOOGL and Amazon, Inc. AMZN  only by a slight margin. To move above Amazon, Nvidia has to add $57.02 billion in market cap, and for it to go past Alphabet, it needs to augment its market cap by about $80.63 billion. The calculations assume the shares of Amazon and Alphabet remain unchanged. Nvidia Stratospheric Run Sustainable? Nvidia is scheduled to report its fourth-quarter results on Feb. 21 and in the run-up to the results, there could be a scramble among sell analysts to rerate estimates and potentially even the price target for the stock. FOMO sentiment could also drive an upside in the stock. Analysts. on average, expect the company to report earnings per share of $4.50 and revenue of $20.166 billion, according to Benzinga Pro data. A year ago, the company reported earnings of 88 cents per share and revenue of $6.05 billion. Quarterly beat, solid guidance and positive updates on how Nvidia is side-stepping the China chip ban could also serve to accelerate the rally in the stock. Ahead of the quarterly results, Tigress Financial said due to Nvidia’s leadership in AI hardware and software infrastructure, the company will continue to be a core holding in the AI investment theme. It “remains at the forefront of generative AI technology development across all aspects of implementation that will continue to drive a new AI-driven business super cycle, revenue and cash flow growth, and greater shareholder value creation,” it added. Technically, the stock trades in overbought territory, with the 14-day relative-strength index at 85. An elevated number such as this could stir valuation concerns for any other stock but not for Nvidia, given the enormous growth potential the company promises Read Next: Magnificent 7 Stocks Eye $13-Trillion Market Cap: ‘They Are Sucking All The Air Out Of The Universe,’ Wall Street Veteran Says © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}