{
    "title": "News Weekly: Alphabet earnings soar, Bard picks up new tricks, and more",
    "date": "2/3/2024",
    "url": "https://www.androidcentral.com/apps-software/news-weekly-february-3-2024",
    "text": "No offers found When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. A round-up of the biggest Google/Android-related news that stood out this week. This is Android Central's News Weekly, your go-to source for a concise roundup of the week's most significant tech stories. This is where we delve into the top headlines that provide the latest developments and innovations contributing to the digital landscape. This week, we get into the massive earnings Alphabet announced for its last quarter, Amazon giving up the Irobot deal, Google introducing Gen AI in maps, Google Bard levels up with Imagen 2, and the new Android 14 beta update available only to one special phone.  Google's parent company, Alphabet, released its earnings report for Q4 and fiscal year 2023 on January 30. Alphabet's Q4 earnings report shows that the company made $83.3 billion in Q4 alone. Its full-year revenue was $307 billion, a 9% increase from 2022. According to the report, Search and YouTube subscriptions were major contributors to Q4 growth. However, Google also spent $2.1 billion in employee severance after laying off over 12,000 employees in 2023. On the earnings call, Chief Investment Officer Ruth Porat hinted at more layoffs and a slower hiring pace in the near future as they continue to focus on \"removing layers to simplify execution and drive velocity.\" Google's generative AI remained the focus of the Q4 earnings call, with Pichai calling it the 'Gemini Era.' Meanwhile, other companies like Meta, Amazon, and Qualcomm also released earnings this week, speaking about the latest developments in their services and the incorporation of AI in their systems. Speaking of the Gemini Era, Google announced Gemini Pro last year. Starting February 1, Gemini Pro will power Google Bard worldwide as it is available in more than 40 languages and over 230 countries and territories. Get the latest news from Android Central, your trusted companion in the world of Android With Gemini Pro, Bard gets a new tool called \"double-check,\" which cross-checks Bard's answer against similar internet results to check for accuracy and facts, improving users' trust in Bard.  Another cool feature that was introduced was Imagen 2, the text-to-image model. With this tool, users can generate images that are higher in quality and accuracy when compared to other such AI image generators. Google claims that they have specifically worked on areas where some image generators struggle with things like text, faces, and hands. The Imagen 2 model is equipped to generate images in Google Ads, Duet AI in Google Workspace, and the Search Generative Experience. Imagen 2  powers ImageFX, an image generation tool currently available in Labs.  Earlier this week, Amazon announced that it has come to a \"mutual\" agreement with iRobot to terminate its previous $1.4 billion deal to acquire the Roomba maker. Leaving the deal will resolve \"all outstanding matters\" alongside the termination fee both companies agreed upon prior. Amazon will have to pay iRobot $94 million due to the termination of the acquisition. On Monday (January 29), EU antitrust chief Margrethe Vestager said that \"the acquisition of iRobot would have enabled Amazon to foreclose iRobot's rivals by restricting or degrading access to Amazon stores.\" However, according to Reuters, Amazon and iRobot agreeing to part ways seems to correlate to the resistance it faced in the EU. The deal's termination has caused significant challenges, with iRobot's now-former Chairman and CEO, Colin Angle, resigning and 35% of the company's staff being laid off.  Google issued a new Android 14 update on Thursday (February 1). However, this update only comes to the Google Pixel 5a owners. According to Google's beta release notes (via the Android Beta Reddit), QPR2 Beta 3.2 (build AP11.231215.010) addresses 15 issues that an earlier update to the phone may have caused. The update is rolling out now, and Pixel 5a owners should receive it within the next five days. If you have a Pixel 5a, you can update your phone by navigating to Settings > System > System update. Meanwhile, we're still waiting on the stable version of QPR2 to roll out to Pixel phones, which we expect could happen in February or March (when the next feature drop is expected).  With Gen AI, Google is trying to enhance the Maps experience by taking it a step further. Users in the U.S. will soon find the option to write a query or choose from a selection of pre-made ones on Google Maps. For example, when you type in\"places with a vintage vibe in SF,\" Google says Maps' AI will list out businesses and places around you that fit the description of the prompt. It will also pull up reviews, images, and ratings of the locations close by. These results are also categorized by type/activity, i.e., clothing stores, vinyl shops, flea markets, etc. As of now, this feature is only rolling out to \"local guides\" in the U.S. Individuals who go out and review places to see/ restaurants in the area. Those are some of the biggest stories from this week. Meanwhile, here are some other stories from this week that are worth catching up on: Nandika Ravi is an Editor for Android Central. Based in Toronto, after rocking the news scene as a Multimedia Reporter and Editor at Rogers Sports and Media, she now brings her expertise into the Tech ecosystem. When not breaking tech news, you can catch her sipping coffee at cosy cafes, exploring new trails with her boxer dog or leveling up in the gaming universe. WhatsApp for Android may soon get better video playback controls following iOS debut Samsung One UI 6.1: Release date, eligible devices, new features, and much more The Oculus Quest 1 is about to be sent out to pasture By Jay BonggoltoMarch 28, 2024 By Brady SnyderMarch 28, 2024 By Nickolas DiazMarch 28, 2024 By Patrick FarmerMarch 28, 2024 By Brady SnyderMarch 28, 2024 By Jay BonggoltoMarch 28, 2024 By Nickolas DiazMarch 28, 2024 By Steven ShawMarch 28, 2024 By Nicholas SutrichMarch 28, 2024 By Brady SnyderMarch 28, 2024 By Jay BonggoltoMarch 28, 2024 Android Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
}