{
    "title": "Google CEO Blasts 'Unacceptable' Gemini Image Generation Failure",
    "date": "2/28/2024",
    "url": "https://ca.finance.yahoo.com/news/google-ceo-blasts-unacceptable-gemini-064338259.html",
    "text": "(Bloomberg) -- Alphabet Inc.’s Sundar Pichai emailed staff on Tuesday to address the problematic responses from Google’s Gemini AI engine, describing them as “completely unacceptable.” Most Read from Bloomberg China Scraps Premier Li's Briefing, Breaking Years of Convention What to Remember If the Stock Market Takes a Dive Wall Street’s DEI Retreat Has Officially Begun Young Hong Kongers Who Defied Xi Are Now Partying in China Haley Gets First Primary Win in D.C. With Super Tuesday Ahead Teams are now working around the clock to rectify the issues, Pichai wrote in his note, reviewed by Bloomberg News. Stressing the need for the company to deliver unbiased and accurate information, the chief executive officer of both Alphabet and Google said structural changes will be made to prevent similar incidents. Gemini, formerly Bard, is Google’s flagship artificial intelligence product, but the company was criticized for its image generation that depicted historically inaccurate scenes when prompted to create images of people. The Mountain View, California-based company stopped accepting prompts for people in its image generator while it worked to address the concerns raised. “We’ll be driving a clear set of actions, including structural changes, updated product guidelines, improved launch processes, robust evals and red-teaming, and technical recommendations,” Pichai wrote, urging a focus on “helpful products that are deserving of our users’ trust.” The boom in AI interest and use has brought with it a wave of closer scrutiny, with many critics pointing to the potential for AI-created content to mislead, either deliberately or accidentally. The full note from Pichai to Google employees, first reported by Semafor, is below. I want to address the recent issues with problematic text and image responses in the Gemini app (formerly Bard). I know that some of its responses have offended our users and shown bias – to be clear, that’s completely unacceptable and we got it wrong. Our teams have been working around the clock to address these issues. We’re already seeing a substantial improvement on a wide range of prompts. No AI is perfect, especially at this emerging stage of the industry’s development, but we know the bar is high for us and we will keep at it for however long it takes. And we’ll review what happened and make sure we fix it at scale. Our mission to organize the world’s information and make it universally accessible and useful is sacrosanct. We’ve always sought to give users helpful, accurate, and unbiased information in our products. That’s why people trust them. This has to be our approach for all our products, including our emerging AI products. We’ll be driving a clear set of actions, including structural changes, updated product guidelines, improved launch processes, robust evals and red-teaming, and technical recommendations. We are looking across all of this and will make the necessary changes. Even as we learn from what went wrong here, we should also build on the product and technical announcements we’ve made in AI over the last several weeks. That includes some foundational advances in our underlying models e.g. our 1 million long-context window breakthrough and our open models, both of which have been well received. We know what it takes to create great products that are used and beloved by billions of people and businesses, and with our infrastructure and research expertise we have an incredible springboard for the AI wave. Let’s focus on what matters most: building helpful products that are deserving of our users’ trust. Most Read from Bloomberg Businessweek The Monaco Royals Whose Deals Have Brought Peril to the Palace Doors Chocolate Makers Try a New Recipe: Less Chocolate Top Takeaways From Businessweek’s Investigation Into Monaco’s Royal Family Private Equity’s Green Star Started It All With a Database China’s Piano Dreams Are Fading for a Cash-Strapped Middle Class ©2024 Bloomberg L.P. Suri Cruise, Katie Holmes and Tom Cruise's daughter looks so grown up as she headed on vacation with mother ahead of her 18th birthday. See photos. Hamas victim's father defends Associated Press' award-winning photo of her body as 'symbol' of an era. 即日起至4月30日，成功於網上整合個人強積金戶口即可享有一次性紅利單位回贈禮遇。 \"Travis's version of being passive-aggressive with his girlfriend,\" one user commented. Rebel Wilson is calling Sacha Baron Cohen’s decision to release behind-the-scenes footage of their sex scene “an a–hole move,” after never-before-seen video from the set of the 2016 film “The Brothers Grimsby” was published Friday by the Daily Mail. “Releasing unauthorized and misleading behind-the-scenes video without my approval is SBC’s latest way of bullying and gaslighting me,” the ... Saturday Night Live went with Donald Trump’s hawking of Bibles for its cold open, with James Austin Johnson returning as the former president to make the pitch. It was another case of the show trying to satirize something that hardly needs rewriting. “That’s right, it’s Easter. The time of year when I compare myself to … Trade 24 hours a day on the world's most popular platform. When Sam* married her husband, she never imagined that 20 years on, she'd have not one, but two affairs... Nordegren has moved on and built a life that focuses on her six kids Seven reportedly cost $20 million  Neil Hobday, the former project director for former President Trump’s golf course in Scotland, said the country was “hoodwinked” by his claims that he would spend 1 billion pounds to develop the property. Hodbay told the British Broadcast Corporation (BBC) that he felt “hoodwinked and ashamed” that he and Scotland fell for Trump’s overestimate. Trump… Russian Armed Forces downed their own Sukhoi Su-27 fighter jet over Crimea, according to Ukrainian officials. The defenestration of Ronna McDaniel, threatened disbarment of John Eastman and capitulation of Kari Lake in a defamation lawsuit suggest a welcome reckoning is upon us.  A Jacksonville, Florida, resident woke up to find extensive damage to her car outside her home. Her surveillance camera caught the suspects in the act. Action News Jax reporter Robert Grant has the story. Illustration by Elizabeth Brockway/The Daily BeastI have vivid memories of then-President Donald Trump standing in front of St. John’s Episcopal Church, right across from the White House, using the Bible as a prop. Ironically and revealingly, Trump looked uncomfortable handling the Holy Scriptures and ended up holding the Bible upside down. Had he actually read the Bible, it might have turned his worldview upside down.And now he is hawking his new Bible—the Bless the USA Bible—for $59.99 (more t \"Almost three decades spent with someone is not easy to shake off in a little over a year — or maybe ever.\"  Prince George appears to have inherited a very impressive skill from the likes of King Charles, Kate Middleton and Prince Philip. Discover more... Buying a car can feel like walking through a minefield of shady sales tactics. Some deceitful dealerships have long employed a bag of tricks to nickel-and-dime consumers out of their hard-earned cash.... Owning clothes with buttons, at least when they were first invented, was a sign of wealth.  They soft-launched their relationship at the supermodel's cookbook event in Miami. The former national security adviser rejected a comparison between the ex-president and Julius Caesar. Photo Illustration by Elizabeth Brockway/The Daily Beast/GettyRetired American generals vehemently say that no, Donald Trump cannot deploy SEAL Team 6 to kill a political rival. Gun groups howl that the United States is turning into Communist China. And a convicted Jan. 6 rioter warns that President Joe Biden could someday get sued over the death of a jogger in Georgia.These are among the 18 various groups that shared their wisdom with the Supreme Court earlier this month, filing amicus briefs o "
}