{
    "title": "Top Stock Reports for Alphabet, Bank of America & AMD",
    "date": "2/21/2024",
    "url": "https://finance.yahoo.com/news/top-stock-reports-alphabet-bank-213300975.html",
    "text": "Wednesday, February 21, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Alphabet Inc. (GOOGL), Bank of America Corporation (BAC) and Advanced Micro Devices, Inc. (AMD). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Shares of Alphabet have gained +9.3% over the past six months against the Zacks Internet - Services industry’s gain of +12.4%. The company’s strong cloud division is aiding substantial revenue growth. Moreover, expanding data centers will continue to bolster its presence in the cloud space.Further, major updates in its search segment are enhancing the search results. Also, strong focus on innovation of AI techniques and the home automation space should aid business growth in the long term. Further, its deepening focus on wearables category remains a tailwind.Alphabet’s expanding presence in the autonomous driving space is contributing well. Its growing efforts to gain foothold in the healthcare industry are other positives. However, sluggishness in the company’s Network advertisement businessremains a headwind. Additionally, its growing litigation issues and increasing expenses are concerns.(You can read the full research report on Alphabet here >>>)Bank of America’s shares have gained +21.4% over the past six months against the Zacks Banks - Major Regional industry’s gain of +24.6%. Higher interest rates and decent loan demand will keep supporting the company’s net interest income (NII) growth in the upcoming quarters. The opening of financial centers and improving digital capabilities is expected to further support the top line.Yet, the current tough macroeconomic environment will continue to weigh on the company’s investment banking (IB) business. This, along with the volatile nature of the capital markets, will likely hurt fee income. Due to inflationary pressure, overall costs are expected to remain elevated.(You can read the full research report on Bank of America here >>>)Shares of AMD have outperformed the Zacks Electronics - Semiconductors industry over the past six months (+56.8% vs. +49.5%). The company is benefiting from portfolio strength and an expanding partner base. Strong demand for EPYC processors has been a growth driver. The launch of the Ryzen 8040 series processor with Ryzen AI and Instinct MI300 Series data center AI accelerators bodes well for top-line growth. AMD continues to benefit from acquisitions, including Xilinx and Pensando, which has diversified its business. For fourth-quarter 2023, AMD expects to witness year-over-year growth in the Data Center and Client segments by double-digit percentage.Sequentially, the Data Center segment’s revenues are expected to grow on a double-digit percentage, while Client is expected to increase. However, weakness in the Gaming and Embedded segment revenues are expected to hurt top-line growth.(You can read the full research report on AMD here >>>)Other noteworthy reports we are featuring today Danaher Corporation (DHR), Applied Materials, Inc. (AMAT) and The TJX Companies, Inc. (TJX).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>> Today's Must Read Alphabet (GOOGL) Benefits From Search & Cloud Initiatives Higher Rates Aid Bank of America (BAC) Amid Fee Income Woes AMD Rides on Strong Adoption of EPYC & Ryzen Processors Featured Reports Strong Life Sciences Unit Aids Danaher (DHR), High Debt AilsPer the Zacks analyst, Danaher's Life Sciences segment is driven strong demand in the academic and life science research markets. However, high debt obligation remains a concern for the company. Online Growth to Fuel TJX Companies (TJX), High Costs a WoePer the Zacks analyst, TJX Companies is set to keep gaining from robust efforts to boost online sales. However, increased selling, general and administrative costs is a headwind. SONY Benefits From Improving Music & G&NS Segment SalesPer the Zacks analyst, Sony is gaining from strong performance of its Music and G&NS segments. However, stiff competition and weak global macroeconomic conditions remain major concerns. Baker Hughes (BKR) Advanced Tech Aids Its Strategic PositionBaker Hughes thrives in the oilfield service sector, capitalizing on advanced technology and global LNG opportunities. However, rising costs and expenses concern the Zacks analyst. Broadridge Gains From Itiviti Buyout, Amid High CompetitionPer the Zacks analyst, the Itiviti acquisition has boosted Broadridge's global technology and operations segment. High competition from other players is an overhang. Strategic Gains Aid Labcorp (LH) Amid Lesser COVID SalesThe Zacks Analyst is impressed with Labcorp's robust strategic execution including the Ascension integration, Fortrea spin-off and new lab partnerships. Yet, COVID testing sales dip dents progress. TEVA's New Drugs & Generic Stability May Help Revive GrowthTeva's newer drugs, Austedo, Uzedy and Ajovy, and a stable generics business may revive top-line growth, per the Zacks analyst. New Upgrades Applied Materials (AMAT) Rides on Strength in AGS SegmentPer the Zacks analyst, solid adoption of 200-mm systems and strengthening subscription business are benefiting Applied Materials Applied Global Services (AGS) segment. Higher Demand, Big River Investment Drive U.S. Steel (X) Per the Zacks analyst, the Big River investment has strengthened U.S. Steel's position in high-margin steel-end markets. Higher end-market demand should also drive its volumes. n Enrollment Growth & Cost Saving Aid American Public (APEI)Per the Zacks analyst, American Public is benefiting from increased enrollments and registrations in the HCN and APUS segments. Also, focus on cost efficiency and affordable tuition bodes well. New Downgrades Competition From Clean Fuel Sources Ail Arch Resources (ARCH)Per the Zacks analyst, Arch Resources' results are adversely impacted as emissions concerns push coal back in comparison with other clean fuel sources. Strict regulations also act as a headwind. Nu Skin (NUS) Revenues Hurt by Consumer Spending ChallengesPer the Zacks analyst, Nu Skin is battling macroeconomic challenges, with inflation putting pressure on consumer spending and customer acquisition. Management expects revenues to decline in 2024. Lower Revenues Continue to Grapple Virtu Financial (VIRT)Per the Zacks analyst, Virtu Financial's revenues were hurt by decreased volatility and volumes in global markets. A decline in market volatility offers it lesser trading and profit opportunities. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Bank of America Corporation (BAC) : Free Stock Analysis Report Advanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report The TJX Companies, Inc. (TJX) : Free Stock Analysis Report Danaher Corporation (DHR) : Free Stock Analysis Report Applied Materials, Inc. (AMAT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}