{
    "title": "Alphabet's Culture Issue Is Worse Than Its Earnings Issue",
    "date": "2/8/2024",
    "url": "https://www.forbes.com/sites/gurufocus/2024/02/08/alphabets-culture-issue-is-worse-than-its-earnings-issue/",
    "text": "By Grahamites Summary   Google's parent company, Alphabet Inc. (GOOG, Financial) (GOOGL, Financial), reported earnings on Jan. 30. Although revenue grew by double digits, the stock was down after the report because ad sales growth was slower than analysts' expectations. Google search and YouTube ads revenue had healthy double-digit growth, but the Google Network segment's revenue declined 2% year over year. Combined, Google ad revenue grew 11% year over year. Compared to Amazon (AMZN, Financial), Microsoft (MSFT, Financial) and Meta Platforms (META, Financial), Alphabet's results were clearly disappointing. I have followed big U.S. and Chinese technology companies for more than 10 years now. I remember back in 2014, Alibaba (BABA, Financial) and Alphabet both seemed invincible. But now, both companies are running into trouble. In my opinion, both Alibaba and Alphabet's biggest challenge is culture, which ironically used to be their strength. In the past I've written about Alibaba's cultural crisis. In this discussion, I will focus on Alphabet's culture with discussions of both its pros and cons. During the 2018 Berkshire Hathaway (BRK.A, Financial) (BRK.B, Financial) shareholder meeting, the late Charlie Munger commented on Alphabet's culture. He said, \"I've been to Google headquarters. It looked to me like a kindergarten.\" Warren Buffett (Trades, Portfolio) added, \"A very rich kindergarten.\" I agree with Munger and Buffett's observations about Google because I have also been to its headquarters a few times. Personally I wouldn't use the word kindergarten to describe it, but the atmosphere is certainly very laid-back with plenty of on-site facilities. This atmosphere was designed from day one to help facilitate creativity, as laid out by Google's very first founders' letter, which states the following: “Google is not a conventional company. We do not intend to become one. Throughout Google's evolution as a privately held company, we have managed Google differently. We have also emphasized an atmosphere of creativity and challenge, which has helped us provide unbiased, accurate and free access to information for those who rely on us around the world.” Having the best talent is key to Alphabet's business model. To attract the best talent, the company created the unconventional decentralized atmosphere and offered the highest compensation package in the industry. As a result, it has always had a very high win-rate when recruiting talent. Once the best engineers join the company, they have maximum amount of flexibility and enjoy tremendous benefits such as a free gym, snacks, diverse on-site restaurants and much more. In other words, everything is taken care of by Alphabet. This is probably why Munger and Buffett call it a kindergarten. This culture worked very well in the early years. I remember during my first visit to Google campus in 2014, I was really impressed by the open and vibrant culture. For a long time, this was key to Alphabet's moat. Like all other big tech companies, Alphabet grew its employee base rapidly over the past decade as its business continued to expand. In 2014, the company had only 53,600 employees. By the end of 2022, the number of employees had ballooned to 190,234. Inevitably, more employees means more bureaucracy. This is true for all big tech companies. The company realized it had too many employees so, for the first time in its history, it implemented layoffs, which decreased the employee count to 182,381 as of the latest quarter. But bureaucracy is not Alphabet's main cultural issue. I think the biggest issue with its culture is complacency and sloth, which ironically is the accumulated result of the decentralized and creative culture it is proud of. It is analogous to spoiling your children. The best way to destroy a talented child is to spoil him or her with easy-to-get luxuries. For many years, Alphabet's engineers have been used to this hands-off and laid-back approach of management. This approach works as long as the business is booming. But once the competition picks up, Alphabet's culture can be detrimental. It is like going to war with an army of soldiers who are rusty at essential military skills. Another issue with the company's culture is its lack of flexibility in terms of product design and development, which resulted in less user-friendly products. The best example is the cloud business. Alphabet developed the cloud technology years before Amazon. But Alphabet's product is not user-friendly at all because its engineers are not used to listening to customer feedback. Therefore, Alphabet's cloud business has grown much slower than Amazon and Microsoft. I'm concerned the company will repeat this problem again with Bard, which is its version of a conversational artificial intelligence tool. Last but not least, I think Alphabet is facing a problem of cultural division. This was inevitable as the company grew its employee base. To be fair, most big tech companies will face this problem. But with Alphabet, the issue is particularly severe because it is more open than the other tech companies. Therefore, there are fewer rules governing employee behaviors, which makes it harder for management to reconcile differences. Alphabet's earnings release is disappointing, but not too bad. For long-term investors, the more concerning issue is its culture. Unless management takes dramatic action, the cultural issues are here to stay. Fortunately, Sundar Pichai has realized the culture issues and has taken steps to address them. It remains to be seen whether he can successfully tackle them in the future. I/we have no positions in any stocks mentioned, and have no plans to buy any new positions in the stocks mentioned within the next 72 hours.  "
}