{
    "title": null,
    "date": "2/2/2024",
    "url": "https://www.mypunepulse.com/googles-rs-17500-crore-expenditure-on-layoffs-revealed-in-q4-earnings/",
    "text": "PUNE PULSE Trusted-Connected-Targeted PUNE PULSE Google's Rs 17,500 crore expenditure on layoffs revealed in Q4 earnings In a significant revelation during its fourth-quarter earnings release, Alphabet, the parent company of Google, disclosed that the tech giant spent ₹17,500 crore (approximately $2.1 billion) on severance and related expenses during its 2023 layoffs, impacting over 12,000 employees. The expenditure included $700 million spent this month alone on severance charges for additional layoffs affecting more than 1,000 roles. This financial move follows Alphabet’s announcement in January 2023 of plans to cut 12,000 jobs, constituting 6% of its global workforce, marking the largest layoff in Google’s history. Alphabet’s CEO, Sundar Pichai, deemed these layoffs “essential” for the company. Despite the substantial layoffs, Google’s parent company experienced a notable return to double-digit revenue growth in the last quarter of the previous year. This growth was driven by the success of YouTube and the cloud computing unit, marking Alphabet’s third consecutive quarter of increasing revenue. While Google’s ad sales exhibited growth, it lagged behind increases in other areas, such as cloud computing and YouTube subscriptions. Despite the positive results, Alphabet’s shares faced a nearly 7% dip in extended trading. CEO Sundar Pichai has informed employees to anticipate further job cuts in the upcoming months, aiming to “simplify execution.” In a memo, Pichai clarified that the layoffs will focus on streamlining operations by “removing layers” from various departments, aiming to enhance the company’s efficiency. He emphasized that these role eliminations will not be at the scale of the previous year’s reductions and will not affect every team.    "
}