{
    "title": null,
    "date": "2/16/2024",
    "url": "https://techcrunch.com/2024/02/16/a-peek-at-how-things-work-today-inside-alphabets-7-billion-growth-stage-investing-arm-capitalg/",
    "text": "Almost a year ago, Alphabet’s growth stage venture arm, CapitalG, named partner Laela Sturdy as its new head, just as the unit’s founder, David Lawee, stepped down. Few were surprised Sturdy was promoted to the post. She joined Google in 2007 in a marketing role and was pulled into a number of departments in the following years, and when CapitalG was launched in 2013, she was recruited by Lawee, who told CNBC in 2021, “I kind of made it a point to know who all the stars were inside of Google, and Laela’s name came up a lot.” Of course, for many investors, the last year has been among the toughest in their career. We wondered if the same is true for Sturdy, a former college basketball star who is quick to note that 60% of her team comes from diverse or underrepresented backgrounds. To find out more, we reached her earlier this week at CapitalG’s bright, airy office in San Francisco’s Ferry Building; excerpts of our chat are edited lightly for length and clarity below. Belated congratulations on taking over the helm. How does your management style differ from that of your predecessor, David? I’m still leading investments and still on a bunch of boards, but I’ve loved being able to also put increasing attention on the team and figure out how we can continue to build out the firm. There’s [now] many more incredible investors that we have at CapitalG. You have around 50 people on your team; how many of these are investors versus otherwise? Our model is to find ways that Google and Alphabet can help our portfolio companies, so not only the individuals on this team, but to give you an idea [of what I mean], over the last couple of years, we’ve had over 3,500 different senior advisers inside of Alphabet help partner with our portfolio companies [to help with] pricing analysis, scaling infrastructure, marketing and setting up sales incentives. There are all these different technical and business questions that come up for growth-stage companies, which is where we specialize. Access to 3,500 different senior advisers! How does that work? An example is over the last couple of years, we’ve partnered with the Google training team who does AI and ML training for Google engineers. We said, “Hey, this training is really effective and gets really high ratings internally.” And we have a lot of our portfolio companies asking us, “How can we up level the talent of our engineering and our organizations and get them ready to fully take advantage of the trends in AI?” So we partnered with the training team and got our portfolio companies access to the exact same training, and we’ve now had hundreds of engineers inside our portfolio go through that training. I worked at Google for a long time before I came to CapitalG, and one of the amazing things about the culture of Google from the beginning is a real culture of knowledge sharing. The market for AI talent is so competitive. What can you tell portfolio companies that might feel nervous about the information that’s going into and out of Alphabet through you? Everything is opt-in from the portfolio companies’ standpoint. We don’t share anything; we operate totally separately. We don’t share any portfolio company data with Alphabet and we don’t share any Alphabet data back to the portfolio companies. We exist as the intermediary to find win-wins where they exist. As an example, [Google Cloud] has been an incredible go-to-market partner [and] all the other cloud providers are also important and great partners, so we don’t push anything on anyone. We help facilitate the right introductions and marketing partnerships and product discussions where it’s relevant. How are decisions made inside CapitalG? Do you have final say over who sees a check? We have an investment committee [composed of] myself and three other general partners who are really incredible investors. For example, my partner Gene Frantz, who I’ve been working with for the last 10 years — since almost the beginning of CapitalG — is a longtime investor who was at TPG and other places before [joining the outfit]. So we’ve built a GP bench that’s really strong, and these GPs bring deals to our investment committee, and we make the decision as a committee. How many bets per year are you making? And what size checks are you writing? We typically invest between $50 million and $200 million in each company. We’re very thesis driven, so we spend a lot of time going deep on sectors . . . and we’re investing in about seven or eight new companies a year and then typically [many] more follow-on [rounds] for our existing portfolio. How much of a company do you aim to own? We’re flexible on ownership percentage. What we’re thinking about is our money-on-money returns in these companies. For example, I led the Series D round in Stripe back in 2017. I think that was a $9 billion valuation. [We closed] a recent AI investment that was on the earlier side — it had a sub-$500 million valuation — so we’re very focused on the market, how much we think the business is differentiated, and whether we can invest a significant amount of capital to scale. What are your cash-on-cash returns? We don’t share those publicly. We don’t share any of the returns publicly. At $9 billion, you’re going to do great with that investment in Stripe, whose valuation ran all the way up to $95 billion before it was reset at $50 billion last year. Do you think that valuation swing was in response to market trends or its performance? Stripe is an incredible company and [tackling] absolutely one of the biggest market opportunities out there, so I’m very bullish on their performance to date and all that’s ahead. When you look at any valuations, public or private, across the last 18 to 24 months, all of them had some sort of reset based coming out of the COVID . . . so I wouldn’t read anything into the company’s performance. Does Alphabet allocate a discrete fund to you every year? Yes, we invest out of discrete funds, so yearly annual funds. How big are they? We have $7 billion in assets under management [dating back to 2013]. So you have a lot of money in a market where others have less. With the IPO market stalled and other late-stage investors investing less, are you buying up secondary shares? We’re very focused on partnerships with the CEO and the management team. We will only invest if we have engagement with the CEO and we have direct data from the company. Our model is we want to be the best partners to these founders so that they refer us to the next best companies down the line. What secondary shares have you bought? I won’t share specific companies because that hasn’t been [publicly disclosed by the companies]. And a lot of secondary sales end up structured as primary anyway. But the broader trend that you’re referring to is interesting because it is early-stage investors looking for liquidity. And I think that’s right in line with our strategy of finding the best growth-stage companies and at what we believe is very early in their long-term compounding [trajectory], so we’re super excited to get on the cap table of those types of companies . . . Our strategy is to partner with these companies early and then hold them for a long period of time. You do eventually distribute shares back to Alphabet, though. We definitely distribute, but I’d say we have a long-term orientation. Does Alphabet really care if you deliver returns? Are these bets mostly strategic? We focus on delivering returns, and we focus on the mission of using the expertise and experience of Google and Alphabet to be world-class partners to these generational tech companies. Google is obviously going big on AI. Tell me a bit about your own AI strategy. We’re as excited about AI as everyone else. We have a really wonderful team of people focused on it within CapitalG, and that’s another area where we have some really great advisers within Google who have enabled us to lean into even more technical bets. Cybersecurity is a good example here. We were in CrowdStrike in the Series B when they had $15 million in revenue or something, and a big part of making some of those early cybersecurity bets was a differentiated technical point of view. So we’re bringing that same rigor to the AI space. One of the things that we think is really interesting in the AI space is, when we look across enterprise use cases, we actually think a lot of the incumbents are quite well-positioned, because they have distribution, they have customers, they have workflows . . . so where we’ve been looking a bit more is places where there’s real technical differentiation and where workflow and existing distribution is less important. One company that we’ve backed that we believe has a strong, technical differentiation is Magic, which is focused on building an AI software engineer. You’re also on the board of Duolingo, which parted ways with 10% of its contractors last month. A spokesperson said at the time that the company didn’t really need as many people, in part because of AI. Is that something that you’re seeing across your portfolio companies? I won’t comment on Duolingo specifically, but I will say that across our portfolio companies, they are looking at how AI can enhance the customer experience, and enhance their other systems and processes. I think there’s a lot of surprise and delight around that. There’s a lot of rethinking of the marketing stack. There’s a lot of rethinking of customer support and services. We’re still in very early innings. But the same way I see enterprise customers excited to experiment with how they can use AI in their workflow, I see startup and growth-stage companies really excited to experiment with how they can use AI to rethink how they’re building the organization and get all of their employees focused on the most high-value opportunities. There’s a lot of interesting work happening there. "
}