{
    "title": "Pinterest Gets Google's Help In An Amazon-Like Partnership As It Continues \nTo Try To Make Monetization Happen",
    "date": "2/9/2024",
    "url": "https://finance.yahoo.com/news/pinterest-gets-googles-help-amazon-211948255.html",
    "text": "Unlike Meta Platforms (NASDAQ: META), Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL) and Amazon.com Inc (NASDAQ: AMZN), Pinterest Inc (NYSE: PINS) and Snap Inc (NYSE: SNAP) did not experience double digit growth of their ad business. Snap reported its fourth quarter sales grew 5% and it issued a weak guidance. On Wednesday, Snap shares tanked 35% as Meta set the bar high with its advertising revenue up 24%, more than double compared to Google and its 11% growth. Not to mention the fact that Amazon reported an impressive 27% YoY expansion of its ad business.  Pinterest shares surged 53% last year and until Thursday’s report, they rose 9.5% since the beginning of 2024. But like Snap, it got punished for the revenue miss with its stock falling about 20% after-hours before recovering. On its now long quest to monetize its platform, Pinterest enlisted the help of Google that is similar to its existing Amazon partnership in an effort to make that business equation finally happen. After announcing the integration with Google, shares rebounded to a decline of about 10%. Although revenue rose 12% to $981 million, it came below LSEG’s estimate of $991 million. Net income rose from last year’s comparable quarter when it was $17.49 million, or 3 cents a share to $201 million, or 29 cents a share. Unlike revenue, adjusted earnings of 53 cents per share topped LSEG’s consensus estimate of 51 cents. Although the Google integration went live a couple of weeks ago, it was not a significant contributor in the reported quarter, but it is expected to bring improvement in the current quarter and beyond, as it already helped lift third party ad demand. Pinterest reported its costs decreased about 10% YoY to $785 million, but this is mainly the result of lowered sales and marketing expenses. Also, Pinterest trimmed its workforce by 5% last year as layoffs plagued the entire industry. Although its monthly active users rose 11% to 498 million and topped analyst estimates of 487 million, global average revenue per user of $2 came below analyst estimates of $2.05. One cannot but not notice that ad recovery is selective, with Big Tech reaping the rewards of the rebound and leaving scraps for others. Fortunately, the world’s multiyear slump is expected to soon become history. Pinterest guided for first-quarter revenue in the range between $690 million and $705 million, which equates to YoY growth of 15% to 17%, while the average analyst estimate is at the higher end that range, at about $703 million. At the end of the day, Pinterest needs to lift its revenue and get its users to buy goods they see on its platform. Its Amazon partnership looked promising and the Google integration is another step in the right direction. But, by no means will Pinterest have it easy with intense, not to say scary, competition for ad dollars. DISCLAIMER: This content is for informational purposes only. It is not intended as investing advice. This article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy. \"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now! Get the latest stock analysis from Benzinga? This article Pinterest Gets Google's Help In An Amazon-Like Partnership As It Continues To Try To Make Monetization Happen originally appeared on Benzinga.com © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Related Quotes "
}