{
    "title": "Should You Sell Alphabet Inc Class A (GOOGL) Stock Friday Morning?",
    "date": "2/23/2024",
    "url": "https://www.investorsobserver.com/news/stock-update/should-you-sell-alphabet-inc-class-a-googl-stock-friday-morning-3",
    "text": "Alphabet Inc Class A (GOOGL) is down Friday morning, with the stock decreasing -0.40% in pre-market trading to 143.52. \n\n\nGOOGL's short-term technical score of 93 indicates that the stock has traded more bullishly over the last month than 93% of stocks on the market. In the Internet Content & Information industry, which ranks 81 out of 146 industries, the stock ranks higher than 94% of stocks.\n\nAlphabet Inc Class A has fallen 2.01% over the past month, closing at $152.19 on January 26. During this period of time, the stock fell as low as $140.10 and as high as $153.78. GOOGL has an average analyst recommendation of Strong Buy. The company has an average price target of $160.97.\n\n\n\n\n\n GOOGL has an Overall Score of 77. Find out what this means to you and get the rest of the rankings on GOOGL!\nSee Full GOOGL Report\n\n\n\nAlphabet Inc Class A has a Long-Term Technical rank of 74. This means that trading over the last 200 trading days has placed the company in the upper half of stocks with 26% of the market scoring higher. In the Internet Content & Information industry which is number 95 by this metric, GOOGL ranks better than 95% of stocks.\n\n\n\nImportant Dates for Investors in GOOGL:\n\n\n-Alphabet Inc Class A is set to release earnings on 2024-04-29. Over the last 12 months, the company has reported EPS of $5.22.\n\n\n-We do not have a set dividend date for Alphabet Inc Class A at this time.\n\nClick Here To Get The Full Report on Alphabet Inc Class A (GOOGL) Alphabet Inc Class A (GOOGL) is down Friday morning, with the stock decreasing -0.40% in pre-market trading to 143.52. \n\n\nGOOGL's short-term technical score of 93 indicates that the stock has traded more bullishly over the last month than 93% of stocks on the market. In the Internet Content & Information industry, which ranks 81 out of 146 industries, the stock ranks higher than 94% of stocks.\n\nAlphabet Inc Class A has fallen 2.01% over the past month, closing at $152.19 on January 26. During this period of time, the stock fell as low as $140.10 and as high as $153.78. GOOGL has an average analyst recommendation of Strong Buy. The company has an average price target of $160.97.\n\n\n\n\n\n GOOGL has an Overall Score of 77. Find out what this means to you and get the rest of the rankings on GOOGL!\nSee Full GOOGL Report\n\n\n\nAlphabet Inc Class A has a Long-Term Technical rank of 74. This means that trading over the last 200 trading days has placed the company in the upper half of stocks with 26% of the market scoring higher. In the Internet Content & Information industry which is number 95 by this metric, GOOGL ranks better than 95% of stocks.\n\n\n\nImportant Dates for Investors in GOOGL:\n\n\n-Alphabet Inc Class A is set to release earnings on 2024-04-29. Over the last 12 months, the company has reported EPS of $5.22.\n\n\n-We do not have a set dividend date for Alphabet Inc Class A at this time.\n\nClick Here To Get The Full Report on Alphabet Inc Class A (GOOGL) Subscribe to our daily morning update newsletter and never miss out on the need-to-know market news, movements, and more. Thank you for signing up! You're all set to receive the Morning Update newsletter Stock Price data may be delayed up to 15 minutes. Copyright © 2024. Portions of this content may be copyrighted by Fresh Brewed Media, Investors Observer, and/or O2 Media LLC. All Rights Reserved. Portions of this content protected by US Patent numbers 7,865,496, 7,856,390, and 7,716,116. Investing in stocks, bonds, option and other financial instruments involve risks and may not be suitable for everyone. Portfolio results are unaudited and based on varying investment expiration dates. Terms of Service | Privacy Policy "
}