{
    "title": null,
    "date": "3/30/2024",
    "url": "https://www.defenseworld.net/2024/03/30/next-level-private-llc-has-629000-stock-position-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 30th, 2024 Next Level Private LLC boosted its position in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) by 1.7% during the fourth quarter, HoldingsChannel.com reports. The institutional investor  owned 4,505 shares of the information services provider’s stock after acquiring an additional 76 shares during the quarter. Next Level Private LLC’s holdings in Alphabet were worth $629,000 as of its most recent filing with the Securities and Exchange Commission. Other institutional investors have also made changes to their positions in the company. Bornite Capital Management LP bought a new position in shares of  Alphabet during the 1st quarter worth about $16,688,000.  Markel Corp grew its holdings in shares of  Alphabet by 17.0% during the 1st quarter. Markel Corp now owns 15,500 shares of the information services provider’s stock worth $43,110,000 after purchasing an additional 2,250 shares in the last quarter.  United Bank increased its position in shares of  Alphabet by 5.9% during the first quarter. United Bank now owns 2,033 shares of the information services provider’s stock valued at $5,654,000 after purchasing an additional 113 shares during the period.  Mirae Asset Global Investments Co. Ltd. lifted its position in  Alphabet by 23.4% in the first quarter. Mirae Asset Global Investments Co. Ltd. now owns 323,918 shares of the information services provider’s stock worth $900,929,000 after purchasing an additional 61,427 shares during the period.  Finally, Dakota Wealth Management lifted its holdings in shares of  Alphabet by 20.4% during the 1st quarter. Dakota Wealth Management now owns 9,279 shares of the information services provider’s stock worth $25,806,000 after acquiring an additional 1,570 shares during the period. 40.03% of the stock is currently owned by institutional investors. Shares of NASDAQ GOOGL opened at $150.93 on Friday. The firm has a 50 day moving average price of $143.67 and a 200 day moving average price of $138.21. The company has a debt-to-equity ratio of 0.05, a quick ratio of 2.10 and a current ratio of 2.10. The stock has a market cap of $1.88 trillion, a P/E ratio of 26.02, a P/E/G ratio of 1.39 and a beta of 1.04. Alphabet Inc. has a 52-week low of $99.78 and a 52-week high of $153.78. Alphabet (NASDAQ:GOOGL – Get Free Report) last announced its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, beating the consensus estimate of $1.60 by $0.04. The company had revenue of $86.31 billion during the quarter, compared to analyst estimates of $70.77 billion. Alphabet had a net margin of 24.01% and a return on equity of 27.22%. During the same quarter in the previous year, the business earned $1.05 EPS.  Analysts expect that  Alphabet Inc. will post 6.77 EPS for the current year. Several research firms recently issued reports on GOOGL. Royal Bank of Canada  reissued an “outperform” rating and issued a $155.00 price target on shares of Alphabet in a research report on Wednesday, January 31st. Wedbush lifted their price objective on Alphabet from $160.00 to $175.00 and gave the company an “outperform” rating in a report on Friday, March 22nd. Mizuho upped their target price on shares of Alphabet from $155.00 to $170.00 and gave the stock a “buy” rating in a report on Wednesday, January 17th. Barclays cut their price target on shares of Alphabet from $180.00 to $173.00 and set an “overweight” rating for the company in a report on Wednesday, January 31st. Finally, Needham & Company LLC  reaffirmed a “buy” rating and set a $160.00 price objective on shares of Alphabet in a report on Wednesday, January 31st. Five research analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have given a strong buy rating to the stock. According to data from MarketBeat, the company  has an average rating of “Moderate Buy” and an average price target of $155.48. Get Our Latest Stock Report on Alphabet In other Alphabet news, CAO Amie Thuener O’toole sold 425 shares of the firm’s stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total transaction of $59,334.25. Following the sale, the chief accounting officer now directly owns 27,259 shares in the company, valued at approximately $3,805,628.99. The sale was disclosed in a filing with the Securities & Exchange Commission, which is accessible through this link. In related news, Director Frances Arnold sold 230 shares of Alphabet stock in a transaction that occurred on Tuesday, January 30th. The stock was sold at an average price of $154.06, for a total value of $35,433.80. Following the sale, the director now owns 15,104 shares of the company’s stock, valued at approximately $2,326,922.24. The sale was disclosed in a legal filing with the SEC, which can be accessed through this link. Also, CAO Amie Thuener O’toole sold 425 shares of the business’s stock in a transaction that occurred on Tuesday, January 2nd. The shares were sold at an average price of $139.61, for a total value of $59,334.25. Following the completion of the sale, the chief accounting officer now owns 27,259 shares in the company, valued at approximately $3,805,628.99. The disclosure for this sale can be found here. Insiders sold 263,312 shares of company stock worth $37,268,315 over the last ninety days. 0.88% of the stock is currently owned by corporate insiders. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Alphabet Inc. (NASDAQ:GOOGL) Shares Purchased by West Wealth Group LLC Alphabet Inc. (NASDAQ:GOOGL) Shares Acquired by First National Corp MA ADV "
}