{
    "title": "Magnificent Seven Adds $250 Billion On Gemini’s Reported iPhone Deal",
    "date": "3/18/2024",
    "url": "https://www.forbes.com/sites/dereksaul/2024/03/18/magnificent-seven-adds-350-billion-on-geminis-reported-iphone-deal/",
    "text": "An epic reported artificial intelligence partnership out of Silicon Valley sent stocks off to a hot start Monday ahead of a crucial week for markets. iPhones may soon be getting a Google AI refresh. Shares of Google parent Alphabet shot up about 6% after Bloomberg reported the search engine giant and Apple are discussing a deal to bring Google’s Gemini generative artificial intelligence services to Apple’s iPhones, a potentially massive win for Alphabet as some believe it’s lagged behind rival Microsoft thus far in the generative AI space. The Alphabet rally, which added some $120 billion to the company’s market capitalization by midday, boosted major stock indexes to notable gains, as the benchmark S&P 500 and tech-heavy Nasdaq rose 1% and 1.3%, respectively. Much of Monday’s gains were concentrated among big tech companies, with shares of Apple inching up 2%, shares of AI semiconductor chip designer Nvidia jumping 1% as investors awaited Nvidia CEO Jensen Huang’s keynote speech at the AI leader’s afternoon conference and electric vehicle maker Tesla’s stock rose 6% after the company hiked prices on some of its cars. Each of the so-called “magnificent seven” stocks increased Monday, with the septet tacking on about $253 billion in combined market value, according to YCharts data. The Monday rally comes ahead of the Federal Reserve’s Tuesday and Wednesday meeting which will reveal the central bank’s latest thoughts on cutting interest rates, a conclave which could potentially derail the good vibes on Wall Street as higher-than-expected interest rates would cut into companies’ earnings power. Getting Gemini onto iPhones would be a “major win” for Google as there’s “clearly a major license fee attached to this,” Wedbush analysts led by Dan Ives wrote in a Monday note to clients. How much Apple would pay Alphabet to license the Gemini software on its smartphones. Apple is looking at a “very significant” cost for such a deal, according to bank of America analyst Wamsi Mohan, who noted the report may suggest Apple’s in-house generative AI services are not on equal footing with Gemini or ChatGPT, the top Gemini competitor built by Microsoft-backed OpenAI. Perhaps the most comparable agreement is actually Apple’s $18 billion annual windfall from Alphabet for Google to be the default search engine on iPhones. Both Alphabet and Apple have taken their lumps over the last two years from a lack of market excitement for their AI offerings, with Alphabet stock suffering a 5% selloff just three weeks ago over Gemini angst and Apple wildly underperforming over the broader market over the last six months.    "
}