{
    "title": "The 3 Biggest Beneficiaries of the Massive AI-Driven Growth Opportunities",
    "date": "3/28/2024",
    "url": "https://investorplace.com/2024/03/the-3-biggest-beneficiaries-of-the-massive-ai-driven-growth-opportunities/",
    "text": " These names will benefit from the rapidly growing technology Advertisement Source: shutterstock.com/Allies Interactive Many companies benefitting tremendously from the proliferation of artificial intelligence. But so far, only a relatively small number of stocks, such as Nvidia (NASDAQ:NVDA), Microsoft (NASDAQ:MSFT) and Super Micro (NASDAQ:SMCI), have received a sizable boost from the trend. In a note to investors earlier this month, Goldman Sachs predicted that three groups of stocks would benefit from the spread of AI going forward. Goldman also forecasted the order in which these groups of AI stocks will advance. First, other firms involved in creating AI infrastructure, such as other chip makers and cloud infrastructure firms, will climb. Then the shares of firms that develop products equipped with AI will rise. Finally, the stocks of companies whose “productivity” will be boosted by AI will advance. For this column, I will include one pick from each category. Here are three stocks to benefit from AI growth. Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) develops AI infrastructure, including its Gemini AI system, and sells AI-powered products through its Google Cloud unit. As a result, GOOG stock is in the first group of AI stocks identified by Goldman. Investment bank Wedbush recently placed GOOG stock on its “Best Ideas List.” The bank named Alphabet as a clear beneficiary of generative AI, and predicted that the Street would become more upbeat about the firm’s AI capabilities. This backs up a report I made in a previous column, where I noted that thousands of companies are utilizing the firm’s AI-powered assistant. Meanwhile its AI model, Gemini, excels at understanding and summarizing many different types of media. Additionally, Google Cloud is already benefiting from the AI revolution, as its revenue surged nearly 26% last quarter versus the same period a year earlier. Given these points, GOOG is one of the best-positioned stocks to benefit from AI growth. ServiceNow (NYSE:NOW) offers many AI-infused products, putting it in the second group of Goldman Sachs’ AI beneficiaries.. ServiceNow’s Now Assist harnesses AI to improve its users productivity and efficiency. The firm’s Vancouver Platform has new automation and AI capabilities that helps firms deal with security and regulatory issues. Also importantly, ServiceNow launched an AI consulting software and service joint with Nvidia and consulting firm Accenture (NYSE:ACN). Given the strong reputation and offerings of ServiceNow and its partners, I expect this venture to be extraordinarily successful over the medium and long term. Investment bank Robert W. Baird recently asserted that ServiceNow’s revenue from Washington, which currently accounts for 10% of its sales, can increase meaningfully going forward. Many companies are looking to automate and standardize their processes, providing a positive catalyst for NOW stock. The bank has an $870 price target and an “outperform” rating on the shares. Drug maker Eli Lilly’s (NYSE:LLY) productivity will likely get a huge, long-term boost from AI. That’s because the technology makes streamlines and simplifies the long, arduous drug discovery process. Using AI, drug makers can quickly identify which of the billions of molecules available are likely to meet the criteria needed to become safe, effective treatments. And because AI is so good at evaluating all of the molecules’ characteristics, the technology significantly increases the success rate of drug candidates. In October 2022, Eli Lilly signed a huge deal worth up to $425 million with Schrodinger (NASDAQ:SDGR), which has one of the leading AI-powered drug discovery platforms. Schrodinger reports that the platform reduces by 50% the time needed to select suitable drug development candidates. On the date of publication, Larry Ramer held long positions in SMCI and SDGR while his wife had a long position in NOW. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Larry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer. Artificial Intelligence, Technology   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/the-3-biggest-beneficiaries-of-the-massive-ai-driven-growth-opportunities/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}