{
    "title": null,
    "date": "3/24/2024",
    "url": "https://seekingalpha.com/article/4680165-alphabet-google-an-advantaged-and-scaled-ai-player-at-a-deep-discount",
    "text": "Alexander Koerner Alexander Koerner The following segment was excerpted from this fund letter. In early 2023, we initiated an investment in Alphabet, the parent company of Google, at a highly attractive valuation during a period when apprehension about the company's competitive positioning in AI overshadowed the high-quality nature of its business and strong growth prospects. Since we initiated our position, the company has delivered impressive operating results. With two of the highest ROI and most resilient ad formats in Search and YouTube, Google occupies a dominant position in the secularly fast-growing digital advertising market. As the digital advertising market recovered over the course of the year, revenue growth in Google's advertising business accelerated from 3% in Q1 2023 to 10% in Q4 2023. Moreover, the company realized significant progress on its substantial margin expansion opportunity and maintained a robust capital return program. In 2023, operating profit margins expanded by approximately 225 basis points (bps), excluding one-time severance and real estate charges, as the Cloud segment reached breakeven profitability. We expect continued cost control, automation efficiencies, and operating leverage in under-earning segments (Cloud & YouTube) to sustain margin expansion as Google invests behind AI initiatives. The company is using its ample free cash flow to repurchase approximately 4% of its outstanding shares on an annual basis. Despite strong financial performance, concerns about Google's AI capabilities continue to weigh on its valuation. These concerns were recently stoked by Google's flawed rollout of its Gemini chatbot app which displayed historically inaccurate and biased responses to certain image and text queries. CEO, Sundar Pichai, has acknowledged these responses as \"completely unacceptable\" and the company is working quickly to rectify underlying issues, including implementing structural changes to its product launch, evaluation, and red-teaming processes to prevent future instances of bias. While Google's challenges have been well-publicized, it is worth noting that AI chatbots from other Big Tech and upstart competitors have displayed similarly biased and inaccurate responses. We are still in the very early days of AI commercialization and expect the company to iterate and learn from occasional missteps as it launches new AI applications. Over the longer term, we believe Google's access to high-quality training data, its substantial distribution moat, its AI-optimized infrastructure and deep technical expertise are durable competitive advantages. Although overshadowed by the scrutiny around its chatbot, Google also recently unveiled its next-generation AI model, Gemini 1.5, which we believe is industry-leading and represents a step-change improvement in the amount of information an AI model can process. For example, Gemini 1.5 is capable of analyzing hour-long videos and codebases with over 30,000 lines of code. Google is uniquely well-positioned to deliver AI advances, like Gemini 1.5, cost-efficiently and at scale across its broad suite of consumer and Cloud apps, including six different products that each serve more than two billion users. The cumulative impact of AI and machine learning enhancements is perhaps most evident in Google's core Search franchise. Google Search has evolved from its starting point as a simple results page with \"10 blue links\" and now provides summary answer snippets for informational and educational queries similar to AI chatbots without any of their latency. For more involved queries, for example, in travel, the company has developed specialized Google Flights and Hotels modules that offer consumers substantial utility and freedom to direct their discovery process. Innovation in Google Search has maintained its leading market position through multiple perceived \"disruption\" risks over time, including the platform transition from desktop-to-mobile and competitive threats from social media and verticalized search. Likewise, we view the company's integration of generative AI into a wider range of queries, not as a disruptive shift, but as a natural evolution of its Search product which will enhance the user experience and improve conversion for advertisers. We continue to believe Google is one of the most advantaged and scaled players in AI with an unmatched business model. The company's stock currently trades at approximately 19 times forward earnings, a deep discount to its peers despite its similar rate of projected earnings growth. The companies on this page reflect all of the portfolio companies, long and short, as of March 19, 2024, in respect of which ('A') Pershing Square or any Pershing Square Fund, as applicable, has designated a representative to the board, filed Schedule 13D, Form 4 or a similar non-US filing or has made a Hart-Scott Rodino filing; or ('B') Pershing Square has publicly recommended changes to the company's strategy in an investment-specific white paper, letter or presentation. Past performance is not a guarantee of future results. All investments involve risk, including the loss of principal. Limitations of Performance Data Past performance is not necessarily indicative of future results. All investments involve risk including the loss of principal. This report does not constitute a recommendation, an offer to sell or a solicitation of an offer to purchase any security or investment product. This report contains information and analyses relating to all publicly disclosed positions above 50 basis points in the Company's portfolio during 2022. Pershing Square may currently or in the future buy, sell, cover or otherwise change the form of its investment in the companies discussed in this report for any reason. Pershing Square hereby disclaims any duty to provide any updates or changes to the information contained here including, without limitation, the manner or type of any Pershing Square investment. Forward-Looking Statements This report also contains forward-looking statements, which reflect Pershing Square's views. These forward-looking statements can be identified by reference to words such as \"believe\", \"expect\", potential\", \"continue\", \"may\", \"will\", \"should\", \"seek\", \"approximately\", \"predict\", \"intend\", \"plan\", \"estimate\", \"anticipate\" or other comparable words. These forward-looking statements are subject to various risks, uncertainties and assumptions. Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. Should any assumptions underlying the forward-looking statements contained herein prove to be incorrect, the actual outcome or results may differ materially from outcomes or results projected in these statements. None of the Company, Pershing Square or any of their respective affiliates undertakes any obligation to update or review any forward-looking statement, whether as a result of new information, future developments or otherwise, except as required by applicable law or regulation. Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by "
}