{
    "title": "Google's AI blunder shows risks in scramble to catch up to Microsoft",
    "date": "3/2/2024",
    "url": "https://finance.yahoo.com/news/googles-ai-blunder-shows-risks-in-scramble-to-catch-up-to-microsoft-192344723.html",
    "text": "The market buzz around generative AI comes with heightened scrutiny, as Google (GOOG, GOOGL) was painfully reminded for the second time. The search giant said this week that it plans to relaunch its Gemini AI image generator after some users on social media showed how prompts for historical images of people generated inaccurate or unexpected results, in what critics called anti-White bias. One viral post appeared to show a Gemini result for \"a portrait of a Founding Father of America\" that included a Black man and a Native American man. Other examples of image and text results prompted disapproval from prominent figures, including X owner Elon Musk, who has previously criticized the perceived liberal bias of AI tools. The incident marks the latest misstep from Google as it scrambles for positioning in the blossoming market for AI products and plays catch up to Microsoft (MSFT) and its AI partner OpenAI. Shares of Alphabet, Google's parent company, fell almost 5% this week after the announcement that it hit pause on the tool. In a memo to staff on Tuesday, CEO Sundar Pichai said, \"I know that some of its responses have offended our users and shown bias — to be clear, that’s completely unacceptable, and we got it wrong.\" Rob Sanderson, managing director at Loop Capital, said the PR blunder suggests that Google is trailing and misperforming in the high-stakes space for generative AI and that questions surrounding its standing and search dominance will pressure its valuation. \"Google seems to be handling product introduction in a way unlike Google of the past,\" he said. \"We think that Google is in the unfamiliar position in not being the leader in a core, [machine learning]-driven technology. Google is trying hard to catch up and now needs to go backward to repair a core technology component while dealing with a major PR blunder, or possibly something worse.\" Google's first AI fumble came a year ago when the company released a demo of its AI chatbot, Bard, a few months after ChatGPT exploded onto the scene. Google's chatbot spit out an inaccurate response in a promotional video that was widely circulated online. In the immediate aftermath, skittish investors wiped $100 billion from Google's market value just as Microsoft's fortunes climbed. Google explained in a recent blog post that it tuned its Gemini image generation tool to show a range of people of different ethnicities and other characteristics but that it failed to account for cases that should not depict diversity. Some observers noted that the company's long-held supremacy in search might have fostered a stifled culture among employees that ultimately showed up in the tool. \"Many suggest that a cultural bias toward social issues is so deeply entwined in Google’s engineering that it’s being reflected in its most advanced AI products,\" said Sanderson. Alison Taylor, a professor at New York University whose research focuses on business ethics and social impact, said the apparent overcorrection of injecting diversity initiatives into the tech also highlights the awkward position Google and others find themselves in. \"Do these AI tools reflect the accurate fact that society is racist, or do they try to correct and the result is the absurdity that we see?\" she said. Like prior episodes involving Bud Light (BUD) and Target (T), Google has attracted the ire of a subset of conservatives who see corporate America's attempts at inclusivity as antagonistic and ham-fisted. Last year, conservative outcry aimed at Target and Bud Light's support of the LGBTQ community damaged the brands' financials. Experts said the companies inflamed the fierce negative publicity by appearing to back down, which drew criticism from the customers who opposed the company's actions and those that the brands were originally trying to appeal to. The two companies, at least for a time, served as cautionary tales within marketing circles for seeming to not know their audience and for bumbling corporate responses to political boycotts. But Wall Street has largely moved on. Both stocks have recovered from earlier losses. The market may not be as forgiving toward Google, however. For those opposed to diversity initiatives, the recent incident looks like inclusivity run amok. For AI critics, it highlights the mad dash to deliver a product and the clumsy attempts to fix the biases of AI models. And for Wall Street it highlights another danger of Google playing from behind. \"We think that Google’s uncertain position in [generative] AI and long-term implications will be a growing 'wall of worry' for investors at a minimum and the beginning of secular decline in the worst case,\" Sanderson said. Hamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on Twitter @hshaban. Click here for the latest technology news that will impact the stock market. Read the latest financial and business news from Yahoo Finance Related Quotes "
}