{
    "title": "Insider Selling: Alphabet Inc. (NASDAQ:GOOGL) Director Sells 300 Shares of \nStock",
    "date": "3/12/2024",
    "url": "https://www.marketbeat.com/instant-alerts/nasdaq-googl-insider-buying-and-selling-2024-03-12/",
    "text": "Alphabet Inc. (NASDAQ:GOOGL - Get Free Report) Director John L. Hennessy sold 300 shares of Alphabet stock in a transaction that occurred on Tuesday, March 12th. The stock was sold at an average price of $139.51, for a total value of $41,853.00. Following the sale, the director now owns 9,291 shares in the company, valued at $1,296,187.41. The transaction was disclosed in a legal filing with the SEC, which can be accessed through this hyperlink. Get Alphabet alerts:Sign UpAlphabet Stock Performance Shares of NASDAQ GOOGL traded up $0.83 during trading hours on Tuesday, hitting $138.50. 27,546,298 shares of the company's stock were exchanged, compared to its average volume of 31,206,469. Alphabet Inc. has a 1-year low of $89.42 and a 1-year high of $153.78. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. The stock has a market capitalization of $1.72 trillion, a price-to-earnings ratio of 23.96, a PEG ratio of 1.25 and a beta of 1.04. The company's 50-day moving average price is $142.05 and its 200-day moving average price is $137.15. Alphabet (NASDAQ:GOOGL - Get Free Report) last posted its quarterly earnings data on Tuesday, January 30th. The information services provider reported $1.64 earnings per share for the quarter, topping the consensus estimate of $1.60 by $0.04. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. The business had revenue of $86.31 billion during the quarter, compared to analysts' expectations of $70.77 billion. During the same quarter in the previous year, the firm earned $1.05 EPS. On average, sell-side analysts expect that Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. Analysts Set New Price Targets Several equities research analysts have issued reports on GOOGL shares. Rosenblatt Securities dropped their price objective on Alphabet from $174.00 to $172.00 and set a \"buy\" rating on the stock in a report on Wednesday, January 31st. Wedbush reiterated an \"outperform\" rating and issued a $160.00 target price on shares of Alphabet in a research report on Wednesday, January 31st. Mizuho lifted their target price on Alphabet from $155.00 to $170.00 and gave the stock a \"buy\" rating in a research report on Wednesday, January 17th. Susquehanna lifted their target price on Alphabet from $150.00 to $170.00 and gave the stock a \"positive\" rating in a research report on Wednesday, January 31st. Finally, Roth Mkm decreased their target price on Alphabet from $166.00 to $164.00 and set a \"buy\" rating for the company in a research report on Wednesday, January 31st. Five equities research analysts have rated the stock with a hold rating, twenty-seven have assigned a buy rating and two have assigned a strong buy rating to the company. According to MarketBeat, Alphabet currently has a consensus rating of \"Moderate Buy\" and a consensus price target of $153.65. Check Out Our Latest Analysis on GOOGLHedge Funds Weigh In On Alphabet Several large investors have recently added to or reduced their stakes in GOOGL. Spreng Capital Management Inc. lifted its position in Alphabet by 4.0% during the first quarter. Spreng Capital Management Inc. now owns 131 shares of the information services provider's stock valued at $364,000 after purchasing an additional 5 shares during the last quarter. West Family Investments Inc. lifted its holdings in shares of Alphabet by 0.3% in the 1st quarter. West Family Investments Inc. now owns 1,754 shares of the information services provider's stock worth $4,878,000 after acquiring an additional 6 shares during the last quarter. Maple Capital Management Inc. lifted its holdings in shares of Alphabet by 2.1% in the 1st quarter. Maple Capital Management Inc. now owns 296 shares of the information services provider's stock worth $823,000 after acquiring an additional 6 shares during the last quarter. Private Advisory Group LLC lifted its holdings in shares of Alphabet by 1.8% in the 1st quarter. Private Advisory Group LLC now owns 401 shares of the information services provider's stock worth $1,115,000 after acquiring an additional 7 shares during the last quarter. Finally, Weik Capital Management lifted its holdings in shares of Alphabet by 0.5% in the 1st quarter. Weik Capital Management now owns 1,533 shares of the information services provider's stock worth $4,264,000 after acquiring an additional 8 shares during the last quarter. Institutional investors and hedge funds own 35.08% of the company's stock. Alphabet Company Profile (Get Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.See AlsoFive stocks we like better than AlphabetAre Penny Stocks a Good Fit for Your Portfolio?Ambarella's Stock Turning Point: AI Set to Propel Growth in 2024Dividend Capture Strategy: What You Need to KnowON Holdings Stock Price Tumbles: Is Now The Time to Buy?There Are Different Types of Stock To Invest InGameStop Stock Is Giving Investors a Familiar Feeling, But Why?This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.→ Trump’s “Tax Free” Retirement Strategy  (From Gold Safe Exchange) (Ad)Should you invest $1,000 in Alphabet right now?Before you consider Alphabet, you'll want to hear this.MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list.While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.View The Five Stocks Here 7 Stocks to Own Before the 2024 ElectionLooking to avoid the hassle of mudslinging, volatility, and uncertainty? You'd need to be out of the market, which isn’t viable. So where should investors put their money? Find out with this report.Get This Free Report  This instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com. Before you consider Alphabet, you'll want to hear this. MarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Alphabet wasn't on the list. While Alphabet currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys. View The Five Stocks Here Looking to avoid the hassle of mudslinging, volatility, and uncertainty? You'd need to be out of the market, which isn’t viable. So where should investors put their money? Find out with this report. Sign up for MarketBeat All Access to gain access to MarketBeat's full suite of research tools: View the latest news, buy/sell ratings, SEC filings and insider transactions for your stocks. Compare your portfolio performance to leading indices and get personalized stock ideas based on your portfolio. Get daily stock ideas from top-performing Wall Street analysts. Get short term trading ideas from the MarketBeat Idea Engine. View which stocks are hot on social media with MarketBeat's trending stocks report. Identify stocks that meet your criteria using seven unique stock screeners. See what's happening in the market right now with MarketBeat's real-time news feed. Export data to Excel for your own analysis. As Featured By: 345 N Reid Place, Suite 620, Sioux Falls, SD 57103\n\ncontact@marketbeat.com\n\n(844) 978-6257 © MarketBeat Media, LLC® 2010-2024. All rights reserved. © 2024 Market data provided is at least 10-minutes delayed and hosted by Barchart Solutions. Information is provided 'as-is' and solely for informational purposes, not for trading purposes or advice, and is delayed. To see all exchange delays and terms of use please see Barchart's disclaimer. My Account - "
}