{
    "title": "After Larry Page founded Alphabet, Steve Jobs told him he was doing too much",
    "date": "3/26/2024",
    "url": "https://fortune.com/2024/03/26/google-founder-larry-page-birthday-sergey-brin-alphabet-steve-jobs-fortune-global-forum/",
    "text": "Even from Google’s inception, cofounders Larry Page and Sergey Brin considered the company’s potential for astronomical growth. Named after “googol,” the term for the numeral 1 with 100 zeros behind it, Google, then just a search engine founded in 1998, would become as large as the internet would allow. The company has far exceeded the parameters of just the internet. Valued at about $1.9 trillion, Alphabet Inc., Google’s parent company, ranks No. 1 on Fortune’s 2024 Most Innovative Companies list. Broken into three segments—Google Services, Google Cloud, and Other Bets—Alphabet’s reach spans from Android, Chrome, YouTube, and its Bard AI chatbot under its Services umbrella, to cloud computing under its Cloud umbrella, to private equity fund CapitalG, DeepMind AI research, and Waymo under its Other Bets umbrella. Google Services makes up 90% of the company’s revenue, Fortune calculated from Alphabet’s 2023 fourth-quarter earnings report. Page, the eighth-richest person in the world with a net worth of about $136 billion, according to the Bloomberg Billionaires Index, has certainly reaped the rewards of Alphabet’s success. With stints as CEO of Google from 1997 to 2001 and 2011 to 2015, and of Alphabet until 2019, Page remains a board member and shareholder of his company, effectively controlling it alongside cofounder Brin. Tuesday is Page’s 51st birthday, and while he’s another year older and wiser, it was Apple cofounder Steve Jobs who imparted some prescient wisdom about the company’s future, which now boasts the sixth-largest market capitalization in the world. Page visited Jobs toward the end of Jobs’ life in 2011 to receive some frank advice from his mentor: “The main thing I stressed was focus,” Jobs said, according to Walter Isaacson, author of Jobs’ biography. “It’s now all over the map. What are the five products you want to focus on? Get rid of the rest, because they’re dragging you down. They’re turning you into Microsoft. They’re causing you to turn out products that are adequate but not great.” “He was right,” Page told Fortune CEO Alan Murray at Fortune’s Global Forum in 2015, just days after Alphabet’s October founding. “I mean, he did fine as well.” Page did listen to his advice at first, telling employees to focus on Android products and the now-defunct Google+. But the growth of Alphabet suggested the company was poised for bigger things, and more of them. Alphabet was designed as a container for Google’s future ventures, even its more esoteric ideas such as glucose-monitoring contact lenses. While Page conceded that Jobs was correct on some level, he also believed that Alphabet’s ventures were interconnected and that energy, telecommunications, and transportation all fit under its umbrella. “I always thought it was kind of stupid if you have this big company, and you can only do, like, five things,” Page said in a 2014 fireside chat with Khosla Ventures, taking a jab at Jobs. Page and Brin were so certain of Alphabet’s name and purpose that they didn’t even market test it. “I wanted to have a name that people would be proud to work for,” Page said. “But [I] actually didn’t want it to be too catchy because the idea really wasn’t to have a consumer brand in the way that Google is, but really a brand for companies to be part of.” Alphabet was a brand for its employees and investors, Page said. But he doesn’t take credit for the name. “I chose Google, so [Sergey] chose Alphabet.” © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. "
}