{
    "title": null,
    "date": "3/21/2024",
    "url": "https://finance.yahoo.com/news/alphabet-goog-stock-trading-reasonable-074015257.html",
    "text": "Ruane, Cunniff & Goldfarb, an investment adviser managing Sequoia Fund, released its Q4 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, the fund returned 13.31% compared to an 11.69% return for the S&P 500 Index. The fund generated a 27.83% return in 2023 compared to a 26.29% return for the index. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Sequoia Fund featured stocks like Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On March 20, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $149.68 per share. One-month return of Alphabet Inc. (NASDAQ:GOOG) was 3.00%, and its shares gained 40.86% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.855 trillion. Sequoia Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter: \"Shares in Alphabet Inc. (NASDAQ:GOOG) returned 58% last year, essentially double the return of the Index. Business performance was solid. Google Search and YouTube advertising continued to grow last year, with YouTube subscriptions growing nicely and enjoying a bump last fall as the NFL made the platform the exclusive home of NFL Sunday Ticket in the US in a deal signed through 2030. In the first quarter of 2023, Google Cloud achieved profitability for the first time. It stayed in the black over the balance of the year, as revenues grew to an annualized run-rate of over $33 billion. In Other Bets, Waymo's driverless fleet surpassed seven million fully autonomous miles driven while safety issues forced a key competitor out of the market. We expect Alphabet’s revenues and earnings per share to be up high-single digits in 2023. Since our initial investment over twelve years ago, Alphabet has only become more of an internet powerhouse. From its origins in Search, the company has expanded into a vast ecosystem of complementary products across YouTube, Gmail, Workspace, Android, Cloud and more. These are preeminent assets that boast some of the largest user-bases globally…” (Click here to read the full text) A laptop and phone open to Google's services in an everyday setting. Alphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. At the end of the fourth quarter, Alphabet Inc. (NASDAQ:GOOG) was held by 166 hedge fund portfolios, compared to 163 in the previous quarter, according to our database. We discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared Diamond Hill Capital's views on the company. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors. Suggested Articles: 20 Most Food Insecure States in the US 15 Money Mistakes to Avoid in Your 30s 20 Countries with Most Personal Space Disclosure: None. This article is originally published at Insider Monkey. Related Quotes "
}