{
    "title": "Google CEO's Anxiety Exposed? Leaked Email Reveals How Sundar Pichai Was \nSpooked About Losing Talent, Esp",
    "date": "3/11/2024",
    "url": "https://www.benzinga.com/news/24/03/37579583/google-ceos-anxiety-exposed-leaked-email-reveals-how-sundar-pichai-was-spooked-about-losing-talent-e",
    "text": "Get All the Market Moving News, Squawk, and Mentorship NOW Get All the Market Moving News, Squawk, and Mentorship NOW Alphabet Inc. GOOG GOOGL and Google CEO Sundar Pichai was reportedly keeping a close watch on the loss of key talent to rivals, especially Apple. What Happened: Amidst an ongoing antitrust lawsuit brought by the U.S. Department of Justice, an email exchange between Pichai and a Google executive revealed the CEO's insecurity amidst concerns that Apple was working on its own search engine. In the email, Pichai asks the Google executive to give him a monthly report of loss of talent to key competitors. What stands out in this conversation is Pichai wanting to micro-manage this for Apple in particular. He asks the executive to email him about every individual talent poached by the iPhone maker. See Also: Neither Sundar Pichai Nor Sergey Brin—This Ex-Employee Warned Google 5 Years Ago That AI Was Coming For Their Search Engine \"Prasad, I need monthly reports of all losses to key competitors on an ongoing basis and if anyone from search to Appe, please email me directly on every individual cases [sic].\" Analysts estimate that Google likely paid Apple a whopping $10 billion in 2020 to be the default search engine on iPhones. This is expected to have increased to $15 billion. Google's filing also sheds light on the fact that rival Microsoft tried to sell Bing to Apple. The deal did not go through eventually and Apple stuck to its Google deal said to be worth $19 billion. Apple's senior vice president of services, Eddy Cue, defended the Google deal stating it was in the \"best interest\" of both the companies. Why It Matters: Pichai has increasingly come under fire recently over issues plaguing Google, especially with respect to its efforts in artificial intelligence (AI). The Gemini scandal has made matters worse for the Google veteran, and there are growing calls for Pichai to step down. It also brought Google co-founder Sergey Brin back into the public eye, who said Gemini's image generator was \"messed up.\" Pichai called the scandal \"completely unacceptable\" in an internal memo. A previous letter by another Google veteran revealed that employee morale at the search giant was at an \"all-time low.\" Price Action: Google's stock closed 0.20% lower on Friday, according to data from Benzinga Pro. Check out more of Benzinga’s Consumer Tech coverage by following this link. Read Next: Sam Altman Apologizes For This After Returning To OpenAI Board: ‘Wish I Had Done It Differently’ Photo via Shutterstock © 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Trade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about. "
}