{
    "title": null,
    "date": "3/1/2024",
    "url": "https://www.foxbusiness.com/technology/is-the-gemini-fallout-bud-light-moment-google",
    "text": "Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n          Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Substack columnist Michael Shellenberger discusses the woke rhetoric from Google’s AI platform on ‘The Bottom line.’ Google is facing heavy backlash over accusations that the company is \"woke\" following the revelation that its new artificial intelligence tool, Gemini, was developed with a bias against White people. The Alphabet-owned tech giant is scrambling to right ship after pulling the plug on Gemini's image generation features last week, with CEO Sundar Pichai telling employees on Tuesday the company is working \"around the clock\" to fix the tool's bias, calling the images generated by the model \"completely unacceptable.\" Google CEO Sundar Pichai (REUTERS/Brandon Wade / Reuters Photos) Alphabet, Inc. However, \"Public\" founder Michael Shellenberger says the fallout over Gemini is Google's \"Bud Light moment,\" likening the situation to what Anheuser-Busch InBev faced after its Bud Light brand was boycotted following a partnership with controversial transgender influencer Dylan Mulvaney. Anheuser-Busch InBev \"The problem for Google, as with Bud Light before it, is that its CEO and other senior executives are still in denial about the problem,\" Shellenberger told FOX Business in an emailed statement. \"They think the problem is just a few tweaks to the AI or the algorithms.\" BUD LIGHT REMAINS DRAG ON PARENT COMPANY AS DYLAN MULVANEY HIT LINGERS The journalist and author argues it will take more than fixing Gemini for Google to regain the public's trust. Gemini's senior director of product management at Google has issued an apology after the AI refused to provide images of White people. (Photo by Betul Abali/Anadolu via Getty Images / Getty Images) \"The real problem is that Google is a tool of its woke workers and government contractors, who are manipulating Google Search and Google Gemini to divide the American people along racial and partisan lines, censor disfavored views, and spread disinformation about everyone from German farmers to American investigative reporters,\" Shellenberger wrote. \"Google’s CEO must snap out of denial and commit to political neutrality, which means nonpartisan and balanced political donations, nonpartisan and transparent fact-checking that is accountable for its biases and errors, and an end to censorship of politically disfavored views,\" he added. GOOGLE CEO'S 2016 PLEDGE TO COMBAT MISINFORMATION WITH AI UNDER SCRUTINY FOLLOWING GEMINI CONTROVERSY Jessica Melugin, director of the Competitive Enterprise Institute’s Center for Technology and Innovation, says she does not believe Google's troubles rise to the same level as Bud Light's. Jessica Melugin, Competitive Enterprise Institute Director of Center for Technology and Innovation, reacts to Google’s ‘woke’ artificial intelligence tool on ‘The Big Money Show.’ \"I think they’re different in that Bud Light was a marketing mistake, while Gemini was a product mistake,\" Melugin told FOX Business. \"I think the parallel would be skunked beer.\" Melugin said she can see how some might see a common thread in terms of political slant, but noted that generative AI competitors have produced bad results in the other direction too, so she thinks Gemini's woes could be attributed to a quality-control issue. GET FOX BUSINESS ON THE GO BY CLICKING HERE \"Whatever the reason for the bad results, Google has plenty of incentive to fix it,\" she said, pointing to the beating Alphabet's stock has taken since hitting pause on Gemini. Get a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you. We've added you to our mailing list. By clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement. This material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy "
}