{
    "title": null,
    "date": "3/25/2024",
    "url": "https://finance.yahoo.com/news/alphabet-inc-goog-declines-more-214522462.html",
    "text": "Alphabet Inc. (GOOG) ended the recent trading session at $151.15, demonstrating a -0.41% swing from the preceding day's closing price. This change lagged the S&P 500's daily loss of 0.31%. Elsewhere, the Dow lost 0.41%, while the tech-heavy Nasdaq lost 0.27%. The company's stock has climbed by 4.46% in the past month, exceeding the Computer and Technology sector's gain of 3.86% and the S&P 500's gain of 3.05%. Analysts and investors alike will be keeping a close eye on the performance of Alphabet Inc. in its upcoming earnings disclosure. The company is predicted to post an EPS of $1.49, indicating a 27.35% growth compared to the equivalent quarter last year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $65.95 billion, up 13.58% from the year-ago period. GOOG's full-year Zacks Consensus Estimates are calling for earnings of $6.77 per share and revenue of $286.48 billion. These results would represent year-over-year changes of +16.72% and +11.68%, respectively. Furthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Alphabet Inc. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability. Empirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model. The Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.03% decrease. Alphabet Inc. currently has a Zacks Rank of #3 (Hold). In the context of valuation, Alphabet Inc. is at present trading with a Forward P/E ratio of 22.41. This indicates a discount in contrast to its industry's Forward P/E of 25.97. Meanwhile, GOOG's PEG ratio is currently 1.4. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. The Internet - Services was holding an average PEG ratio of 2.21 at yesterday's closing price. The Internet - Services industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 74, this industry ranks in the top 30% of all industries, numbering over 250. The Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1. Ensure to harness Zacks.com to stay updated with all these stock-shifting metrics, among others, in the next trading sessions. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Alphabet Inc. (GOOG) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research Related Quotes "
}