{
    "title": "Wall Street Picked These 5 AI Stocks for 2024",
    "date": "3/9/2024",
    "url": "https://www.insidermonkey.com/blog/wall-street-picked-these-5-ai-stocks-for-2024-1268866/4",
    "text": "Number of Hedge Fund Holders: 293 YTD Performance as of March 7, 2024: +19.3% Amazon.com Inc (NASDAQ:AMZN) is a consumer and tech company that sells products, ads, and subscriptions. It also offers AI services through Amazon Web Services. AI helps Amazon.com Inc (NASDAQ:AMZN) improve its e-commerce, cloud, and logistics. RBC Capital analyst Brad Erickson has called Amazon.com Inc (NASDAQ:AMZN) one of his favorite ideas in the internet space in 2024. The analyst reaffirmed a buy rating on AMZN stock with a price target of $180. “We expect AMZN to gain ‘share’ in the GenAI narrative battle between itself, GOOGL & MSFT as Bedrock builds partnerships and gains more traction,” Erickson said in a research note to investors. In the fourth quarter, hedge fund sentiment was positive toward Amazon.com, Inc. (NASDAQ:AMZN) as the number of hedge funds with investments in the stock went up to 293, up from 286 in the previous quarter. Fisher Asset Management increased its stake in Amazon.com Inc (NASDAQ:AMZN) by 3% to 42.24 million shares worth $6.42 billion. This is what Polen Global Growth Strategy said about Amazon.com, Inc. (NASDAQ:AMZN) in its fourth quarter 2023 investor letter: “Amazon.com, Inc. (NASDAQ:AMZN), which saw significant price appreciation throughout much of 2023, saw its share price increase materially in Q4 following the company’s Q3 2023 earnings report. We have yet to see the long-awaited re-acceleration in AWS (Amazon Web Services) revenue growth. However, in our estimation, the segment’s growth has likely bottomed, and we could see accelerating growth in 2024. Further, Amazon’s e-commerce business has gradually re-accelerated from 2022’s levels and, perhaps most importantly, the company’s margins and free cash flow have rebounded materially from last year. This rebound in margins and free cash flow at Amazon has been a key component of our long-term thesis for the business, and we expect the improvement in these metrics to continue into 2024 and beyond (though perhaps not linearly) as the company continues to optimize costs and capital expenditures. Our position in Amazon reflects our positive long-term expectations of the business, and it is currently our largest absolute weight in the Portfolio.” NASDAQ:GOOGNASDAQ:AMZNNASDAQ:METANASDAQ:MSFTNASDAQ:NVDANvidia Corp (NASDAQ:NVDA)Alphabet Inc (NASDAQ:GOOG)Microsoft Corp (NASDAQ:MSFT)Amazon.com Inc. (NASDAQ:AMZN)Meta Platforms Inc. (NASDAQ:META)Alphabet Inc Class C (NASDAQ:GOOG)Wall Street Picked These 5 AI Stocks for 2024Dorsal Capital Partners Sees a 13% Boost in 2023: Its Top 15 Stock PicksHere is How Billionaire Chris Hohn's Hedge Fund Beat the Market with 33% GainShow more...Show less Warren Buffett Berkshire Hathaway $293,447,417,000 David Einhorn Greenlight Capital $1,491,303,000 George Soros Soros Fund Management $5,416,602,000 Jim Simons Renaissance Technologies $77,426,184,000 Leon Cooperman Omega Advisors $1,886,381,000 Carl Icahn Icahn Capital LP $22,521,664,000 Steve Cohen Point72 Asset Management $22,767,998,000 John Paulson Paulson & Co $3,510,256,000 David Tepper Appaloosa Management LP $4,198,712,000 Paul Tudor Jones Tudor Investment Corp $6,160,740,000                                                            Get our editor’s daily picks straight in your inbox!  "
}