{
    "title": "Stock Alert: 3 Big Tech Names That Have More Room to Run",
    "date": "3/4/2024",
    "url": "https://investorplace.com/2024/03/stock-alert-3-big-tech-names-that-have-more-room-to-run/",
    "text": " Don't miss out on these big tech stocks set to run Advertisement Source: Peshkova / Shutterstock Big tech stocks have carried the S&P 500 and the Nasdaq 100. These corporations produce products and services that have become household names. Despite massive run-ups, many of the mega-cap tech stocks still have more room to run. These stocks still have enough catalysts to outperform the market and deliver long-term value to new shareholders. Investors looking for some opportunities in established stocks should consider these big tech stocks set to run. Meta Platforms (NASDAQ:META) recently hit an all-time high as the 2022 slowdown is now a distant memory. Shares have roughly tripled over the past year. A return to impressive revenue growth and significant cost reduction helped the company notch net profit margins above 30%. More specifically, Meta Platforms increased revenue by 25% year-over-year (YoY) and grew net income by 201% YoY in the fourth quarter of 2023. The remarkable net income growth led to the company’s first dividend, which is set at an annualized $2/share. Facebook’s parent company has a lot of room to raise its dividend. Investors should expect many years of 10% dividend hikes. Cash flow will reward income investors, but the corporation is still growing and can deliver returns for long-term investors. Underlying strength within the core platform supports future appreciation. Facebook’s daily active users reached 2.11 billion, up by 6% YoY. Monthly active users reached 3.98 billion, also a 6% YoY improvement. Continued growth and a higher average revenue per user will help the stock expand its rally. Amazon (NASDAQ:AMZN) offers investors exposure to e-commerce, cloud computing, artificial intelligence, advertising and other segments. The stock has almost doubled over the past year, and a record-breaking fourth quarter suggests more gains are likely. During the quarter, Amazon’s sales reached $170.0 billion for the first time. It was a 14% YoY improvement fueled by international growth. Domestic sales still delivered a solid 13% YoY growth rate, while YoY international growth was 17%. Amazon Web Services experienced a 13% in sales over the past year. That segment makes up 14% of the company’s total revenue. Amazon CEO Andy Jassy expressed optimism about the company’s record-breaking holiday shopping season, artificial intelligence initiatives and growth in advertising services. While Amazon has many growth ventures, its e-commerce foundation can still lead to more gains. The e-commerce industry is projected to have a compounded annual growth rate of 9.79% from now until 2029. Amazon will get the majority of that market share since it has become the industry’s leader. Many tech stocks have soared tremendously and have higher valuations. Forward P/E ratios make it easier to justify the worth of many big tech companies, but investors can appreciate Alphabet’s (NASDAQ:GOOG, NASDAQ:GOOGL) current valuation. Shares only trade at a 23 P/E ratio. The valuation can even drop in the short run as the company’s Gemini blunder captures headlines. Gemini’s AI image generation tool will only be down for a few weeks and may help the company in the future. However, investors have gotten too caught up in artificial intelligence to recognize the company’s solid business model. Google advertising and Google Cloud continue to generate high revenue growth. Google Cloud recently became profitable and will expand the company’s net profit margins. We saw that unfold in the fourth quarter of 2023. Revenue increased by 13% YoY, while net income was up by 52% YoY. The company’s rising profits resemble Meta Platforms’ efforts to reduce costs. Alphabet has a good history of using artificial intelligence to improve its search engine and cloud platform. The company will rebound and look like the best value pick among mega-cap tech stocks. On this date of publication, Marc Guberti held a long position in GOOG. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Marc Guberti is a finance freelance writer at InvestorPlace.com who hosts the Breakthrough Success Podcast. He has contributed to several publications, including the U.S. News & World Report, Benzinga, and Joy Wallet.   Article printed from InvestorPlace Media, https://investorplace.com/2024/03/stock-alert-3-big-tech-names-that-have-more-room-to-run/. ©2024 InvestorPlace Media, LLC Market Analysis Market Analysis Today's Market Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Stocks to Buy Financial Market Data powered by FinancialContent Services, Inc. All rights reserved. Nasdaq\n\t\t\t\t\t\tquotes delayed at least 15 minutes, all others at least 20 minutes.\n\t\t\t\t\t\tCopyright ©\n\t\t\t\t\t\t2024 InvestorPlace Media, LLC. All rights reserved. 1125 N. Charles St, Baltimore, MD 21201. Not Yet a Premium Subscriber?  Your Email  "
}