{
    "title": "Invera Wealth Advisors LLC Makes New $4.11 Million Investment in Alphabet \nInc. (NASDAQ:GOOGL)",
    "date": "3/27/2024",
    "url": "https://www.defenseworld.net/2024/03/27/invera-wealth-advisors-llc-makes-new-4-11-million-investment-in-alphabet-inc-nasdaqgoogl.html",
    "text": "Posted by Defense World Staff on Mar 27th, 2024 Invera Wealth Advisors LLC acquired a new position in  Alphabet Inc. (NASDAQ:GOOGL – Free Report) in the 4th quarter, HoldingsChannel.com reports. The firm acquired 29,442 shares of the information services provider’s stock, valued at approximately $4,113,000. Alphabet accounts for about  2.6% of Invera Wealth Advisors LLC’s investment portfolio, making the stock its 8th biggest holding. Several other institutional investors have also recently modified their holdings of the company. Vanguard Group Inc. raised its position in  Alphabet by 1,919.4% during the third quarter. Vanguard Group Inc. now owns 477,035,902 shares of the information services provider’s stock valued at $45,628,484,000 after acquiring an additional 453,413,389 shares in the last quarter.  State Street Corp raised its position in  Alphabet by 1,900.6% during the third quarter. State Street Corp now owns 217,154,306 shares of the information services provider’s stock valued at $20,770,809,000 after acquiring an additional 206,300,042 shares in the last quarter.  Moneta Group Investment Advisors LLC raised its position in  Alphabet by 111,197.8% during the fourth quarter. Moneta Group Investment Advisors LLC now owns 170,420,243 shares of the information services provider’s stock valued at $15,036,178,000 after acquiring an additional 170,267,122 shares in the last quarter.  Price T Rowe Associates Inc. MD increased its position in shares of  Alphabet by 1,759.2% in the third quarter. Price T Rowe Associates Inc. MD now owns 116,116,066 shares of the information services provider’s stock valued at $11,106,502,000 after buying an additional 109,870,525 shares in the last quarter.  Finally, Norges Bank purchased a new stake in shares of  Alphabet in the fourth quarter valued at approximately $8,335,063,000. 40.03% of the stock is currently owned by hedge funds and other institutional investors. In other news, CEO Sundar Pichai sold 22,500 shares of the firm’s stock in a transaction that occurred on Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total value of $3,152,475.00. Following the completion of the sale, the chief executive officer now directly owns 2,422,691 shares of the company’s stock, valued at approximately $339,443,236.01. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed through this link. In related news, CEO Sundar Pichai sold 22,500 shares of Alphabet stock in a transaction on Wednesday, January 3rd. The stock was sold at an average price of $140.11, for a total transaction of $3,152,475.00. Following the completion of the transaction, the chief executive officer now directly owns 2,422,691 shares of the company’s stock, valued at $339,443,236.01. The sale was disclosed in a legal filing with the SEC, which is accessible through the SEC website. Also, insider John Kent Walker sold 28,281 shares of Alphabet stock in a transaction on Thursday, December 28th. The stock was sold at an average price of $141.40, for a total value of $3,998,933.40. Following the transaction, the insider now directly owns 25,002 shares of the company’s stock, valued at $3,535,282.80. The disclosure for this sale can be found here. Insiders sold 279,659 shares of company stock valued at $39,460,310 in the last three months. 0.88% of the stock is currently owned by company insiders. A number of analysts have recently commented on the company. Barclays cut their price objective on Alphabet from $180.00 to $173.00 and set an “overweight” rating for the company in a research report on Wednesday, January 31st. Wolfe Research boosted their price objective on Alphabet from $170.00 to $180.00 and gave the company an “outperform” rating in a research report on Wednesday, January 31st. Redburn Atlantic lifted their price target on Alphabet from $150.00 to $165.00 and gave the stock a “buy” rating in a research note on Wednesday, January 31st. JMP Securities lifted their price target on Alphabet from $150.00 to $160.00 and gave the stock a “market outperform” rating in a research note on Wednesday, January 31st. Finally, Needham & Company LLC  reaffirmed a “buy” rating and issued a $160.00 price target on shares of Alphabet in a research note on Wednesday, January 31st. Five investment analysts have rated the stock with a hold rating, twenty-six have assigned  a buy rating and two have assigned  a strong buy rating to the company’s stock. According to MarketBeat.com, the company presently has an average rating of “Moderate Buy” and an average price target of $155.48. View Our Latest Stock Analysis on Alphabet GOOGL stock opened at $150.67 on Wednesday. The company has a debt-to-equity ratio of 0.05, a current ratio of 2.10 and a quick ratio of 2.10. Alphabet Inc. has a 1 year low of $99.74 and a 1 year high of $153.78. The firm has a market capitalization of $1.87 trillion, a P/E ratio of 25.98, a P/E/G ratio of 1.39 and a beta of 1.04. The business’s 50-day moving average is $143.17 and its two-hundred day moving average is $137.93. Alphabet (NASDAQ:GOOGL – Get Free Report) last released its quarterly earnings results on Tuesday, January 30th. The information services provider reported $1.64 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $1.60 by $0.04. The firm had revenue of $86.31 billion for the quarter, compared to the consensus estimate of $70.77 billion. Alphabet had a return on equity of 27.22% and a net margin of 24.01%. During the same quarter last year, the business posted $1.05 EPS.  Analysts anticipate that  Alphabet Inc. will post 6.77 earnings per share for the current fiscal year. (Free Report) Alphabet Inc offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube.  Want to see what other hedge funds are holding GOOGL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Alphabet Inc. (NASDAQ:GOOGL – Free Report).   Receive News & Ratings for Alphabet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet and related companies with MarketBeat.com's FREE daily email newsletter. Kingswood Wealth Advisors LLC Increases Stock Position in Vanguard Value ETF (NYSEARCA:VTV) 13,080 Shares in JPMorgan Chase & Co. (NYSE:JPM) Purchased by Connective Portfolio Management LLC "
}