{
    "title": "Capital Market Strategies LLC Purchases 139 Shares of Microsoft Co. \n(NASDAQ:MSFT)",
    "date": "1 hour ago",
    "url": "https://www.defenseworld.net/2024/03/21/capital-market-strategies-llc-purchases-139-shares-of-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 21st, 2024 Capital Market Strategies LLC increased its position in shares of  Microsoft Co. (NASDAQ:MSFT – Free Report) by 0.9% during the fourth quarter, according to its most recent filing with the Securities & Exchange Commission. The fund owned 15,152 shares of the software giant’s stock after buying an additional 139 shares during the quarter. Microsoft comprises  5.0% of Capital Market Strategies LLC’s investment portfolio, making the stock its 3rd biggest holding. Capital Market Strategies LLC’s holdings in Microsoft were worth $5,698,000 at the end of the most recent quarter. Several other institutional investors also recently added to or reduced their stakes in MSFT. Adero Partners LLC raised its stake in shares of  Microsoft by 2.7% during the second quarter. Adero Partners LLC now owns 16,815 shares of the software giant’s stock worth $5,726,000 after purchasing an additional 435 shares during the last quarter.  Cadian Capital Management LP boosted its holdings in shares of  Microsoft by 15.1% in the second quarter. Cadian Capital Management LP now owns 107,000 shares of the software giant’s stock valued at $36,438,000 after acquiring an additional 14,000 shares in the last quarter.  Gunderson Capital Management Inc. increased its stake in shares of  Microsoft by 0.7% during the fourth quarter. Gunderson Capital Management Inc. now owns 24,887 shares of the software giant’s stock worth $9,359,000 after acquiring an additional 185 shares during the period.  C M Bidwell & Associates Ltd. lifted its position in  Microsoft by 5.2% in the second quarter. C M Bidwell & Associates Ltd. now owns 5,075 shares of the software giant’s stock valued at $1,728,000 after purchasing an additional 253 shares during the period.  Finally, Geneos Wealth Management Inc. lifted its holdings in shares of  Microsoft by 4.1% in the 3rd quarter. Geneos Wealth Management Inc. now owns 82,267 shares of the software giant’s stock valued at $25,976,000 after buying an additional 3,209 shares during the period. Institutional investors and hedge funds own  69.20% of the company’s stock. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of the stock in a transaction that occurred on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total value of $1,950,000.00. Following the completion of the sale, the insider now directly owns 11,677,398 shares of the company’s stock, valued at $22,770,926.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. In other news, major shareholder Corp Microsoft sold 1,000,000 shares of the company’s stock in a transaction on Thursday, February 22nd. The shares were sold at an average price of $1.95, for a total value of $1,950,000.00. Following the transaction, the insider now directly owns 11,677,398 shares of the company’s stock, valued at $22,770,926.10. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available at this hyperlink. Also, insider Bradford L. Smith sold 45,000 shares of Microsoft stock in a transaction dated Friday, February 2nd. The shares were sold at an average price of $411.78, for a total value of $18,530,100.00. Following the sale, the insider now owns 574,129 shares of the company’s stock, valued at $236,414,839.62. The disclosure for this sale can be found here. In the last 90 days, insiders sold 1,070,258 shares of company stock valued at $30,690,456. Company insiders own  0.03% of the company’s stock. MSFT has been the topic of several recent analyst reports. BNP Paribas upgraded shares of Microsoft from a “neutral” rating to an “outperform” rating and set a $471.00 target price on the stock in a research report on Thursday, January 18th. China Renaissance started coverage on shares of Microsoft in a research note on Tuesday, December 5th. They issued a “buy” rating and a $466.00 target price for the company. Tigress Financial increased their price target on Microsoft from $433.00 to $475.00 and gave the stock a “buy” rating in a research note on Wednesday, November 29th. StockNews.com cut Microsoft from a “buy” rating to a “hold” rating in a report on Thursday, February 22nd. Finally, Truist Financial  reiterated a “buy” rating on shares of Microsoft in a research note on Tuesday, January 23rd. Four analysts have rated the stock with a hold rating and thirty-six have issued  a buy rating to the company’s stock. According to data from MarketBeat, Microsoft currently has an average rating of “Moderate Buy” and an average target price of $415.00. Get Our Latest Stock Report on MSFT NASDAQ MSFT opened at $425.23 on Thursday. The stock has a market capitalization of $3.16 trillion, a P/E ratio of 38.45, a P/E/G ratio of 2.22 and a beta of 0.89. The company has a debt-to-equity ratio of 0.19, a quick ratio of 1.20 and a current ratio of 1.22. The business’s fifty day moving average is $405.78 and its two-hundred day moving average is $370.35. Microsoft Co. has a 1 year low of $269.52 and a 1 year high of $427.82. Microsoft (NASDAQ:MSFT – Get Free Report) last issued its quarterly earnings results on Tuesday, January 30th. The software giant reported $2.93 earnings per share for the quarter, topping analysts’ consensus estimates of $2.76 by $0.17. Microsoft had a return on equity of 38.40% and a net margin of 36.27%. The firm had revenue of $62.02 billion for the quarter, compared to analysts’ expectations of $61.14 billion. During the same quarter last year, the business posted $2.32 EPS. Microsoft’s revenue was up 17.6% on a year-over-year basis.  On average, research analysts forecast that  Microsoft Co. will post 11.63 earnings per share for the current fiscal year. The company also recently disclosed a quarterly dividend, which will be paid on Thursday, June 13th. Investors of record on Thursday, May 16th will be paid a $0.75 dividend. This represents a $3.00 dividend on an annualized basis and a yield of 0.71%. The ex-dividend date is Wednesday, May 15th. Microsoft’s dividend payout ratio  is 27.12%. (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Lynch & Associates IN Has $41.72 Million Stock Holdings in Microsoft Co. (NASDAQ:MSFT) Microsoft Co. (NASDAQ:MSFT) Stock Position Lifted by Channel Wealth LLC "
}