{
    "title": "B.O.S.S. Retirement Advisors LLC Sells 2065 Shares of Microsoft Co. \n(NASDAQ:MSFT)",
    "date": "1 hour ago",
    "url": "https://www.defenseworld.net/2024/03/21/b-o-s-s-retirement-advisors-llc-sells-2065-shares-of-microsoft-co-nasdaqmsft.html",
    "text": "Posted by Defense World Staff on Mar 21st, 2024 B.O.S.S. Retirement Advisors LLC decreased its holdings in shares of  Microsoft Co. (NASDAQ:MSFT – Free Report) by 3.7% in the 4th quarter, according to its most recent Form 13F filing with the SEC. The firm owned 54,459 shares of the software giant’s stock after selling 2,065 shares during the period. Microsoft makes up  approximately  4.3% of B.O.S.S. Retirement Advisors LLC’s holdings, making the stock its largest position. B.O.S.S. Retirement Advisors LLC’s holdings in Microsoft were worth $20,479,000 as of its most recent filing with the SEC. A number of other hedge funds and other institutional investors have also recently made changes to their positions in the stock. DGS Capital Management LLC increased its stake in shares of  Microsoft by 19.9% during the 1st quarter. DGS Capital Management LLC now owns 14,342 shares of the software giant’s stock worth $4,422,000 after purchasing an additional 2,383 shares in the last quarter.  IFM Investors Pty Ltd raised its holdings in shares of  Microsoft by 20.8% in the first quarter. IFM Investors Pty Ltd now owns 1,138,469 shares of the software giant’s stock worth $351,001,000 after acquiring an additional 196,338 shares during the last quarter.  Altus Wealth Group LLC lifted its position in shares of  Microsoft by 1.2% in the first quarter. Altus Wealth Group LLC now owns 12,712 shares of the software giant’s stock valued at $3,919,000 after acquiring an additional 152 shares in the last quarter.  Powell Investment Advisors LLC boosted its stake in shares of  Microsoft by 16.2% during the first quarter. Powell Investment Advisors LLC now owns 2,578 shares of the software giant’s stock valued at $795,000 after acquiring an additional 359 shares during the last quarter.  Finally, Onyx Bridge Wealth Group LLC grew its holdings in shares of  Microsoft by 8.2% during the first quarter. Onyx Bridge Wealth Group LLC now owns 6,782 shares of the software giant’s stock worth $1,921,000 after buying an additional 512 shares in the last quarter. Hedge funds and other institutional investors own  69.20% of the company’s stock. In other Microsoft news, insider Bradford L. Smith sold 3,303 shares of the company’s stock in a transaction that occurred on Monday, February 5th. The stock was sold at an average price of $406.12, for a total transaction of $1,341,414.36. Following the completion of the sale, the insider now owns 570,826 shares of the company’s stock, valued at $231,823,855.12. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC website. In other Microsoft news, major shareholder Corp Microsoft sold 1,000,000 shares of the firm’s stock in a transaction that occurred on Thursday, February 22nd. The stock was sold at an average price of $1.95, for a total value of $1,950,000.00. Following the sale, the insider now owns 11,677,398 shares of the company’s stock, valued at approximately $22,770,926.10. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this link. Also, insider Bradford L. Smith sold 3,303 shares of the firm’s stock in a transaction on Monday, February 5th. The stock was sold at an average price of $406.12, for a total transaction of $1,341,414.36. Following the completion of the sale, the insider now owns 570,826 shares in the company, valued at $231,823,855.12. The disclosure for this sale can be found here. Insiders sold 1,070,258 shares of company stock valued at $30,690,456 over the last quarter. Insiders own  0.03% of the company’s stock. MSFT opened at $425.23 on Thursday. The company has a market capitalization of $3.16 trillion, a PE ratio of 38.45, a price-to-earnings-growth ratio of 2.22 and a beta of 0.89. The company has a debt-to-equity ratio of 0.19, a current ratio of 1.22 and a quick ratio of 1.20. Microsoft Co. has a fifty-two week low of $269.52 and a fifty-two week high of $427.82. The business has a 50-day moving average of $405.78 and a 200-day moving average of $370.35. Microsoft (NASDAQ:MSFT – Get Free Report) last issued its quarterly earnings data on Tuesday, January 30th. The software giant reported $2.93 earnings per share for the quarter, beating the consensus estimate of $2.76 by $0.17. The firm had revenue of $62.02 billion for the quarter, compared to analyst estimates of $61.14 billion. Microsoft had a net margin of 36.27% and a return on equity of 38.40%. The company’s revenue for the quarter was up 17.6% on a year-over-year basis. During the same quarter last year, the firm earned $2.32 earnings per share.  Equities research analysts forecast that  Microsoft Co. will post 11.63 EPS for the current fiscal year. The firm also recently announced a quarterly dividend, which will be paid on Thursday, June 13th. Shareholders of record on Thursday, May 16th will be given a dividend of $0.75 per share. This represents a $3.00 annualized dividend and a yield of 0.71%. The ex-dividend date is Wednesday, May 15th. Microsoft’s payout ratio is 27.12%. Several equities analysts recently commented on the stock. Wells Fargo & Company upped their price target on shares of Microsoft from $435.00 to $460.00 and gave the stock an “overweight” rating in a research report on Wednesday, January 31st. Jefferies Financial Group  reissued a “buy” rating and set a $465.00 target price on shares of Microsoft in a research report on Wednesday, March 6th. StockNews.com lowered shares of Microsoft from a “buy” rating to a “hold” rating in a report on Thursday, February 22nd. Argus boosted their price objective on shares of Microsoft from $390.00 to $430.00 and gave the stock a “buy” rating in a report on Tuesday, December 5th. Finally, Raymond James raised their target price on Microsoft from $400.00 to $450.00 and gave the company an “outperform” rating in a research note on Wednesday, January 31st. Four research analysts have rated the stock with a hold rating and thirty-six have issued  a buy rating to the company’s stock. According to data from MarketBeat, the company currently has a consensus rating of “Moderate Buy” and an average price target of $415.00. View Our Latest Research Report on MSFT (Free Report) Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services.  Want to see what other hedge funds are holding MSFT? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Microsoft Co. (NASDAQ:MSFT – Free Report).   Receive News & Ratings for Microsoft Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Microsoft and related companies with MarketBeat.com's FREE daily email newsletter. Lynch & Associates IN Has $41.72 Million Stock Holdings in Microsoft Co. (NASDAQ:MSFT) Microsoft Co. (NASDAQ:MSFT) Stock Position Lifted by Channel Wealth LLC "
}